const meanings = [
  [ // سورة 1: الفاتحة
[ // آية 1
      [], // بِسمِ
      [], // اللَّهِ
      [], // الرَّحمـٰنِ
      [] // الرَّحيمِ
    ],
    [ // آية 2
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 3
      [], // الرَّحمـٰنِ
      [] // الرَّحيمِ
    ],
    [ // آية 4
      [], // مـٰلِكِ
      ["يوم الدّين : يوم الجزاء"], // يَومِ
      ["يوم الدّين : يوم الجزاء"] // الدّينِ
    ],
    [ // آية 5
      [], // إِيّاكَ
      [], // نَعبُدُ
      [], // وَإِيّاكَ
      [] // نَستَعينُ
    ],
    [ // آية 6
      [], // اهدِنَا
      [], // الصِّرٰطَ
      [] // المُستَقيمَ
    ],
    [ // آية 7
      [], // صِرٰطَ
      [], // الَّذينَ
      [], // أَنعَمتَ
      [], // عَلَيهِم
      [], // غَيرِ
      ["المغضوب عليهم : اليهود"], // المَغضوبِ
      ["المغضوب عليهم : اليهود"], // عَلَيهِم
      [], // وَلَا
      ["الضّالين : النصارى وكذا أشباههم في الضلال"] // الضّالّينَ
    ]
  ]
];

export default meanings;