const meanings = [
[ // آية 1
      [], // الر
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [] // الحَكيمِ
    ],
    [ // آية 2
      [], // أَكانَ
      [], // لِلنّاسِ
      [], // عَجَبًا
      [], // أَن
      [], // أَوحَينا
      [], // إِلىٰ
      [], // رَجُلٍ
      [], // مِنهُم
      [], // أَن
      [], // أَنذِرِ
      [], // النّاسَ
      [], // وَبَشِّرِ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // أَنَّ
      [], // لَهُم
      ["قَدَم صدق : سابقَةَ فضل ، و منزلة رفيعة"], // قَدَمَ
      ["قَدَم صدق : سابقَةَ فضل ، و منزلة رفيعة"], // صِدقٍ
      [], // عِندَ
      [], // رَبِّهِم
      [], // قالَ
      [], // الكـٰفِرونَ
      [], // إِنَّ
      [], // هـٰذا
      [], // لَسـٰحِرٌ
      [] // مُبينٌ
    ],
    [ // آية 3
      [], // إِنَّ
      [], // رَبَّكُمُ
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // ثُمَّ
      ["استوى على العرش : استواءً يليق به سبحانه"], // استَوىٰ
      ["استوى على العرش : استواءً يليق به سبحانه"], // عَلَى
      ["استوى على العرش : استواءً يليق به سبحانه"], // العَرشِ
      [], // يُدَبِّرُ
      [], // الأَمرَ
      [], // ما
      [], // مِن
      [], // شَفيعٍ
      [], // إِلّا
      [], // مِن
      [], // بَعدِ
      [], // إِذنِهِ
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      [], // فَاعبُدوهُ
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 4
      [], // إِلَيهِ
      [], // مَرجِعُكُم
      [], // جَميعًا
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقًّا
      [], // إِنَّهُ
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // لِيَجزِىَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      ["بالقسط : بالعدل"], // بِالقِسطِ
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // لَهُم
      [], // شَرابٌ
      [], // مِن
      [], // حَميمٍ
      [], // وَعَذابٌ
      [], // أَليمٌ
      [], // بِما
      [], // كانوا
      [] // يَكفُرونَ
    ],
    [ // آية 5
      [], // هُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // الشَّمسَ
      [], // ضِياءً
      [], // وَالقَمَرَ
      [], // نورًا
      [], // وَقَدَّرَهُ
      [], // مَنازِلَ
      [], // لِتَعلَموا
      [], // عَدَدَ
      [], // السِّنينَ
      [], // وَالحِسابَ
      [], // ما
      [], // خَلَقَ
      [], // اللَّهُ
      [], // ذٰلِكَ
      [], // إِلّا
      [], // بِالحَقِّ
      [], // يُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 6
      [], // إِنَّ
      [], // فِى
      [], // اختِلـٰفِ
      [], // الَّيلِ
      [], // وَالنَّهارِ
      [], // وَما
      [], // خَلَقَ
      [], // اللَّهُ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَتَّقونَ
    ],
    [ // آية 7
      [], // إِنَّ
      [], // الَّذينَ
      [], // لا
      [], // يَرجونَ
      [], // لِقاءَنا
      [], // وَرَضوا
      [], // بِالحَيوٰةِ
      [], // الدُّنيا
      [], // وَاطمَأَنّوا
      [], // بِها
      [], // وَالَّذينَ
      [], // هُم
      [], // عَن
      [], // ءايـٰتِنا
      [] // غـٰفِلونَ
    ],
    [ // آية 8
      [], // أُولـٰئِكَ
      [], // مَأوىٰهُمُ
      [], // النّارُ
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 9
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // يَهديهِم
      [], // رَبُّهُم
      [], // بِإيمـٰنِهِم
      [], // تَجرى
      [], // مِن
      [], // تَحتِهِمُ
      [], // الأَنهـٰرُ
      [], // فى
      [], // جَنّـٰتِ
      [] // النَّعيمِ
    ],
    [ // آية 10
      [], // دَعوىٰهُم
      [], // فيها
      [], // سُبحـٰنَكَ
      [], // اللَّهُمَّ
      [], // وَتَحِيَّتُهُم
      [], // فيها
      [], // سَلـٰمٌ
      [], // وَءاخِرُ
      [], // دَعوىٰهُم
      [], // أَنِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 11
      [], // وَلَو
      [], // يُعَجِّلُ
      [], // اللَّهُ
      [], // لِلنّاسِ
      [], // الشَّرَّ
      [], // استِعجالَهُم
      [], // بِالخَيرِ
      [], // لَقُضِىَ
      [], // إِلَيهِم
      [], // أَجَلُهُم
      [], // فَنَذَرُ
      [], // الَّذينَ
      [], // لا
      [], // يَرجونَ
      [], // لِقاءَنا
      [], // فى
      [], // طُغيـٰنِهِم
      [] // يَعمَهونَ
    ],
    [ // آية 12
      [], // وَإِذا
      [], // مَسَّ
      [], // الإِنسـٰنَ
      ["الضّرّ : الجهد و البلاء و الشّدّة"], // الضُّرُّ
      ["دعانا لجنبه : استغاث بنا لكشفه ملقى لجنبه"], // دَعانا
      ["دعانا لجنبه : استغاث بنا لكشفه ملقى لجنبه"], // لِجَنبِهِ
      [], // أَو
      [], // قاعِدًا
      [], // أَو
      [], // قائِمًا
      [], // فَلَمّا
      [], // كَشَفنا
      [], // عَنهُ
      [], // ضُرَّهُ
      ["مرّ : استمرّ على كُفره و لم يتّعظ"], // مَرَّ
      [], // كَأَن
      [], // لَم
      [], // يَدعُنا
      [], // إِلىٰ
      [], // ضُرٍّ
      [], // مَسَّهُ
      [], // كَذٰلِكَ
      [], // زُيِّنَ
      [], // لِلمُسرِفينَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 13
      [], // وَلَقَد
      [], // أَهلَكنَا
      ["القرون : الأمم كقوم نوح و عاد و ثمود"], // القُرونَ
      [], // مِن
      [], // قَبلِكُم
      [], // لَمّا
      ["ظلموا : بالكفر و تكذيب الرّسل"], // ظَلَموا
      [], // وَجاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // وَما
      [], // كانوا
      [], // لِيُؤمِنوا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [], // القَومَ
      [] // المُجرِمينَ
    ],
    [ // آية 14
      [], // ثُمَّ
      [], // جَعَلنـٰكُم
      [], // خَلـٰئِفَ
      [], // فِى
      [], // الأَرضِ
      [], // مِن
      [], // بَعدِهِم
      [], // لِنَنظُرَ
      [], // كَيفَ
      [] // تَعمَلونَ
    ],
    [ // آية 15
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءاياتُنا
      [], // بَيِّنـٰتٍ
      [], // قالَ
      [], // الَّذينَ
      [], // لا
      [], // يَرجونَ
      [], // لِقاءَنَا
      [], // ائتِ
      [], // بِقُرءانٍ
      [], // غَيرِ
      [], // هـٰذا
      [], // أَو
      [], // بَدِّلهُ
      [], // قُل
      [], // ما
      [], // يَكونُ
      [], // لى
      [], // أَن
      [], // أُبَدِّلَهُ
      [], // مِن
      [], // تِلقائِ
      [], // نَفسى
      [], // إِن
      [], // أَتَّبِعُ
      [], // إِلّا
      [], // ما
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // إِنّى
      [], // أَخافُ
      [], // إِن
      [], // عَصَيتُ
      [], // رَبّى
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 16
      [], // قُل
      [], // لَو
      [], // شاءَ
      [], // اللَّهُ
      [], // ما
      [], // تَلَوتُهُ
      [], // عَلَيكُم
      [], // وَلا
      [], // أَدرىٰكُم
      [], // بِهِ
      [], // فَقَد
      [], // لَبِثتُ
      [], // فيكُم
      [], // عُمُرًا
      [], // مِن
      [], // قَبلِهِ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 17
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَو
      [], // كَذَّبَ
      [], // بِـٔايـٰتِهِ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // المُجرِمونَ
    ],
    [ // آية 18
      [], // وَيَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَضُرُّهُم
      [], // وَلا
      [], // يَنفَعُهُم
      [], // وَيَقولونَ
      [], // هـٰؤُلاءِ
      [], // شُفَعـٰؤُنا
      [], // عِندَ
      [], // اللَّهِ
      [], // قُل
      [], // أَتُنَبِّـٔونَ
      [], // اللَّهَ
      [], // بِما
      [], // لا
      [], // يَعلَمُ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَلا
      [], // فِى
      [], // الأَرضِ
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 19
      [], // وَما
      [], // كانَ
      [], // النّاسُ
      [], // إِلّا
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // فَاختَلَفوا
      [], // وَلَولا
      [], // كَلِمَةٌ
      [], // سَبَقَت
      [], // مِن
      [], // رَبِّكَ
      [], // لَقُضِىَ
      [], // بَينَهُم
      [], // فيما
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 20
      [], // وَيَقولونَ
      [], // لَولا
      [], // أُنزِلَ
      [], // عَلَيهِ
      [], // ءايَةٌ
      [], // مِن
      [], // رَبِّهِ
      [], // فَقُل
      [], // إِنَّمَا
      [], // الغَيبُ
      [], // لِلَّهِ
      [], // فَانتَظِروا
      [], // إِنّى
      [], // مَعَكُم
      [], // مِنَ
      [] // المُنتَظِرينَ
    ],
    [ // آية 21
      [], // وَإِذا
      [], // أَذَقنَا
      [], // النّاسَ
      [], // رَحمَةً
      [], // مِن
      [], // بَعدِ
      ["ضرّاء مسّتهم : نائبة أصابتهم (الجوع و القحط)"], // ضَرّاءَ
      ["ضرّاء مسّتهم : نائبة أصابتهم (الجوع و القحط)"], // مَسَّتهُم
      [], // إِذا
      ["لهم مكر : دفع و طعن و استهزاء"], // لَهُم
      ["لهم مكر : دفع و طعن و استهزاء"], // مَكرٌ
      [], // فى
      [], // ءاياتِنا
      [], // قُلِ
      ["الله أسرع مكرا : أعجلُ جزاءً و عقوبة"], // اللَّهُ
      ["الله أسرع مكرا : أعجلُ جزاءً و عقوبة"], // أَسرَعُ
      ["الله أسرع مكرا : أعجلُ جزاءً و عقوبة"], // مَكرًا
      [], // إِنَّ
      [], // رُسُلَنا
      [], // يَكتُبونَ
      [], // ما
      [] // تَمكُرونَ
    ],
    [ // آية 22
      [], // هُوَ
      [], // الَّذى
      [], // يُسَيِّرُكُم
      [], // فِى
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // حَتّىٰ
      [], // إِذا
      [], // كُنتُم
      [], // فِى
      [], // الفُلكِ
      [], // وَجَرَينَ
      [], // بِهِم
      [], // بِريحٍ
      [], // طَيِّبَةٍ
      [], // وَفَرِحوا
      [], // بِها
      [], // جاءَتها
      ["ريح عاصف : شديدة الهبوب"], // ريحٌ
      ["ريح عاصف : شديدة الهبوب"], // عاصِفٌ
      [], // وَجاءَهُمُ
      [], // المَوجُ
      [], // مِن
      [], // كُلِّ
      [], // مَكانٍ
      [], // وَظَنّوا
      [], // أَنَّهُم
      ["أحيط بهم : أحدق بهم الهلاك"], // أُحيطَ
      ["أحيط بهم : أحدق بهم الهلاك"], // بِهِم
      [], // دَعَوُا
      [], // اللَّهَ
      [], // مُخلِصينَ
      [], // لَهُ
      [], // الدّينَ
      [], // لَئِن
      [], // أَنجَيتَنا
      [], // مِن
      [], // هـٰذِهِ
      [], // لَنَكونَنَّ
      [], // مِنَ
      [] // الشّـٰكِرينَ
    ],
    [ // آية 23
      [], // فَلَمّا
      [], // أَنجىٰهُم
      [], // إِذا
      [], // هُم
      ["يبغون : يُفسدون"], // يَبغونَ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِنَّما
      [], // بَغيُكُم
      [], // عَلىٰ
      [], // أَنفُسِكُم
      [], // مَتـٰعَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // ثُمَّ
      [], // إِلَينا
      [], // مَرجِعُكُم
      [], // فَنُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 24
      [], // إِنَّما
      [], // مَثَلُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // كَماءٍ
      [], // أَنزَلنـٰهُ
      [], // مِنَ
      [], // السَّماءِ
      [], // فَاختَلَطَ
      [], // بِهِ
      [], // نَباتُ
      [], // الأَرضِ
      [], // مِمّا
      [], // يَأكُلُ
      [], // النّاسُ
      [], // وَالأَنعـٰمُ
      [], // حَتّىٰ
      [], // إِذا
      [], // أَخَذَتِ
      [], // الأَرضُ
      ["زخرفها : نظارتها و بهجتها بألوان النّبات"], // زُخرُفَها
      [], // وَازَّيَّنَت
      [], // وَظَنَّ
      [], // أَهلُها
      [], // أَنَّهُم
      [], // قـٰدِرونَ
      [], // عَلَيها
      [], // أَتىٰها
      ["أمرُنا : ما يجتاحها من الآفات و العاهات"], // أَمرُنا
      [], // لَيلًا
      [], // أَو
      [], // نَهارًا
      [], // فَجَعَلنـٰها
      ["حصيدا : كالنّبات المحصود بالمناجل"], // حَصيدًا
      [], // كَأَن
      ["لم تغْنَ : لم تمكث زروعها و لم تُقم"], // لَم
      ["لم تغْنَ : لم تمكث زروعها و لم تُقم"], // تَغنَ
      [], // بِالأَمسِ
      [], // كَذٰلِكَ
      [], // نُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 25
      [], // وَاللَّهُ
      [], // يَدعوا
      [], // إِلىٰ
      [], // دارِ
      [], // السَّلـٰمِ
      [], // وَيَهدى
      [], // مَن
      [], // يَشاءُ
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 26
      [], // لِلَّذينَ
      [], // أَحسَنُوا
      [], // الحُسنىٰ
      [], // وَزِيادَةٌ
      [], // وَلا
      [], // يَرهَقُ
      [], // وُجوهَهُم
      [], // قَتَرٌ
      [], // وَلا
      [], // ذِلَّةٌ
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 27
      [], // وَالَّذينَ
      [], // كَسَبُوا
      [], // السَّيِّـٔاتِ
      [], // جَزاءُ
      [], // سَيِّئَةٍ
      [], // بِمِثلِها
      [], // وَتَرهَقُهُم
      [], // ذِلَّةٌ
      [], // ما
      [], // لَهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // مِن
      ["عاصم : مانع يمنع سُخطه و عذابه"], // عاصِمٍ
      [], // كَأَنَّما
      ["أغشيت وجوههم : كُسيت و ألبست"], // أُغشِيَت
      ["أغشيت وجوههم : كُسيت و ألبست"], // وُجوهُهُم
      [], // قِطَعًا
      [], // مِنَ
      [], // الَّيلِ
      [], // مُظلِمًا
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 28
      [], // وَيَومَ
      [], // نَحشُرُهُم
      [], // جَميعًا
      [], // ثُمَّ
      [], // نَقولُ
      [], // لِلَّذينَ
      [], // أَشرَكوا
      ["مكانكم : الزموا مكانكم و اثبتوا فيه"], // مَكانَكُم
      [], // أَنتُم
      [], // وَشُرَكاؤُكُم
      [], // فَزَيَّلنا
      [], // بَينَهُم
      [], // وَقالَ
      [], // شُرَكاؤُهُم
      [], // ما
      [], // كُنتُم
      [], // إِيّانا
      [] // تَعبُدونَ
    ],
    [ // آية 29
      [], // فَكَفىٰ
      [], // بِاللَّهِ
      [], // شَهيدًا
      [], // بَينَنا
      [], // وَبَينَكُم
      [], // إِن
      [], // كُنّا
      [], // عَن
      [], // عِبادَتِكُم
      [] // لَغـٰفِلينَ
    ],
    [ // آية 30
      [], // هُنالِكَ
      [], // تَبلوا
      [], // كُلُّ
      [], // نَفسٍ
      [], // ما
      [], // أَسلَفَت
      [], // وَرُدّوا
      [], // إِلَى
      [], // اللَّهِ
      [], // مَولىٰهُمُ
      [], // الحَقِّ
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَفتَرونَ
    ],
    [ // آية 31
      [], // قُل
      [], // مَن
      [], // يَرزُقُكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // أَمَّن
      [], // يَملِكُ
      [], // السَّمعَ
      [], // وَالأَبصـٰرَ
      [], // وَمَن
      [], // يُخرِجُ
      [], // الحَىَّ
      [], // مِنَ
      [], // المَيِّتِ
      [], // وَيُخرِجُ
      [], // المَيِّتَ
      [], // مِنَ
      [], // الحَىِّ
      [], // وَمَن
      [], // يُدَبِّرُ
      [], // الأَمرَ
      [], // فَسَيَقولونَ
      [], // اللَّهُ
      [], // فَقُل
      [], // أَفَلا
      [] // تَتَّقونَ
    ],
    [ // آية 32
      [], // فَذٰلِكُمُ
      [], // اللَّهُ
      ["ربّكم الحقّ : الثابتة ربوبيّته بالبرهان ثبوتا لا ريب فيه"], // رَبُّكُمُ
      ["ربّكم الحقّ : الثابتة ربوبيّته بالبرهان ثبوتا لا ريب فيه"], // الحَقُّ
      [], // فَماذا
      [], // بَعدَ
      [], // الحَقِّ
      [], // إِلَّا
      [], // الضَّلـٰلُ
      [], // فَأَنّىٰ
      [] // تُصرَفونَ
    ],
    [ // آية 33
      [], // كَذٰلِكَ
      ["حقّت : ثبتت و وجبت"], // حَقَّت
      [], // كَلِمَتُ
      [], // رَبِّكَ
      [], // عَلَى
      [], // الَّذينَ
      [], // فَسَقوا
      [], // أَنَّهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 34
      [], // قُل
      [], // هَل
      [], // مِن
      [], // شُرَكائِكُم
      [], // مَن
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // قُلِ
      [], // اللَّهُ
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // فَأَنّىٰ
      [] // تُؤفَكونَ
    ],
    [ // آية 35
      [], // قُل
      [], // هَل
      [], // مِن
      [], // شُرَكائِكُم
      [], // مَن
      [], // يَهدى
      [], // إِلَى
      [], // الحَقِّ
      [], // قُلِ
      [], // اللَّهُ
      [], // يَهدى
      [], // لِلحَقِّ
      [], // أَفَمَن
      [], // يَهدى
      [], // إِلَى
      [], // الحَقِّ
      [], // أَحَقُّ
      [], // أَن
      [], // يُتَّبَعَ
      [], // أَمَّن
      [], // لا
      [], // يَهِدّى
      [], // إِلّا
      [], // أَن
      [], // يُهدىٰ
      [], // فَما
      [], // لَكُم
      [], // كَيفَ
      [] // تَحكُمونَ
    ],
    [ // آية 36
      [], // وَما
      [], // يَتَّبِعُ
      [], // أَكثَرُهُم
      [], // إِلّا
      [], // ظَنًّا
      [], // إِنَّ
      [], // الظَّنَّ
      [], // لا
      [], // يُغنى
      [], // مِنَ
      [], // الحَقِّ
      [], // شَيـًٔا
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [], // بِما
      [] // يَفعَلونَ
    ],
    [ // آية 37
      [], // وَما
      [], // كانَ
      [], // هـٰذَا
      [], // القُرءانُ
      [], // أَن
      [], // يُفتَرىٰ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلـٰكِن
      [], // تَصديقَ
      [], // الَّذى
      [], // بَينَ
      [], // يَدَيهِ
      [], // وَتَفصيلَ
      [], // الكِتـٰبِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 38
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰهُ
      [], // قُل
      [], // فَأتوا
      [], // بِسورَةٍ
      [], // مِثلِهِ
      [], // وَادعوا
      [], // مَنِ
      [], // استَطَعتُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 39
      [], // بَل
      [], // كَذَّبوا
      [], // بِما
      [], // لَم
      [], // يُحيطوا
      [], // بِعِلمِهِ
      [], // وَلَمّا
      ["يأتهم تأويله : يتبيّن لهم عاقبته و مآل وعيده"], // يَأتِهِم
      ["يأتهم تأويله : يتبيّن لهم عاقبته و مآل وعيده"], // تَأويلُهُ
      [], // كَذٰلِكَ
      [], // كَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 40
      [], // وَمِنهُم
      [], // مَن
      [], // يُؤمِنُ
      [], // بِهِ
      [], // وَمِنهُم
      [], // مَن
      [], // لا
      [], // يُؤمِنُ
      [], // بِهِ
      [], // وَرَبُّكَ
      [], // أَعلَمُ
      [] // بِالمُفسِدينَ
    ],
    [ // آية 41
      [], // وَإِن
      [], // كَذَّبوكَ
      [], // فَقُل
      [], // لى
      [], // عَمَلى
      [], // وَلَكُم
      [], // عَمَلُكُم
      [], // أَنتُم
      [], // بَريـٔونَ
      [], // مِمّا
      [], // أَعمَلُ
      [], // وَأَنا۠
      [], // بَرىءٌ
      [], // مِمّا
      [] // تَعمَلونَ
    ],
    [ // آية 42
      [], // وَمِنهُم
      [], // مَن
      [], // يَستَمِعونَ
      [], // إِلَيكَ
      [], // أَفَأَنتَ
      [], // تُسمِعُ
      [], // الصُّمَّ
      [], // وَلَو
      [], // كانوا
      [], // لا
      [] // يَعقِلونَ
    ],
    [ // آية 43
      [], // وَمِنهُم
      [], // مَن
      ["ينظر إليك : يُعاين دلائل نبوّته الواضحة"], // يَنظُرُ
      ["ينظر إليك : يُعاين دلائل نبوّته الواضحة"], // إِلَيكَ
      [], // أَفَأَنتَ
      [], // تَهدِى
      [], // العُمىَ
      [], // وَلَو
      [], // كانوا
      [], // لا
      [] // يُبصِرونَ
    ],
    [ // آية 44
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَظلِمُ
      [], // النّاسَ
      [], // شَيـًٔا
      [], // وَلـٰكِنَّ
      [], // النّاسَ
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 45
      [], // وَيَومَ
      [], // يَحشُرُهُم
      [], // كَأَن
      [], // لَم
      [], // يَلبَثوا
      [], // إِلّا
      [], // ساعَةً
      [], // مِنَ
      [], // النَّهارِ
      [], // يَتَعارَفونَ
      [], // بَينَهُم
      [], // قَد
      [], // خَسِرَ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِلِقاءِ
      [], // اللَّهِ
      [], // وَما
      [], // كانوا
      [] // مُهتَدينَ
    ],
    [ // آية 46
      [], // وَإِمّا
      [], // نُرِيَنَّكَ
      [], // بَعضَ
      [], // الَّذى
      [], // نَعِدُهُم
      [], // أَو
      [], // نَتَوَفَّيَنَّكَ
      [], // فَإِلَينا
      [], // مَرجِعُهُم
      [], // ثُمَّ
      [], // اللَّهُ
      [], // شَهيدٌ
      [], // عَلىٰ
      [], // ما
      [] // يَفعَلونَ
    ],
    [ // آية 47
      [], // وَلِكُلِّ
      [], // أُمَّةٍ
      [], // رَسولٌ
      [], // فَإِذا
      [], // جاءَ
      [], // رَسولُهُم
      [], // قُضِىَ
      [], // بَينَهُم
      ["بالقسط : بالعدل في الدّنيا أو يوم الجزاء"], // بِالقِسطِ
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 48
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 49
      [], // قُل
      [], // لا
      [], // أَملِكُ
      [], // لِنَفسى
      [], // ضَرًّا
      [], // وَلا
      [], // نَفعًا
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // اللَّهُ
      [], // لِكُلِّ
      [], // أُمَّةٍ
      [], // أَجَلٌ
      [], // إِذا
      [], // جاءَ
      [], // أَجَلُهُم
      [], // فَلا
      [], // يَستَـٔخِرونَ
      [], // ساعَةً
      [], // وَلا
      [] // يَستَقدِمونَ
    ],
    [ // آية 50
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // أَتىٰكُم
      [], // عَذابُهُ
      [], // بَيـٰتًا
      [], // أَو
      [], // نَهارًا
      [], // ماذا
      [], // يَستَعجِلُ
      [], // مِنهُ
      [] // المُجرِمونَ
    ],
    [ // آية 51
      [], // أَثُمَّ
      [], // إِذا
      [], // ما
      [], // وَقَعَ
      [], // ءامَنتُم
      [], // بِهِ
      [], // ءالـٔـٰنَ
      [], // وَقَد
      [], // كُنتُم
      [], // بِهِ
      [] // تَستَعجِلونَ
    ],
    [ // آية 52
      [], // ثُمَّ
      [], // قيلَ
      [], // لِلَّذينَ
      [], // ظَلَموا
      [], // ذوقوا
      [], // عَذابَ
      [], // الخُلدِ
      [], // هَل
      [], // تُجزَونَ
      [], // إِلّا
      [], // بِما
      [], // كُنتُم
      [] // تَكسِبونَ
    ],
    [ // آية 53
      [], // وَيَستَنبِـٔونَكَ
      [], // أَحَقٌّ
      [], // هُوَ
      [], // قُل
      [], // إى
      [], // وَرَبّى
      [], // إِنَّهُ
      [], // لَحَقٌّ
      [], // وَما
      [], // أَنتُم
      [] // بِمُعجِزينَ
    ],
    [ // آية 54
      [], // وَلَو
      [], // أَنَّ
      [], // لِكُلِّ
      [], // نَفسٍ
      [], // ظَلَمَت
      [], // ما
      [], // فِى
      [], // الأَرضِ
      [], // لَافتَدَت
      [], // بِهِ
      [], // وَأَسَرُّوا
      [], // النَّدامَةَ
      [], // لَمّا
      [], // رَأَوُا
      [], // العَذابَ
      [], // وَقُضِىَ
      [], // بَينَهُم
      [], // بِالقِسطِ
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 55
      [], // أَلا
      [], // إِنَّ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // أَلا
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 56
      [], // هُوَ
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 57
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // قَد
      [], // جاءَتكُم
      [], // مَوعِظَةٌ
      [], // مِن
      [], // رَبِّكُم
      [], // وَشِفاءٌ
      [], // لِما
      [], // فِى
      [], // الصُّدورِ
      [], // وَهُدًى
      [], // وَرَحمَةٌ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 58
      [], // قُل
      [], // بِفَضلِ
      [], // اللَّهِ
      [], // وَبِرَحمَتِهِ
      [], // فَبِذٰلِكَ
      [], // فَليَفرَحوا
      [], // هُوَ
      [], // خَيرٌ
      [], // مِمّا
      [] // يَجمَعونَ
    ],
    [ // آية 59
      [], // قُل
      [], // أَرَءَيتُم
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // لَكُم
      [], // مِن
      [], // رِزقٍ
      [], // فَجَعَلتُم
      [], // مِنهُ
      [], // حَرامًا
      [], // وَحَلـٰلًا
      [], // قُل
      [], // ءاللَّهُ
      ["أذِن لكم : أعلمكم بهذا التحليل و التّحريم"], // أَذِنَ
      ["أذِن لكم : أعلمكم بهذا التحليل و التّحريم"], // لَكُم
      [], // أَم
      [], // عَلَى
      [], // اللَّهِ
      ["تفترون : تكذبون في نسبة ذلك إليه"] // تَفتَرونَ
    ],
    [ // آية 60
      [], // وَما
      [], // ظَنُّ
      [], // الَّذينَ
      [], // يَفتَرونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَذو
      [], // فَضلٍ
      [], // عَلَى
      [], // النّاسِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَشكُرونَ
    ],
    [ // آية 61
      [], // وَما
      [], // تَكونُ
      [], // فى
      [], // شَأنٍ
      [], // وَما
      [], // تَتلوا
      [], // مِنهُ
      [], // مِن
      [], // قُرءانٍ
      [], // وَلا
      [], // تَعمَلونَ
      [], // مِن
      [], // عَمَلٍ
      [], // إِلّا
      [], // كُنّا
      [], // عَلَيكُم
      [], // شُهودًا
      [], // إِذ
      ["تُفيضون فيه : تشرعون و تخوضون فيه"], // تُفيضونَ
      ["تُفيضون فيه : تشرعون و تخوضون فيه"], // فيهِ
      [], // وَما
      [], // يَعزُبُ
      [], // عَن
      [], // رَبِّكَ
      [], // مِن
      ["مثقال ذرّة : وزن أصغر نملة أو هباءة"], // مِثقالِ
      ["مثقال ذرّة : وزن أصغر نملة أو هباءة"], // ذَرَّةٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // فِى
      [], // السَّماءِ
      [], // وَلا
      [], // أَصغَرَ
      [], // مِن
      [], // ذٰلِكَ
      [], // وَلا
      [], // أَكبَرَ
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [] // مُبينٍ
    ],
    [ // آية 62
      [], // أَلا
      [], // إِنَّ
      [], // أَولِياءَ
      [], // اللَّهِ
      [], // لا
      [], // خَوفٌ
      [], // عَلَيهِم
      [], // وَلا
      [], // هُم
      [] // يَحزَنونَ
    ],
    [ // آية 63
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَكانوا
      [] // يَتَّقونَ
    ],
    [ // آية 64
      [], // لَهُمُ
      [], // البُشرىٰ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَفِى
      [], // الـٔاخِرَةِ
      [], // لا
      [], // تَبديلَ
      [], // لِكَلِمـٰتِ
      [], // اللَّهِ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 65
      [], // وَلا
      [], // يَحزُنكَ
      [], // قَولُهُم
      [], // إِنَّ
      [], // العِزَّةَ
      [], // لِلَّهِ
      [], // جَميعًا
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 66
      [], // أَلا
      [], // إِنَّ
      [], // لِلَّهِ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // يَتَّبِعُ
      [], // الَّذينَ
      [], // يَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // شُرَكاءَ
      [], // إِن
      [], // يَتَّبِعونَ
      [], // إِلَّا
      [], // الظَّنَّ
      [], // وَإِن
      [], // هُم
      [], // إِلّا
      ["يخرصون : يكذبون فيها ينسبونه إليه تعالى"] // يَخرُصونَ
    ],
    [ // آية 67
      [], // هُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الَّيلَ
      [], // لِتَسكُنوا
      [], // فيهِ
      [], // وَالنَّهارَ
      [], // مُبصِرًا
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَسمَعونَ
    ],
    [ // آية 68
      [], // قالُوا
      [], // اتَّخَذَ
      [], // اللَّهُ
      [], // وَلَدًا
      [], // سُبحـٰنَهُ
      [], // هُوَ
      [], // الغَنِىُّ
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // إِن
      [], // عِندَكُم
      [], // مِن
      [], // سُلطـٰنٍ
      [], // بِهـٰذا
      [], // أَتَقولونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 69
      [], // قُل
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَفتَرونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // لا
      [] // يُفلِحونَ
    ],
    [ // آية 70
      [], // مَتـٰعٌ
      [], // فِى
      [], // الدُّنيا
      [], // ثُمَّ
      [], // إِلَينا
      [], // مَرجِعُهُم
      [], // ثُمَّ
      [], // نُذيقُهُمُ
      [], // العَذابَ
      [], // الشَّديدَ
      [], // بِما
      [], // كانوا
      [] // يَكفُرونَ
    ],
    [ // آية 71
      [], // وَاتلُ
      [], // عَلَيهِم
      [], // نَبَأَ
      [], // نوحٍ
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // يـٰقَومِ
      [], // إِن
      [], // كانَ
      ["كبُر عليكم : عظُم و شقّ عليكم"], // كَبُرَ
      ["كبُر عليكم : عظُم و شقّ عليكم"], // عَلَيكُم
      [], // مَقامى
      [], // وَتَذكيرى
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // فَعَلَى
      [], // اللَّهِ
      [], // تَوَكَّلتُ
      ["فأجمعوا أمركم : اعزموا و صمّموا على كيدكم"], // فَأَجمِعوا
      ["فأجمعوا أمركم : اعزموا و صمّموا على كيدكم"], // أَمرَكُم
      [], // وَشُرَكاءَكُم
      [], // ثُمَّ
      [], // لا
      [], // يَكُن
      [], // أَمرُكُم
      [], // عَلَيكُم
      [], // غُمَّةً
      [], // ثُمَّ
      [], // اقضوا
      [], // إِلَىَّ
      [], // وَلا
      [] // تُنظِرونِ
    ],
    [ // آية 72
      [], // فَإِن
      [], // تَوَلَّيتُم
      [], // فَما
      [], // سَأَلتُكُم
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلَى
      [], // اللَّهِ
      [], // وَأُمِرتُ
      [], // أَن
      [], // أَكونَ
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 73
      [], // فَكَذَّبوهُ
      [], // فَنَجَّينـٰهُ
      [], // وَمَن
      [], // مَعَهُ
      [], // فِى
      [], // الفُلكِ
      [], // وَجَعَلنـٰهُم
      [], // خَلـٰئِفَ
      [], // وَأَغرَقنَا
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُنذَرينَ
    ],
    [ // آية 74
      [], // ثُمَّ
      [], // بَعَثنا
      [], // مِن
      [], // بَعدِهِ
      [], // رُسُلًا
      [], // إِلىٰ
      [], // قَومِهِم
      [], // فَجاءوهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَما
      [], // كانوا
      [], // لِيُؤمِنوا
      [], // بِما
      [], // كَذَّبوا
      [], // بِهِ
      [], // مِن
      [], // قَبلُ
      [], // كَذٰلِكَ
      [], // نَطبَعُ
      [], // عَلىٰ
      [], // قُلوبِ
      [] // المُعتَدينَ
    ],
    [ // آية 75
      [], // ثُمَّ
      [], // بَعَثنا
      [], // مِن
      [], // بَعدِهِم
      [], // موسىٰ
      [], // وَهـٰرونَ
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      [], // بِـٔايـٰتِنا
      [], // فَاستَكبَروا
      [], // وَكانوا
      [], // قَومًا
      [] // مُجرِمينَ
    ],
    [ // آية 76
      [], // فَلَمّا
      [], // جاءَهُمُ
      [], // الحَقُّ
      [], // مِن
      [], // عِندِنا
      [], // قالوا
      [], // إِنَّ
      [], // هـٰذا
      [], // لَسِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 77
      [], // قالَ
      [], // موسىٰ
      [], // أَتَقولونَ
      [], // لِلحَقِّ
      [], // لَمّا
      [], // جاءَكُم
      [], // أَسِحرٌ
      [], // هـٰذا
      [], // وَلا
      [], // يُفلِحُ
      [] // السّـٰحِرونَ
    ],
    [ // آية 78
      [], // قالوا
      [], // أَجِئتَنا
      ["لتلفتنا : لِتلوينا و تصرفنا"], // لِتَلفِتَنا
      [], // عَمّا
      [], // وَجَدنا
      [], // عَلَيهِ
      [], // ءاباءَنا
      [], // وَتَكونَ
      [], // لَكُمَا
      [], // الكِبرِياءُ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // نَحنُ
      [], // لَكُما
      [] // بِمُؤمِنينَ
    ],
    [ // آية 79
      [], // وَقالَ
      [], // فِرعَونُ
      [], // ائتونى
      [], // بِكُلِّ
      [], // سـٰحِرٍ
      [] // عَليمٍ
    ],
    [ // آية 80
      [], // فَلَمّا
      [], // جاءَ
      [], // السَّحَرَةُ
      [], // قالَ
      [], // لَهُم
      [], // موسىٰ
      [], // أَلقوا
      [], // ما
      [], // أَنتُم
      [] // مُلقونَ
    ],
    [ // آية 81
      [], // فَلَمّا
      [], // أَلقَوا
      [], // قالَ
      [], // موسىٰ
      [], // ما
      [], // جِئتُم
      [], // بِهِ
      [], // السِّحرُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَيُبطِلُهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُصلِحُ
      [], // عَمَلَ
      [] // المُفسِدينَ
    ],
    [ // آية 82
      [], // وَيُحِقُّ
      [], // اللَّهُ
      [], // الحَقَّ
      [], // بِكَلِمـٰتِهِ
      [], // وَلَو
      [], // كَرِهَ
      [] // المُجرِمونَ
    ],
    [ // آية 83
      [], // فَما
      [], // ءامَنَ
      [], // لِموسىٰ
      [], // إِلّا
      [], // ذُرِّيَّةٌ
      [], // مِن
      [], // قَومِهِ
      [], // عَلىٰ
      [], // خَوفٍ
      [], // مِن
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِم
      ["أن يفتنهم : أن يبتليهم و يعذّبهم"], // أَن
      ["أن يفتنهم : أن يبتليهم و يعذّبهم"], // يَفتِنَهُم
      [], // وَإِنَّ
      [], // فِرعَونَ
      [], // لَعالٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَإِنَّهُ
      [], // لَمِنَ
      [] // المُسرِفينَ
    ],
    [ // آية 84
      [], // وَقالَ
      [], // موسىٰ
      [], // يـٰقَومِ
      [], // إِن
      [], // كُنتُم
      [], // ءامَنتُم
      [], // بِاللَّهِ
      [], // فَعَلَيهِ
      [], // تَوَكَّلوا
      [], // إِن
      [], // كُنتُم
      [] // مُسلِمينَ
    ],
    [ // آية 85
      [], // فَقالوا
      [], // عَلَى
      [], // اللَّهِ
      [], // تَوَكَّلنا
      [], // رَبَّنا
      [], // لا
      [], // تَجعَلنا
      [], // فِتنَةً
      [], // لِلقَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 86
      [], // وَنَجِّنا
      [], // بِرَحمَتِكَ
      [], // مِنَ
      [], // القَومِ
      [] // الكـٰفِرينَ
    ],
    [ // آية 87
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // وَأَخيهِ
      [], // أَن
      [], // تَبَوَّءا
      [], // لِقَومِكُما
      [], // بِمِصرَ
      [], // بُيوتًا
      [], // وَاجعَلوا
      [], // بُيوتَكُم
      ["قبلة : مساجد نحو الكعبة أو مُصلّى"], // قِبلَةً
      [], // وَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَبَشِّرِ
      [] // المُؤمِنينَ
    ],
    [ // آية 88
      [], // وَقالَ
      [], // موسىٰ
      [], // رَبَّنا
      [], // إِنَّكَ
      [], // ءاتَيتَ
      [], // فِرعَونَ
      [], // وَمَلَأَهُ
      [], // زينَةً
      [], // وَأَموٰلًا
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // رَبَّنا
      [], // لِيُضِلّوا
      [], // عَن
      [], // سَبيلِكَ
      [], // رَبَّنَا
      [], // اطمِس
      [], // عَلىٰ
      [], // أَموٰلِهِم
      [], // وَاشدُد
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // فَلا
      [], // يُؤمِنوا
      [], // حَتّىٰ
      [], // يَرَوُا
      [], // العَذابَ
      [] // الأَليمَ
    ],
    [ // آية 89
      [], // قالَ
      [], // قَد
      [], // أُجيبَت
      [], // دَعوَتُكُما
      [], // فَاستَقيما
      [], // وَلا
      [], // تَتَّبِعانِّ
      [], // سَبيلَ
      [], // الَّذينَ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 90
      [], // وَجـٰوَزنا
      [], // بِبَنى
      [], // إِسرٰءيلَ
      [], // البَحرَ
      [], // فَأَتبَعَهُم
      [], // فِرعَونُ
      [], // وَجُنودُهُ
      [], // بَغيًا
      [], // وَعَدوًا
      [], // حَتّىٰ
      [], // إِذا
      [], // أَدرَكَهُ
      [], // الغَرَقُ
      [], // قالَ
      [], // ءامَنتُ
      [], // أَنَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلَّا
      [], // الَّذى
      [], // ءامَنَت
      [], // بِهِ
      [], // بَنوا
      [], // إِسرٰءيلَ
      [], // وَأَنا۠
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 91
      [], // ءالـٔـٰنَ
      [], // وَقَد
      [], // عَصَيتَ
      [], // قَبلُ
      [], // وَكُنتَ
      [], // مِنَ
      [] // المُفسِدينَ
    ],
    [ // آية 92
      [], // فَاليَومَ
      [], // نُنَجّيكَ
      [], // بِبَدَنِكَ
      [], // لِتَكونَ
      [], // لِمَن
      [], // خَلفَكَ
      [], // ءايَةً
      [], // وَإِنَّ
      [], // كَثيرًا
      [], // مِنَ
      [], // النّاسِ
      [], // عَن
      [], // ءايـٰتِنا
      [] // لَغـٰفِلونَ
    ],
    [ // آية 93
      [], // وَلَقَد
      ["بوّأنا : أنزلنا و أسكنّا"], // بَوَّأنا
      [], // بَنى
      [], // إِسرٰءيلَ
      ["مُبوّأ صدق : منزلا صالحا مرضيّا"], // مُبَوَّأَ
      ["مُبوّأ صدق : منزلا صالحا مرضيّا"], // صِدقٍ
      [], // وَرَزَقنـٰهُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // فَمَا
      [], // اختَلَفوا
      [], // حَتّىٰ
      [], // جاءَهُمُ
      [], // العِلمُ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // يَقضى
      [], // بَينَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // فيما
      [], // كانوا
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 94
      [], // فَإِن
      [], // كُنتَ
      [], // فى
      [], // شَكٍّ
      [], // مِمّا
      [], // أَنزَلنا
      [], // إِلَيكَ
      [], // فَسـَٔلِ
      [], // الَّذينَ
      [], // يَقرَءونَ
      [], // الكِتـٰبَ
      [], // مِن
      [], // قَبلِكَ
      [], // لَقَد
      [], // جاءَكَ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكَ
      [], // فَلا
      [], // تَكونَنَّ
      [], // مِنَ
      ["الممترين : الشّاكّين المتزلزلين"] // المُمتَرينَ
    ],
    [ // آية 95
      [], // وَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // فَتَكونَ
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 96
      [], // إِنَّ
      [], // الَّذينَ
      [], // حَقَّت
      [], // عَلَيهِم
      [], // كَلِمَتُ
      [], // رَبِّكَ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 97
      [], // وَلَو
      [], // جاءَتهُم
      [], // كُلُّ
      [], // ءايَةٍ
      [], // حَتّىٰ
      [], // يَرَوُا
      [], // العَذابَ
      [] // الأَليمَ
    ],
    [ // آية 98
      [], // فَلَولا
      [], // كانَت
      [], // قَريَةٌ
      [], // ءامَنَت
      [], // فَنَفَعَها
      [], // إيمـٰنُها
      [], // إِلّا
      [], // قَومَ
      [], // يونُسَ
      [], // لَمّا
      [], // ءامَنوا
      [], // كَشَفنا
      [], // عَنهُم
      [], // عَذابَ
      [], // الخِزىِ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَمَتَّعنـٰهُم
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 99
      [], // وَلَو
      [], // شاءَ
      [], // رَبُّكَ
      [], // لَـٔامَنَ
      [], // مَن
      [], // فِى
      [], // الأَرضِ
      [], // كُلُّهُم
      [], // جَميعًا
      [], // أَفَأَنتَ
      [], // تُكرِهُ
      [], // النّاسَ
      [], // حَتّىٰ
      [], // يَكونوا
      [] // مُؤمِنينَ
    ],
    [ // آية 100
      [], // وَما
      [], // كانَ
      [], // لِنَفسٍ
      [], // أَن
      [], // تُؤمِنَ
      [], // إِلّا
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // وَيَجعَلُ
      [], // الرِّجسَ
      [], // عَلَى
      [], // الَّذينَ
      [], // لا
      [] // يَعقِلونَ
    ],
    [ // آية 101
      [], // قُلِ
      [], // انظُروا
      [], // ماذا
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // تُغنِى
      [], // الـٔايـٰتُ
      [], // وَالنُّذُرُ
      [], // عَن
      [], // قَومٍ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 102
      [], // فَهَل
      [], // يَنتَظِرونَ
      [], // إِلّا
      [], // مِثلَ
      [], // أَيّامِ
      [], // الَّذينَ
      [], // خَلَوا
      [], // مِن
      [], // قَبلِهِم
      [], // قُل
      [], // فَانتَظِروا
      [], // إِنّى
      [], // مَعَكُم
      [], // مِنَ
      [] // المُنتَظِرينَ
    ],
    [ // آية 103
      [], // ثُمَّ
      [], // نُنَجّى
      [], // رُسُلَنا
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // كَذٰلِكَ
      [], // حَقًّا
      [], // عَلَينا
      [], // نُنجِ
      [] // المُؤمِنينَ
    ],
    [ // آية 104
      [], // قُل
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِن
      [], // كُنتُم
      [], // فى
      [], // شَكٍّ
      [], // مِن
      [], // دينى
      [], // فَلا
      [], // أَعبُدُ
      [], // الَّذينَ
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلـٰكِن
      [], // أَعبُدُ
      [], // اللَّهَ
      [], // الَّذى
      [], // يَتَوَفّىٰكُم
      [], // وَأُمِرتُ
      [], // أَن
      [], // أَكونَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 105
      [], // وَأَن
      ["أقم وجهك للدّين : اصرف ذاتك كلّها للدّين الحنيفيّ"], // أَقِم
      ["أقم وجهك للدّين : اصرف ذاتك كلّها للدّين الحنيفيّ"], // وَجهَكَ
      ["أقم وجهك للدّين : اصرف ذاتك كلّها للدّين الحنيفيّ"], // لِلدّينِ
      ["حنيفا : مائلا عن الأديان الباطلة كلّها"], // حَنيفًا
      [], // وَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 106
      [], // وَلا
      [], // تَدعُ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَنفَعُكَ
      [], // وَلا
      [], // يَضُرُّكَ
      [], // فَإِن
      [], // فَعَلتَ
      [], // فَإِنَّكَ
      [], // إِذًا
      [], // مِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 107
      [], // وَإِن
      [], // يَمسَسكَ
      [], // اللَّهُ
      [], // بِضُرٍّ
      [], // فَلا
      [], // كاشِفَ
      [], // لَهُ
      [], // إِلّا
      [], // هُوَ
      [], // وَإِن
      [], // يُرِدكَ
      [], // بِخَيرٍ
      [], // فَلا
      [], // رادَّ
      [], // لِفَضلِهِ
      [], // يُصيبُ
      [], // بِهِ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَهُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 108
      [], // قُل
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // قَد
      [], // جاءَكُمُ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكُم
      [], // فَمَنِ
      [], // اهتَدىٰ
      [], // فَإِنَّما
      [], // يَهتَدى
      [], // لِنَفسِهِ
      [], // وَمَن
      [], // ضَلَّ
      [], // فَإِنَّما
      [], // يَضِلُّ
      [], // عَلَيها
      [], // وَما
      [], // أَنا۠
      [], // عَلَيكُم
      ["بوكيل : بحفيظ موكولٍ إليّ أمركم"] // بِوَكيلٍ
    ],
    [ // آية 109
      [], // وَاتَّبِع
      [], // ما
      [], // يوحىٰ
      [], // إِلَيكَ
      [], // وَاصبِر
      [], // حَتّىٰ
      [], // يَحكُمَ
      [], // اللَّهُ
      [], // وَهُوَ
      [], // خَيرُ
      [] // الحـٰكِمينَ
    ]
];

export default meanings;