const meanings = [
  [ // سورة 100: العاديات
[ // آية 1
      [], // وَالعـٰدِيـٰتِ
      [] // ضَبحًا
    ],
    [ // آية 2
      [], // فَالمورِيـٰتِ
      [] // قَدحًا
    ],
    [ // آية 3
      [], // فَالمُغيرٰتِ
      [] // صُبحًا
    ],
    [ // آية 4
      [], // فَأَثَرنَ
      [], // بِهِ
      [] // نَقعًا
    ],
    [ // آية 5
      ["فَوَسَطنَ به جَمْعا : فـتـَـوَسّـــْطنَ  فيه مِنَ الأعداء"], // فَوَسَطنَ
      ["فَوَسَطنَ به جَمْعا : فـتـَـوَسّـــْطنَ  فيه مِنَ الأعداء"], // بِهِ
      ["فَوَسَطنَ به جَمْعا : فـتـَـوَسّـــْطنَ  فيه مِنَ الأعداء"] // جَمعًا
    ],
    [ // آية 6
      [], // إِنَّ
      [], // الإِنسـٰنَ
      [], // لِرَبِّهِ
      [] // لَكَنودٌ
    ],
    [ // آية 7
      [], // وَإِنَّهُ
      [], // عَلىٰ
      [], // ذٰلِكَ
      [] // لَشَهيدٌ
    ],
    [ // آية 8
      [], // وَإِنَّهُ
      [], // لِحُبِّ
      [], // الخَيرِ
      ["لشديدٌ : لقويّ مُجدّ في تحصيله مُتـهالكٌ عليه"] // لَشَديدٌ
    ],
    [ // آية 9
      [], // أَفَلا
      [], // يَعلَمُ
      [], // إِذا
      [], // بُعثِرَ
      [], // ما
      [], // فِى
      [] // القُبورِ
    ],
    [ // آية 10
      [], // وَحُصِّلَ
      [], // ما
      [], // فِى
      [] // الصُّدورِ
    ],
    [ // آية 11
      [], // إِنَّ
      [], // رَبَّهُم
      [], // بِهِم
      [], // يَومَئِذٍ
      [] // لَخَبيرٌ
    ]
  ]
];

export default meanings;