const meanings = [
[ // آية 1
      ["القارعة : القيامة تـقـْـرَعُ القـلوب بأهوالِها"] // القارِعَةُ
    ],
    [ // آية 2
      [], // مَا
      [] // القارِعَةُ
    ],
    [ // آية 3
      [], // وَما
      [], // أَدرىٰكَ
      [], // مَا
      [] // القارِعَةُ
    ],
    [ // آية 4
      [], // يَومَ
      [], // يَكونُ
      [], // النّاسُ
      ["كالفراش : هوَ طيْرٌ كالبَعوض يَتهافتُ في النّار"], // كَالفَراشِ
      ["المبْثوث : المُتـفـرّق المُـنـتـَـشِر"] // المَبثوثِ
    ],
    [ // آية 5
      [], // وَتَكونُ
      [], // الجِبالُ
      ["كالعِهن : كالصّوف المصْبوغ  بألوان مُختلفة"], // كَالعِهنِ
      ["المنفوش : المُـفرّق بالأصابع و نحْوها"] // المَنفوشِ
    ],
    [ // آية 6
      [], // فَأَمّا
      [], // مَن
      [], // ثَقُلَت
      [] // مَوٰزينُهُ
    ],
    [ // آية 7
      [], // فَهُوَ
      [], // فى
      [], // عيشَةٍ
      [] // راضِيَةٍ
    ],
    [ // آية 8
      [], // وَأَمّا
      [], // مَن
      [], // خَفَّت
      [] // مَوٰزينُهُ
    ],
    [ // آية 9
      ["فأمّه هاوية : فمأواه جهنّم يَهْوي فيها"], // فَأُمُّهُ
      ["فأمّه هاوية : فمأواه جهنّم يَهْوي فيها"] // هاوِيَةٌ
    ],
    [ // آية 10
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [] // هِيَه
    ],
    [ // آية 11
      [], // نارٌ
      [] // حامِيَةٌ
    ]
];

export default meanings;