const meanings = [
[ // آية 1
      [], // أَلهىٰكُمُ
      [] // التَّكاثُرُ
    ],
    [ // آية 2
      [], // حَتّىٰ
      ["زُرْتم المقابر : متـّـمْ و دُفِنـنـْـتم في القبور"], // زُرتُمُ
      ["زُرْتم المقابر : متـّـمْ و دُفِنـنـْـتم في القبور"] // المَقابِرَ
    ],
    [ // آية 3
      [], // كَلّا
      [], // سَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 4
      [], // ثُمَّ
      [], // كَلّا
      [], // سَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 5
      [], // كَلّا
      ["لو تعلمون عِلم اليقين : لوْ تعلمون مآلكم عِلما يَقـينا لـَـمَـا ألهاكم التـّـكاثر"], // لَو
      ["لو تعلمون عِلم اليقين : لوْ تعلمون مآلكم عِلما يَقـينا لـَـمَـا ألهاكم التـّـكاثر"], // تَعلَمونَ
      ["لو تعلمون عِلم اليقين : لوْ تعلمون مآلكم عِلما يَقـينا لـَـمَـا ألهاكم التـّـكاثر"], // عِلمَ
      ["لو تعلمون عِلم اليقين : لوْ تعلمون مآلكم عِلما يَقـينا لـَـمَـا ألهاكم التـّـكاثر"] // اليَقينِ
    ],
    [ // آية 6
      ["لترونّ الجحيم : و الله لترَوُنّ الجحيم"], // لَتَرَوُنَّ
      ["لترونّ الجحيم : و الله لترَوُنّ الجحيم"] // الجَحيمَ
    ],
    [ // آية 7
      [], // ثُمَّ
      [], // لَتَرَوُنَّها
      ["عيْن اليقين : نـَـفـْـسَ اليَقين و هو المشاهدة"], // عَينَ
      ["عيْن اليقين : نـَـفـْـسَ اليَقين و هو المشاهدة"] // اليَقينِ
    ],
    [ // آية 8
      [], // ثُمَّ
      [], // لَتُسـَٔلُنَّ
      [], // يَومَئِذٍ
      [], // عَنِ
      ["النّعيم : الذي ألهاكمْ عنْ طاعة رَبّكمْ"] // النَّعيمِ
    ]
];

export default meanings;