const meanings = [
[ // آية 1
      ["وَيْل : عذاب أو هَلاك أوْ وَادٍ في جَهنّم"], // وَيلٌ
      [], // لِكُلِّ
      [], // هُمَزَةٍ
      [] // لُمَزَةٍ
    ],
    [ // آية 2
      [], // الَّذى
      [], // جَمَعَ
      [], // مالًا
      [] // وَعَدَّدَهُ
    ],
    [ // آية 3
      [], // يَحسَبُ
      [], // أَنَّ
      [], // مالَهُ
      ["أخلده : يُخـلـّـدُهُ في الدنيا"] // أَخلَدَهُ
    ],
    [ // آية 4
      [], // كَلّا
      [], // لَيُنبَذَنَّ
      [], // فِى
      [] // الحُطَمَةِ
    ],
    [ // آية 5
      [], // وَما
      [], // أَدرىٰكَ
      [], // مَا
      [] // الحُطَمَةُ
    ],
    [ // آية 6
      [], // نارُ
      [], // اللَّهِ
      [] // الموقَدَةُ
    ],
    [ // آية 7
      [], // الَّتى
      [], // تَطَّلِعُ
      [], // عَلَى
      [] // الأَفـِٔدَةِ
    ],
    [ // آية 8
      [], // إِنَّها
      [], // عَلَيهِم
      ["مؤْصَدَة : مُـطبَـقـَـة مُـغْـلـقـَة ٌ أبْوابها"] // مُؤصَدَةٌ
    ],
    [ // آية 9
      [], // فى
      [], // عَمَدٍ
      [] // مُمَدَّدَةٍ
    ]
];

export default meanings;