const meanings = [
[ // آية 1
      [], // أَلَم
      [], // تَرَ
      [], // كَيفَ
      [], // فَعَلَ
      [], // رَبُّكَ
      [], // بِأَصحـٰبِ
      [] // الفيلِ
    ],
    [ // آية 2
      [], // أَلَم
      ["يَجْعَلْ كَيْدَهمْ : سَعْـيَهمْ لتخْريب الكَعْـبَة"], // يَجعَل
      ["يَجْعَلْ كَيْدَهمْ : سَعْـيَهمْ لتخْريب الكَعْـبَة"], // كَيدَهُم
      [], // فى
      [] // تَضليلٍ
    ],
    [ // آية 3
      [], // وَأَرسَلَ
      [], // عَلَيهِم
      ["طَيْرًا أبابيل : جماعاتٍ مُتفرّقة  مُتتابعة"], // طَيرًا
      ["طَيْرًا أبابيل : جماعاتٍ مُتفرّقة  مُتتابعة"] // أَبابيلَ
    ],
    [ // آية 4
      [], // تَرميهِم
      [], // بِحِجارَةٍ
      [], // مِن
      [] // سِجّيلٍ
    ],
    [ // آية 5
      [], // فَجَعَلَهُم
      ["كَعَصْفٍ مأكول : كَـتِـبْـنِ أكَلـتـْه الدّوابّ فراثـَتـْـه"], // كَعَصفٍ
      ["كَعَصْفٍ مأكول : كَـتِـبْـنِ أكَلـتـْه الدّوابّ فراثـَتـْـه"] // مَأكولٍ
    ]
];

export default meanings;