const meanings = [
  [ // سورة 107: الماعون
[ // آية 1
      [], // أَرَءَيتَ
      [], // الَّذى
      [], // يُكَذِّبُ
      [] // بِالدّينِ
    ],
    [ // آية 2
      [], // فَذٰلِكَ
      [], // الَّذى
      [], // يَدُعُّ
      [] // اليَتيمَ
    ],
    [ // آية 3
      [], // وَلا
      [], // يَحُضُّ
      [], // عَلىٰ
      [], // طَعامِ
      [] // المِسكينِ
    ],
    [ // آية 4
      [], // فَوَيلٌ
      [] // لِلمُصَلّينَ
    ],
    [ // آية 5
      [], // الَّذينَ
      [], // هُم
      [], // عَن
      [], // صَلاتِهِم
      ["سَاهون : غـَـافـِلون غَيْرُ مُبالين بها"] // ساهونَ
    ],
    [ // آية 6
      [], // الَّذينَ
      [], // هُم
      ["يُرَاءُون : يَقـْـصِـدون الرّياءَ بأعمالِهمْ"] // يُراءونَ
    ],
    [ // آية 7
      [], // وَيَمنَعونَ
      [] // الماعونَ
    ]
  ]
];

export default meanings;