const meanings = [
  [ // سورة 109: الكافرون
[ // آية 1
      [], // قُل
      [], // يـٰأَيُّهَا
      [] // الكـٰفِرونَ
    ],
    [ // آية 2
      [], // لا
      [], // أَعبُدُ
      [], // ما
      [] // تَعبُدونَ
    ],
    [ // آية 3
      [], // وَلا
      [], // أَنتُم
      [], // عـٰبِدونَ
      [], // ما
      [] // أَعبُدُ
    ],
    [ // آية 4
      [], // وَلا
      [], // أَنا۠
      [], // عابِدٌ
      [], // ما
      [] // عَبَدتُم
    ],
    [ // آية 5
      [], // وَلا
      [], // أَنتُم
      [], // عـٰبِدونَ
      [], // ما
      [] // أَعبُدُ
    ],
    [ // آية 6
      ["لَكُمْ دينكمْ : شِرْككم  و كفركم أو جَزاؤهُ"], // لَكُم
      ["لَكُمْ دينكمْ : شِرْككم  و كفركم أو جَزاؤهُ"], // دينُكُم
      [], // وَلِىَ
      [] // دينِ
    ]
  ]
];

export default meanings;