const meanings = [
[ // آية 1
      [], // الر
      [], // كِتـٰبٌ
      [], // أُحكِمَت
      [], // ءايـٰتُهُ
      [], // ثُمَّ
      ["فصّلت : فرّقت في التّنزيل نجوما بالحكمة"], // فُصِّلَت
      [], // مِن
      [], // لَدُن
      [], // حَكيمٍ
      [] // خَبيرٍ
    ],
    [ // آية 2
      [], // أَلّا
      [], // تَعبُدوا
      [], // إِلَّا
      [], // اللَّهَ
      [], // إِنَّنى
      [], // لَكُم
      [], // مِنهُ
      [], // نَذيرٌ
      [] // وَبَشيرٌ
    ],
    [ // آية 3
      [], // وَأَنِ
      [], // استَغفِروا
      [], // رَبَّكُم
      [], // ثُمَّ
      [], // توبوا
      [], // إِلَيهِ
      [], // يُمَتِّعكُم
      [], // مَتـٰعًا
      [], // حَسَنًا
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // وَيُؤتِ
      [], // كُلَّ
      [], // ذى
      [], // فَضلٍ
      [], // فَضلَهُ
      [], // وَإِن
      [], // تَوَلَّوا
      [], // فَإِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      [], // يَومٍ
      [] // كَبيرٍ
    ],
    [ // آية 4
      [], // إِلَى
      [], // اللَّهِ
      [], // مَرجِعُكُم
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 5
      [], // أَلا
      [], // إِنَّهُم
      ["يثنون صدورهم : يطوونها على الكفر و العداوة"], // يَثنونَ
      ["يثنون صدورهم : يطوونها على الكفر و العداوة"], // صُدورَهُم
      ["ليستخفوا منه : من الله تعالى جهلا منهم"], // لِيَستَخفوا
      ["ليستخفوا منه : من الله تعالى جهلا منهم"], // مِنهُ
      [], // أَلا
      [], // حينَ
      ["يستغشون ثيابهم : يتغطّون بها مُبالغة في الاستخفاء"], // يَستَغشونَ
      ["يستغشون ثيابهم : يتغطّون بها مُبالغة في الاستخفاء"], // ثِيابَهُم
      [], // يَعلَمُ
      [], // ما
      [], // يُسِرّونَ
      [], // وَما
      [], // يُعلِنونَ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 6
      [], // وَما
      [], // مِن
      [], // دابَّةٍ
      [], // فِى
      [], // الأَرضِ
      [], // إِلّا
      [], // عَلَى
      [], // اللَّهِ
      [], // رِزقُها
      [], // وَيَعلَمُ
      [], // مُستَقَرَّها
      [], // وَمُستَودَعَها
      [], // كُلٌّ
      [], // فى
      [], // كِتـٰبٍ
      [] // مُبينٍ
    ],
    [ // آية 7
      [], // وَهُوَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // وَكانَ
      [], // عَرشُهُ
      [], // عَلَى
      [], // الماءِ
      ["ليبلُوكم : ليختبركم و هو أعلم بأمركم"], // لِيَبلُوَكُم
      [], // أَيُّكُم
      ["أحسن عملا : أطوع لله و أروع عن محارمه"], // أَحسَنُ
      ["أحسن عملا : أطوع لله و أروع عن محارمه"], // عَمَلًا
      [], // وَلَئِن
      [], // قُلتَ
      [], // إِنَّكُم
      [], // مَبعوثونَ
      [], // مِن
      [], // بَعدِ
      [], // المَوتِ
      [], // لَيَقولَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 8
      [], // وَلَئِن
      [], // أَخَّرنا
      [], // عَنهُمُ
      [], // العَذابَ
      [], // إِلىٰ
      ["أمّة معدودة : طائفة من الأيّام قليلة"], // أُمَّةٍ
      ["أمّة معدودة : طائفة من الأيّام قليلة"], // مَعدودَةٍ
      [], // لَيَقولُنَّ
      [], // ما
      [], // يَحبِسُهُ
      [], // أَلا
      [], // يَومَ
      [], // يَأتيهِم
      [], // لَيسَ
      [], // مَصروفًا
      [], // عَنهُم
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 9
      [], // وَلَئِن
      [], // أَذَقنَا
      [], // الإِنسـٰنَ
      [], // مِنّا
      [], // رَحمَةً
      [], // ثُمَّ
      [], // نَزَعنـٰها
      [], // مِنهُ
      [], // إِنَّهُ
      [], // لَيَـٔوسٌ
      ["كفور : كثير الكفران للنّعم"] // كَفورٌ
    ],
    [ // آية 10
      [], // وَلَئِن
      [], // أَذَقنـٰهُ
      [], // نَعماءَ
      [], // بَعدَ
      ["ضرّاء مسّته : نائبة و نكبة أصابته"], // ضَرّاءَ
      ["ضرّاء مسّته : نائبة و نكبة أصابته"], // مَسَّتهُ
      [], // لَيَقولَنَّ
      [], // ذَهَبَ
      [], // السَّيِّـٔاتُ
      [], // عَنّى
      [], // إِنَّهُ
      [], // لَفَرِحٌ
      [] // فَخورٌ
    ],
    [ // آية 11
      [], // إِلَّا
      [], // الَّذينَ
      [], // صَبَروا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَأَجرٌ
      [] // كَبيرٌ
    ],
    [ // آية 12
      [], // فَلَعَلَّكَ
      [], // تارِكٌ
      [], // بَعضَ
      [], // ما
      [], // يوحىٰ
      [], // إِلَيكَ
      [], // وَضائِقٌ
      [], // بِهِ
      [], // صَدرُكَ
      [], // أَن
      [], // يَقولوا
      [], // لَولا
      [], // أُنزِلَ
      [], // عَلَيهِ
      [], // كَنزٌ
      [], // أَو
      [], // جاءَ
      [], // مَعَهُ
      [], // مَلَكٌ
      [], // إِنَّما
      [], // أَنتَ
      [], // نَذيرٌ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      ["وكيل : قائمٌ به حافظ له"] // وَكيلٌ
    ],
    [ // آية 13
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰهُ
      [], // قُل
      [], // فَأتوا
      [], // بِعَشرِ
      [], // سُوَرٍ
      [], // مِثلِهِ
      [], // مُفتَرَيـٰتٍ
      [], // وَادعوا
      [], // مَنِ
      [], // استَطَعتُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 14
      [], // فَإِلَّم
      [], // يَستَجيبوا
      [], // لَكُم
      [], // فَاعلَموا
      [], // أَنَّما
      [], // أُنزِلَ
      [], // بِعِلمِ
      [], // اللَّهِ
      [], // وَأَن
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَهَل
      [], // أَنتُم
      [] // مُسلِمونَ
    ],
    [ // آية 15
      [], // مَن
      [], // كانَ
      [], // يُريدُ
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // وَزينَتَها
      [], // نُوَفِّ
      [], // إِلَيهِم
      [], // أَعمـٰلَهُم
      [], // فيها
      [], // وَهُم
      [], // فيها
      [], // لا
      [] // يُبخَسونَ
    ],
    [ // آية 16
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // لَيسَ
      [], // لَهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // إِلَّا
      [], // النّارُ
      [], // وَحَبِطَ
      [], // ما
      [], // صَنَعوا
      [], // فيها
      [], // وَبـٰطِلٌ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 17
      [], // أَفَمَن
      [], // كانَ
      [], // عَلىٰ
      ["بيّنة : يقين و برهان واضح و هو القرآن"], // بَيِّنَةٍ
      [], // مِن
      [], // رَبِّهِ
      [], // وَيَتلوهُ
      ["شاهد : على تنزيله و هو اعجاز نظمه"], // شاهِدٌ
      [], // مِنهُ
      [], // وَمِن
      [], // قَبلِهِ
      [], // كِتـٰبُ
      [], // موسىٰ
      [], // إِمامًا
      [], // وَرَحمَةً
      [], // أُولـٰئِكَ
      [], // يُؤمِنونَ
      [], // بِهِ
      [], // وَمَن
      [], // يَكفُر
      [], // بِهِ
      [], // مِنَ
      [], // الأَحزابِ
      [], // فَالنّارُ
      [], // مَوعِدُهُ
      [], // فَلا
      [], // تَكُ
      [], // فى
      ["مرية منه : شكّ من تنزيله من عند الله"], // مِريَةٍ
      ["مرية منه : شكّ من تنزيله من عند الله"], // مِنهُ
      [], // إِنَّهُ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكَ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 18
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أُولـٰئِكَ
      [], // يُعرَضونَ
      [], // عَلىٰ
      [], // رَبِّهِم
      [], // وَيَقولُ
      [], // الأَشهـٰدُ
      [], // هـٰؤُلاءِ
      [], // الَّذينَ
      [], // كَذَبوا
      [], // عَلىٰ
      [], // رَبِّهِم
      [], // أَلا
      [], // لَعنَةُ
      [], // اللَّهِ
      [], // عَلَى
      [] // الظّـٰلِمينَ
    ],
    [ // آية 19
      [], // الَّذينَ
      [], // يَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَيَبغونَها
      [], // عِوَجًا
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [], // هُم
      [] // كـٰفِرونَ
    ],
    [ // آية 20
      [], // أُولـٰئِكَ
      [], // لَم
      [], // يَكونوا
      ["مُعجزين : فائتين من عذاب الله بالهرب"], // مُعجِزينَ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // كانَ
      [], // لَهُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // أَولِياءَ
      [], // يُضـٰعَفُ
      [], // لَهُمُ
      [], // العَذابُ
      [], // ما
      [], // كانوا
      [], // يَستَطيعونَ
      [], // السَّمعَ
      [], // وَما
      [], // كانوا
      [] // يُبصِرونَ
    ],
    [ // آية 21
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَفتَرونَ
    ],
    [ // آية 22
      [], // لا
      [], // جَرَمَ
      [], // أَنَّهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // هُمُ
      [] // الأَخسَرونَ
    ],
    [ // آية 23
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // وَأَخبَتوا
      [], // إِلىٰ
      [], // رَبِّهِم
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 24
      [], // مَثَلُ
      [], // الفَريقَينِ
      [], // كَالأَعمىٰ
      [], // وَالأَصَمِّ
      [], // وَالبَصيرِ
      [], // وَالسَّميعِ
      [], // هَل
      [], // يَستَوِيانِ
      [], // مَثَلًا
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 25
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // نوحًا
      [], // إِلىٰ
      [], // قَومِهِ
      [], // إِنّى
      [], // لَكُم
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 26
      [], // أَن
      [], // لا
      [], // تَعبُدوا
      [], // إِلَّا
      [], // اللَّهَ
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      [], // يَومٍ
      [] // أَليمٍ
    ],
    [ // آية 27
      [], // فَقالَ
      ["الملأُ : السادة و الرّؤساء"], // المَلَأُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَومِهِ
      [], // ما
      [], // نَرىٰكَ
      [], // إِلّا
      [], // بَشَرًا
      [], // مِثلَنا
      [], // وَما
      [], // نَرىٰكَ
      [], // اتَّبَعَكَ
      [], // إِلَّا
      [], // الَّذينَ
      [], // هُم
      [], // أَراذِلُنا
      [], // بادِىَ
      [], // الرَّأىِ
      [], // وَما
      [], // نَرىٰ
      [], // لَكُم
      [], // عَلَينا
      [], // مِن
      [], // فَضلٍ
      [], // بَل
      [], // نَظُنُّكُم
      [] // كـٰذِبينَ
    ],
    [ // آية 28
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَرَءَيتُم
      [], // إِن
      [], // كُنتُ
      [], // عَلىٰ
      [], // بَيِّنَةٍ
      [], // مِن
      [], // رَبّى
      [], // وَءاتىٰنى
      [], // رَحمَةً
      [], // مِن
      [], // عِندِهِ
      ["فعُمّيت عليكم : أُخفيت عليكم"], // فَعُمِّيَت
      ["فعُمّيت عليكم : أُخفيت عليكم"], // عَلَيكُم
      [], // أَنُلزِمُكُموها
      [], // وَأَنتُم
      [], // لَها
      [] // كـٰرِهونَ
    ],
    [ // آية 29
      [], // وَيـٰقَومِ
      [], // لا
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مالًا
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلَى
      [], // اللَّهِ
      [], // وَما
      [], // أَنا۠
      [], // بِطارِدِ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّهُم
      [], // مُلـٰقوا
      [], // رَبِّهِم
      [], // وَلـٰكِنّى
      [], // أَرىٰكُم
      [], // قَومًا
      [] // تَجهَلونَ
    ],
    [ // آية 30
      [], // وَيـٰقَومِ
      [], // مَن
      [], // يَنصُرُنى
      [], // مِنَ
      [], // اللَّهِ
      [], // إِن
      [], // طَرَدتُهُم
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 31
      [], // وَلا
      [], // أَقولُ
      [], // لَكُم
      [], // عِندى
      ["خزائن الله : خزائن رزقه و ماله"], // خَزائِنُ
      ["خزائن الله : خزائن رزقه و ماله"], // اللَّهِ
      [], // وَلا
      [], // أَعلَمُ
      [], // الغَيبَ
      [], // وَلا
      [], // أَقولُ
      [], // إِنّى
      [], // مَلَكٌ
      [], // وَلا
      [], // أَقولُ
      [], // لِلَّذينَ
      [], // تَزدَرى
      [], // أَعيُنُكُم
      [], // لَن
      [], // يُؤتِيَهُمُ
      [], // اللَّهُ
      [], // خَيرًا
      [], // اللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [], // فى
      [], // أَنفُسِهِم
      [], // إِنّى
      [], // إِذًا
      [], // لَمِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 32
      [], // قالوا
      [], // يـٰنوحُ
      [], // قَد
      [], // جـٰدَلتَنا
      [], // فَأَكثَرتَ
      [], // جِدٰلَنا
      [], // فَأتِنا
      [], // بِما
      [], // تَعِدُنا
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 33
      [], // قالَ
      [], // إِنَّما
      [], // يَأتيكُم
      [], // بِهِ
      [], // اللَّهُ
      [], // إِن
      [], // شاءَ
      [], // وَما
      [], // أَنتُم
      [] // بِمُعجِزينَ
    ],
    [ // آية 34
      [], // وَلا
      [], // يَنفَعُكُم
      [], // نُصحى
      [], // إِن
      [], // أَرَدتُ
      [], // أَن
      [], // أَنصَحَ
      [], // لَكُم
      [], // إِن
      [], // كانَ
      [], // اللَّهُ
      [], // يُريدُ
      ["أن يُغويكم : يضلّكم"], // أَن
      ["أن يُغويكم : يضلّكم"], // يُغوِيَكُم
      [], // هُوَ
      [], // رَبُّكُم
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 35
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰهُ
      [], // قُل
      [], // إِنِ
      [], // افتَرَيتُهُ
      [], // فَعَلَىَّ
      [], // إِجرامى
      [], // وَأَنا۠
      [], // بَرىءٌ
      [], // مِمّا
      [] // تُجرِمونَ
    ],
    [ // آية 36
      [], // وَأوحِىَ
      [], // إِلىٰ
      [], // نوحٍ
      [], // أَنَّهُ
      [], // لَن
      [], // يُؤمِنَ
      [], // مِن
      [], // قَومِكَ
      [], // إِلّا
      [], // مَن
      [], // قَد
      [], // ءامَنَ
      ["فلا تبتئس : فلا تحزن"], // فَلا
      ["فلا تبتئس : فلا تحزن"], // تَبتَئِس
      [], // بِما
      [], // كانوا
      [] // يَفعَلونَ
    ],
    [ // آية 37
      [], // وَاصنَعِ
      [], // الفُلكَ
      ["بأعيننا : بحفظنا و كلاءتنا الكاملين"], // بِأَعيُنِنا
      [], // وَوَحيِنا
      [], // وَلا
      [], // تُخـٰطِبنى
      [], // فِى
      [], // الَّذينَ
      [], // ظَلَموا
      [], // إِنَّهُم
      [] // مُغرَقونَ
    ],
    [ // آية 38
      [], // وَيَصنَعُ
      [], // الفُلكَ
      [], // وَكُلَّما
      [], // مَرَّ
      [], // عَلَيهِ
      [], // مَلَأٌ
      [], // مِن
      [], // قَومِهِ
      [], // سَخِروا
      [], // مِنهُ
      [], // قالَ
      [], // إِن
      [], // تَسخَروا
      [], // مِنّا
      [], // فَإِنّا
      [], // نَسخَرُ
      [], // مِنكُم
      [], // كَما
      [] // تَسخَرونَ
    ],
    [ // آية 39
      [], // فَسَوفَ
      [], // تَعلَمونَ
      [], // مَن
      [], // يَأتيهِ
      [], // عَذابٌ
      ["يُخزيه : يذلّه و يُهينه"], // يُخزيهِ
      [], // وَيَحِلُّ
      [], // عَلَيهِ
      [], // عَذابٌ
      [] // مُقيمٌ
    ],
    [ // آية 40
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَ
      [], // أَمرُنا
      [], // وَفارَ
      [], // التَّنّورُ
      [], // قُلنَا
      [], // احمِل
      [], // فيها
      [], // مِن
      [], // كُلٍّ
      [], // زَوجَينِ
      [], // اثنَينِ
      [], // وَأَهلَكَ
      [], // إِلّا
      [], // مَن
      [], // سَبَقَ
      [], // عَلَيهِ
      [], // القَولُ
      [], // وَمَن
      [], // ءامَنَ
      [], // وَما
      [], // ءامَنَ
      [], // مَعَهُ
      [], // إِلّا
      [] // قَليلٌ
    ],
    [ // آية 41
      [], // وَقالَ
      [], // اركَبوا
      [], // فيها
      [], // بِسمِ
      [], // اللَّهِ
      [], // مَجر۪ىٰها
      [], // وَمُرسىٰها
      [], // إِنَّ
      [], // رَبّى
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 42
      [], // وَهِىَ
      [], // تَجرى
      [], // بِهِم
      [], // فى
      [], // مَوجٍ
      [], // كَالجِبالِ
      [], // وَنادىٰ
      [], // نوحٌ
      [], // ابنَهُ
      [], // وَكانَ
      [], // فى
      [], // مَعزِلٍ
      [], // يـٰبُنَىَّ
      [], // اركَب
      [], // مَعَنا
      [], // وَلا
      [], // تَكُن
      [], // مَعَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 43
      [], // قالَ
      [], // سَـٔاوى
      [], // إِلىٰ
      [], // جَبَلٍ
      [], // يَعصِمُنى
      [], // مِنَ
      [], // الماءِ
      [], // قالَ
      [], // لا
      [], // عاصِمَ
      [], // اليَومَ
      [], // مِن
      [], // أَمرِ
      [], // اللَّهِ
      [], // إِلّا
      [], // مَن
      [], // رَحِمَ
      [], // وَحالَ
      [], // بَينَهُمَا
      [], // المَوجُ
      [], // فَكانَ
      [], // مِنَ
      [] // المُغرَقينَ
    ],
    [ // آية 44
      [], // وَقيلَ
      [], // يـٰأَرضُ
      [], // ابلَعى
      [], // ماءَكِ
      [], // وَيـٰسَماءُ
      [], // أَقلِعى
      [], // وَغيضَ
      [], // الماءُ
      [], // وَقُضِىَ
      [], // الأَمرُ
      [], // وَاستَوَت
      [], // عَلَى
      [], // الجودِىِّ
      [], // وَقيلَ
      [], // بُعدًا
      [], // لِلقَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 45
      [], // وَنادىٰ
      [], // نوحٌ
      [], // رَبَّهُ
      [], // فَقالَ
      [], // رَبِّ
      [], // إِنَّ
      [], // ابنى
      [], // مِن
      [], // أَهلى
      [], // وَإِنَّ
      [], // وَعدَكَ
      [], // الحَقُّ
      [], // وَأَنتَ
      [], // أَحكَمُ
      [] // الحـٰكِمينَ
    ],
    [ // آية 46
      [], // قالَ
      [], // يـٰنوحُ
      [], // إِنَّهُ
      [], // لَيسَ
      [], // مِن
      [], // أَهلِكَ
      [], // إِنَّهُ
      [], // عَمَلٌ
      [], // غَيرُ
      [], // صـٰلِحٍ
      [], // فَلا
      [], // تَسـَٔلنِ
      [], // ما
      [], // لَيسَ
      [], // لَكَ
      [], // بِهِ
      [], // عِلمٌ
      [], // إِنّى
      [], // أَعِظُكَ
      [], // أَن
      [], // تَكونَ
      [], // مِنَ
      [] // الجـٰهِلينَ
    ],
    [ // آية 47
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      [], // أَعوذُ
      [], // بِكَ
      [], // أَن
      [], // أَسـَٔلَكَ
      [], // ما
      [], // لَيسَ
      [], // لى
      [], // بِهِ
      [], // عِلمٌ
      [], // وَإِلّا
      [], // تَغفِر
      [], // لى
      [], // وَتَرحَمنى
      [], // أَكُن
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 48
      [], // قيلَ
      [], // يـٰنوحُ
      [], // اهبِط
      [], // بِسَلـٰمٍ
      [], // مِنّا
      [], // وَبَرَكـٰتٍ
      [], // عَلَيكَ
      [], // وَعَلىٰ
      [], // أُمَمٍ
      [], // مِمَّن
      [], // مَعَكَ
      [], // وَأُمَمٌ
      [], // سَنُمَتِّعُهُم
      [], // ثُمَّ
      [], // يَمَسُّهُم
      [], // مِنّا
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 49
      [], // تِلكَ
      [], // مِن
      [], // أَنباءِ
      [], // الغَيبِ
      [], // نوحيها
      [], // إِلَيكَ
      [], // ما
      [], // كُنتَ
      [], // تَعلَمُها
      [], // أَنتَ
      [], // وَلا
      [], // قَومُكَ
      [], // مِن
      [], // قَبلِ
      [], // هـٰذا
      [], // فَاصبِر
      [], // إِنَّ
      [], // العـٰقِبَةَ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 50
      [], // وَإِلىٰ
      [], // عادٍ
      [], // أَخاهُم
      [], // هودًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [] // مُفتَرونَ
    ],
    [ // آية 51
      [], // يـٰقَومِ
      [], // لا
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // أَجرًا
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلَى
      [], // الَّذى
      [], // فَطَرَنى
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 52
      [], // وَيـٰقَومِ
      [], // استَغفِروا
      [], // رَبَّكُم
      [], // ثُمَّ
      [], // توبوا
      [], // إِلَيهِ
      [], // يُرسِلِ
      ["السّماء : المطر"], // السَّماءَ
      [], // عَلَيكُم
      ["مدرارا : غزيرا ممتابعا بلا إضرار"], // مِدرارًا
      [], // وَيَزِدكُم
      [], // قُوَّةً
      [], // إِلىٰ
      [], // قُوَّتِكُم
      [], // وَلا
      [], // تَتَوَلَّوا
      [] // مُجرِمينَ
    ],
    [ // آية 53
      [], // قالوا
      [], // يـٰهودُ
      [], // ما
      [], // جِئتَنا
      [], // بِبَيِّنَةٍ
      [], // وَما
      [], // نَحنُ
      [], // بِتارِكى
      [], // ءالِهَتِنا
      [], // عَن
      [], // قَولِكَ
      [], // وَما
      [], // نَحنُ
      [], // لَكَ
      [] // بِمُؤمِنينَ
    ],
    [ // آية 54
      [], // إِن
      [], // نَقولُ
      [], // إِلَّا
      [], // اعتَرىٰكَ
      [], // بَعضُ
      [], // ءالِهَتِنا
      ["بسوء : بجنون و خَبَل"], // بِسوءٍ
      [], // قالَ
      [], // إِنّى
      [], // أُشهِدُ
      [], // اللَّهَ
      [], // وَاشهَدوا
      [], // أَنّى
      [], // بَرىءٌ
      [], // مِمّا
      [] // تُشرِكونَ
    ],
    [ // آية 55
      [], // مِن
      [], // دونِهِ
      [], // فَكيدونى
      [], // جَميعًا
      [], // ثُمَّ
      ["لا تُنظرون : لا تمهلوني"], // لا
      ["لا تُنظرون : لا تمهلوني"] // تُنظِرونِ
    ],
    [ // آية 56
      [], // إِنّى
      [], // تَوَكَّلتُ
      [], // عَلَى
      [], // اللَّهِ
      [], // رَبّى
      [], // وَرَبِّكُم
      [], // ما
      [], // مِن
      [], // دابَّةٍ
      [], // إِلّا
      [], // هُوَ
      [], // ءاخِذٌ
      [], // بِناصِيَتِها
      [], // إِنَّ
      [], // رَبّى
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 57
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَقَد
      [], // أَبلَغتُكُم
      [], // ما
      [], // أُرسِلتُ
      [], // بِهِ
      [], // إِلَيكُم
      [], // وَيَستَخلِفُ
      [], // رَبّى
      [], // قَومًا
      [], // غَيرَكُم
      [], // وَلا
      [], // تَضُرّونَهُ
      [], // شَيـًٔا
      [], // إِنَّ
      [], // رَبّى
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // حَفيظٌ
    ],
    [ // آية 58
      [], // وَلَمّا
      [], // جاءَ
      [], // أَمرُنا
      [], // نَجَّينا
      [], // هودًا
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // بِرَحمَةٍ
      [], // مِنّا
      [], // وَنَجَّينـٰهُم
      [], // مِن
      [], // عَذابٍ
      ["غليظ : شديد مُضاعف"] // غَليظٍ
    ],
    [ // آية 59
      [], // وَتِلكَ
      [], // عادٌ
      [], // جَحَدوا
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      [], // وَعَصَوا
      [], // رُسُلَهُ
      [], // وَاتَّبَعوا
      [], // أَمرَ
      [], // كُلِّ
      ["جبّار : مُتعاظم مُتكبّر"], // جَبّارٍ
      ["عنيد : طاغٍ معاند للحقّ مُجانب له"] // عَنيدٍ
    ],
    [ // آية 60
      [], // وَأُتبِعوا
      [], // فى
      [], // هـٰذِهِ
      [], // الدُّنيا
      [], // لَعنَةً
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // أَلا
      [], // إِنَّ
      [], // عادًا
      [], // كَفَروا
      [], // رَبَّهُم
      [], // أَلا
      ["بُعدا لعاد : هلاكا و سُحقا لهم"], // بُعدًا
      ["بُعدا لعاد : هلاكا و سُحقا لهم"], // لِعادٍ
      [], // قَومِ
      [] // هودٍ
    ],
    [ // آية 61
      [], // وَإِلىٰ
      [], // ثَمودَ
      [], // أَخاهُم
      [], // صـٰلِحًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // هُوَ
      [], // أَنشَأَكُم
      [], // مِنَ
      [], // الأَرضِ
      [], // وَاستَعمَرَكُم
      [], // فيها
      [], // فَاستَغفِروهُ
      [], // ثُمَّ
      [], // توبوا
      [], // إِلَيهِ
      [], // إِنَّ
      [], // رَبّى
      [], // قَريبٌ
      [] // مُجيبٌ
    ],
    [ // آية 62
      [], // قالوا
      [], // يـٰصـٰلِحُ
      [], // قَد
      [], // كُنتَ
      [], // فينا
      [], // مَرجُوًّا
      [], // قَبلَ
      [], // هـٰذا
      [], // أَتَنهىٰنا
      [], // أَن
      [], // نَعبُدَ
      [], // ما
      [], // يَعبُدُ
      [], // ءاباؤُنا
      [], // وَإِنَّنا
      [], // لَفى
      [], // شَكٍّ
      [], // مِمّا
      [], // تَدعونا
      [], // إِلَيهِ
      ["مُريب : موقع في الرّيبة و القلق"] // مُريبٍ
    ],
    [ // آية 63
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَرَءَيتُم
      [], // إِن
      [], // كُنتُ
      [], // عَلىٰ
      ["بيّنة : يقين و برهان و بصيرة"], // بَيِّنَةٍ
      [], // مِن
      [], // رَبّى
      [], // وَءاتىٰنى
      [], // مِنهُ
      [], // رَحمَةً
      [], // فَمَن
      [], // يَنصُرُنى
      [], // مِنَ
      [], // اللَّهِ
      [], // إِن
      [], // عَصَيتُهُ
      [], // فَما
      [], // تَزيدونَنى
      [], // غَيرَ
      ["تخسير : خسرانٍ إن عصيته"] // تَخسيرٍ
    ],
    [ // آية 64
      [], // وَيـٰقَومِ
      [], // هـٰذِهِ
      [], // ناقَةُ
      [], // اللَّهِ
      [], // لَكُم
      [], // ءايَةً
      [], // فَذَروها
      [], // تَأكُل
      [], // فى
      [], // أَرضِ
      [], // اللَّهِ
      [], // وَلا
      [], // تَمَسّوها
      [], // بِسوءٍ
      [], // فَيَأخُذَكُم
      [], // عَذابٌ
      [] // قَريبٌ
    ],
    [ // آية 65
      [], // فَعَقَروها
      [], // فَقالَ
      [], // تَمَتَّعوا
      [], // فى
      [], // دارِكُم
      [], // ثَلـٰثَةَ
      [], // أَيّامٍ
      [], // ذٰلِكَ
      [], // وَعدٌ
      [], // غَيرُ
      [] // مَكذوبٍ
    ],
    [ // آية 66
      [], // فَلَمّا
      [], // جاءَ
      [], // أَمرُنا
      [], // نَجَّينا
      [], // صـٰلِحًا
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // بِرَحمَةٍ
      [], // مِنّا
      [], // وَمِن
      [], // خِزىِ
      [], // يَومِئِذٍ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // القَوِىُّ
      [] // العَزيزُ
    ],
    [ // آية 67
      [], // وَأَخَذَ
      [], // الَّذينَ
      [], // ظَلَمُوا
      ["الصّيحة : صوت من السّماء مُهلك"], // الصَّيحَةُ
      [], // فَأَصبَحوا
      [], // فى
      [], // دِيـٰرِهِم
      [] // جـٰثِمينَ
    ],
    [ // آية 68
      [], // كَأَن
      ["لم يغنوا فيها : لم يُقيموا فيها طويلا في رغدٍ"], // لَم
      ["لم يغنوا فيها : لم يُقيموا فيها طويلا في رغدٍ"], // يَغنَوا
      ["لم يغنوا فيها : لم يُقيموا فيها طويلا في رغدٍ"], // فيها
      [], // أَلا
      [], // إِنَّ
      [], // ثَمودَا۟
      [], // كَفَروا
      [], // رَبَّهُم
      [], // أَلا
      ["بُعدا لثمود : هلاكا و سُحقا لهم"], // بُعدًا
      ["بُعدا لثمود : هلاكا و سُحقا لهم"] // لِثَمودَ
    ],
    [ // آية 69
      [], // وَلَقَد
      [], // جاءَت
      [], // رُسُلُنا
      [], // إِبرٰهيمَ
      [], // بِالبُشرىٰ
      [], // قالوا
      [], // سَلـٰمًا
      [], // قالَ
      [], // سَلـٰمٌ
      [], // فَما
      [], // لَبِثَ
      [], // أَن
      [], // جاءَ
      ["بعجل حنيذٍ : مشويّ بالحجارة المحمّاة في حُفرة"], // بِعِجلٍ
      ["بعجل حنيذٍ : مشويّ بالحجارة المحمّاة في حُفرة"] // حَنيذٍ
    ],
    [ // آية 70
      [], // فَلَمّا
      [], // رَءا
      [], // أَيدِيَهُم
      [], // لا
      [], // تَصِلُ
      [], // إِلَيهِ
      ["نكِرهم : أنكرهم و نفر منهم"], // نَكِرَهُم
      [], // وَأَوجَسَ
      [], // مِنهُم
      [], // خيفَةً
      [], // قالوا
      [], // لا
      [], // تَخَف
      [], // إِنّا
      [], // أُرسِلنا
      [], // إِلىٰ
      [], // قَومِ
      [] // لوطٍ
    ],
    [ // آية 71
      [], // وَامرَأَتُهُ
      [], // قائِمَةٌ
      [], // فَضَحِكَت
      [], // فَبَشَّرنـٰها
      [], // بِإِسحـٰقَ
      [], // وَمِن
      [], // وَراءِ
      [], // إِسحـٰقَ
      [] // يَعقوبَ
    ],
    [ // آية 72
      [], // قالَت
      [], // يـٰوَيلَتىٰ
      [], // ءَأَلِدُ
      [], // وَأَنا۠
      [], // عَجوزٌ
      [], // وَهـٰذا
      [], // بَعلى
      [], // شَيخًا
      [], // إِنَّ
      [], // هـٰذا
      [], // لَشَىءٌ
      [] // عَجيبٌ
    ],
    [ // آية 73
      [], // قالوا
      [], // أَتَعجَبينَ
      [], // مِن
      [], // أَمرِ
      [], // اللَّهِ
      [], // رَحمَتُ
      [], // اللَّهِ
      [], // وَبَرَكـٰتُهُ
      [], // عَلَيكُم
      [], // أَهلَ
      [], // البَيتِ
      [], // إِنَّهُ
      [], // حَميدٌ
      ["مجيد : كثير الخير و الإحسان"] // مَجيدٌ
    ],
    [ // آية 74
      [], // فَلَمّا
      [], // ذَهَبَ
      [], // عَن
      [], // إِبرٰهيمَ
      ["الرّوع : الخوف و الفزع"], // الرَّوعُ
      [], // وَجاءَتهُ
      [], // البُشرىٰ
      [], // يُجـٰدِلُنا
      [], // فى
      [], // قَومِ
      [] // لوطٍ
    ],
    [ // آية 75
      [], // إِنَّ
      [], // إِبرٰهيمَ
      ["لحليم : مُتأنّ غير عجول"], // لَحَليمٌ
      [], // أَوّٰهٌ
      ["منيب : راجع إلى الله سبحانه"] // مُنيبٌ
    ],
    [ // آية 76
      [], // يـٰإِبرٰهيمُ
      [], // أَعرِض
      [], // عَن
      [], // هـٰذا
      [], // إِنَّهُ
      [], // قَد
      [], // جاءَ
      [], // أَمرُ
      [], // رَبِّكَ
      [], // وَإِنَّهُم
      [], // ءاتيهِم
      [], // عَذابٌ
      [], // غَيرُ
      [] // مَردودٍ
    ],
    [ // آية 77
      [], // وَلَمّا
      [], // جاءَت
      [], // رُسُلُنا
      [], // لوطًا
      [], // سىءَ
      [], // بِهِم
      [], // وَضاقَ
      [], // بِهِم
      [], // ذَرعًا
      [], // وَقالَ
      [], // هـٰذا
      ["يوم عصيب : شديد شرّه و بلاؤه"], // يَومٌ
      ["يوم عصيب : شديد شرّه و بلاؤه"] // عَصيبٌ
    ],
    [ // آية 78
      [], // وَجاءَهُ
      [], // قَومُهُ
      ["يُهرعون إليه : يُسرعون إليه كأنّهم يُدفعون"], // يُهرَعونَ
      ["يُهرعون إليه : يُسرعون إليه كأنّهم يُدفعون"], // إِلَيهِ
      [], // وَمِن
      [], // قَبلُ
      [], // كانوا
      [], // يَعمَلونَ
      [], // السَّيِّـٔاتِ
      [], // قالَ
      [], // يـٰقَومِ
      [], // هـٰؤُلاءِ
      [], // بَناتى
      [], // هُنَّ
      [], // أَطهَرُ
      [], // لَكُم
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [], // وَلا
      [], // تُخزونِ
      [], // فى
      [], // ضَيفى
      [], // أَلَيسَ
      [], // مِنكُم
      [], // رَجُلٌ
      [] // رَشيدٌ
    ],
    [ // آية 79
      [], // قالوا
      [], // لَقَد
      [], // عَلِمتَ
      [], // ما
      [], // لَنا
      [], // فى
      [], // بَناتِكَ
      ["من حقّ : من حاجة و أَرَب"], // مِن
      ["من حقّ : من حاجة و أَرَب"], // حَقٍّ
      [], // وَإِنَّكَ
      [], // لَتَعلَمُ
      [], // ما
      [] // نُريدُ
    ],
    [ // آية 80
      [], // قالَ
      [], // لَو
      [], // أَنَّ
      [], // لى
      [], // بِكُم
      [], // قُوَّةً
      [], // أَو
      [], // ءاوى
      [], // إِلىٰ
      [], // رُكنٍ
      [] // شَديدٍ
    ],
    [ // آية 81
      [], // قالوا
      [], // يـٰلوطُ
      [], // إِنّا
      [], // رُسُلُ
      [], // رَبِّكَ
      [], // لَن
      [], // يَصِلوا
      [], // إِلَيكَ
      [], // فَأَسرِ
      [], // بِأَهلِكَ
      [], // بِقِطعٍ
      [], // مِنَ
      [], // الَّيلِ
      [], // وَلا
      [], // يَلتَفِت
      [], // مِنكُم
      [], // أَحَدٌ
      [], // إِلَّا
      [], // امرَأَتَكَ
      [], // إِنَّهُ
      [], // مُصيبُها
      [], // ما
      [], // أَصابَهُم
      [], // إِنَّ
      [], // مَوعِدَهُمُ
      [], // الصُّبحُ
      [], // أَلَيسَ
      [], // الصُّبحُ
      [] // بِقَريبٍ
    ],
    [ // آية 82
      [], // فَلَمّا
      [], // جاءَ
      [], // أَمرُنا
      [], // جَعَلنا
      [], // عـٰلِيَها
      [], // سافِلَها
      [], // وَأَمطَرنا
      [], // عَلَيها
      [], // حِجارَةً
      [], // مِن
      ["سجيل : طين طُبخ بالنّار كالفخّار"], // سِجّيلٍ
      ["منضود : متتابع أو مجموع معدّ للعذاب"] // مَنضودٍ
    ],
    [ // آية 83
      ["مسوّمةً : معلمة العذاب"], // مُسَوَّمَةً
      [], // عِندَ
      [], // رَبِّكَ
      [], // وَما
      [], // هِىَ
      [], // مِنَ
      [], // الظّـٰلِمينَ
      [] // بِبَعيدٍ
    ],
    [ // آية 84
      [], // وَإِلىٰ
      [], // مَديَنَ
      [], // أَخاهُم
      [], // شُعَيبًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // وَلا
      [], // تَنقُصُوا
      [], // المِكيالَ
      [], // وَالميزانَ
      [], // إِنّى
      [], // أَرىٰكُم
      [], // بِخَيرٍ
      [], // وَإِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      ["يوم مُحيط : مُهلك"], // يَومٍ
      ["يوم مُحيط : مُهلك"] // مُحيطٍ
    ],
    [ // آية 85
      [], // وَيـٰقَومِ
      [], // أَوفُوا
      [], // المِكيالَ
      [], // وَالميزانَ
      ["بالقسط : بالعدل بلا زيادة و لا نُقصان"], // بِالقِسطِ
      [], // وَلا
      [], // تَبخَسُوا
      [], // النّاسَ
      [], // أَشياءَهُم
      [], // وَلا
      [], // تَعثَوا
      [], // فِى
      [], // الأَرضِ
      [] // مُفسِدينَ
    ],
    [ // آية 86
      [], // بَقِيَّتُ
      [], // اللَّهِ
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [], // مُؤمِنينَ
      [], // وَما
      [], // أَنا۠
      [], // عَلَيكُم
      ["بحفيظ : برقيب فأجازيكم بأعمالكم"] // بِحَفيظٍ
    ],
    [ // آية 87
      [], // قالوا
      [], // يـٰشُعَيبُ
      [], // أَصَلوٰتُكَ
      [], // تَأمُرُكَ
      [], // أَن
      [], // نَترُكَ
      [], // ما
      [], // يَعبُدُ
      [], // ءاباؤُنا
      [], // أَو
      [], // أَن
      [], // نَفعَلَ
      [], // فى
      [], // أَموٰلِنا
      [], // ما
      [], // نَشـٰؤُا۟
      [], // إِنَّكَ
      [], // لَأَنتَ
      [], // الحَليمُ
      [] // الرَّشيدُ
    ],
    [ // آية 88
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَرَءَيتُم
      [], // إِن
      [], // كُنتُ
      [], // عَلىٰ
      ["بيّنة : هداية و بصيرة"], // بَيِّنَةٍ
      [], // مِن
      [], // رَبّى
      [], // وَرَزَقَنى
      [], // مِنهُ
      [], // رِزقًا
      [], // حَسَنًا
      [], // وَما
      [], // أُريدُ
      [], // أَن
      [], // أُخالِفَكُم
      [], // إِلىٰ
      [], // ما
      [], // أَنهىٰكُم
      [], // عَنهُ
      [], // إِن
      [], // أُريدُ
      [], // إِلَّا
      [], // الإِصلـٰحَ
      [], // مَا
      [], // استَطَعتُ
      [], // وَما
      [], // تَوفيقى
      [], // إِلّا
      [], // بِاللَّهِ
      [], // عَلَيهِ
      [], // تَوَكَّلتُ
      [], // وَإِلَيهِ
      [] // أُنيبُ
    ],
    [ // آية 89
      [], // وَيـٰقَومِ
      [], // لا
      [], // يَجرِمَنَّكُم
      [], // شِقاقى
      [], // أَن
      [], // يُصيبَكُم
      [], // مِثلُ
      [], // ما
      [], // أَصابَ
      [], // قَومَ
      [], // نوحٍ
      [], // أَو
      [], // قَومَ
      [], // هودٍ
      [], // أَو
      [], // قَومَ
      [], // صـٰلِحٍ
      [], // وَما
      [], // قَومُ
      [], // لوطٍ
      [], // مِنكُم
      [] // بِبَعيدٍ
    ],
    [ // آية 90
      [], // وَاستَغفِروا
      [], // رَبَّكُم
      [], // ثُمَّ
      [], // توبوا
      [], // إِلَيهِ
      [], // إِنَّ
      [], // رَبّى
      [], // رَحيمٌ
      [] // وَدودٌ
    ],
    [ // آية 91
      [], // قالوا
      [], // يـٰشُعَيبُ
      [], // ما
      [], // نَفقَهُ
      [], // كَثيرًا
      [], // مِمّا
      [], // تَقولُ
      [], // وَإِنّا
      [], // لَنَرىٰكَ
      [], // فينا
      [], // ضَعيفًا
      [], // وَلَولا
      [], // رَهطُكَ
      [], // لَرَجَمنـٰكَ
      [], // وَما
      [], // أَنتَ
      [], // عَلَينا
      [] // بِعَزيزٍ
    ],
    [ // آية 92
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَرَهطى
      [], // أَعَزُّ
      [], // عَلَيكُم
      [], // مِنَ
      [], // اللَّهِ
      [], // وَاتَّخَذتُموهُ
      ["وراءكم ظهريّا : منبوذا وراء ظهوركم منسيّا"], // وَراءَكُم
      ["وراءكم ظهريّا : منبوذا وراء ظهوركم منسيّا"], // ظِهرِيًّا
      [], // إِنَّ
      [], // رَبّى
      [], // بِما
      [], // تَعمَلونَ
      [] // مُحيطٌ
    ],
    [ // آية 93
      [], // وَيـٰقَومِ
      [], // اعمَلوا
      [], // عَلىٰ
      ["مكانتكم : غاية تمكّنكم من أمركم"], // مَكانَتِكُم
      [], // إِنّى
      [], // عـٰمِلٌ
      [], // سَوفَ
      [], // تَعلَمونَ
      [], // مَن
      [], // يَأتيهِ
      [], // عَذابٌ
      [], // يُخزيهِ
      [], // وَمَن
      [], // هُوَ
      [], // كـٰذِبٌ
      [], // وَارتَقِبوا
      [], // إِنّى
      [], // مَعَكُم
      [] // رَقيبٌ
    ],
    [ // آية 94
      [], // وَلَمّا
      [], // جاءَ
      [], // أَمرُنا
      [], // نَجَّينا
      [], // شُعَيبًا
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // بِرَحمَةٍ
      [], // مِنّا
      [], // وَأَخَذَتِ
      [], // الَّذينَ
      [], // ظَلَمُوا
      ["الصّيحة : صوت من السّماء مُهلكٌ مُرجفٌ"], // الصَّيحَةُ
      [], // فَأَصبَحوا
      [], // فى
      [], // دِيـٰرِهِم
      [] // جـٰثِمينَ
    ],
    [ // آية 95
      [], // كَأَن
      ["لم يغنوا فيها : لن يُقيموا فيها طويلا في رغد"], // لَم
      ["لم يغنوا فيها : لن يُقيموا فيها طويلا في رغد"], // يَغنَوا
      ["لم يغنوا فيها : لن يُقيموا فيها طويلا في رغد"], // فيها
      [], // أَلا
      [], // بُعدًا
      [], // لِمَديَنَ
      [], // كَما
      ["بَعدت ثمود : هلكت من قبل"], // بَعِدَت
      ["بَعدت ثمود : هلكت من قبل"] // ثَمودُ
    ],
    [ // آية 96
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // وَسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 97
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      [], // فَاتَّبَعوا
      [], // أَمرَ
      [], // فِرعَونَ
      [], // وَما
      [], // أَمرُ
      [], // فِرعَونَ
      [] // بِرَشيدٍ
    ],
    [ // آية 98
      ["يقدُم قومه : يتقدّمهم كما يتقدّم الوارد"], // يَقدُمُ
      ["يقدُم قومه : يتقدّمهم كما يتقدّم الوارد"], // قَومَهُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      ["فأوردهم النّار : أدخلهم فيها بكفره و كفرهم"], // فَأَورَدَهُمُ
      ["فأوردهم النّار : أدخلهم فيها بكفره و كفرهم"], // النّارَ
      [], // وَبِئسَ
      [], // الوِردُ
      [] // المَورودُ
    ],
    [ // آية 99
      [], // وَأُتبِعوا
      [], // فى
      [], // هـٰذِهِ
      [], // لَعنَةً
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // بِئسَ
      [], // الرِّفدُ
      [] // المَرفودُ
    ],
    [ // آية 100
      [], // ذٰلِكَ
      [], // مِن
      [], // أَنباءِ
      [], // القُرىٰ
      [], // نَقُصُّهُ
      [], // عَلَيكَ
      [], // مِنها
      [], // قائِمٌ
      [] // وَحَصيدٌ
    ],
    [ // آية 101
      [], // وَما
      [], // ظَلَمنـٰهُم
      [], // وَلـٰكِن
      [], // ظَلَموا
      [], // أَنفُسَهُم
      [], // فَما
      [], // أَغنَت
      [], // عَنهُم
      [], // ءالِهَتُهُمُ
      [], // الَّتى
      [], // يَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // لَمّا
      [], // جاءَ
      [], // أَمرُ
      [], // رَبِّكَ
      [], // وَما
      [], // زادوهُم
      ["غير تتبيب : غير تخسير و إهلاك"], // غَيرَ
      ["غير تتبيب : غير تخسير و إهلاك"] // تَتبيبٍ
    ],
    [ // آية 102
      [], // وَكَذٰلِكَ
      [], // أَخذُ
      [], // رَبِّكَ
      [], // إِذا
      [], // أَخَذَ
      [], // القُرىٰ
      [], // وَهِىَ
      [], // ظـٰلِمَةٌ
      [], // إِنَّ
      [], // أَخذَهُ
      [], // أَليمٌ
      [] // شَديدٌ
    ],
    [ // آية 103
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِمَن
      [], // خافَ
      [], // عَذابَ
      [], // الـٔاخِرَةِ
      [], // ذٰلِكَ
      [], // يَومٌ
      [], // مَجموعٌ
      [], // لَهُ
      [], // النّاسُ
      [], // وَذٰلِكَ
      [], // يَومٌ
      [] // مَشهودٌ
    ],
    [ // آية 104
      [], // وَما
      [], // نُؤَخِّرُهُ
      [], // إِلّا
      [], // لِأَجَلٍ
      [] // مَعدودٍ
    ],
    [ // آية 105
      [], // يَومَ
      [], // يَأتِ
      [], // لا
      [], // تَكَلَّمُ
      [], // نَفسٌ
      [], // إِلّا
      [], // بِإِذنِهِ
      [], // فَمِنهُم
      [], // شَقِىٌّ
      [] // وَسَعيدٌ
    ],
    [ // آية 106
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // شَقوا
      [], // فَفِى
      [], // النّارِ
      [], // لَهُم
      [], // فيها
      ["زفير : إخراج شديد للنّفس من الصّدر"], // زَفيرٌ
      [] // وَشَهيقٌ
    ],
    [ // آية 107
      [], // خـٰلِدينَ
      [], // فيها
      [], // ما
      [], // دامَتِ
      [], // السَّمـٰوٰتُ
      [], // وَالأَرضُ
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // رَبُّكَ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // فَعّالٌ
      [], // لِما
      [] // يُريدُ
    ],
    [ // آية 108
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // سُعِدوا
      [], // فَفِى
      [], // الجَنَّةِ
      [], // خـٰلِدينَ
      [], // فيها
      [], // ما
      [], // دامَتِ
      [], // السَّمـٰوٰتُ
      [], // وَالأَرضُ
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // رَبُّكَ
      [], // عَطاءً
      ["غير مجذوذ : غير مقطوع عنهم"], // غَيرَ
      ["غير مجذوذ : غير مقطوع عنهم"] // مَجذوذٍ
    ],
    [ // آية 109
      [], // فَلا
      [], // تَكُ
      [], // فى
      [], // مِريَةٍ
      [], // مِمّا
      [], // يَعبُدُ
      [], // هـٰؤُلاءِ
      [], // ما
      [], // يَعبُدونَ
      [], // إِلّا
      [], // كَما
      [], // يَعبُدُ
      [], // ءاباؤُهُم
      [], // مِن
      [], // قَبلُ
      [], // وَإِنّا
      [], // لَمُوَفّوهُم
      [], // نَصيبَهُم
      [], // غَيرَ
      [] // مَنقوصٍ
    ],
    [ // آية 110
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // فَاختُلِفَ
      [], // فيهِ
      [], // وَلَولا
      [], // كَلِمَةٌ
      [], // سَبَقَت
      [], // مِن
      [], // رَبِّكَ
      [], // لَقُضِىَ
      [], // بَينَهُم
      [], // وَإِنَّهُم
      [], // لَفى
      [], // شَكٍّ
      [], // مِنهُ
      ["مُريب : موقع في الرّيبة و قلق النّفس"] // مُريبٍ
    ],
    [ // آية 111
      [], // وَإِنَّ
      [], // كُلًّا
      [], // لَمّا
      [], // لَيُوَفِّيَنَّهُم
      [], // رَبُّكَ
      [], // أَعمـٰلَهُم
      [], // إِنَّهُ
      [], // بِما
      [], // يَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 112
      [], // فَاستَقِم
      [], // كَما
      [], // أُمِرتَ
      [], // وَمَن
      [], // تابَ
      [], // مَعَكَ
      [], // وَلا
      [], // تَطغَوا
      [], // إِنَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 113
      [], // وَلا
      [], // تَركَنوا
      [], // إِلَى
      [], // الَّذينَ
      [], // ظَلَموا
      [], // فَتَمَسَّكُمُ
      [], // النّارُ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // أَولِياءَ
      [], // ثُمَّ
      [], // لا
      [] // تُنصَرونَ
    ],
    [ // آية 114
      [], // وَأَقِمِ
      [], // الصَّلوٰةَ
      [], // طَرَفَىِ
      [], // النَّهارِ
      [], // وَزُلَفًا
      [], // مِنَ
      [], // الَّيلِ
      [], // إِنَّ
      [], // الحَسَنـٰتِ
      [], // يُذهِبنَ
      [], // السَّيِّـٔاتِ
      [], // ذٰلِكَ
      [], // ذِكرىٰ
      [] // لِلذّٰكِرينَ
    ],
    [ // آية 115
      [], // وَاصبِر
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُضيعُ
      [], // أَجرَ
      [] // المُحسِنينَ
    ],
    [ // آية 116
      [], // فَلَولا
      [], // كانَ
      [], // مِنَ
      ["القرون : الأمم"], // القُرونِ
      [], // مِن
      [], // قَبلِكُم
      ["أولوا بقية : أصحاب فضل و خير"], // أُولوا
      ["أولوا بقية : أصحاب فضل و خير"], // بَقِيَّةٍ
      [], // يَنهَونَ
      [], // عَنِ
      [], // الفَسادِ
      [], // فِى
      [], // الأَرضِ
      [], // إِلّا
      [], // قَليلًا
      [], // مِمَّن
      [], // أَنجَينا
      [], // مِنهُم
      [], // وَاتَّبَعَ
      [], // الَّذينَ
      [], // ظَلَموا
      ["ما أُترفوا فيه : ما أنعموا فيه من الخصب و السّعة"], // ما
      ["ما أُترفوا فيه : ما أنعموا فيه من الخصب و السّعة"], // أُترِفوا
      ["ما أُترفوا فيه : ما أنعموا فيه من الخصب و السّعة"], // فيهِ
      [], // وَكانوا
      [] // مُجرِمينَ
    ],
    [ // آية 117
      [], // وَما
      [], // كانَ
      [], // رَبُّكَ
      [], // لِيُهلِكَ
      [], // القُرىٰ
      [], // بِظُلمٍ
      [], // وَأَهلُها
      [] // مُصلِحونَ
    ],
    [ // آية 118
      [], // وَلَو
      [], // شاءَ
      [], // رَبُّكَ
      [], // لَجَعَلَ
      [], // النّاسَ
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // وَلا
      [], // يَزالونَ
      [] // مُختَلِفينَ
    ],
    [ // آية 119
      [], // إِلّا
      [], // مَن
      [], // رَحِمَ
      [], // رَبُّكَ
      [], // وَلِذٰلِكَ
      [], // خَلَقَهُم
      [], // وَتَمَّت
      [], // كَلِمَةُ
      [], // رَبِّكَ
      [], // لَأَملَأَنَّ
      [], // جَهَنَّمَ
      [], // مِنَ
      [], // الجِنَّةِ
      [], // وَالنّاسِ
      [] // أَجمَعينَ
    ],
    [ // آية 120
      [], // وَكُلًّا
      [], // نَقُصُّ
      [], // عَلَيكَ
      [], // مِن
      [], // أَنباءِ
      [], // الرُّسُلِ
      [], // ما
      [], // نُثَبِّتُ
      [], // بِهِ
      [], // فُؤادَكَ
      [], // وَجاءَكَ
      [], // فى
      [], // هـٰذِهِ
      [], // الحَقُّ
      [], // وَمَوعِظَةٌ
      [], // وَذِكرىٰ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 121
      [], // وَقُل
      [], // لِلَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // اعمَلوا
      [], // عَلىٰ
      ["مكانتكم : غاية تمكّنكم من أمركم"], // مَكانَتِكُم
      [], // إِنّا
      [] // عـٰمِلونَ
    ],
    [ // آية 122
      [], // وَانتَظِروا
      [], // إِنّا
      [] // مُنتَظِرونَ
    ],
    [ // آية 123
      [], // وَلِلَّهِ
      [], // غَيبُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَإِلَيهِ
      [], // يُرجَعُ
      [], // الأَمرُ
      [], // كُلُّهُ
      [], // فَاعبُدهُ
      [], // وَتَوَكَّل
      [], // عَلَيهِ
      [], // وَما
      [], // رَبُّكَ
      [], // بِغـٰفِلٍ
      [], // عَمّا
      [] // تَعمَلونَ
    ]
];

export default meanings;