const meanings = [
[ // آية 1
      [], // إِذا
      ["جاء نصر الله : عَوْنـُهُ لك على الأعداء"], // جاءَ
      ["جاء نصر الله : عَوْنـُهُ لك على الأعداء"], // نَصرُ
      ["جاء نصر الله : عَوْنـُهُ لك على الأعداء"], // اللَّهِ
      [] // وَالفَتحُ
    ],
    [ // آية 2
      [], // وَرَأَيتَ
      [], // النّاسَ
      [], // يَدخُلونَ
      [], // فى
      [], // دينِ
      [], // اللَّهِ
      ["أفواجا : جَماعاتٍ جماعات كثيرة"] // أَفواجًا
    ],
    [ // آية 3
      ["فسبّح بحمد ربّك : فـنـَـزّهْهُ تعالى ، حامِدًا له"], // فَسَبِّح
      ["فسبّح بحمد ربّك : فـنـَـزّهْهُ تعالى ، حامِدًا له"], // بِحَمدِ
      ["فسبّح بحمد ربّك : فـنـَـزّهْهُ تعالى ، حامِدًا له"], // رَبِّكَ
      [], // وَاستَغفِرهُ
      [], // إِنَّهُ
      [], // كانَ
      [] // تَوّابًا
    ]
];

export default meanings;