const meanings = [
[ // آية 1
      [], // تَبَّت
      [], // يَدا
      [], // أَبى
      [], // لَهَبٍ
      [] // وَتَبَّ
    ],
    [ // آية 2
      ["ما أغنى عنه : ما دَفَـعَ التـّـبَابَ عنه"], // ما
      ["ما أغنى عنه : ما دَفَـعَ التـّـبَابَ عنه"], // أَغنىٰ
      ["ما أغنى عنه : ما دَفَـعَ التـّـبَابَ عنه"], // عَنهُ
      [], // مالُهُ
      [], // وَما
      [] // كَسَبَ
    ],
    [ // آية 3
      ["سَيَصلى نارًا : سَـيَـدْخلـها أوْ يُقاسي حَرّها"], // سَيَصلىٰ
      ["سَيَصلى نارًا : سَـيَـدْخلـها أوْ يُقاسي حَرّها"], // نارًا
      [], // ذاتَ
      [] // لَهَبٍ
    ],
    [ // آية 4
      [], // وَامرَأَتُهُ
      [], // حَمّالَةَ
      [] // الحَطَبِ
    ],
    [ // آية 5
      [], // فى
      [], // جيدِها
      [], // حَبلٌ
      ["مِنْ مَسَدٍ : مـمّـا يُـفـْـتـَـلُ قـَويّـا مِنَ الحِبَال"], // مِن
      ["مِنْ مَسَدٍ : مـمّـا يُـفـْـتـَـلُ قـَويّـا مِنَ الحِبَال"] // مَسَدٍ
    ]
];

export default meanings;