const meanings = [
[ // آية 1
      [], // قُل
      [], // هُوَ
      [], // اللَّهُ
      [] // أَحَدٌ
    ],
    [ // آية 2
      ["الله الصّمد : هو وَحْدَه المقصود في الحَوائج"], // اللَّهُ
      ["الله الصّمد : هو وَحْدَه المقصود في الحَوائج"] // الصَّمَدُ
    ],
    [ // آية 3
      [], // لَم
      [], // يَلِد
      [], // وَلَم
      [] // يولَد
    ],
    [ // آية 4
      [], // وَلَم
      [], // يَكُن
      [], // لَهُ
      [], // كُفُوًا
      [] // أَحَدٌ
    ]
];

export default meanings;