const meanings = [
  [ // سورة 113: الفلق
[ // آية 1
      [], // قُل
      ["أعوذ : أعْتـَصِمُ و أسْتجير"], // أَعوذُ
      ["بربّ الفلق : بربّ الصّـبْح . أو الخَـلـْـق كلـّهمْ"], // بِرَبِّ
      ["بربّ الفلق : بربّ الصّـبْح . أو الخَـلـْـق كلـّهمْ"] // الفَلَقِ
    ],
    [ // آية 2
      [], // مِن
      [], // شَرِّ
      [], // ما
      [] // خَلَقَ
    ],
    [ // آية 3
      [], // وَمِن
      ["شرّ غاسق : شرّ الليل"], // شَرِّ
      ["شرّ غاسق : شرّ الليل"], // غاسِقٍ
      [], // إِذا
      ["وَقب : دَخَل ظلامه في كلّ شيء"] // وَقَبَ
    ],
    [ // آية 4
      [], // وَمِن
      [], // شَرِّ
      [], // النَّفّـٰثـٰتِ
      [], // فِى
      [] // العُقَدِ
    ],
    [ // آية 5
      [], // وَمِن
      [], // شَرِّ
      [], // حاسِدٍ
      [], // إِذا
      [] // حَسَدَ
    ]
  ]
];

export default meanings;