const meanings = [
  [ // سورة 114: الناس
[ // آية 1
      [], // قُل
      ["أعوذ : أعْـتصِـمُ و أستجير"], // أَعوذُ
      [], // بِرَبِّ
      [] // النّاسِ
    ],
    [ // آية 2
      [], // مَلِكِ
      [] // النّاسِ
    ],
    [ // آية 3
      [], // إِلـٰهِ
      [] // النّاسِ
    ],
    [ // آية 4
      [], // مِن
      [], // شَرِّ
      ["الوَسواس : المُوَسْوس جـِنـِّـيّـا أو إنـْـسِـيّـا"], // الوَسواسِ
      ["الخنّاس : المُـتـَوَاري المُـخْـتـَفي"] // الخَنّاسِ
    ],
    [ // آية 5
      [], // الَّذى
      [], // يُوَسوِسُ
      [], // فى
      [], // صُدورِ
      [] // النّاسِ
    ],
    [ // آية 6
      [], // مِنَ
      [], // الجِنَّةِ
      [] // وَالنّاسِ
    ]
  ]
];

export default meanings;