const meanings = [
[ // آية 1
      [], // الر
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [] // المُبينِ
    ],
    [ // آية 2
      [], // إِنّا
      [], // أَنزَلنـٰهُ
      [], // قُرءٰنًا
      [], // عَرَبِيًّا
      [], // لَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 3
      [], // نَحنُ
      ["نقُصّ عليك : نُحدّثك أو نبيّن لك يا محمد"], // نَقُصُّ
      ["نقُصّ عليك : نُحدّثك أو نبيّن لك يا محمد"], // عَلَيكَ
      [], // أَحسَنَ
      [], // القَصَصِ
      [], // بِما
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // هـٰذَا
      [], // القُرءانَ
      [], // وَإِن
      [], // كُنتَ
      [], // مِن
      [], // قَبلِهِ
      [], // لَمِنَ
      [] // الغـٰفِلينَ
    ],
    [ // آية 4
      [], // إِذ
      [], // قالَ
      [], // يوسُفُ
      [], // لِأَبيهِ
      [], // يـٰأَبَتِ
      [], // إِنّى
      [], // رَأَيتُ
      [], // أَحَدَ
      [], // عَشَرَ
      [], // كَوكَبًا
      [], // وَالشَّمسَ
      [], // وَالقَمَرَ
      [], // رَأَيتُهُم
      [], // لى
      [] // سـٰجِدينَ
    ],
    [ // آية 5
      [], // قالَ
      [], // يـٰبُنَىَّ
      [], // لا
      [], // تَقصُص
      [], // رُءياكَ
      [], // عَلىٰ
      [], // إِخوَتِكَ
      [], // فَيَكيدوا
      [], // لَكَ
      [], // كَيدًا
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      [], // لِلإِنسـٰنِ
      [], // عَدُوٌّ
      [] // مُبينٌ
    ],
    [ // آية 6
      [], // وَكَذٰلِكَ
      ["يجتبيك : يصطفيك بأمور عظام"], // يَجتَبيكَ
      [], // رَبُّكَ
      [], // وَيُعَلِّمُكَ
      [], // مِن
      ["تأويل الأحاديث : تعبير الرؤيا و تفسيرها"], // تَأويلِ
      ["تأويل الأحاديث : تعبير الرؤيا و تفسيرها"], // الأَحاديثِ
      [], // وَيُتِمُّ
      [], // نِعمَتَهُ
      [], // عَلَيكَ
      [], // وَعَلىٰ
      [], // ءالِ
      [], // يَعقوبَ
      [], // كَما
      [], // أَتَمَّها
      [], // عَلىٰ
      [], // أَبَوَيكَ
      [], // مِن
      [], // قَبلُ
      [], // إِبرٰهيمَ
      [], // وَإِسحـٰقَ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 7
      [], // لَقَد
      [], // كانَ
      [], // فى
      [], // يوسُفَ
      [], // وَإِخوَتِهِ
      [], // ءايـٰتٌ
      [] // لِلسّائِلينَ
    ],
    [ // آية 8
      [], // إِذ
      [], // قالوا
      [], // لَيوسُفُ
      [], // وَأَخوهُ
      [], // أَحَبُّ
      [], // إِلىٰ
      [], // أَبينا
      [], // مِنّا
      [], // وَنَحنُ
      [], // عُصبَةٌ
      [], // إِنَّ
      [], // أَبانا
      [], // لَفى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 9
      [], // اقتُلوا
      [], // يوسُفَ
      [], // أَوِ
      ["اطرحوه أرضا : ألقوه في أرض بعيدة عن أبيه"], // اطرَحوهُ
      ["اطرحوه أرضا : ألقوه في أرض بعيدة عن أبيه"], // أَرضًا
      ["يخلُ لكم وجه أبيكم : يخلص لكم حبّه و إقباله عليكم"], // يَخلُ
      ["يخلُ لكم وجه أبيكم : يخلص لكم حبّه و إقباله عليكم"], // لَكُم
      ["يخلُ لكم وجه أبيكم : يخلص لكم حبّه و إقباله عليكم"], // وَجهُ
      ["يخلُ لكم وجه أبيكم : يخلص لكم حبّه و إقباله عليكم"], // أَبيكُم
      [], // وَتَكونوا
      [], // مِن
      [], // بَعدِهِ
      [], // قَومًا
      [] // صـٰلِحينَ
    ],
    [ // آية 10
      [], // قالَ
      [], // قائِلٌ
      [], // مِنهُم
      [], // لا
      [], // تَقتُلوا
      [], // يوسُفَ
      [], // وَأَلقوهُ
      [], // فى
      [], // غَيـٰبَتِ
      [], // الجُبِّ
      [], // يَلتَقِطهُ
      [], // بَعضُ
      ["السّيّارة : المسافرين"], // السَّيّارَةِ
      [], // إِن
      [], // كُنتُم
      [] // فـٰعِلينَ
    ],
    [ // آية 11
      [], // قالوا
      [], // يـٰأَبانا
      [], // ما
      [], // لَكَ
      [], // لا
      [], // تَأمَ۫نّا
      [], // عَلىٰ
      [], // يوسُفَ
      [], // وَإِنّا
      [], // لَهُ
      [] // لَنـٰصِحونَ
    ],
    [ // آية 12
      [], // أَرسِلهُ
      [], // مَعَنا
      [], // غَدًا
      ["يرتع : يتّسع في أكل ما لذ و طاب"], // يَرتَع
      [], // وَيَلعَب
      [], // وَإِنّا
      [], // لَهُ
      [] // لَحـٰفِظونَ
    ],
    [ // آية 13
      [], // قالَ
      [], // إِنّى
      [], // لَيَحزُنُنى
      [], // أَن
      [], // تَذهَبوا
      [], // بِهِ
      [], // وَأَخافُ
      [], // أَن
      [], // يَأكُلَهُ
      [], // الذِّئبُ
      [], // وَأَنتُم
      [], // عَنهُ
      [] // غـٰفِلونَ
    ],
    [ // آية 14
      [], // قالوا
      [], // لَئِن
      [], // أَكَلَهُ
      [], // الذِّئبُ
      [], // وَنَحنُ
      [], // عُصبَةٌ
      [], // إِنّا
      [], // إِذًا
      [] // لَخـٰسِرونَ
    ],
    [ // آية 15
      [], // فَلَمّا
      [], // ذَهَبوا
      [], // بِهِ
      [], // وَأَجمَعوا
      [], // أَن
      [], // يَجعَلوهُ
      [], // فى
      [], // غَيـٰبَتِ
      [], // الجُبِّ
      [], // وَأَوحَينا
      [], // إِلَيهِ
      [], // لَتُنَبِّئَنَّهُم
      [], // بِأَمرِهِم
      [], // هـٰذا
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 16
      [], // وَجاءو
      [], // أَباهُم
      [], // عِشاءً
      [] // يَبكونَ
    ],
    [ // آية 17
      [], // قالوا
      [], // يـٰأَبانا
      [], // إِنّا
      [], // ذَهَبنا
      ["نستبق : ننتضل في الرّمي بالسّهام"], // نَستَبِقُ
      [], // وَتَرَكنا
      [], // يوسُفَ
      [], // عِندَ
      [], // مَتـٰعِنا
      [], // فَأَكَلَهُ
      [], // الذِّئبُ
      [], // وَما
      [], // أَنتَ
      [], // بِمُؤمِنٍ
      [], // لَنا
      [], // وَلَو
      [], // كُنّا
      [] // صـٰدِقينَ
    ],
    [ // آية 18
      [], // وَجاءو
      [], // عَلىٰ
      [], // قَميصِهِ
      [], // بِدَمٍ
      [], // كَذِبٍ
      [], // قالَ
      [], // بَل
      [], // سَوَّلَت
      [], // لَكُم
      [], // أَنفُسُكُم
      [], // أَمرًا
      ["فصبر جميل : لا شكوى فيه لغير الله تعالى"], // فَصَبرٌ
      ["فصبر جميل : لا شكوى فيه لغير الله تعالى"], // جَميلٌ
      [], // وَاللَّهُ
      [], // المُستَعانُ
      [], // عَلىٰ
      [], // ما
      [] // تَصِفونَ
    ],
    [ // آية 19
      [], // وَجاءَت
      ["سيّارة : رُفقة مُسافرون من مدين لمصر"], // سَيّارَةٌ
      [], // فَأَرسَلوا
      ["واردهم : من يتقدّم الرّفقة ليستقي لهم"], // وارِدَهُم
      ["فأدلى دلوه : فأرسلها في الجبّ ليملأها ماءً"], // فَأَدلىٰ
      ["فأدلى دلوه : فأرسلها في الجبّ ليملأها ماءً"], // دَلوَهُ
      [], // قالَ
      [], // يـٰبُشرىٰ
      [], // هـٰذا
      [], // غُلـٰمٌ
      [], // وَأَسَرّوهُ
      [], // بِضـٰعَةً
      [], // وَاللَّهُ
      [], // عَليمٌ
      [], // بِما
      [] // يَعمَلونَ
    ],
    [ // آية 20
      [], // وَشَرَوهُ
      ["بثمن بخس : ناقص عن القيمة نُقصانا ظاهرا"], // بِثَمَنٍ
      ["بثمن بخس : ناقص عن القيمة نُقصانا ظاهرا"], // بَخسٍ
      [], // دَرٰهِمَ
      [], // مَعدودَةٍ
      [], // وَكانوا
      [], // فيهِ
      [], // مِنَ
      [] // الزّٰهِدينَ
    ],
    [ // آية 21
      [], // وَقالَ
      [], // الَّذِى
      [], // اشتَرىٰهُ
      [], // مِن
      [], // مِصرَ
      [], // لِامرَأَتِهِ
      [], // أَكرِمى
      [], // مَثوىٰهُ
      [], // عَسىٰ
      [], // أَن
      [], // يَنفَعَنا
      [], // أَو
      [], // نَتَّخِذَهُ
      [], // وَلَدًا
      [], // وَكَذٰلِكَ
      [], // مَكَّنّا
      [], // لِيوسُفَ
      [], // فِى
      [], // الأَرضِ
      [], // وَلِنُعَلِّمَهُ
      [], // مِن
      [], // تَأويلِ
      [], // الأَحاديثِ
      [], // وَاللَّهُ
      ["غالب على أمره : لا يقهره شيء ، و لا يدفعه عنه أحد"], // غالِبٌ
      ["غالب على أمره : لا يقهره شيء ، و لا يدفعه عنه أحد"], // عَلىٰ
      ["غالب على أمره : لا يقهره شيء ، و لا يدفعه عنه أحد"], // أَمرِهِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 22
      [], // وَلَمّا
      ["بلغ أشدّه : مُنتهى شدّة جسمه و قوّته"], // بَلَغَ
      ["بلغ أشدّه : مُنتهى شدّة جسمه و قوّته"], // أَشُدَّهُ
      [], // ءاتَينـٰهُ
      [], // حُكمًا
      [], // وَعِلمًا
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 23
      [], // وَرٰوَدَتهُ
      [], // الَّتى
      [], // هُوَ
      [], // فى
      [], // بَيتِها
      [], // عَن
      [], // نَفسِهِ
      [], // وَغَلَّقَتِ
      [], // الأَبوٰبَ
      [], // وَقالَت
      ["هيت لك : أقبِل ، أسرع – إرادتي لك"], // هَيتَ
      ["هيت لك : أقبِل ، أسرع – إرادتي لك"], // لَكَ
      [], // قالَ
      [], // مَعاذَ
      [], // اللَّهِ
      [], // إِنَّهُ
      [], // رَبّى
      [], // أَحسَنَ
      [], // مَثواىَ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 24
      [], // وَلَقَد
      [], // هَمَّت
      [], // بِهِ
      [], // وَهَمَّ
      [], // بِها
      [], // لَولا
      [], // أَن
      [], // رَءا
      [], // بُرهـٰنَ
      [], // رَبِّهِ
      [], // كَذٰلِكَ
      [], // لِنَصرِفَ
      [], // عَنهُ
      [], // السّوءَ
      [], // وَالفَحشاءَ
      [], // إِنَّهُ
      [], // مِن
      [], // عِبادِنَا
      ["المُخلصين : المُختارين لطاعته أو لرسالته"] // المُخلَصينَ
    ],
    [ // آية 25
      [], // وَاستَبَقَا
      [], // البابَ
      [], // وَقَدَّت
      [], // قَميصَهُ
      [], // مِن
      [], // دُبُرٍ
      [], // وَأَلفَيا
      [], // سَيِّدَها
      [], // لَدَا
      [], // البابِ
      [], // قالَت
      [], // ما
      [], // جَزاءُ
      [], // مَن
      [], // أَرادَ
      [], // بِأَهلِكَ
      [], // سوءًا
      [], // إِلّا
      [], // أَن
      [], // يُسجَنَ
      [], // أَو
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 26
      [], // قالَ
      [], // هِىَ
      [], // رٰوَدَتنى
      [], // عَن
      [], // نَفسى
      [], // وَشَهِدَ
      [], // شاهِدٌ
      [], // مِن
      [], // أَهلِها
      [], // إِن
      [], // كانَ
      [], // قَميصُهُ
      [], // قُدَّ
      [], // مِن
      [], // قُبُلٍ
      [], // فَصَدَقَت
      [], // وَهُوَ
      [], // مِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 27
      [], // وَإِن
      [], // كانَ
      [], // قَميصُهُ
      [], // قُدَّ
      [], // مِن
      [], // دُبُرٍ
      [], // فَكَذَبَت
      [], // وَهُوَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 28
      [], // فَلَمّا
      [], // رَءا
      [], // قَميصَهُ
      [], // قُدَّ
      [], // مِن
      [], // دُبُرٍ
      [], // قالَ
      [], // إِنَّهُ
      [], // مِن
      [], // كَيدِكُنَّ
      [], // إِنَّ
      [], // كَيدَكُنَّ
      [] // عَظيمٌ
    ],
    [ // آية 29
      [], // يوسُفُ
      [], // أَعرِض
      [], // عَن
      [], // هـٰذا
      [], // وَاستَغفِرى
      [], // لِذَنبِكِ
      [], // إِنَّكِ
      [], // كُنتِ
      [], // مِنَ
      [] // الخاطِـٔينَ
    ],
    [ // آية 30
      [], // وَقالَ
      [], // نِسوَةٌ
      [], // فِى
      [], // المَدينَةِ
      [], // امرَأَتُ
      [], // العَزيزِ
      [], // تُرٰوِدُ
      [], // فَتىٰها
      [], // عَن
      [], // نَفسِهِ
      [], // قَد
      [], // شَغَفَها
      [], // حُبًّا
      [], // إِنّا
      [], // لَنَرىٰها
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 31
      [], // فَلَمّا
      [], // سَمِعَت
      [], // بِمَكرِهِنَّ
      [], // أَرسَلَت
      [], // إِلَيهِنَّ
      [], // وَأَعتَدَت
      [], // لَهُنَّ
      [], // مُتَّكَـًٔا
      [], // وَءاتَت
      [], // كُلَّ
      [], // وٰحِدَةٍ
      [], // مِنهُنَّ
      [], // سِكّينًا
      [], // وَقالَتِ
      [], // اخرُج
      [], // عَلَيهِنَّ
      [], // فَلَمّا
      [], // رَأَينَهُ
      [], // أَكبَرنَهُ
      [], // وَقَطَّعنَ
      [], // أَيدِيَهُنَّ
      [], // وَقُلنَ
      [], // حـٰشَ
      [], // لِلَّهِ
      [], // ما
      [], // هـٰذا
      [], // بَشَرًا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // مَلَكٌ
      [] // كَريمٌ
    ],
    [ // آية 32
      [], // قالَت
      [], // فَذٰلِكُنَّ
      [], // الَّذى
      [], // لُمتُنَّنى
      [], // فيهِ
      [], // وَلَقَد
      [], // رٰوَدتُهُ
      [], // عَن
      [], // نَفسِهِ
      ["فاستعصم : فامتنع امتناعا شديدا و أبى"], // فَاستَعصَمَ
      [], // وَلَئِن
      [], // لَم
      [], // يَفعَل
      [], // ما
      [], // ءامُرُهُ
      [], // لَيُسجَنَنَّ
      [], // وَلَيَكونًا
      [], // مِنَ
      [] // الصّـٰغِرينَ
    ],
    [ // آية 33
      [], // قالَ
      [], // رَبِّ
      [], // السِّجنُ
      [], // أَحَبُّ
      [], // إِلَىَّ
      [], // مِمّا
      [], // يَدعونَنى
      [], // إِلَيهِ
      [], // وَإِلّا
      [], // تَصرِف
      [], // عَنّى
      [], // كَيدَهُنَّ
      [], // أَصبُ
      [], // إِلَيهِنَّ
      [], // وَأَكُن
      [], // مِنَ
      [] // الجـٰهِلينَ
    ],
    [ // آية 34
      [], // فَاستَجابَ
      [], // لَهُ
      [], // رَبُّهُ
      [], // فَصَرَفَ
      [], // عَنهُ
      [], // كَيدَهُنَّ
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 35
      [], // ثُمَّ
      [], // بَدا
      [], // لَهُم
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // رَأَوُا
      [], // الـٔايـٰتِ
      [], // لَيَسجُنُنَّهُ
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 36
      [], // وَدَخَلَ
      [], // مَعَهُ
      [], // السِّجنَ
      [], // فَتَيانِ
      [], // قالَ
      [], // أَحَدُهُما
      [], // إِنّى
      [], // أَرىٰنى
      ["أعصر خمرا : عنبا يؤول لخمر أسقيه الملك"], // أَعصِرُ
      ["أعصر خمرا : عنبا يؤول لخمر أسقيه الملك"], // خَمرًا
      [], // وَقالَ
      [], // الـٔاخَرُ
      [], // إِنّى
      [], // أَرىٰنى
      [], // أَحمِلُ
      [], // فَوقَ
      [], // رَأسى
      [], // خُبزًا
      [], // تَأكُلُ
      [], // الطَّيرُ
      [], // مِنهُ
      [], // نَبِّئنا
      [], // بِتَأويلِهِ
      [], // إِنّا
      [], // نَرىٰكَ
      [], // مِنَ
      [] // المُحسِنينَ
    ],
    [ // آية 37
      [], // قالَ
      [], // لا
      [], // يَأتيكُما
      [], // طَعامٌ
      [], // تُرزَقانِهِ
      [], // إِلّا
      [], // نَبَّأتُكُما
      [], // بِتَأويلِهِ
      [], // قَبلَ
      [], // أَن
      [], // يَأتِيَكُما
      [], // ذٰلِكُما
      [], // مِمّا
      [], // عَلَّمَنى
      [], // رَبّى
      [], // إِنّى
      [], // تَرَكتُ
      [], // مِلَّةَ
      [], // قَومٍ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [], // هُم
      [] // كـٰفِرونَ
    ],
    [ // آية 38
      [], // وَاتَّبَعتُ
      [], // مِلَّةَ
      [], // ءاباءى
      [], // إِبرٰهيمَ
      [], // وَإِسحـٰقَ
      [], // وَيَعقوبَ
      [], // ما
      [], // كانَ
      [], // لَنا
      [], // أَن
      [], // نُشرِكَ
      [], // بِاللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // ذٰلِكَ
      [], // مِن
      [], // فَضلِ
      [], // اللَّهِ
      [], // عَلَينا
      [], // وَعَلَى
      [], // النّاسِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَشكُرونَ
    ],
    [ // آية 39
      [], // يـٰصـٰحِبَىِ
      [], // السِّجنِ
      [], // ءَأَربابٌ
      [], // مُتَفَرِّقونَ
      [], // خَيرٌ
      [], // أَمِ
      [], // اللَّهُ
      [], // الوٰحِدُ
      [] // القَهّارُ
    ],
    [ // آية 40
      [], // ما
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِهِ
      [], // إِلّا
      [], // أَسماءً
      [], // سَمَّيتُموها
      [], // أَنتُم
      [], // وَءاباؤُكُم
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // بِها
      [], // مِن
      [], // سُلطـٰنٍ
      [], // إِنِ
      [], // الحُكمُ
      [], // إِلّا
      [], // لِلَّهِ
      [], // أَمَرَ
      [], // أَلّا
      [], // تَعبُدوا
      [], // إِلّا
      [], // إِيّاهُ
      [], // ذٰلِكَ
      ["الدّين القيّم : المُستقيم . أو الثّابت بالبراهين"], // الدّينُ
      ["الدّين القيّم : المُستقيم . أو الثّابت بالبراهين"], // القَيِّمُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 41
      [], // يـٰصـٰحِبَىِ
      [], // السِّجنِ
      [], // أَمّا
      [], // أَحَدُكُما
      [], // فَيَسقى
      [], // رَبَّهُ
      [], // خَمرًا
      [], // وَأَمَّا
      [], // الـٔاخَرُ
      [], // فَيُصلَبُ
      [], // فَتَأكُلُ
      [], // الطَّيرُ
      [], // مِن
      [], // رَأسِهِ
      [], // قُضِىَ
      [], // الأَمرُ
      [], // الَّذى
      [], // فيهِ
      [] // تَستَفتِيانِ
    ],
    [ // آية 42
      [], // وَقالَ
      [], // لِلَّذى
      [], // ظَنَّ
      [], // أَنَّهُ
      [], // ناجٍ
      [], // مِنهُمَا
      [], // اذكُرنى
      [], // عِندَ
      [], // رَبِّكَ
      [], // فَأَنسىٰهُ
      [], // الشَّيطـٰنُ
      [], // ذِكرَ
      [], // رَبِّهِ
      [], // فَلَبِثَ
      [], // فِى
      [], // السِّجنِ
      [], // بِضعَ
      [] // سِنينَ
    ],
    [ // آية 43
      [], // وَقالَ
      [], // المَلِكُ
      [], // إِنّى
      [], // أَرىٰ
      [], // سَبعَ
      [], // بَقَرٰتٍ
      [], // سِمانٍ
      [], // يَأكُلُهُنَّ
      [], // سَبعٌ
      ["عِجاف : مهازيل جدّا"], // عِجافٌ
      [], // وَسَبعَ
      [], // سُنبُلـٰتٍ
      [], // خُضرٍ
      [], // وَأُخَرَ
      [], // يابِسـٰتٍ
      [], // يـٰأَيُّهَا
      [], // المَلَأُ
      [], // أَفتونى
      [], // فى
      [], // رُءيـٰىَ
      [], // إِن
      [], // كُنتُم
      [], // لِلرُّءيا
      ["تعبرون : تعلمون تأويلها و تفسيرها"] // تَعبُرونَ
    ],
    [ // آية 44
      [], // قالوا
      [], // أَضغـٰثُ
      [], // أَحلـٰمٍ
      [], // وَما
      [], // نَحنُ
      [], // بِتَأويلِ
      [], // الأَحلـٰمِ
      [] // بِعـٰلِمينَ
    ],
    [ // آية 45
      [], // وَقالَ
      [], // الَّذى
      [], // نَجا
      [], // مِنهُما
      [], // وَادَّكَرَ
      [], // بَعدَ
      [], // أُمَّةٍ
      [], // أَنا۠
      [], // أُنَبِّئُكُم
      [], // بِتَأويلِهِ
      [] // فَأَرسِلونِ
    ],
    [ // آية 46
      [], // يوسُفُ
      [], // أَيُّهَا
      [], // الصِّدّيقُ
      [], // أَفتِنا
      [], // فى
      [], // سَبعِ
      [], // بَقَرٰتٍ
      [], // سِمانٍ
      [], // يَأكُلُهُنَّ
      [], // سَبعٌ
      [], // عِجافٌ
      [], // وَسَبعِ
      [], // سُنبُلـٰتٍ
      [], // خُضرٍ
      [], // وَأُخَرَ
      [], // يابِسـٰتٍ
      [], // لَعَلّى
      [], // أَرجِعُ
      [], // إِلَى
      [], // النّاسِ
      [], // لَعَلَّهُم
      [] // يَعلَمونَ
    ],
    [ // آية 47
      [], // قالَ
      [], // تَزرَعونَ
      [], // سَبعَ
      [], // سِنينَ
      ["دأبا : دائبين كعادتكم في الزّراعة"], // دَأَبًا
      [], // فَما
      [], // حَصَدتُم
      [], // فَذَروهُ
      [], // فى
      [], // سُنبُلِهِ
      [], // إِلّا
      [], // قَليلًا
      [], // مِمّا
      [] // تَأكُلونَ
    ],
    [ // آية 48
      [], // ثُمَّ
      [], // يَأتى
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // سَبعٌ
      [], // شِدادٌ
      [], // يَأكُلنَ
      [], // ما
      [], // قَدَّمتُم
      [], // لَهُنَّ
      [], // إِلّا
      [], // قَليلًا
      [], // مِمّا
      ["تُحصنون : تخبؤونه من البذر للزّراعة"] // تُحصِنونَ
    ],
    [ // آية 49
      [], // ثُمَّ
      [], // يَأتى
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // عامٌ
      [], // فيهِ
      ["يُغاث النّاس : يُمطرون فتخصب أراضيهم"], // يُغاثُ
      ["يُغاث النّاس : يُمطرون فتخصب أراضيهم"], // النّاسُ
      [], // وَفيهِ
      ["يعصرون : ما شأنه أن يُعصر كالزّيتون"] // يَعصِرونَ
    ],
    [ // آية 50
      [], // وَقالَ
      [], // المَلِكُ
      [], // ائتونى
      [], // بِهِ
      [], // فَلَمّا
      [], // جاءَهُ
      [], // الرَّسولُ
      [], // قالَ
      [], // ارجِع
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // فَسـَٔلهُ
      [], // ما
      [], // بالُ
      [], // النِّسوَةِ
      [], // الّـٰتى
      [], // قَطَّعنَ
      [], // أَيدِيَهُنَّ
      [], // إِنَّ
      [], // رَبّى
      [], // بِكَيدِهِنَّ
      [] // عَليمٌ
    ],
    [ // آية 51
      [], // قالَ
      [], // ما
      [], // خَطبُكُنَّ
      [], // إِذ
      [], // رٰوَدتُنَّ
      [], // يوسُفَ
      [], // عَن
      [], // نَفسِهِ
      [], // قُلنَ
      [], // حـٰشَ
      [], // لِلَّهِ
      [], // ما
      [], // عَلِمنا
      [], // عَلَيهِ
      [], // مِن
      [], // سوءٍ
      [], // قالَتِ
      [], // امرَأَتُ
      [], // العَزيزِ
      [], // الـٔـٰنَ
      ["حصحص الحقّ : ظهر و انكشف بعد خفاء"], // حَصحَصَ
      ["حصحص الحقّ : ظهر و انكشف بعد خفاء"], // الحَقُّ
      [], // أَنا۠
      [], // رٰوَدتُهُ
      [], // عَن
      [], // نَفسِهِ
      [], // وَإِنَّهُ
      [], // لَمِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 52
      [], // ذٰلِكَ
      [], // لِيَعلَمَ
      [], // أَنّى
      [], // لَم
      [], // أَخُنهُ
      [], // بِالغَيبِ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدى
      [], // كَيدَ
      [] // الخائِنينَ
    ],
    [ // آية 53
      [], // وَما
      [], // أُبَرِّئُ
      [], // نَفسى
      [], // إِنَّ
      [], // النَّفسَ
      [], // لَأَمّارَةٌ
      [], // بِالسّوءِ
      [], // إِلّا
      [], // ما
      [], // رَحِمَ
      [], // رَبّى
      [], // إِنَّ
      [], // رَبّى
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 54
      [], // وَقالَ
      [], // المَلِكُ
      [], // ائتونى
      [], // بِهِ
      [], // أَستَخلِصهُ
      [], // لِنَفسى
      [], // فَلَمّا
      [], // كَلَّمَهُ
      [], // قالَ
      [], // إِنَّكَ
      [], // اليَومَ
      [], // لَدَينا
      ["مكين : ذو مكانة رفيعة و نفوذ أمر"], // مَكينٌ
      [] // أَمينٌ
    ],
    [ // آية 55
      [], // قالَ
      [], // اجعَلنى
      [], // عَلىٰ
      [], // خَزائِنِ
      [], // الأَرضِ
      [], // إِنّى
      [], // حَفيظٌ
      [] // عَليمٌ
    ],
    [ // آية 56
      [], // وَكَذٰلِكَ
      [], // مَكَّنّا
      [], // لِيوسُفَ
      [], // فِى
      [], // الأَرضِ
      ["يتبوّأ منها : يتّخذ منها نباءة و منزلا"], // يَتَبَوَّأُ
      ["يتبوّأ منها : يتّخذ منها نباءة و منزلا"], // مِنها
      [], // حَيثُ
      [], // يَشاءُ
      [], // نُصيبُ
      [], // بِرَحمَتِنا
      [], // مَن
      [], // نَشاءُ
      [], // وَلا
      [], // نُضيعُ
      [], // أَجرَ
      [] // المُحسِنينَ
    ],
    [ // آية 57
      [], // وَلَأَجرُ
      [], // الـٔاخِرَةِ
      [], // خَيرٌ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // وَكانوا
      [] // يَتَّقونَ
    ],
    [ // آية 58
      [], // وَجاءَ
      [], // إِخوَةُ
      [], // يوسُفَ
      [], // فَدَخَلوا
      [], // عَلَيهِ
      [], // فَعَرَفَهُم
      [], // وَهُم
      [], // لَهُ
      [] // مُنكِرونَ
    ],
    [ // آية 59
      [], // وَلَمّا
      ["جهّزهم بجَهازهم : أعطاهم ما هم في حاجة إليه"], // جَهَّزَهُم
      ["جهّزهم بجَهازهم : أعطاهم ما هم في حاجة إليه"], // بِجَهازِهِم
      [], // قالَ
      [], // ائتونى
      [], // بِأَخٍ
      [], // لَكُم
      [], // مِن
      [], // أَبيكُم
      [], // أَلا
      [], // تَرَونَ
      [], // أَنّى
      [], // أوفِى
      [], // الكَيلَ
      [], // وَأَنا۠
      [], // خَيرُ
      [] // المُنزِلينَ
    ],
    [ // آية 60
      [], // فَإِن
      [], // لَم
      [], // تَأتونى
      [], // بِهِ
      [], // فَلا
      [], // كَيلَ
      [], // لَكُم
      [], // عِندى
      [], // وَلا
      [] // تَقرَبونِ
    ],
    [ // آية 61
      [], // قالوا
      [], // سَنُرٰوِدُ
      [], // عَنهُ
      [], // أَباهُ
      [], // وَإِنّا
      [] // لَفـٰعِلونَ
    ],
    [ // آية 62
      [], // وَقالَ
      [], // لِفِتيـٰنِهِ
      [], // اجعَلوا
      [], // بِضـٰعَتَهُم
      [], // فى
      ["رحالهم : أوعيتهم التي فيها الطّعام و غيره"], // رِحالِهِم
      [], // لَعَلَّهُم
      [], // يَعرِفونَها
      [], // إِذَا
      [], // انقَلَبوا
      [], // إِلىٰ
      [], // أَهلِهِم
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 63
      [], // فَلَمّا
      [], // رَجَعوا
      [], // إِلىٰ
      [], // أَبيهِم
      [], // قالوا
      [], // يـٰأَبانا
      [], // مُنِعَ
      [], // مِنَّا
      [], // الكَيلُ
      [], // فَأَرسِل
      [], // مَعَنا
      [], // أَخانا
      [], // نَكتَل
      [], // وَإِنّا
      [], // لَهُ
      [] // لَحـٰفِظونَ
    ],
    [ // آية 64
      [], // قالَ
      [], // هَل
      [], // ءامَنُكُم
      [], // عَلَيهِ
      [], // إِلّا
      [], // كَما
      [], // أَمِنتُكُم
      [], // عَلىٰ
      [], // أَخيهِ
      [], // مِن
      [], // قَبلُ
      [], // فَاللَّهُ
      [], // خَيرٌ
      [], // حـٰفِظًا
      [], // وَهُوَ
      [], // أَرحَمُ
      [] // الرّٰحِمينَ
    ],
    [ // آية 65
      [], // وَلَمّا
      [], // فَتَحوا
      [], // مَتـٰعَهُم
      [], // وَجَدوا
      [], // بِضـٰعَتَهُم
      [], // رُدَّت
      [], // إِلَيهِم
      [], // قالوا
      [], // يـٰأَبانا
      [], // ما
      [], // نَبغى
      [], // هـٰذِهِ
      [], // بِضـٰعَتُنا
      [], // رُدَّت
      [], // إِلَينا
      [], // وَنَميرُ
      [], // أَهلَنا
      [], // وَنَحفَظُ
      [], // أَخانا
      [], // وَنَزدادُ
      [], // كَيلَ
      [], // بَعيرٍ
      [], // ذٰلِكَ
      [], // كَيلٌ
      [] // يَسيرٌ
    ],
    [ // آية 66
      [], // قالَ
      [], // لَن
      [], // أُرسِلَهُ
      [], // مَعَكُم
      [], // حَتّىٰ
      [], // تُؤتونِ
      ["موثقا : عهدا مُؤكّدا باليمين يوثق به"], // مَوثِقًا
      [], // مِنَ
      [], // اللَّهِ
      [], // لَتَأتُنَّنى
      [], // بِهِ
      [], // إِلّا
      [], // أَن
      ["يُحاط بكم : تُغلبوا . أو تهلكوا جميعا"], // يُحاطَ
      ["يُحاط بكم : تُغلبوا . أو تهلكوا جميعا"], // بِكُم
      [], // فَلَمّا
      [], // ءاتَوهُ
      [], // مَوثِقَهُم
      [], // قالَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // ما
      [], // نَقولُ
      ["وكيل : مُضطلع رقيبٌ"] // وَكيلٌ
    ],
    [ // آية 67
      [], // وَقالَ
      [], // يـٰبَنِىَّ
      [], // لا
      [], // تَدخُلوا
      [], // مِن
      [], // بابٍ
      [], // وٰحِدٍ
      [], // وَادخُلوا
      [], // مِن
      [], // أَبوٰبٍ
      [], // مُتَفَرِّقَةٍ
      [], // وَما
      [], // أُغنى
      [], // عَنكُم
      [], // مِنَ
      [], // اللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // إِنِ
      [], // الحُكمُ
      [], // إِلّا
      [], // لِلَّهِ
      [], // عَلَيهِ
      [], // تَوَكَّلتُ
      [], // وَعَلَيهِ
      [], // فَليَتَوَكَّلِ
      [] // المُتَوَكِّلونَ
    ],
    [ // آية 68
      [], // وَلَمّا
      [], // دَخَلوا
      [], // مِن
      [], // حَيثُ
      [], // أَمَرَهُم
      [], // أَبوهُم
      [], // ما
      [], // كانَ
      [], // يُغنى
      [], // عَنهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // إِلّا
      [], // حاجَةً
      [], // فى
      [], // نَفسِ
      [], // يَعقوبَ
      [], // قَضىٰها
      [], // وَإِنَّهُ
      [], // لَذو
      [], // عِلمٍ
      [], // لِما
      [], // عَلَّمنـٰهُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 69
      [], // وَلَمّا
      [], // دَخَلوا
      [], // عَلىٰ
      [], // يوسُفَ
      [], // ءاوىٰ
      [], // إِلَيهِ
      [], // أَخاهُ
      [], // قالَ
      [], // إِنّى
      [], // أَنا۠
      [], // أَخوكَ
      ["فلا تبتئس : فلا تحزن"], // فَلا
      ["فلا تبتئس : فلا تحزن"], // تَبتَئِس
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 70
      [], // فَلَمّا
      [], // جَهَّزَهُم
      [], // بِجَهازِهِم
      [], // جَعَلَ
      ["السّقاية : إناءً من ذهب للشّرب اتخذ للكيل"], // السِّقايَةَ
      [], // فى
      [], // رَحلِ
      [], // أَخيهِ
      [], // ثُمَّ
      ["أذّن مؤذن : نادى مُنادٍ و أعلم مُعلم"], // أَذَّنَ
      ["أذّن مؤذن : نادى مُنادٍ و أعلم مُعلم"], // مُؤَذِّنٌ
      [], // أَيَّتُهَا
      ["العير : القافلة فيها الأحمال"], // العيرُ
      [], // إِنَّكُم
      [] // لَسـٰرِقونَ
    ],
    [ // آية 71
      [], // قالوا
      [], // وَأَقبَلوا
      [], // عَلَيهِم
      [], // ماذا
      [] // تَفقِدونَ
    ],
    [ // آية 72
      [], // قالوا
      [], // نَفقِدُ
      ["صواع الملك : \"صاعه \"\"مكياله\"\" ، و هو السّقاية \""], // صُواعَ
      ["صواع الملك : \"صاعه \"\"مكياله\"\" ، و هو السّقاية \""], // المَلِكِ
      [], // وَلِمَن
      [], // جاءَ
      [], // بِهِ
      [], // حِملُ
      [], // بَعيرٍ
      [], // وَأَنا۠
      [], // بِهِ
      ["زعيم : كفيل أؤدّيه إليه"] // زَعيمٌ
    ],
    [ // آية 73
      [], // قالوا
      [], // تَاللَّهِ
      [], // لَقَد
      [], // عَلِمتُم
      [], // ما
      [], // جِئنا
      [], // لِنُفسِدَ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // كُنّا
      [] // سـٰرِقينَ
    ],
    [ // آية 74
      [], // قالوا
      [], // فَما
      [], // جَزٰؤُهُ
      [], // إِن
      [], // كُنتُم
      [] // كـٰذِبينَ
    ],
    [ // آية 75
      [], // قالوا
      [], // جَزٰؤُهُ
      [], // مَن
      [], // وُجِدَ
      [], // فى
      [], // رَحلِهِ
      [], // فَهُوَ
      [], // جَزٰؤُهُ
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // الظّـٰلِمينَ
    ],
    [ // آية 76
      [], // فَبَدَأَ
      [], // بِأَوعِيَتِهِم
      [], // قَبلَ
      [], // وِعاءِ
      [], // أَخيهِ
      [], // ثُمَّ
      [], // استَخرَجَها
      [], // مِن
      [], // وِعاءِ
      [], // أَخيهِ
      [], // كَذٰلِكَ
      [], // كِدنا
      [], // لِيوسُفَ
      [], // ما
      [], // كانَ
      [], // لِيَأخُذَ
      [], // أَخاهُ
      [], // فى
      ["دين الملك : شريعة ملك مصر أو حُكمه"], // دينِ
      ["دين الملك : شريعة ملك مصر أو حُكمه"], // المَلِكِ
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // نَرفَعُ
      [], // دَرَجـٰتٍ
      [], // مَن
      [], // نَشاءُ
      [], // وَفَوقَ
      [], // كُلِّ
      [], // ذى
      [], // عِلمٍ
      [] // عَليمٌ
    ],
    [ // آية 77
      [], // قالوا
      [], // إِن
      [], // يَسرِق
      [], // فَقَد
      [], // سَرَقَ
      [], // أَخٌ
      [], // لَهُ
      [], // مِن
      [], // قَبلُ
      [], // فَأَسَرَّها
      [], // يوسُفُ
      [], // فى
      [], // نَفسِهِ
      [], // وَلَم
      [], // يُبدِها
      [], // لَهُم
      [], // قالَ
      [], // أَنتُم
      [], // شَرٌّ
      [], // مَكانًا
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [] // تَصِفونَ
    ],
    [ // آية 78
      [], // قالوا
      [], // يـٰأَيُّهَا
      [], // العَزيزُ
      [], // إِنَّ
      [], // لَهُ
      [], // أَبًا
      [], // شَيخًا
      [], // كَبيرًا
      [], // فَخُذ
      [], // أَحَدَنا
      [], // مَكانَهُ
      [], // إِنّا
      [], // نَرىٰكَ
      [], // مِنَ
      [] // المُحسِنينَ
    ],
    [ // آية 79
      [], // قالَ
      ["معاذ الله : نعوذ بالله معاذا و نعتصم به"], // مَعاذَ
      ["معاذ الله : نعوذ بالله معاذا و نعتصم به"], // اللَّهِ
      [], // أَن
      [], // نَأخُذَ
      [], // إِلّا
      [], // مَن
      [], // وَجَدنا
      [], // مَتـٰعَنا
      [], // عِندَهُ
      [], // إِنّا
      [], // إِذًا
      [] // لَظـٰلِمونَ
    ],
    [ // آية 80
      [], // فَلَمَّا
      [], // استَيـَٔسوا
      [], // مِنهُ
      ["خلصوا نجيّا : انفردوا متناجين مُتشاورين"], // خَلَصوا
      ["خلصوا نجيّا : انفردوا متناجين مُتشاورين"], // نَجِيًّا
      [], // قالَ
      [], // كَبيرُهُم
      [], // أَلَم
      [], // تَعلَموا
      [], // أَنَّ
      [], // أَباكُم
      [], // قَد
      [], // أَخَذَ
      [], // عَلَيكُم
      [], // مَوثِقًا
      [], // مِنَ
      [], // اللَّهِ
      [], // وَمِن
      [], // قَبلُ
      ["ما فرّطتم : قصّرتم ،  و (ما : زائدة)"], // ما
      ["ما فرّطتم : قصّرتم ،  و (ما : زائدة)"], // فَرَّطتُم
      [], // فى
      [], // يوسُفَ
      [], // فَلَن
      [], // أَبرَحَ
      [], // الأَرضَ
      [], // حَتّىٰ
      [], // يَأذَنَ
      [], // لى
      [], // أَبى
      [], // أَو
      [], // يَحكُمَ
      [], // اللَّهُ
      [], // لى
      [], // وَهُوَ
      [], // خَيرُ
      [] // الحـٰكِمينَ
    ],
    [ // آية 81
      [], // ارجِعوا
      [], // إِلىٰ
      [], // أَبيكُم
      [], // فَقولوا
      [], // يـٰأَبانا
      [], // إِنَّ
      [], // ابنَكَ
      [], // سَرَقَ
      [], // وَما
      [], // شَهِدنا
      [], // إِلّا
      [], // بِما
      [], // عَلِمنا
      [], // وَما
      [], // كُنّا
      [], // لِلغَيبِ
      [] // حـٰفِظينَ
    ],
    [ // آية 82
      [], // وَسـَٔلِ
      [], // القَريَةَ
      [], // الَّتى
      [], // كُنّا
      [], // فيها
      [], // وَالعيرَ
      [], // الَّتى
      [], // أَقبَلنا
      [], // فيها
      [], // وَإِنّا
      [] // لَصـٰدِقونَ
    ],
    [ // آية 83
      [], // قالَ
      [], // بَل
      ["سوّلت : زيّنت و سهّلت"], // سَوَّلَت
      [], // لَكُم
      [], // أَنفُسُكُم
      [], // أَمرًا
      [], // فَصَبرٌ
      [], // جَميلٌ
      [], // عَسَى
      [], // اللَّهُ
      [], // أَن
      [], // يَأتِيَنى
      [], // بِهِم
      [], // جَميعًا
      [], // إِنَّهُ
      [], // هُوَ
      [], // العَليمُ
      [] // الحَكيمُ
    ],
    [ // آية 84
      [], // وَتَوَلّىٰ
      [], // عَنهُم
      [], // وَقالَ
      [], // يـٰأَسَفىٰ
      [], // عَلىٰ
      [], // يوسُفَ
      [], // وَابيَضَّت
      [], // عَيناهُ
      [], // مِنَ
      [], // الحُزنِ
      [], // فَهُوَ
      ["كظيم : ممتلئ من الغيظ أو الحزن يكتمه و لا يُبديه"] // كَظيمٌ
    ],
    [ // آية 85
      [], // قالوا
      [], // تَاللَّهِ
      [], // تَفتَؤُا۟
      [], // تَذكُرُ
      [], // يوسُفَ
      [], // حَتّىٰ
      ["تكون حرضا : تصير مريضا مُشفيا على الهلاك"], // تَكونَ
      ["تكون حرضا : تصير مريضا مُشفيا على الهلاك"], // حَرَضًا
      [], // أَو
      [], // تَكونَ
      [], // مِنَ
      [] // الهـٰلِكينَ
    ],
    [ // آية 86
      [], // قالَ
      [], // إِنَّما
      [], // أَشكوا
      [], // بَثّى
      [], // وَحُزنى
      [], // إِلَى
      [], // اللَّهِ
      [], // وَأَعلَمُ
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 87
      [], // يـٰبَنِىَّ
      [], // اذهَبوا
      ["فتحسّسوا من يوسف : تعرّفوا من خبر يوسف"], // فَتَحَسَّسوا
      ["فتحسّسوا من يوسف : تعرّفوا من خبر يوسف"], // مِن
      ["فتحسّسوا من يوسف : تعرّفوا من خبر يوسف"], // يوسُفَ
      [], // وَأَخيهِ
      [], // وَلا
      [], // تَا۟يـَٔسوا
      [], // مِن
      ["روح الله : رحمته و فرجه و تنفيسه"], // رَوحِ
      ["روح الله : رحمته و فرجه و تنفيسه"], // اللَّهِ
      [], // إِنَّهُ
      [], // لا
      [], // يَا۟يـَٔسُ
      [], // مِن
      [], // رَوحِ
      [], // اللَّهِ
      [], // إِلَّا
      [], // القَومُ
      [] // الكـٰفِرونَ
    ],
    [ // آية 88
      [], // فَلَمّا
      [], // دَخَلوا
      [], // عَلَيهِ
      [], // قالوا
      [], // يـٰأَيُّهَا
      [], // العَزيزُ
      [], // مَسَّنا
      [], // وَأَهلَنَا
      ["الضّرّ : الهزال من شدّة الجوع"], // الضُّرُّ
      [], // وَجِئنا
      [], // بِبِضـٰعَةٍ
      [], // مُزجىٰةٍ
      [], // فَأَوفِ
      [], // لَنَا
      [], // الكَيلَ
      [], // وَتَصَدَّق
      [], // عَلَينا
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَجزِى
      [] // المُتَصَدِّقينَ
    ],
    [ // آية 89
      [], // قالَ
      [], // هَل
      [], // عَلِمتُم
      [], // ما
      [], // فَعَلتُم
      [], // بِيوسُفَ
      [], // وَأَخيهِ
      [], // إِذ
      [], // أَنتُم
      [] // جـٰهِلونَ
    ],
    [ // آية 90
      [], // قالوا
      [], // أَءِنَّكَ
      [], // لَأَنتَ
      [], // يوسُفُ
      [], // قالَ
      [], // أَنا۠
      [], // يوسُفُ
      [], // وَهـٰذا
      [], // أَخى
      [], // قَد
      [], // مَنَّ
      [], // اللَّهُ
      [], // عَلَينا
      [], // إِنَّهُ
      [], // مَن
      [], // يَتَّقِ
      [], // وَيَصبِر
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُضيعُ
      [], // أَجرَ
      [] // المُحسِنينَ
    ],
    [ // آية 91
      [], // قالوا
      [], // تَاللَّهِ
      [], // لَقَد
      [], // ءاثَرَكَ
      [], // اللَّهُ
      [], // عَلَينا
      [], // وَإِن
      [], // كُنّا
      [] // لَخـٰطِـٔينَ
    ],
    [ // آية 92
      [], // قالَ
      [], // لا
      [], // تَثريبَ
      [], // عَلَيكُمُ
      [], // اليَومَ
      [], // يَغفِرُ
      [], // اللَّهُ
      [], // لَكُم
      [], // وَهُوَ
      [], // أَرحَمُ
      [] // الرّٰحِمينَ
    ],
    [ // آية 93
      [], // اذهَبوا
      [], // بِقَميصى
      [], // هـٰذا
      [], // فَأَلقوهُ
      [], // عَلىٰ
      [], // وَجهِ
      [], // أَبى
      [], // يَأتِ
      [], // بَصيرًا
      [], // وَأتونى
      [], // بِأَهلِكُم
      [] // أَجمَعينَ
    ],
    [ // آية 94
      [], // وَلَمّا
      ["فصلت العير : فارقت القافلة عريش مصر"], // فَصَلَتِ
      ["فصلت العير : فارقت القافلة عريش مصر"], // العيرُ
      [], // قالَ
      [], // أَبوهُم
      [], // إِنّى
      [], // لَأَجِدُ
      [], // ريحَ
      [], // يوسُفَ
      [], // لَولا
      [], // أَن
      [] // تُفَنِّدونِ
    ],
    [ // آية 95
      [], // قالوا
      [], // تَاللَّهِ
      [], // إِنَّكَ
      [], // لَفى
      [], // ضَلـٰلِكَ
      [] // القَديمِ
    ],
    [ // آية 96
      [], // فَلَمّا
      [], // أَن
      [], // جاءَ
      [], // البَشيرُ
      [], // أَلقىٰهُ
      [], // عَلىٰ
      [], // وَجهِهِ
      [], // فَارتَدَّ
      [], // بَصيرًا
      [], // قالَ
      [], // أَلَم
      [], // أَقُل
      [], // لَكُم
      [], // إِنّى
      [], // أَعلَمُ
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 97
      [], // قالوا
      [], // يـٰأَبانَا
      [], // استَغفِر
      [], // لَنا
      [], // ذُنوبَنا
      [], // إِنّا
      [], // كُنّا
      [] // خـٰطِـٔينَ
    ],
    [ // آية 98
      [], // قالَ
      [], // سَوفَ
      [], // أَستَغفِرُ
      [], // لَكُم
      [], // رَبّى
      [], // إِنَّهُ
      [], // هُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 99
      [], // فَلَمّا
      [], // دَخَلوا
      [], // عَلىٰ
      [], // يوسُفَ
      [], // ءاوىٰ
      [], // إِلَيهِ
      [], // أَبَوَيهِ
      [], // وَقالَ
      [], // ادخُلوا
      [], // مِصرَ
      [], // إِن
      [], // شاءَ
      [], // اللَّهُ
      [] // ءامِنينَ
    ],
    [ // آية 100
      [], // وَرَفَعَ
      [], // أَبَوَيهِ
      [], // عَلَى
      [], // العَرشِ
      [], // وَخَرّوا
      [], // لَهُ
      ["سُجّدا : و كان ذلك جائزا في شريعتهم"], // سُجَّدًا
      [], // وَقالَ
      [], // يـٰأَبَتِ
      [], // هـٰذا
      [], // تَأويلُ
      [], // رُءيـٰىَ
      [], // مِن
      [], // قَبلُ
      [], // قَد
      [], // جَعَلَها
      [], // رَبّى
      [], // حَقًّا
      [], // وَقَد
      [], // أَحسَنَ
      [], // بى
      [], // إِذ
      [], // أَخرَجَنى
      [], // مِنَ
      [], // السِّجنِ
      [], // وَجاءَ
      [], // بِكُم
      [], // مِنَ
      ["البدو : البادية"], // البَدوِ
      [], // مِن
      [], // بَعدِ
      [], // أَن
      [], // نَزَغَ
      [], // الشَّيطـٰنُ
      [], // بَينى
      [], // وَبَينَ
      [], // إِخوَتى
      [], // إِنَّ
      [], // رَبّى
      [], // لَطيفٌ
      [], // لِما
      [], // يَشاءُ
      [], // إِنَّهُ
      [], // هُوَ
      [], // العَليمُ
      [] // الحَكيمُ
    ],
    [ // آية 101
      [], // رَبِّ
      [], // قَد
      [], // ءاتَيتَنى
      [], // مِنَ
      [], // المُلكِ
      [], // وَعَلَّمتَنى
      [], // مِن
      [], // تَأويلِ
      [], // الأَحاديثِ
      [], // فاطِرَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // أَنتَ
      [], // وَلِيّۦ
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // تَوَفَّنى
      [], // مُسلِمًا
      [], // وَأَلحِقنى
      [] // بِالصّـٰلِحينَ
    ],
    [ // آية 102
      [], // ذٰلِكَ
      [], // مِن
      [], // أَنباءِ
      [], // الغَيبِ
      [], // نوحيهِ
      [], // إِلَيكَ
      [], // وَما
      [], // كُنتَ
      [], // لَدَيهِم
      [], // إِذ
      ["أجمعوا أمرهم : عزموا على الكيد ليوسف"], // أَجمَعوا
      ["أجمعوا أمرهم : عزموا على الكيد ليوسف"], // أَمرَهُم
      [], // وَهُم
      [] // يَمكُرونَ
    ],
    [ // آية 103
      [], // وَما
      [], // أَكثَرُ
      [], // النّاسِ
      [], // وَلَو
      [], // حَرَصتَ
      [] // بِمُؤمِنينَ
    ],
    [ // آية 104
      [], // وَما
      [], // تَسـَٔلُهُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرٌ
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 105
      [], // وَكَأَيِّن
      [], // مِن
      [], // ءايَةٍ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يَمُرّونَ
      [], // عَلَيها
      [], // وَهُم
      [], // عَنها
      [] // مُعرِضونَ
    ],
    [ // آية 106
      [], // وَما
      [], // يُؤمِنُ
      [], // أَكثَرُهُم
      [], // بِاللَّهِ
      [], // إِلّا
      [], // وَهُم
      [] // مُشرِكونَ
    ],
    [ // آية 107
      [], // أَفَأَمِنوا
      [], // أَن
      [], // تَأتِيَهُم
      [], // غـٰشِيَةٌ
      [], // مِن
      [], // عَذابِ
      [], // اللَّهِ
      [], // أَو
      [], // تَأتِيَهُمُ
      [], // السّاعَةُ
      ["بغتة : فجأة"], // بَغتَةً
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 108
      [], // قُل
      [], // هـٰذِهِ
      [], // سَبيلى
      [], // أَدعوا
      [], // إِلَى
      [], // اللَّهِ
      [], // عَلىٰ
      [], // بَصيرَةٍ
      [], // أَنا۠
      [], // وَمَنِ
      [], // اتَّبَعَنى
      [], // وَسُبحـٰنَ
      [], // اللَّهِ
      [], // وَما
      [], // أَنا۠
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 109
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // إِلّا
      [], // رِجالًا
      [], // نوحى
      [], // إِلَيهِم
      [], // مِن
      [], // أَهلِ
      [], // القُرىٰ
      [], // أَفَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَلَدارُ
      [], // الـٔاخِرَةِ
      [], // خَيرٌ
      [], // لِلَّذينَ
      [], // اتَّقَوا
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 110
      [], // حَتّىٰ
      [], // إِذَا
      [], // استَيـَٔسَ
      [], // الرُّسُلُ
      [], // وَظَنّوا
      [], // أَنَّهُم
      ["قد كُذبوا : كذبهم رجاؤهم النّصر في الدّنيا"], // قَد
      ["قد كُذبوا : كذبهم رجاؤهم النّصر في الدّنيا"], // كُذِبوا
      [], // جاءَهُم
      [], // نَصرُنا
      [], // فَنُجِّىَ
      [], // مَن
      [], // نَشاءُ
      [], // وَلا
      [], // يُرَدُّ
      [], // بَأسُنا
      [], // عَنِ
      [], // القَومِ
      [] // المُجرِمينَ
    ],
    [ // آية 111
      [], // لَقَد
      [], // كانَ
      [], // فى
      [], // قَصَصِهِم
      ["عبرة : عظة و تذكرة"], // عِبرَةٌ
      [], // لِأُولِى
      [], // الأَلبـٰبِ
      [], // ما
      [], // كانَ
      [], // حَديثًا
      ["يُفترى : يُختلق"], // يُفتَرىٰ
      [], // وَلـٰكِن
      [], // تَصديقَ
      [], // الَّذى
      [], // بَينَ
      [], // يَدَيهِ
      [], // وَتَفصيلَ
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَهُدًى
      [], // وَرَحمَةً
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ]
];

export default meanings;