const meanings = [
  [ // سورة 14: إبراهيم
[ // آية 1
      [], // الر
      [], // كِتـٰبٌ
      [], // أَنزَلنـٰهُ
      [], // إِلَيكَ
      [], // لِتُخرِجَ
      [], // النّاسَ
      [], // مِنَ
      [], // الظُّلُمـٰتِ
      [], // إِلَى
      [], // النّورِ
      ["بإذن ربّهم : بتيسيره و توفيقه لهم أو بأمره"], // بِإِذنِ
      ["بإذن ربّهم : بتيسيره و توفيقه لهم أو بأمره"], // رَبِّهِم
      [], // إِلىٰ
      [], // صِرٰطِ
      ["العزيز : الغالب أو الذي لا مثل له"], // العَزيزِ
      ["الحميد : المحمود الُثنى عليه"] // الحَميدِ
    ],
    [ // آية 2
      [], // اللَّهِ
      [], // الَّذى
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَوَيلٌ
      [], // لِلكـٰفِرينَ
      [], // مِن
      [], // عَذابٍ
      [] // شَديدٍ
    ],
    [ // آية 3
      [], // الَّذينَ
      ["يستحبّون : يختارون و يؤثرون"], // يَستَحِبّونَ
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // عَلَى
      [], // الـٔاخِرَةِ
      [], // وَيَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَيَبغونَها
      [], // عِوَجًا
      [], // أُولـٰئِكَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // بَعيدٍ
    ],
    [ // آية 4
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // بِلِسانِ
      [], // قَومِهِ
      [], // لِيُبَيِّنَ
      [], // لَهُم
      [], // فَيُضِلُّ
      [], // اللَّهُ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَهدى
      [], // مَن
      [], // يَشاءُ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 5
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // أَن
      [], // أَخرِج
      [], // قَومَكَ
      [], // مِنَ
      [], // الظُّلُمـٰتِ
      [], // إِلَى
      [], // النّورِ
      [], // وَذَكِّرهُم
      [], // بِأَيّىٰمِ
      [], // اللَّهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِكُلِّ
      [], // صَبّارٍ
      [] // شَكورٍ
    ],
    [ // آية 6
      [], // وَإِذ
      [], // قالَ
      [], // موسىٰ
      [], // لِقَومِهِ
      [], // اذكُروا
      [], // نِعمَةَ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // إِذ
      [], // أَنجىٰكُم
      [], // مِن
      [], // ءالِ
      [], // فِرعَونَ
      ["يسومونكم : يذيقونكم و يكلّفونكم"], // يَسومونَكُم
      [], // سوءَ
      [], // العَذابِ
      [], // وَيُذَبِّحونَ
      [], // أَبناءَكُم
      [], // وَيَستَحيونَ
      [], // نِساءَكُم
      [], // وَفى
      [], // ذٰلِكُم
      [], // بَلاءٌ
      [], // مِن
      [], // رَبِّكُم
      [] // عَظيمٌ
    ],
    [ // آية 7
      [], // وَإِذ
      ["تأذّن ربّكم : أعلم اعلاما لا شُبهة معه"], // تَأَذَّنَ
      ["تأذّن ربّكم : أعلم اعلاما لا شُبهة معه"], // رَبُّكُم
      [], // لَئِن
      [], // شَكَرتُم
      [], // لَأَزيدَنَّكُم
      [], // وَلَئِن
      [], // كَفَرتُم
      [], // إِنَّ
      [], // عَذابى
      [] // لَشَديدٌ
    ],
    [ // آية 8
      [], // وَقالَ
      [], // موسىٰ
      [], // إِن
      [], // تَكفُروا
      [], // أَنتُم
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // جَميعًا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // لَغَنِىٌّ
      [] // حَميدٌ
    ],
    [ // آية 9
      [], // أَلَم
      [], // يَأتِكُم
      [], // نَبَؤُا۟
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِكُم
      [], // قَومِ
      [], // نوحٍ
      [], // وَعادٍ
      [], // وَثَمودَ
      [], // وَالَّذينَ
      [], // مِن
      [], // بَعدِهِم
      [], // لا
      [], // يَعلَمُهُم
      [], // إِلَّا
      [], // اللَّهُ
      [], // جاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَرَدّوا
      [], // أَيدِيَهُم
      [], // فى
      [], // أَفوٰهِهِم
      [], // وَقالوا
      [], // إِنّا
      [], // كَفَرنا
      [], // بِما
      [], // أُرسِلتُم
      [], // بِهِ
      [], // وَإِنّا
      [], // لَفى
      [], // شَكٍّ
      [], // مِمّا
      [], // تَدعونَنا
      [], // إِلَيهِ
      ["مريبٍ : موقعٍ في الرّيبة و القلق"] // مُريبٍ
    ],
    [ // آية 10
      [], // قالَت
      [], // رُسُلُهُم
      [], // أَفِى
      [], // اللَّهِ
      [], // شَكٌّ
      [], // فاطِرِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يَدعوكُم
      [], // لِيَغفِرَ
      [], // لَكُم
      [], // مِن
      [], // ذُنوبِكُم
      [], // وَيُؤَخِّرَكُم
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // قالوا
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُنا
      [], // تُريدونَ
      [], // أَن
      [], // تَصُدّونا
      [], // عَمّا
      [], // كانَ
      [], // يَعبُدُ
      [], // ءاباؤُنا
      [], // فَأتونا
      [], // بِسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 11
      [], // قالَت
      [], // لَهُم
      [], // رُسُلُهُم
      [], // إِن
      [], // نَحنُ
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // يَمُنُّ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَما
      [], // كانَ
      [], // لَنا
      [], // أَن
      [], // نَأتِيَكُم
      [], // بِسُلطـٰنٍ
      [], // إِلّا
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // وَعَلَى
      [], // اللَّهِ
      [], // فَليَتَوَكَّلِ
      [] // المُؤمِنونَ
    ],
    [ // آية 12
      [], // وَما
      [], // لَنا
      [], // أَلّا
      [], // نَتَوَكَّلَ
      [], // عَلَى
      [], // اللَّهِ
      [], // وَقَد
      [], // هَدىٰنا
      [], // سُبُلَنا
      [], // وَلَنَصبِرَنَّ
      [], // عَلىٰ
      [], // ما
      [], // ءاذَيتُمونا
      [], // وَعَلَى
      [], // اللَّهِ
      [], // فَليَتَوَكَّلِ
      [] // المُتَوَكِّلونَ
    ],
    [ // آية 13
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِرُسُلِهِم
      [], // لَنُخرِجَنَّكُم
      [], // مِن
      [], // أَرضِنا
      [], // أَو
      [], // لَتَعودُنَّ
      [], // فى
      [], // مِلَّتِنا
      [], // فَأَوحىٰ
      [], // إِلَيهِم
      [], // رَبُّهُم
      [], // لَنُهلِكَنَّ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 14
      [], // وَلَنُسكِنَنَّكُمُ
      [], // الأَرضَ
      [], // مِن
      [], // بَعدِهِم
      [], // ذٰلِكَ
      [], // لِمَن
      [], // خافَ
      [], // مَقامى
      [], // وَخافَ
      [] // وَعيدِ
    ],
    [ // آية 15
      [], // وَاستَفتَحوا
      [], // وَخابَ
      [], // كُلُّ
      [], // جَبّارٍ
      ["عنيدٍ : معاند للحقّ ، مُجانب له"] // عَنيدٍ
    ],
    [ // آية 16
      [], // مِن
      [], // وَرائِهِ
      [], // جَهَنَّمُ
      [], // وَيُسقىٰ
      [], // مِن
      [], // ماءٍ
      ["صديدٍ : ما يسيل من أجساد أهل النّار"] // صَديدٍ
    ],
    [ // آية 17
      ["يتجرّعه : يتكلّف بلعه لحرارته و مرارته"], // يَتَجَرَّعُهُ
      [], // وَلا
      [], // يَكادُ
      [], // يُسيغُهُ
      [], // وَيَأتيهِ
      [], // المَوتُ
      [], // مِن
      [], // كُلِّ
      [], // مَكانٍ
      [], // وَما
      [], // هُوَ
      [], // بِمَيِّتٍ
      [], // وَمِن
      [], // وَرائِهِ
      [], // عَذابٌ
      [] // غَليظٌ
    ],
    [ // آية 18
      [], // مَثَلُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِرَبِّهِم
      [], // أَعمـٰلُهُم
      [], // كَرَمادٍ
      [], // اشتَدَّت
      [], // بِهِ
      [], // الرّيحُ
      [], // فى
      ["يوم عاصف : شديد هبوب الرّيح"], // يَومٍ
      ["يوم عاصف : شديد هبوب الرّيح"], // عاصِفٍ
      [], // لا
      [], // يَقدِرونَ
      [], // مِمّا
      [], // كَسَبوا
      [], // عَلىٰ
      [], // شَىءٍ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الضَّلـٰلُ
      [] // البَعيدُ
    ],
    [ // آية 19
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // إِن
      [], // يَشَأ
      [], // يُذهِبكُم
      [], // وَيَأتِ
      [], // بِخَلقٍ
      [] // جَديدٍ
    ],
    [ // آية 20
      [], // وَما
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // بِعَزيزٍ
    ],
    [ // آية 21
      [], // وَبَرَزوا
      [], // لِلَّهِ
      [], // جَميعًا
      [], // فَقالَ
      [], // الضُّعَفـٰؤُا۟
      [], // لِلَّذينَ
      [], // استَكبَروا
      [], // إِنّا
      [], // كُنّا
      [], // لَكُم
      [], // تَبَعًا
      [], // فَهَل
      [], // أَنتُم
      ["مُغنون عنّا : دافِعون عنّا"], // مُغنونَ
      ["مُغنون عنّا : دافِعون عنّا"], // عَنّا
      [], // مِن
      [], // عَذابِ
      [], // اللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // قالوا
      [], // لَو
      [], // هَدىٰنَا
      [], // اللَّهُ
      [], // لَهَدَينـٰكُم
      [], // سَواءٌ
      [], // عَلَينا
      [], // أَجَزِعنا
      [], // أَم
      [], // صَبَرنا
      [], // ما
      [], // لَنا
      [], // مِن
      ["محيصٍ : منجى و مهرب و مزاغ"] // مَحيصٍ
    ],
    [ // آية 22
      [], // وَقالَ
      [], // الشَّيطـٰنُ
      [], // لَمّا
      [], // قُضِىَ
      [], // الأَمرُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // وَعَدَكُم
      [], // وَعدَ
      [], // الحَقِّ
      [], // وَوَعَدتُكُم
      [], // فَأَخلَفتُكُم
      [], // وَما
      [], // كانَ
      [], // لِىَ
      [], // عَلَيكُم
      [], // مِن
      [], // سُلطـٰنٍ
      [], // إِلّا
      [], // أَن
      [], // دَعَوتُكُم
      [], // فَاستَجَبتُم
      [], // لى
      [], // فَلا
      [], // تَلومونى
      [], // وَلوموا
      [], // أَنفُسَكُم
      [], // ما
      [], // أَنا۠
      [], // بِمُصرِخِكُم
      [], // وَما
      [], // أَنتُم
      [], // بِمُصرِخِىَّ
      [], // إِنّى
      [], // كَفَرتُ
      [], // بِما
      [], // أَشرَكتُمونِ
      [], // مِن
      [], // قَبلُ
      [], // إِنَّ
      [], // الظّـٰلِمينَ
      [], // لَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 23
      [], // وَأُدخِلَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // بِإِذنِ
      [], // رَبِّهِم
      [], // تَحِيَّتُهُم
      [], // فيها
      [] // سَلـٰمٌ
    ],
    [ // آية 24
      [], // أَلَم
      [], // تَرَ
      [], // كَيفَ
      [], // ضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // كَلِمَةً
      [], // طَيِّبَةً
      [], // كَشَجَرَةٍ
      [], // طَيِّبَةٍ
      [], // أَصلُها
      [], // ثابِتٌ
      [], // وَفَرعُها
      [], // فِى
      [] // السَّماءِ
    ],
    [ // آية 25
      [], // تُؤتى
      [], // أُكُلَها
      [], // كُلَّ
      [], // حينٍ
      [], // بِإِذنِ
      [], // رَبِّها
      [], // وَيَضرِبُ
      [], // اللَّهُ
      [], // الأَمثالَ
      [], // لِلنّاسِ
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 26
      [], // وَمَثَلُ
      ["كلمة خبيثة : كلمة الكفر و الضّلال"], // كَلِمَةٍ
      ["كلمة خبيثة : كلمة الكفر و الضّلال"], // خَبيثَةٍ
      [], // كَشَجَرَةٍ
      [], // خَبيثَةٍ
      ["اجتُثّت : اقتُلِعت جثّتها من أصلها"], // اجتُثَّت
      [], // مِن
      [], // فَوقِ
      [], // الأَرضِ
      [], // ما
      [], // لَها
      [], // مِن
      [] // قَرارٍ
    ],
    [ // آية 27
      [], // يُثَبِّتُ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // بِالقَولِ
      [], // الثّابِتِ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَفِى
      [], // الـٔاخِرَةِ
      [], // وَيُضِلُّ
      [], // اللَّهُ
      [], // الظّـٰلِمينَ
      [], // وَيَفعَلُ
      [], // اللَّهُ
      [], // ما
      [] // يَشاءُ
    ],
    [ // آية 28
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // بَدَّلوا
      [], // نِعمَتَ
      [], // اللَّهِ
      [], // كُفرًا
      [], // وَأَحَلّوا
      [], // قَومَهُم
      ["دار البوار : دار الهلاك ( جهنّم)"], // دارَ
      ["دار البوار : دار الهلاك ( جهنّم)"] // البَوارِ
    ],
    [ // آية 29
      [], // جَهَنَّمَ
      ["يصلونها : يدخلونها أو يُقاسون حرّها"], // يَصلَونَها
      [], // وَبِئسَ
      [] // القَرارُ
    ],
    [ // آية 30
      [], // وَجَعَلوا
      [], // لِلَّهِ
      ["أندادا : أمثالا من الأوثان يعبدونها"], // أَندادًا
      [], // لِيُضِلّوا
      [], // عَن
      [], // سَبيلِهِ
      [], // قُل
      [], // تَمَتَّعوا
      [], // فَإِنَّ
      [], // مَصيرَكُم
      [], // إِلَى
      [] // النّارِ
    ],
    [ // آية 31
      [], // قُل
      [], // لِعِبادِىَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // يُقيمُوا
      [], // الصَّلوٰةَ
      [], // وَيُنفِقوا
      [], // مِمّا
      [], // رَزَقنـٰهُم
      [], // سِرًّا
      [], // وَعَلانِيَةً
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِىَ
      [], // يَومٌ
      [], // لا
      [], // بَيعٌ
      [], // فيهِ
      [], // وَلا
      [] // خِلـٰلٌ
    ],
    [ // آية 32
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَأَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَخرَجَ
      [], // بِهِ
      [], // مِنَ
      [], // الثَّمَرٰتِ
      [], // رِزقًا
      [], // لَكُم
      [], // وَسَخَّرَ
      [], // لَكُمُ
      [], // الفُلكَ
      [], // لِتَجرِىَ
      [], // فِى
      [], // البَحرِ
      [], // بِأَمرِهِ
      [], // وَسَخَّرَ
      [], // لَكُمُ
      [] // الأَنهـٰرَ
    ],
    [ // آية 33
      [], // وَسَخَّرَ
      [], // لَكُمُ
      [], // الشَّمسَ
      [], // وَالقَمَرَ
      ["دائبين : دائمين في منافعهما لكم"], // دائِبَينِ
      [], // وَسَخَّرَ
      [], // لَكُمُ
      [], // الَّيلَ
      [] // وَالنَّهارَ
    ],
    [ // آية 34
      [], // وَءاتىٰكُم
      [], // مِن
      [], // كُلِّ
      [], // ما
      [], // سَأَلتُموهُ
      [], // وَإِن
      [], // تَعُدّوا
      [], // نِعمَتَ
      [], // اللَّهِ
      ["لا تُحصوها : لا تطيقوا عدّها لعدم تناهيها"], // لا
      ["لا تُحصوها : لا تطيقوا عدّها لعدم تناهيها"], // تُحصوها
      [], // إِنَّ
      [], // الإِنسـٰنَ
      [], // لَظَلومٌ
      [] // كَفّارٌ
    ],
    [ // آية 35
      [], // وَإِذ
      [], // قالَ
      [], // إِبرٰهيمُ
      [], // رَبِّ
      [], // اجعَل
      [], // هـٰذَا
      [], // البَلَدَ
      [], // ءامِنًا
      [], // وَاجنُبنى
      [], // وَبَنِىَّ
      [], // أَن
      [], // نَعبُدَ
      [] // الأَصنامَ
    ],
    [ // آية 36
      [], // رَبِّ
      [], // إِنَّهُنَّ
      [], // أَضلَلنَ
      [], // كَثيرًا
      [], // مِنَ
      [], // النّاسِ
      [], // فَمَن
      [], // تَبِعَنى
      [], // فَإِنَّهُ
      [], // مِنّى
      [], // وَمَن
      [], // عَصانى
      [], // فَإِنَّكَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 37
      [], // رَبَّنا
      [], // إِنّى
      [], // أَسكَنتُ
      [], // مِن
      [], // ذُرِّيَّتى
      [], // بِوادٍ
      [], // غَيرِ
      [], // ذى
      [], // زَرعٍ
      [], // عِندَ
      [], // بَيتِكَ
      [], // المُحَرَّمِ
      [], // رَبَّنا
      [], // لِيُقيمُوا
      [], // الصَّلوٰةَ
      [], // فَاجعَل
      [], // أَفـِٔدَةً
      [], // مِنَ
      [], // النّاسِ
      [], // تَهوى
      [], // إِلَيهِم
      [], // وَارزُقهُم
      [], // مِنَ
      [], // الثَّمَرٰتِ
      [], // لَعَلَّهُم
      [] // يَشكُرونَ
    ],
    [ // آية 38
      [], // رَبَّنا
      [], // إِنَّكَ
      [], // تَعلَمُ
      [], // ما
      [], // نُخفى
      [], // وَما
      [], // نُعلِنُ
      [], // وَما
      [], // يَخفىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // مِن
      [], // شَىءٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // فِى
      [] // السَّماءِ
    ],
    [ // آية 39
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // وَهَبَ
      [], // لى
      [], // عَلَى
      [], // الكِبَرِ
      [], // إِسمـٰعيلَ
      [], // وَإِسحـٰقَ
      [], // إِنَّ
      [], // رَبّى
      [], // لَسَميعُ
      [] // الدُّعاءِ
    ],
    [ // آية 40
      [], // رَبِّ
      [], // اجعَلنى
      [], // مُقيمَ
      [], // الصَّلوٰةِ
      [], // وَمِن
      [], // ذُرِّيَّتى
      [], // رَبَّنا
      [], // وَتَقَبَّل
      [] // دُعاءِ
    ],
    [ // آية 41
      [], // رَبَّنَا
      [], // اغفِر
      [], // لى
      [], // وَلِوٰلِدَىَّ
      [], // وَلِلمُؤمِنينَ
      [], // يَومَ
      [], // يَقومُ
      [] // الحِسابُ
    ],
    [ // آية 42
      [], // وَلا
      [], // تَحسَبَنَّ
      [], // اللَّهَ
      [], // غـٰفِلًا
      [], // عَمّا
      [], // يَعمَلُ
      [], // الظّـٰلِمونَ
      [], // إِنَّما
      [], // يُؤَخِّرُهُم
      [], // لِيَومٍ
      [], // تَشخَصُ
      [], // فيهِ
      [] // الأَبصـٰرُ
    ],
    [ // آية 43
      ["مهطعين : مسرعين إلى الدّاعي بذلّة"], // مُهطِعينَ
      [], // مُقنِعى
      [], // رُءوسِهِم
      [], // لا
      [], // يَرتَدُّ
      [], // إِلَيهِم
      [], // طَرفُهُم
      [], // وَأَفـِٔدَتُهُم
      [] // هَواءٌ
    ],
    [ // آية 44
      [], // وَأَنذِرِ
      [], // النّاسَ
      [], // يَومَ
      [], // يَأتيهِمُ
      [], // العَذابُ
      [], // فَيَقولُ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // رَبَّنا
      [], // أَخِّرنا
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // قَريبٍ
      [], // نُجِب
      [], // دَعوَتَكَ
      [], // وَنَتَّبِعِ
      [], // الرُّسُلَ
      [], // أَوَلَم
      [], // تَكونوا
      [], // أَقسَمتُم
      [], // مِن
      [], // قَبلُ
      [], // ما
      [], // لَكُم
      [], // مِن
      [] // زَوالٍ
    ],
    [ // آية 45
      [], // وَسَكَنتُم
      [], // فى
      [], // مَسـٰكِنِ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // أَنفُسَهُم
      [], // وَتَبَيَّنَ
      [], // لَكُم
      [], // كَيفَ
      [], // فَعَلنا
      [], // بِهِم
      [], // وَضَرَبنا
      [], // لَكُمُ
      [] // الأَمثالَ
    ],
    [ // آية 46
      [], // وَقَد
      [], // مَكَروا
      [], // مَكرَهُم
      [], // وَعِندَ
      [], // اللَّهِ
      [], // مَكرُهُم
      [], // وَإِن
      [], // كانَ
      [], // مَكرُهُم
      [], // لِتَزولَ
      [], // مِنهُ
      [] // الجِبالُ
    ],
    [ // آية 47
      [], // فَلا
      [], // تَحسَبَنَّ
      [], // اللَّهَ
      [], // مُخلِفَ
      [], // وَعدِهِ
      [], // رُسُلَهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [], // ذُو
      [] // انتِقامٍ
    ],
    [ // آية 48
      [], // يَومَ
      [], // تُبَدَّلُ
      [], // الأَرضُ
      [], // غَيرَ
      [], // الأَرضِ
      [], // وَالسَّمـٰوٰتُ
      [], // وَبَرَزوا
      [], // لِلَّهِ
      [], // الوٰحِدِ
      [] // القَهّارِ
    ],
    [ // آية 49
      [], // وَتَرَى
      [], // المُجرِمينَ
      [], // يَومَئِذٍ
      ["مقرّنين : مقرونا بعضهم مع بعض"], // مُقَرَّنينَ
      [], // فِى
      ["الأصفاد : القيود أو الأغلال"] // الأَصفادِ
    ],
    [ // آية 50
      ["سرابيلهم : قمصانهم أو ثيابهم"], // سَرابيلُهُم
      [], // مِن
      [], // قَطِرانٍ
      [], // وَتَغشىٰ
      [], // وُجوهَهُمُ
      [] // النّارُ
    ],
    [ // آية 51
      [], // لِيَجزِىَ
      [], // اللَّهُ
      [], // كُلَّ
      [], // نَفسٍ
      [], // ما
      [], // كَسَبَت
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَريعُ
      [] // الحِسابِ
    ],
    [ // آية 52
      [], // هـٰذا
      [], // بَلـٰغٌ
      [], // لِلنّاسِ
      [], // وَلِيُنذَروا
      [], // بِهِ
      [], // وَلِيَعلَموا
      [], // أَنَّما
      [], // هُوَ
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // وَلِيَذَّكَّرَ
      [], // أُولُوا
      [] // الأَلبـٰبِ
    ]
  ]
];

export default meanings;