const meanings = [
[ // آية 1
      [], // الر
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [], // وَقُرءانٍ
      [] // مُبينٍ
    ],
    [ // آية 2
      ["رُبَمَا : \"\"\"رُبّ\"\" للتقليل  و \"\"ما \"\" زائدة \""], // رُبَما
      [], // يَوَدُّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَو
      [], // كانوا
      [] // مُسلِمينَ
    ],
    [ // آية 3
      ["ذرهم : دعهم و اتركهم"], // ذَرهُم
      [], // يَأكُلوا
      [], // وَيَتَمَتَّعوا
      [], // وَيُلهِهِمُ
      [], // الأَمَلُ
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ],
    [ // آية 4
      [], // وَما
      [], // أَهلَكنا
      [], // مِن
      [], // قَريَةٍ
      [], // إِلّا
      [], // وَلَها
      [], // كِتابٌ
      [] // مَعلومٌ
    ],
    [ // آية 5
      [], // ما
      [], // تَسبِقُ
      [], // مِن
      [], // أُمَّةٍ
      [], // أَجَلَها
      [], // وَما
      [] // يَستَـٔخِرونَ
    ],
    [ // آية 6
      [], // وَقالوا
      [], // يـٰأَيُّهَا
      [], // الَّذى
      [], // نُزِّلَ
      [], // عَلَيهِ
      [], // الذِّكرُ
      [], // إِنَّكَ
      [] // لَمَجنونٌ
    ],
    [ // آية 7
      ["لو ما تأتينا : هلاّ تأتينا"], // لَو
      ["لو ما تأتينا : هلاّ تأتينا"], // ما
      ["لو ما تأتينا : هلاّ تأتينا"], // تَأتينا
      [], // بِالمَلـٰئِكَةِ
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 8
      [], // ما
      [], // نُنَزِّلُ
      [], // المَلـٰئِكَةَ
      ["إلا بالحق : إلا بالوجه الذي تقتضيه الحكمة"], // إِلّا
      ["إلا بالحق : إلا بالوجه الذي تقتضيه الحكمة"], // بِالحَقِّ
      [], // وَما
      [], // كانوا
      [], // إِذًا
      ["مُنظرين : مؤخّرين في العذاب"] // مُنظَرينَ
    ],
    [ // آية 9
      [], // إِنّا
      [], // نَحنُ
      [], // نَزَّلنَا
      ["الذّكر : القرآن"], // الذِّكرَ
      [], // وَإِنّا
      [], // لَهُ
      [] // لَحـٰفِظونَ
    ],
    [ // آية 10
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // فى
      ["شيع الأوّلين : فرق الأمم السّابقين"], // شِيَعِ
      ["شيع الأوّلين : فرق الأمم السّابقين"] // الأَوَّلينَ
    ],
    [ // آية 11
      [], // وَما
      [], // يَأتيهِم
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 12
      [], // كَذٰلِكَ
      ["نسلكه : ندخل الذّكر مستهزأ  به"], // نَسلُكُهُ
      [], // فى
      [], // قُلوبِ
      [] // المُجرِمينَ
    ],
    [ // آية 13
      [], // لا
      [], // يُؤمِنونَ
      [], // بِهِ
      [], // وَقَد
      ["خلت سنّة الأوّلين : مضت عادة الله بإهلاك المكذّبين"], // خَلَت
      ["خلت سنّة الأوّلين : مضت عادة الله بإهلاك المكذّبين"], // سُنَّةُ
      ["خلت سنّة الأوّلين : مضت عادة الله بإهلاك المكذّبين"] // الأَوَّلينَ
    ],
    [ // آية 14
      [], // وَلَو
      [], // فَتَحنا
      [], // عَلَيهِم
      [], // بابًا
      [], // مِنَ
      [], // السَّماءِ
      [], // فَظَلّوا
      [], // فيهِ
      ["يعرجون : يصعدون فيرون الملائكة و العجائب"] // يَعرُجونَ
    ],
    [ // آية 15
      [], // لَقالوا
      [], // إِنَّما
      [], // سُكِّرَت
      [], // أَبصـٰرُنا
      [], // بَل
      [], // نَحنُ
      ["قوم مسحورون : أصابنا محمّد بسحره"], // قَومٌ
      ["قوم مسحورون : أصابنا محمّد بسحره"] // مَسحورونَ
    ],
    [ // آية 16
      [], // وَلَقَد
      [], // جَعَلنا
      [], // فِى
      [], // السَّماءِ
      [], // بُروجًا
      [], // وَزَيَّنّـٰها
      [] // لِلنّـٰظِرينَ
    ],
    [ // آية 17
      [], // وَحَفِظنـٰها
      [], // مِن
      [], // كُلِّ
      [], // شَيطـٰنٍ
      ["رجيم : مطرود أو مرجوم بالنّجوم"] // رَجيمٍ
    ],
    [ // آية 18
      [], // إِلّا
      [], // مَنِ
      ["استرق السّمع : خطِف المسموع من الملإ الأعلى"], // استَرَقَ
      ["استرق السّمع : خطِف المسموع من الملإ الأعلى"], // السَّمعَ
      ["فأتبعه : أدركه و لحقه"], // فَأَتبَعَهُ
      ["شهاب : شُعلة نار منقضّة من السّماء"], // شِهابٌ
      ["مبين : ظاهر للمبصرين"] // مُبينٌ
    ],
    [ // آية 19
      [], // وَالأَرضَ
      [], // مَدَدنـٰها
      [], // وَأَلقَينا
      [], // فيها
      [], // رَوٰسِىَ
      [], // وَأَنبَتنا
      [], // فيها
      [], // مِن
      [], // كُلِّ
      [], // شَىءٍ
      ["موزون : مقدّر بميزان الحكمة"] // مَوزونٍ
    ],
    [ // آية 20
      [], // وَجَعَلنا
      [], // لَكُم
      [], // فيها
      [], // مَعـٰيِشَ
      [], // وَمَن
      [], // لَستُم
      [], // لَهُ
      [] // بِرٰزِقينَ
    ],
    [ // آية 21
      [], // وَإِن
      [], // مِن
      [], // شَىءٍ
      [], // إِلّا
      [], // عِندَنا
      [], // خَزائِنُهُ
      [], // وَما
      ["ننزّله : نوجده أو نعطيه"], // نُنَزِّلُهُ
      [], // إِلّا
      ["بقدر معلوم : بمقدار معيّن"], // بِقَدَرٍ
      ["بقدر معلوم : بمقدار معيّن"] // مَعلومٍ
    ],
    [ // آية 22
      [], // وَأَرسَلنَا
      [], // الرِّيـٰحَ
      [], // لَوٰقِحَ
      [], // فَأَنزَلنا
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَسقَينـٰكُموهُ
      [], // وَما
      [], // أَنتُم
      [], // لَهُ
      [] // بِخـٰزِنينَ
    ],
    [ // آية 23
      [], // وَإِنّا
      [], // لَنَحنُ
      [], // نُحيۦ
      [], // وَنُميتُ
      [], // وَنَحنُ
      [] // الوٰرِثونَ
    ],
    [ // آية 24
      [], // وَلَقَد
      [], // عَلِمنَا
      [], // المُستَقدِمينَ
      [], // مِنكُم
      [], // وَلَقَد
      [], // عَلِمنَا
      [] // المُستَـٔخِرينَ
    ],
    [ // آية 25
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // يَحشُرُهُم
      [], // إِنَّهُ
      [], // حَكيمٌ
      [] // عَليمٌ
    ],
    [ // آية 26
      [], // وَلَقَد
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // مِن
      [], // صَلصـٰلٍ
      [], // مِن
      ["حمإ : طين أسود متغيّر"], // حَمَإٍ
      ["مسنون : مصوّر صورة إنسان أجوف"] // مَسنونٍ
    ],
    [ // آية 27
      [], // وَالجانَّ
      [], // خَلَقنـٰهُ
      [], // مِن
      [], // قَبلُ
      [], // مِن
      ["نار السّموم : الرّيح الحارّة القاتلة"], // نارِ
      ["نار السّموم : الرّيح الحارّة القاتلة"] // السَّمومِ
    ],
    [ // آية 28
      [], // وَإِذ
      [], // قالَ
      [], // رَبُّكَ
      [], // لِلمَلـٰئِكَةِ
      [], // إِنّى
      [], // خـٰلِقٌ
      [], // بَشَرًا
      [], // مِن
      [], // صَلصـٰلٍ
      [], // مِن
      [], // حَمَإٍ
      [] // مَسنونٍ
    ],
    [ // آية 29
      [], // فَإِذا
      ["سوّيته : أتممت خلقه و هيأته لنفخ الروح"], // سَوَّيتُهُ
      [], // وَنَفَختُ
      [], // فيهِ
      [], // مِن
      [], // روحى
      [], // فَقَعوا
      [], // لَهُ
      [] // سـٰجِدينَ
    ],
    [ // آية 30
      [], // فَسَجَدَ
      [], // المَلـٰئِكَةُ
      [], // كُلُّهُم
      [] // أَجمَعونَ
    ],
    [ // آية 31
      [], // إِلّا
      [], // إِبليسَ
      ["أبى : امتنع تكبّرا"], // أَبىٰ
      [], // أَن
      [], // يَكونَ
      [], // مَعَ
      [] // السّـٰجِدينَ
    ],
    [ // آية 32
      [], // قالَ
      [], // يـٰإِبليسُ
      [], // ما
      [], // لَكَ
      [], // أَلّا
      [], // تَكونَ
      [], // مَعَ
      [] // السّـٰجِدينَ
    ],
    [ // آية 33
      [], // قالَ
      [], // لَم
      [], // أَكُن
      [], // لِأَسجُدَ
      [], // لِبَشَرٍ
      [], // خَلَقتَهُ
      [], // مِن
      [], // صَلصـٰلٍ
      [], // مِن
      [], // حَمَإٍ
      [] // مَسنونٍ
    ],
    [ // آية 34
      [], // قالَ
      [], // فَاخرُج
      [], // مِنها
      [], // فَإِنَّكَ
      ["رجيم : مطرود من الرّحمة أو مرجوم بالشّهب"] // رَجيمٌ
    ],
    [ // آية 35
      [], // وَإِنَّ
      [], // عَلَيكَ
      ["اللّعنة : الابعاد على سبيل السّخط"], // اللَّعنَةَ
      [], // إِلىٰ
      [], // يَومِ
      [] // الدّينِ
    ],
    [ // آية 36
      [], // قالَ
      [], // رَبِّ
      [], // فَأَنظِرنى
      [], // إِلىٰ
      [], // يَومِ
      [] // يُبعَثونَ
    ],
    [ // آية 37
      [], // قالَ
      [], // فَإِنَّكَ
      [], // مِنَ
      [] // المُنظَرينَ
    ],
    [ // آية 38
      [], // إِلىٰ
      [], // يَومِ
      ["الوقت المعلوم : وقت النّفخة الأولى"], // الوَقتِ
      ["الوقت المعلوم : وقت النّفخة الأولى"] // المَعلومِ
    ],
    [ // آية 39
      [], // قالَ
      [], // رَبِّ
      [], // بِما
      [], // أَغوَيتَنى
      [], // لَأُزَيِّنَنَّ
      [], // لَهُم
      [], // فِى
      [], // الأَرضِ
      [], // وَلَأُغوِيَنَّهُم
      [] // أَجمَعينَ
    ],
    [ // آية 40
      [], // إِلّا
      [], // عِبادَكَ
      [], // مِنهُمُ
      ["المخلصين : الذين أخلصتهم لطاعتك"] // المُخلَصينَ
    ],
    [ // آية 41
      [], // قالَ
      [], // هـٰذا
      [], // صِرٰطٌ
      [], // عَلَىَّ
      [] // مُستَقيمٌ
    ],
    [ // آية 42
      [], // إِنَّ
      [], // عِبادى
      [], // لَيسَ
      [], // لَكَ
      [], // عَلَيهِم
      [], // سُلطـٰنٌ
      [], // إِلّا
      [], // مَنِ
      [], // اتَّبَعَكَ
      [], // مِنَ
      [] // الغاوينَ
    ],
    [ // آية 43
      [], // وَإِنَّ
      [], // جَهَنَّمَ
      [], // لَمَوعِدُهُم
      [] // أَجمَعينَ
    ],
    [ // آية 44
      [], // لَها
      [], // سَبعَةُ
      [], // أَبوٰبٍ
      [], // لِكُلِّ
      [], // بابٍ
      [], // مِنهُم
      ["جزء مقسوم : فريق معيّن متميّز عن غيره"], // جُزءٌ
      ["جزء مقسوم : فريق معيّن متميّز عن غيره"] // مَقسومٌ
    ],
    [ // آية 45
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 46
      [], // ادخُلوها
      [], // بِسَلـٰمٍ
      [] // ءامِنينَ
    ],
    [ // آية 47
      [], // وَنَزَعنا
      [], // ما
      [], // فى
      [], // صُدورِهِم
      [], // مِن
      ["غلّ : حقد و ضغينة و عداوة"], // غِلٍّ
      [], // إِخوٰنًا
      [], // عَلىٰ
      [], // سُرُرٍ
      [] // مُتَقـٰبِلينَ
    ],
    [ // آية 48
      [], // لا
      [], // يَمَسُّهُم
      [], // فيها
      ["نصب : تعب و إعياء"], // نَصَبٌ
      [], // وَما
      [], // هُم
      [], // مِنها
      [] // بِمُخرَجينَ
    ],
    [ // آية 49
      [], // نَبِّئ
      [], // عِبادى
      [], // أَنّى
      [], // أَنَا
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 50
      [], // وَأَنَّ
      [], // عَذابى
      [], // هُوَ
      [], // العَذابُ
      [] // الأَليمُ
    ],
    [ // آية 51
      [], // وَنَبِّئهُم
      [], // عَن
      [], // ضَيفِ
      [] // إِبرٰهيمَ
    ],
    [ // آية 52
      [], // إِذ
      [], // دَخَلوا
      [], // عَلَيهِ
      [], // فَقالوا
      [], // سَلـٰمًا
      [], // قالَ
      [], // إِنّا
      [], // مِنكُم
      ["وجلون : خائفون فزعون"] // وَجِلونَ
    ],
    [ // آية 53
      [], // قالوا
      [], // لا
      [], // تَوجَل
      [], // إِنّا
      [], // نُبَشِّرُكَ
      [], // بِغُلـٰمٍ
      [] // عَليمٍ
    ],
    [ // آية 54
      [], // قالَ
      [], // أَبَشَّرتُمونى
      [], // عَلىٰ
      [], // أَن
      [], // مَسَّنِىَ
      [], // الكِبَرُ
      [], // فَبِمَ
      [] // تُبَشِّرونَ
    ],
    [ // آية 55
      [], // قالوا
      [], // بَشَّرنـٰكَ
      [], // بِالحَقِّ
      [], // فَلا
      [], // تَكُن
      [], // مِنَ
      [] // القـٰنِطينَ
    ],
    [ // آية 56
      [], // قالَ
      [], // وَمَن
      [], // يَقنَطُ
      [], // مِن
      [], // رَحمَةِ
      [], // رَبِّهِ
      [], // إِلَّا
      [] // الضّالّونَ
    ],
    [ // آية 57
      [], // قالَ
      [], // فَما
      [], // خَطبُكُم
      [], // أَيُّهَا
      [] // المُرسَلونَ
    ],
    [ // آية 58
      [], // قالوا
      [], // إِنّا
      [], // أُرسِلنا
      [], // إِلىٰ
      [], // قَومٍ
      [] // مُجرِمينَ
    ],
    [ // آية 59
      [], // إِلّا
      [], // ءالَ
      [], // لوطٍ
      [], // إِنّا
      [], // لَمُنَجّوهُم
      [] // أَجمَعينَ
    ],
    [ // آية 60
      [], // إِلَّا
      [], // امرَأَتَهُ
      ["قدّرنا : علِمنا أو قضينا و حكمنا"], // قَدَّرنا
      [], // إِنَّها
      [], // لَمِنَ
      [] // الغـٰبِرينَ
    ],
    [ // آية 61
      [], // فَلَمّا
      [], // جاءَ
      [], // ءالَ
      [], // لوطٍ
      [] // المُرسَلونَ
    ],
    [ // آية 62
      [], // قالَ
      [], // إِنَّكُم
      ["قوم منكرون : أُنكرُكم و لا أعرفكم"], // قَومٌ
      ["قوم منكرون : أُنكرُكم و لا أعرفكم"] // مُنكَرونَ
    ],
    [ // آية 63
      [], // قالوا
      [], // بَل
      [], // جِئنـٰكَ
      [], // بِما
      [], // كانوا
      ["فيه يمترون : يشكّون و يكذّبونك فيه"], // فيهِ
      ["فيه يمترون : يشكّون و يكذّبونك فيه"] // يَمتَرونَ
    ],
    [ // آية 64
      [], // وَأَتَينـٰكَ
      [], // بِالحَقِّ
      [], // وَإِنّا
      [] // لَصـٰدِقونَ
    ],
    [ // آية 65
      [], // فَأَسرِ
      [], // بِأَهلِكَ
      [], // بِقِطعٍ
      [], // مِنَ
      [], // الَّيلِ
      [], // وَاتَّبِع
      [], // أَدبـٰرَهُم
      [], // وَلا
      [], // يَلتَفِت
      [], // مِنكُم
      [], // أَحَدٌ
      [], // وَامضوا
      [], // حَيثُ
      [] // تُؤمَرونَ
    ],
    [ // آية 66
      [], // وَقَضَينا
      [], // إِلَيهِ
      [], // ذٰلِكَ
      [], // الأَمرَ
      [], // أَنَّ
      [], // دابِرَ
      [], // هـٰؤُلاءِ
      [], // مَقطوعٌ
      ["مصبحين : داخلين في وقت الصّباح"] // مُصبِحينَ
    ],
    [ // آية 67
      [], // وَجاءَ
      [], // أَهلُ
      [], // المَدينَةِ
      [] // يَستَبشِرونَ
    ],
    [ // آية 68
      [], // قالَ
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      [], // ضَيفى
      [], // فَلا
      [] // تَفضَحونِ
    ],
    [ // آية 69
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // وَلا
      [] // تُخزونِ
    ],
    [ // آية 70
      [], // قالوا
      [], // أَوَلَم
      [], // نَنهَكَ
      [], // عَنِ
      [] // العـٰلَمينَ
    ],
    [ // آية 71
      [], // قالَ
      [], // هـٰؤُلاءِ
      [], // بَناتى
      [], // إِن
      [], // كُنتُم
      [] // فـٰعِلينَ
    ],
    [ // آية 72
      ["لعمرُك : قسم من الله بحياة نبيّنا صلى الله عليه و سلم"], // لَعَمرُكَ
      [], // إِنَّهُم
      [], // لَفى
      ["سكرتهم : غوايتهم و ضلالتهم"], // سَكرَتِهِم
      ["يعمهون : يعمون عن الرّشد أو يتحيّرون"] // يَعمَهونَ
    ],
    [ // آية 73
      [], // فَأَخَذَتهُمُ
      ["الصّيحة : صوت مُهلك من السّماء"], // الصَّيحَةُ
      ["مُشرقين : داخلين في وقت الشّروق"] // مُشرِقينَ
    ],
    [ // آية 74
      [], // فَجَعَلنا
      [], // عـٰلِيَها
      [], // سافِلَها
      [], // وَأَمطَرنا
      [], // عَلَيهِم
      [], // حِجارَةً
      [], // مِن
      ["سجّيل : طين مُتحجّر طُبِخ بالنّار"] // سِجّيلٍ
    ],
    [ // آية 75
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      ["للمتوسّمين : للمتفرّسين المُتأمّلين"] // لِلمُتَوَسِّمينَ
    ],
    [ // آية 76
      [], // وَإِنَّها
      ["لبسبيل مقيم : طريق ثابت مُعلم مسلوك"], // لَبِسَبيلٍ
      ["لبسبيل مقيم : طريق ثابت مُعلم مسلوك"] // مُقيمٍ
    ],
    [ // آية 77
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 78
      [], // وَإِن
      [], // كانَ
      [], // أَصحـٰبُ
      [], // الأَيكَةِ
      [] // لَظـٰلِمينَ
    ],
    [ // آية 79
      [], // فَانتَقَمنا
      [], // مِنهُم
      [], // وَإِنَّهُما
      ["لبإمام مبين : لبطريق واضح يأتمّون به في أسفارهم"], // لَبِإِمامٍ
      ["لبإمام مبين : لبطريق واضح يأتمّون به في أسفارهم"] // مُبينٍ
    ],
    [ // آية 80
      [], // وَلَقَد
      [], // كَذَّبَ
      [], // أَصحـٰبُ
      ["الحِجر : ديار ثمود بين المدينة و الشام"], // الحِجرِ
      [] // المُرسَلينَ
    ],
    [ // آية 81
      [], // وَءاتَينـٰهُم
      [], // ءايـٰتِنا
      [], // فَكانوا
      [], // عَنها
      [] // مُعرِضينَ
    ],
    [ // آية 82
      [], // وَكانوا
      [], // يَنحِتونَ
      [], // مِنَ
      [], // الجِبالِ
      [], // بُيوتًا
      [] // ءامِنينَ
    ],
    [ // آية 83
      [], // فَأَخَذَتهُمُ
      [], // الصَّيحَةُ
      ["مصبحين : داخلين في وقت الصّباح"] // مُصبِحينَ
    ],
    [ // آية 84
      [], // فَما
      [], // أَغنىٰ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 85
      [], // وَما
      [], // خَلَقنَا
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَإِنَّ
      [], // السّاعَةَ
      [], // لَـٔاتِيَةٌ
      [], // فَاصفَحِ
      [], // الصَّفحَ
      [] // الجَميلَ
    ],
    [ // آية 86
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // الخَلّـٰقُ
      [] // العَليمُ
    ],
    [ // آية 87
      [], // وَلَقَد
      [], // ءاتَينـٰكَ
      ["سبعا : سبع آيات و هي الفاتحة"], // سَبعًا
      [], // مِنَ
      [], // المَثانى
      [], // وَالقُرءانَ
      [] // العَظيمَ
    ],
    [ // آية 88
      [], // لا
      [], // تَمُدَّنَّ
      [], // عَينَيكَ
      [], // إِلىٰ
      [], // ما
      [], // مَتَّعنا
      [], // بِهِ
      [], // أَزوٰجًا
      [], // مِنهُم
      [], // وَلا
      [], // تَحزَن
      [], // عَلَيهِم
      [], // وَاخفِض
      [], // جَناحَكَ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 89
      [], // وَقُل
      [], // إِنّى
      [], // أَنَا
      [], // النَّذيرُ
      [] // المُبينُ
    ],
    [ // آية 90
      [], // كَما
      [], // أَنزَلنا
      [], // عَلَى
      ["المقتسمين : أهل الكتاب"] // المُقتَسِمينَ
    ],
    [ // آية 91
      [], // الَّذينَ
      [], // جَعَلُوا
      [], // القُرءانَ
      ["عضين : أعضاءً و أجزاءً ، فآمنوا ببعض و كفروا ببعض"] // عِضينَ
    ],
    [ // آية 92
      [], // فَوَرَبِّكَ
      [], // لَنَسـَٔلَنَّهُم
      [] // أَجمَعينَ
    ],
    [ // آية 93
      [], // عَمّا
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 94
      ["فاصدع بما تؤمر : فاجهر به أو فامضه و نفّذه"], // فَاصدَع
      ["فاصدع بما تؤمر : فاجهر به أو فامضه و نفّذه"], // بِما
      ["فاصدع بما تؤمر : فاجهر به أو فامضه و نفّذه"], // تُؤمَرُ
      [], // وَأَعرِض
      [], // عَنِ
      [] // المُشرِكينَ
    ],
    [ // آية 95
      [], // إِنّا
      [], // كَفَينـٰكَ
      [] // المُستَهزِءينَ
    ],
    [ // آية 96
      [], // الَّذينَ
      [], // يَجعَلونَ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ],
    [ // آية 97
      [], // وَلَقَد
      [], // نَعلَمُ
      [], // أَنَّكَ
      [], // يَضيقُ
      [], // صَدرُكَ
      [], // بِما
      [] // يَقولونَ
    ],
    [ // آية 98
      [], // فَسَبِّح
      [], // بِحَمدِ
      [], // رَبِّكَ
      [], // وَكُن
      [], // مِنَ
      [] // السّـٰجِدينَ
    ],
    [ // آية 99
      [], // وَاعبُد
      [], // رَبَّكَ
      [], // حَتّىٰ
      [], // يَأتِيَكَ
      ["اليقين : الموت المُتيقّن وقوعه"] // اليَقينُ
    ]
];

export default meanings;