const meanings = [
[ // آية 1
      [], // أَتىٰ
      [], // أَمرُ
      [], // اللَّهِ
      [], // فَلا
      [], // تَستَعجِلوهُ
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 2
      [], // يُنَزِّلُ
      [], // المَلـٰئِكَةَ
      ["بالرّوح : بالوحي و منه القرآن العظيم"], // بِالرّوحِ
      [], // مِن
      [], // أَمرِهِ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // أَن
      [], // أَنذِروا
      [], // أَنَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // أَنا۠
      [] // فَاتَّقونِ
    ],
    [ // آية 3
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // تَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 4
      [], // خَلَقَ
      [], // الإِنسـٰنَ
      [], // مِن
      ["نطفة : ماء مهين"], // نُطفَةٍ
      [], // فَإِذا
      ["هو خصيمٌ : شديد الخصومة بالباطل"], // هُوَ
      ["هو خصيمٌ : شديد الخصومة بالباطل"], // خَصيمٌ
      [] // مُبينٌ
    ],
    [ // آية 5
      [], // وَالأَنعـٰمَ
      [], // خَلَقَها
      [], // لَكُم
      [], // فيها
      [], // دِفءٌ
      [], // وَمَنـٰفِعُ
      [], // وَمِنها
      [] // تَأكُلونَ
    ],
    [ // آية 6
      [], // وَلَكُم
      ["فيها جمال : تجمّل و تزيّن و وجاهة"], // فيها
      ["فيها جمال : تجمّل و تزيّن و وجاهة"], // جَمالٌ
      ["حين تريحون : تردّونها بالعشيّ إلى المُراح"], // حينَ
      ["حين تريحون : تردّونها بالعشيّ إلى المُراح"], // تُريحونَ
      [], // وَحينَ
      [] // تَسرَحونَ
    ],
    [ // آية 7
      [], // وَتَحمِلُ
      [], // أَثقالَكُم
      [], // إِلىٰ
      [], // بَلَدٍ
      [], // لَم
      [], // تَكونوا
      [], // بـٰلِغيهِ
      [], // إِلّا
      ["بشقّ الأنفس : بمشقّتها و تعبها"], // بِشِقِّ
      ["بشقّ الأنفس : بمشقّتها و تعبها"], // الأَنفُسِ
      [], // إِنَّ
      [], // رَبَّكُم
      [], // لَرَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 8
      [], // وَالخَيلَ
      [], // وَالبِغالَ
      [], // وَالحَميرَ
      [], // لِتَركَبوها
      [], // وَزينَةً
      [], // وَيَخلُقُ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 9
      [], // وَعَلَى
      [], // اللَّهِ
      ["قصد السّبيل : بيان الطريق القاصد المستقيم"], // قَصدُ
      ["قصد السّبيل : بيان الطريق القاصد المستقيم"], // السَّبيلِ
      [], // وَمِنها
      [], // جائِرٌ
      [], // وَلَو
      [], // شاءَ
      [], // لَهَدىٰكُم
      [] // أَجمَعينَ
    ],
    [ // آية 10
      [], // هُوَ
      [], // الَّذى
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // لَكُم
      [], // مِنهُ
      [], // شَرابٌ
      [], // وَمِنهُ
      [], // شَجَرٌ
      [], // فيهِ
      [] // تُسيمونَ
    ],
    [ // آية 11
      [], // يُنبِتُ
      [], // لَكُم
      [], // بِهِ
      [], // الزَّرعَ
      [], // وَالزَّيتونَ
      [], // وَالنَّخيلَ
      [], // وَالأَعنـٰبَ
      [], // وَمِن
      [], // كُلِّ
      [], // الثَّمَرٰتِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 12
      [], // وَسَخَّرَ
      [], // لَكُمُ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // وَالشَّمسَ
      [], // وَالقَمَرَ
      [], // وَالنُّجومُ
      [], // مُسَخَّرٰتٌ
      [], // بِأَمرِهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 13
      [], // وَما
      [], // ذَرَأَ
      [], // لَكُم
      [], // فِى
      [], // الأَرضِ
      [], // مُختَلِفًا
      [], // أَلوٰنُهُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَذَّكَّرونَ
    ],
    [ // آية 14
      [], // وَهُوَ
      [], // الَّذى
      [], // سَخَّرَ
      [], // البَحرَ
      [], // لِتَأكُلوا
      [], // مِنهُ
      [], // لَحمًا
      [], // طَرِيًّا
      [], // وَتَستَخرِجوا
      [], // مِنهُ
      [], // حِليَةً
      [], // تَلبَسونَها
      [], // وَتَرَى
      [], // الفُلكَ
      ["مواخر فيه : جواري فيه تشقّ الماء شقّا"], // مَواخِرَ
      ["مواخر فيه : جواري فيه تشقّ الماء شقّا"], // فيهِ
      [], // وَلِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // وَلَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 15
      [], // وَأَلقىٰ
      [], // فِى
      [], // الأَرضِ
      [], // رَوٰسِىَ
      ["أن تميد بكم : لئلا تتحرّك و تضطرب بكم"], // أَن
      ["أن تميد بكم : لئلا تتحرّك و تضطرب بكم"], // تَميدَ
      ["أن تميد بكم : لئلا تتحرّك و تضطرب بكم"], // بِكُم
      [], // وَأَنهـٰرًا
      [], // وَسُبُلًا
      [], // لَعَلَّكُم
      [] // تَهتَدونَ
    ],
    [ // آية 16
      [], // وَعَلـٰمـٰتٍ
      [], // وَبِالنَّجمِ
      [], // هُم
      [] // يَهتَدونَ
    ],
    [ // آية 17
      [], // أَفَمَن
      [], // يَخلُقُ
      [], // كَمَن
      [], // لا
      [], // يَخلُقُ
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 18
      [], // وَإِن
      [], // تَعُدّوا
      [], // نِعمَةَ
      [], // اللَّهِ
      [], // لا
      [], // تُحصوها
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 19
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // ما
      [], // تُسِرّونَ
      [], // وَما
      [] // تُعلِنونَ
    ],
    [ // آية 20
      [], // وَالَّذينَ
      [], // يَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // لا
      [], // يَخلُقونَ
      [], // شَيـًٔا
      [], // وَهُم
      [] // يُخلَقونَ
    ],
    [ // آية 21
      [], // أَموٰتٌ
      [], // غَيرُ
      [], // أَحياءٍ
      [], // وَما
      [], // يَشعُرونَ
      [], // أَيّانَ
      [] // يُبعَثونَ
    ],
    [ // آية 22
      [], // إِلـٰهُكُم
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // فَالَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // قُلوبُهُم
      [], // مُنكِرَةٌ
      [], // وَهُم
      [] // مُستَكبِرونَ
    ],
    [ // آية 23
      [], // لا
      [], // جَرَمَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // ما
      [], // يُسِرّونَ
      [], // وَما
      [], // يُعلِنونَ
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // المُستَكبِرينَ
    ],
    [ // آية 24
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُم
      [], // ماذا
      [], // أَنزَلَ
      [], // رَبُّكُم
      [], // قالوا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 25
      [], // لِيَحمِلوا
      ["أوزارهم : آثامهم و ذنوبهم"], // أَوزارَهُم
      [], // كامِلَةً
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَمِن
      [], // أَوزارِ
      [], // الَّذينَ
      [], // يُضِلّونَهُم
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // أَلا
      [], // ساءَ
      [], // ما
      [] // يَزِرونَ
    ],
    [ // آية 26
      [], // قَد
      [], // مَكَرَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَأَتَى
      [], // اللَّهُ
      [], // بُنيـٰنَهُم
      [], // مِنَ
      ["القواعد : الدعائم و العمد . أو الأساس"], // القَواعِدِ
      [], // فَخَرَّ
      [], // عَلَيهِمُ
      [], // السَّقفُ
      [], // مِن
      [], // فَوقِهِم
      [], // وَأَتىٰهُمُ
      [], // العَذابُ
      [], // مِن
      [], // حَيثُ
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 27
      [], // ثُمَّ
      [], // يَومَ
      [], // القِيـٰمَةِ
      ["يُخزيهم : يُذلّهم و يهينهم بالعذاب"], // يُخزيهِم
      [], // وَيَقولُ
      [], // أَينَ
      [], // شُرَكاءِىَ
      [], // الَّذينَ
      [], // كُنتُم
      [], // تُشـٰقّونَ
      [], // فيهِم
      [], // قالَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // إِنَّ
      [], // الخِزىَ
      [], // اليَومَ
      [], // وَالسّوءَ
      [], // عَلَى
      [] // الكـٰفِرينَ
    ],
    [ // آية 28
      [], // الَّذينَ
      [], // تَتَوَفّىٰهُمُ
      [], // المَلـٰئِكَةُ
      [], // ظالِمى
      [], // أَنفُسِهِم
      [], // فَأَلقَوُا
      [], // السَّلَمَ
      [], // ما
      [], // كُنّا
      [], // نَعمَلُ
      [], // مِن
      [], // سوءٍ
      [], // بَلىٰ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 29
      [], // فَادخُلوا
      [], // أَبوٰبَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // فَلَبِئسَ
      [], // مَثوَى
      [] // المُتَكَبِّرينَ
    ],
    [ // آية 30
      [], // وَقيلَ
      [], // لِلَّذينَ
      [], // اتَّقَوا
      [], // ماذا
      [], // أَنزَلَ
      [], // رَبُّكُم
      [], // قالوا
      [], // خَيرًا
      [], // لِلَّذينَ
      [], // أَحسَنوا
      [], // فى
      [], // هـٰذِهِ
      [], // الدُّنيا
      [], // حَسَنَةٌ
      [], // وَلَدارُ
      [], // الـٔاخِرَةِ
      [], // خَيرٌ
      [], // وَلَنِعمَ
      [], // دارُ
      [] // المُتَّقينَ
    ],
    [ // آية 31
      [], // جَنّـٰتُ
      [], // عَدنٍ
      [], // يَدخُلونَها
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // لَهُم
      [], // فيها
      [], // ما
      [], // يَشاءونَ
      [], // كَذٰلِكَ
      [], // يَجزِى
      [], // اللَّهُ
      [] // المُتَّقينَ
    ],
    [ // آية 32
      [], // الَّذينَ
      [], // تَتَوَفّىٰهُمُ
      [], // المَلـٰئِكَةُ
      ["طيّبين : طاهرين من دنسالشّرك و المعاصي"], // طَيِّبينَ
      [], // يَقولونَ
      [], // سَلـٰمٌ
      [], // عَلَيكُمُ
      [], // ادخُلُوا
      [], // الجَنَّةَ
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 33
      [], // هَل
      [], // يَنظُرونَ
      [], // إِلّا
      [], // أَن
      [], // تَأتِيَهُمُ
      [], // المَلـٰئِكَةُ
      [], // أَو
      [], // يَأتِىَ
      [], // أَمرُ
      [], // رَبِّكَ
      [], // كَذٰلِكَ
      [], // فَعَلَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَما
      [], // ظَلَمَهُمُ
      [], // اللَّهُ
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 34
      [], // فَأَصابَهُم
      [], // سَيِّـٔاتُ
      [], // ما
      [], // عَمِلوا
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 35
      [], // وَقالَ
      [], // الَّذينَ
      [], // أَشرَكوا
      [], // لَو
      [], // شاءَ
      [], // اللَّهُ
      [], // ما
      [], // عَبَدنا
      [], // مِن
      [], // دونِهِ
      [], // مِن
      [], // شَىءٍ
      [], // نَحنُ
      [], // وَلا
      [], // ءاباؤُنا
      [], // وَلا
      [], // حَرَّمنا
      [], // مِن
      [], // دونِهِ
      [], // مِن
      [], // شَىءٍ
      [], // كَذٰلِكَ
      [], // فَعَلَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَهَل
      [], // عَلَى
      [], // الرُّسُلِ
      [], // إِلَّا
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 36
      [], // وَلَقَد
      [], // بَعَثنا
      [], // فى
      [], // كُلِّ
      [], // أُمَّةٍ
      [], // رَسولًا
      [], // أَنِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // وَاجتَنِبُوا
      [], // الطّـٰغوتَ
      [], // فَمِنهُم
      [], // مَن
      [], // هَدَى
      [], // اللَّهُ
      [], // وَمِنهُم
      [], // مَن
      ["حقّت : ثبتت و وجبت"], // حَقَّت
      [], // عَلَيهِ
      [], // الضَّلـٰلَةُ
      [], // فَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَانظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُكَذِّبينَ
    ],
    [ // آية 37
      [], // إِن
      [], // تَحرِص
      [], // عَلىٰ
      [], // هُدىٰهُم
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدى
      [], // مَن
      [], // يُضِلُّ
      [], // وَما
      [], // لَهُم
      [], // مِن
      [] // نـٰصِرينَ
    ],
    [ // آية 38
      [], // وَأَقسَموا
      [], // بِاللَّهِ
      [], // جَهدَ
      [], // أَيمـٰنِهِم
      [], // لا
      [], // يَبعَثُ
      [], // اللَّهُ
      [], // مَن
      [], // يَموتُ
      [], // بَلىٰ
      [], // وَعدًا
      [], // عَلَيهِ
      [], // حَقًّا
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 39
      [], // لِيُبَيِّنَ
      [], // لَهُمُ
      [], // الَّذى
      [], // يَختَلِفونَ
      [], // فيهِ
      [], // وَلِيَعلَمَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَنَّهُم
      [], // كانوا
      [] // كـٰذِبينَ
    ],
    [ // آية 40
      [], // إِنَّما
      [], // قَولُنا
      [], // لِشَىءٍ
      [], // إِذا
      [], // أَرَدنـٰهُ
      [], // أَن
      [], // نَقولَ
      [], // لَهُ
      [], // كُن
      [] // فَيَكونُ
    ],
    [ // آية 41
      [], // وَالَّذينَ
      [], // هاجَروا
      [], // فِى
      [], // اللَّهِ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // ظُلِموا
      ["لنُبوّئنّهم : لننزلنّهم"], // لَنُبَوِّئَنَّهُم
      [], // فِى
      [], // الدُّنيا
      ["حسنةً : مباءة أو داراً أو عطيّة حسنة"], // حَسَنَةً
      [], // وَلَأَجرُ
      [], // الـٔاخِرَةِ
      [], // أَكبَرُ
      [], // لَو
      [], // كانوا
      [] // يَعلَمونَ
    ],
    [ // آية 42
      [], // الَّذينَ
      [], // صَبَروا
      [], // وَعَلىٰ
      [], // رَبِّهِم
      [] // يَتَوَكَّلونَ
    ],
    [ // آية 43
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // إِلّا
      [], // رِجالًا
      [], // نوحى
      [], // إِلَيهِم
      [], // فَسـَٔلوا
      [], // أَهلَ
      [], // الذِّكرِ
      [], // إِن
      [], // كُنتُم
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 44
      [], // بِالبَيِّنـٰتِ
      [], // وَالزُّبُرِ
      [], // وَأَنزَلنا
      [], // إِلَيكَ
      [], // الذِّكرَ
      [], // لِتُبَيِّنَ
      [], // لِلنّاسِ
      [], // ما
      [], // نُزِّلَ
      [], // إِلَيهِم
      [], // وَلَعَلَّهُم
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 45
      [], // أَفَأَمِنَ
      [], // الَّذينَ
      [], // مَكَرُوا
      [], // السَّيِّـٔاتِ
      [], // أَن
      [], // يَخسِفَ
      [], // اللَّهُ
      [], // بِهِمُ
      [], // الأَرضَ
      [], // أَو
      [], // يَأتِيَهُمُ
      [], // العَذابُ
      [], // مِن
      [], // حَيثُ
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 46
      [], // أَو
      [], // يَأخُذَهُم
      [], // فى
      ["تقلّبهم : أسفارهم و متاجرهم"], // تَقَلُّبِهِم
      [], // فَما
      [], // هُم
      ["بمُعجزين : فائتين من عذاب الله بالهرب"] // بِمُعجِزينَ
    ],
    [ // آية 47
      [], // أَو
      [], // يَأخُذَهُم
      [], // عَلىٰ
      ["تخوّف : مخافة من العذاب . أو تَنَقُّص"], // تَخَوُّفٍ
      [], // فَإِنَّ
      [], // رَبَّكُم
      [], // لَرَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 48
      [], // أَوَلَم
      [], // يَرَوا
      [], // إِلىٰ
      [], // ما
      [], // خَلَقَ
      [], // اللَّهُ
      [], // مِن
      [], // شَىءٍ
      [], // يَتَفَيَّؤُا۟
      [], // ظِلـٰلُهُ
      [], // عَنِ
      [], // اليَمينِ
      [], // وَالشَّمائِلِ
      ["سُجّدًا لله : منقادة لِحُكمه و تسخيره تعالى"], // سُجَّدًا
      ["سُجّدًا لله : منقادة لِحُكمه و تسخيره تعالى"], // لِلَّهِ
      [], // وَهُم
      [] // دٰخِرونَ
    ],
    [ // آية 49
      [], // وَلِلَّهِ
      [], // يَسجُدُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // مِن
      [], // دابَّةٍ
      [], // وَالمَلـٰئِكَةُ
      [], // وَهُم
      [], // لا
      [] // يَستَكبِرونَ
    ],
    [ // آية 50
      [], // يَخافونَ
      [], // رَبَّهُم
      [], // مِن
      [], // فَوقِهِم
      [], // وَيَفعَلونَ
      [], // ما
      [] // يُؤمَرونَ
    ],
    [ // آية 51
      [], // وَقالَ
      [], // اللَّهُ
      [], // لا
      [], // تَتَّخِذوا
      [], // إِلـٰهَينِ
      [], // اثنَينِ
      [], // إِنَّما
      [], // هُوَ
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // فَإِيّـٰىَ
      [] // فَارهَبونِ
    ],
    [ // آية 52
      [], // وَلَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلَهُ
      [], // الدّينُ
      ["واصبا : دائما واجبا لازما أو خالصا"], // واصِبًا
      [], // أَفَغَيرَ
      [], // اللَّهِ
      [] // تَتَّقونَ
    ],
    [ // آية 53
      [], // وَما
      [], // بِكُم
      [], // مِن
      [], // نِعمَةٍ
      [], // فَمِنَ
      [], // اللَّهِ
      [], // ثُمَّ
      [], // إِذا
      [], // مَسَّكُمُ
      [], // الضُّرُّ
      [], // فَإِلَيهِ
      [] // تَجـَٔرونَ
    ],
    [ // آية 54
      [], // ثُمَّ
      [], // إِذا
      [], // كَشَفَ
      [], // الضُّرَّ
      [], // عَنكُم
      [], // إِذا
      [], // فَريقٌ
      [], // مِنكُم
      [], // بِرَبِّهِم
      [] // يُشرِكونَ
    ],
    [ // آية 55
      [], // لِيَكفُروا
      [], // بِما
      [], // ءاتَينـٰهُم
      [], // فَتَمَتَّعوا
      [], // فَسَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 56
      [], // وَيَجعَلونَ
      [], // لِما
      [], // لا
      [], // يَعلَمونَ
      [], // نَصيبًا
      [], // مِمّا
      [], // رَزَقنـٰهُم
      [], // تَاللَّهِ
      [], // لَتُسـَٔلُنَّ
      [], // عَمّا
      [], // كُنتُم
      ["تفترون : تكذبونه على الله"] // تَفتَرونَ
    ],
    [ // آية 57
      [], // وَيَجعَلونَ
      [], // لِلَّهِ
      [], // البَنـٰتِ
      [], // سُبحـٰنَهُ
      [], // وَلَهُم
      [], // ما
      [] // يَشتَهونَ
    ],
    [ // آية 58
      [], // وَإِذا
      [], // بُشِّرَ
      [], // أَحَدُهُم
      [], // بِالأُنثىٰ
      [], // ظَلَّ
      [], // وَجهُهُ
      [], // مُسوَدًّا
      [], // وَهُوَ
      [] // كَظيمٌ
    ],
    [ // آية 59
      [], // يَتَوٰرىٰ
      [], // مِنَ
      [], // القَومِ
      [], // مِن
      [], // سوءِ
      [], // ما
      [], // بُشِّرَ
      [], // بِهِ
      [], // أَيُمسِكُهُ
      [], // عَلىٰ
      [], // هونٍ
      [], // أَم
      ["يدسّه : يُخفيه بالوأد فيدفنه حيّا"], // يَدُسُّهُ
      [], // فِى
      [], // التُّرابِ
      [], // أَلا
      [], // ساءَ
      [], // ما
      [] // يَحكُمونَ
    ],
    [ // آية 60
      [], // لِلَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      ["مثل السّوء : صفته القبيحة من الجهل و الكفر"], // مَثَلُ
      ["مثل السّوء : صفته القبيحة من الجهل و الكفر"], // السَّوءِ
      [], // وَلِلَّهِ
      [], // المَثَلُ
      [], // الأَعلىٰ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 61
      [], // وَلَو
      [], // يُؤاخِذُ
      [], // اللَّهُ
      [], // النّاسَ
      [], // بِظُلمِهِم
      [], // ما
      [], // تَرَكَ
      [], // عَلَيها
      [], // مِن
      [], // دابَّةٍ
      [], // وَلـٰكِن
      [], // يُؤَخِّرُهُم
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // فَإِذا
      [], // جاءَ
      [], // أَجَلُهُم
      [], // لا
      [], // يَستَـٔخِرونَ
      [], // ساعَةً
      [], // وَلا
      [] // يَستَقدِمونَ
    ],
    [ // آية 62
      [], // وَيَجعَلونَ
      [], // لِلَّهِ
      [], // ما
      [], // يَكرَهونَ
      [], // وَتَصِفُ
      [], // أَلسِنَتُهُمُ
      [], // الكَذِبَ
      [], // أَنَّ
      [], // لَهُمُ
      [], // الحُسنىٰ
      [], // لا
      [], // جَرَمَ
      [], // أَنَّ
      [], // لَهُمُ
      [], // النّارَ
      [], // وَأَنَّهُم
      ["مُفرطون : مُقدّمون معجّلٌ بهم إلى النار"] // مُفرَطونَ
    ],
    [ // آية 63
      [], // تَاللَّهِ
      [], // لَقَد
      [], // أَرسَلنا
      [], // إِلىٰ
      [], // أُمَمٍ
      [], // مِن
      [], // قَبلِكَ
      [], // فَزَيَّنَ
      [], // لَهُمُ
      [], // الشَّيطـٰنُ
      [], // أَعمـٰلَهُم
      [], // فَهُوَ
      [], // وَلِيُّهُمُ
      [], // اليَومَ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 64
      [], // وَما
      [], // أَنزَلنا
      [], // عَلَيكَ
      [], // الكِتـٰبَ
      [], // إِلّا
      [], // لِتُبَيِّنَ
      [], // لَهُمُ
      [], // الَّذِى
      [], // اختَلَفوا
      [], // فيهِ
      [], // وَهُدًى
      [], // وَرَحمَةً
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 65
      [], // وَاللَّهُ
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَحيا
      [], // بِهِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَسمَعونَ
    ],
    [ // آية 66
      [], // وَإِنَّ
      [], // لَكُم
      [], // فِى
      [], // الأَنعـٰمِ
      ["لعبرةً : لعظة عظيمة و دلالة على قدرتنا"], // لَعِبرَةً
      [], // نُسقيكُم
      [], // مِمّا
      [], // فى
      [], // بُطونِهِ
      [], // مِن
      [], // بَينِ
      ["فرث : ما في الكَرش من الثُّــفْـلِ"], // فَرثٍ
      [], // وَدَمٍ
      [], // لَبَنًا
      [], // خالِصًا
      [], // سائِغًا
      [] // لِلشّـٰرِبينَ
    ],
    [ // آية 67
      [], // وَمِن
      [], // ثَمَرٰتِ
      [], // النَّخيلِ
      [], // وَالأَعنـٰبِ
      [], // تَتَّخِذونَ
      [], // مِنهُ
      ["سكرًا : خمرا (ثمّ حُرّمت بالمدينة)"], // سَكَرًا
      [], // وَرِزقًا
      [], // حَسَنًا
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 68
      [], // وَأَوحىٰ
      [], // رَبُّكَ
      [], // إِلَى
      [], // النَّحلِ
      [], // أَنِ
      [], // اتَّخِذى
      [], // مِنَ
      [], // الجِبالِ
      ["بيوتًا : أوكارا تبنيها لِتعسِل فيها"], // بُيوتًا
      [], // وَمِنَ
      [], // الشَّجَرِ
      [], // وَمِمّا
      ["يعرشون : يَبني الناس من الخلايا للنّحل"] // يَعرِشونَ
    ],
    [ // آية 69
      [], // ثُمَّ
      [], // كُلى
      [], // مِن
      [], // كُلِّ
      [], // الثَّمَرٰتِ
      [], // فَاسلُكى
      [], // سُبُلَ
      [], // رَبِّكِ
      ["ذللا : مذلّلة مُسهّلة لك"], // ذُلُلًا
      [], // يَخرُجُ
      [], // مِن
      [], // بُطونِها
      [], // شَرابٌ
      [], // مُختَلِفٌ
      [], // أَلوٰنُهُ
      [], // فيهِ
      [], // شِفاءٌ
      [], // لِلنّاسِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 70
      [], // وَاللَّهُ
      [], // خَلَقَكُم
      [], // ثُمَّ
      [], // يَتَوَفّىٰكُم
      [], // وَمِنكُم
      [], // مَن
      [], // يُرَدُّ
      [], // إِلىٰ
      ["أرذل العمر : أردئه و أخسِّه (الخَرَف و الهرَم)"], // أَرذَلِ
      ["أرذل العمر : أردئه و أخسِّه (الخَرَف و الهرَم)"], // العُمُرِ
      [], // لِكَى
      [], // لا
      [], // يَعلَمَ
      [], // بَعدَ
      [], // عِلمٍ
      [], // شَيـًٔا
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [] // قَديرٌ
    ],
    [ // آية 71
      [], // وَاللَّهُ
      [], // فَضَّلَ
      [], // بَعضَكُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // فِى
      [], // الرِّزقِ
      [], // فَمَا
      [], // الَّذينَ
      [], // فُضِّلوا
      [], // بِرادّى
      [], // رِزقِهِم
      [], // عَلىٰ
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُهُم
      [], // فَهُم
      [], // فيهِ
      [], // سَواءٌ
      [], // أَفَبِنِعمَةِ
      [], // اللَّهِ
      [] // يَجحَدونَ
    ],
    [ // آية 72
      [], // وَاللَّهُ
      [], // جَعَلَ
      [], // لَكُم
      [], // مِن
      [], // أَنفُسِكُم
      [], // أَزوٰجًا
      [], // وَجَعَلَ
      [], // لَكُم
      [], // مِن
      [], // أَزوٰجِكُم
      [], // بَنينَ
      [], // وَحَفَدَةً
      [], // وَرَزَقَكُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // أَفَبِالبـٰطِلِ
      [], // يُؤمِنونَ
      [], // وَبِنِعمَتِ
      [], // اللَّهِ
      [], // هُم
      [] // يَكفُرونَ
    ],
    [ // آية 73
      [], // وَيَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَملِكُ
      [], // لَهُم
      [], // رِزقًا
      [], // مِنَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // شَيـًٔا
      [], // وَلا
      [] // يَستَطيعونَ
    ],
    [ // آية 74
      [], // فَلا
      [], // تَضرِبوا
      [], // لِلَّهِ
      [], // الأَمثالَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // وَأَنتُم
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 75
      [], // ضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // عَبدًا
      [], // مَملوكًا
      [], // لا
      [], // يَقدِرُ
      [], // عَلىٰ
      [], // شَىءٍ
      [], // وَمَن
      [], // رَزَقنـٰهُ
      [], // مِنّا
      [], // رِزقًا
      [], // حَسَنًا
      [], // فَهُوَ
      [], // يُنفِقُ
      [], // مِنهُ
      [], // سِرًّا
      [], // وَجَهرًا
      [], // هَل
      [], // يَستَوۥنَ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 76
      [], // وَضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // رَجُلَينِ
      ["أحدهما أبكم : أخرس خِلقة"], // أَحَدُهُما
      ["أحدهما أبكم : أخرس خِلقة"], // أَبكَمُ
      [], // لا
      [], // يَقدِرُ
      [], // عَلىٰ
      [], // شَىءٍ
      [], // وَهُوَ
      [], // كَلٌّ
      [], // عَلىٰ
      [], // مَولىٰهُ
      [], // أَينَما
      [], // يُوَجِّههُ
      [], // لا
      [], // يَأتِ
      [], // بِخَيرٍ
      [], // هَل
      [], // يَستَوى
      [], // هُوَ
      [], // وَمَن
      [], // يَأمُرُ
      [], // بِالعَدلِ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 77
      [], // وَلِلَّهِ
      [], // غَيبُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // أَمرُ
      [], // السّاعَةِ
      [], // إِلّا
      ["كلمح البصر : كخطفة بالبصر و اختلاس بالنّظر"], // كَلَمحِ
      ["كلمح البصر : كخطفة بالبصر و اختلاس بالنّظر"], // البَصَرِ
      [], // أَو
      [], // هُوَ
      [], // أَقرَبُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 78
      [], // وَاللَّهُ
      [], // أَخرَجَكُم
      [], // مِن
      [], // بُطونِ
      [], // أُمَّهـٰتِكُم
      [], // لا
      [], // تَعلَمونَ
      [], // شَيـًٔا
      [], // وَجَعَلَ
      [], // لَكُمُ
      [], // السَّمعَ
      [], // وَالأَبصـٰرَ
      [], // وَالأَفـِٔدَةَ
      [], // لَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 79
      [], // أَلَم
      [], // يَرَوا
      [], // إِلَى
      [], // الطَّيرِ
      [], // مُسَخَّرٰتٍ
      [], // فى
      [], // جَوِّ
      [], // السَّماءِ
      [], // ما
      [], // يُمسِكُهُنَّ
      [], // إِلَّا
      [], // اللَّهُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 80
      [], // وَاللَّهُ
      [], // جَعَلَ
      [], // لَكُم
      [], // مِن
      [], // بُيوتِكُم
      [], // سَكَنًا
      [], // وَجَعَلَ
      [], // لَكُم
      [], // مِن
      [], // جُلودِ
      [], // الأَنعـٰمِ
      [], // بُيوتًا
      ["تستخفونها : تجدونها خفيفة الحمل"], // تَستَخِفّونَها
      ["يوم ظعنكم : وقت ترحالكم"], // يَومَ
      ["يوم ظعنكم : وقت ترحالكم"], // ظَعنِكُم
      [], // وَيَومَ
      [], // إِقامَتِكُم
      [], // وَمِن
      [], // أَصوافِها
      [], // وَأَوبارِها
      [], // وَأَشعارِها
      [], // أَثـٰثًا
      [], // وَمَتـٰعًا
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 81
      [], // وَاللَّهُ
      [], // جَعَلَ
      [], // لَكُم
      [], // مِمّا
      [], // خَلَقَ
      [], // ظِلـٰلًا
      [], // وَجَعَلَ
      [], // لَكُم
      [], // مِنَ
      [], // الجِبالِ
      [], // أَكنـٰنًا
      [], // وَجَعَلَ
      [], // لَكُم
      [], // سَرٰبيلَ
      [], // تَقيكُمُ
      [], // الحَرَّ
      [], // وَسَرٰبيلَ
      ["تقيكم بأسكم : الضّرب و الطّعن في حروبكم"], // تَقيكُم
      ["تقيكم بأسكم : الضّرب و الطّعن في حروبكم"], // بَأسَكُم
      [], // كَذٰلِكَ
      [], // يُتِمُّ
      [], // نِعمَتَهُ
      [], // عَلَيكُم
      [], // لَعَلَّكُم
      [] // تُسلِمونَ
    ],
    [ // آية 82
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَإِنَّما
      [], // عَلَيكَ
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 83
      [], // يَعرِفونَ
      [], // نِعمَتَ
      [], // اللَّهِ
      [], // ثُمَّ
      [], // يُنكِرونَها
      [], // وَأَكثَرُهُمُ
      [] // الكـٰفِرونَ
    ],
    [ // آية 84
      [], // وَيَومَ
      [], // نَبعَثُ
      [], // مِن
      [], // كُلِّ
      [], // أُمَّةٍ
      [], // شَهيدًا
      [], // ثُمَّ
      [], // لا
      [], // يُؤذَنُ
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // وَلا
      [], // هُم
      [] // يُستَعتَبونَ
    ],
    [ // آية 85
      [], // وَإِذا
      [], // رَءَا
      [], // الَّذينَ
      [], // ظَلَمُوا
      [], // العَذابَ
      [], // فَلا
      [], // يُخَفَّفُ
      [], // عَنهُم
      [], // وَلا
      [], // هُم
      ["يُنظرون : يُمهَلون و يؤخّرون"] // يُنظَرونَ
    ],
    [ // آية 86
      [], // وَإِذا
      [], // رَءَا
      [], // الَّذينَ
      [], // أَشرَكوا
      [], // شُرَكاءَهُم
      [], // قالوا
      [], // رَبَّنا
      [], // هـٰؤُلاءِ
      [], // شُرَكاؤُنَا
      [], // الَّذينَ
      [], // كُنّا
      [], // نَدعوا
      [], // مِن
      [], // دونِكَ
      [], // فَأَلقَوا
      [], // إِلَيهِمُ
      [], // القَولَ
      [], // إِنَّكُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 87
      [], // وَأَلقَوا
      [], // إِلَى
      [], // اللَّهِ
      [], // يَومَئِذٍ
      ["السّلَم : الإستسلام و الإنقياد لحكمه تعالى"], // السَّلَمَ
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَفتَرونَ
    ],
    [ // آية 88
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَصَدّوا
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // زِدنـٰهُم
      [], // عَذابًا
      [], // فَوقَ
      [], // العَذابِ
      [], // بِما
      [], // كانوا
      [] // يُفسِدونَ
    ],
    [ // آية 89
      [], // وَيَومَ
      [], // نَبعَثُ
      [], // فى
      [], // كُلِّ
      [], // أُمَّةٍ
      [], // شَهيدًا
      [], // عَلَيهِم
      [], // مِن
      [], // أَنفُسِهِم
      [], // وَجِئنا
      [], // بِكَ
      [], // شَهيدًا
      [], // عَلىٰ
      [], // هـٰؤُلاءِ
      [], // وَنَزَّلنا
      [], // عَلَيكَ
      [], // الكِتـٰبَ
      [], // تِبيـٰنًا
      [], // لِكُلِّ
      [], // شَىءٍ
      [], // وَهُدًى
      [], // وَرَحمَةً
      [], // وَبُشرىٰ
      [] // لِلمُسلِمينَ
    ],
    [ // آية 90
      [], // إِنَّ
      [], // اللَّهَ
      ["يأمر بالعدل : بالإعتدال و التّوسّط في الأمور اعتقادا و عملا و خُلُقا"], // يَأمُرُ
      ["يأمر بالعدل : بالإعتدال و التّوسّط في الأمور اعتقادا و عملا و خُلُقا"], // بِالعَدلِ
      [], // وَالإِحسـٰنِ
      [], // وَإيتائِ
      [], // ذِى
      [], // القُربىٰ
      [], // وَيَنهىٰ
      [], // عَنِ
      ["الفحشاء : الذنوب المفرطة في القُبح"], // الفَحشاءِ
      [], // وَالمُنكَرِ
      [], // وَالبَغىِ
      [], // يَعِظُكُم
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 91
      [], // وَأَوفوا
      [], // بِعَهدِ
      [], // اللَّهِ
      [], // إِذا
      [], // عـٰهَدتُم
      [], // وَلا
      [], // تَنقُضُوا
      [], // الأَيمـٰنَ
      [], // بَعدَ
      [], // تَوكيدِها
      [], // وَقَد
      [], // جَعَلتُمُ
      [], // اللَّهَ
      [], // عَلَيكُم
      ["كفيلا : شاهدا . رقيبا . ضامِنا"], // كَفيلًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // ما
      [] // تَفعَلونَ
    ],
    [ // آية 92
      [], // وَلا
      [], // تَكونوا
      [], // كَالَّتى
      [], // نَقَضَت
      [], // غَزلَها
      [], // مِن
      [], // بَعدِ
      ["قوّة : إبرام و إحكام"], // قُوَّةٍ
      [], // أَنكـٰثًا
      [], // تَتَّخِذونَ
      [], // أَيمـٰنَكُم
      ["دخلا بينكم : مفسدة و خيانة و خديعة بينكم"], // دَخَلًا
      ["دخلا بينكم : مفسدة و خيانة و خديعة بينكم"], // بَينَكُم
      ["أن تكون أمّة : بأن تكون جماعة"], // أَن
      ["أن تكون أمّة : بأن تكون جماعة"], // تَكونَ
      ["أن تكون أمّة : بأن تكون جماعة"], // أُمَّةٌ
      [], // هِىَ
      [], // أَربىٰ
      [], // مِن
      [], // أُمَّةٍ
      [], // إِنَّما
      ["يبلوكم الله به : يختبركم به هل تفون بعهدكم"], // يَبلوكُمُ
      ["يبلوكم الله به : يختبركم به هل تفون بعهدكم"], // اللَّهُ
      ["يبلوكم الله به : يختبركم به هل تفون بعهدكم"], // بِهِ
      [], // وَلَيُبَيِّنَنَّ
      [], // لَكُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // ما
      [], // كُنتُم
      [], // فيهِ
      [] // تَختَلِفونَ
    ],
    [ // آية 93
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // لَجَعَلَكُم
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // وَلـٰكِن
      [], // يُضِلُّ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَهدى
      [], // مَن
      [], // يَشاءُ
      [], // وَلَتُسـَٔلُنَّ
      [], // عَمّا
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 94
      [], // وَلا
      [], // تَتَّخِذوا
      [], // أَيمـٰنَكُم
      [], // دَخَلًا
      [], // بَينَكُم
      ["فتزلّ قدم : فتزلّ أقدامُكم عن محجّة الإسلام"], // فَتَزِلَّ
      ["فتزلّ قدم : فتزلّ أقدامُكم عن محجّة الإسلام"], // قَدَمٌ
      [], // بَعدَ
      [], // ثُبوتِها
      [], // وَتَذوقُوا
      [], // السّوءَ
      [], // بِما
      [], // صَدَدتُم
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَلَكُم
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 95
      [], // وَلا
      [], // تَشتَروا
      [], // بِعَهدِ
      [], // اللَّهِ
      [], // ثَمَنًا
      [], // قَليلًا
      [], // إِنَّما
      [], // عِندَ
      [], // اللَّهِ
      [], // هُوَ
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 96
      [], // ما
      [], // عِندَكُم
      ["ينفد : ينقضي و يفنى و يزول"], // يَنفَدُ
      [], // وَما
      [], // عِندَ
      [], // اللَّهِ
      [], // باقٍ
      [], // وَلَنَجزِيَنَّ
      [], // الَّذينَ
      [], // صَبَروا
      [], // أَجرَهُم
      [], // بِأَحسَنِ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 97
      [], // مَن
      [], // عَمِلَ
      [], // صـٰلِحًا
      [], // مِن
      [], // ذَكَرٍ
      [], // أَو
      [], // أُنثىٰ
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَلَنُحيِيَنَّهُ
      [], // حَيوٰةً
      [], // طَيِّبَةً
      [], // وَلَنَجزِيَنَّهُم
      [], // أَجرَهُم
      [], // بِأَحسَنِ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 98
      [], // فَإِذا
      [], // قَرَأتَ
      [], // القُرءانَ
      ["فاستعذ بالله : فاعتصم به تعالى و الجأ إليه"], // فَاستَعِذ
      ["فاستعذ بالله : فاعتصم به تعالى و الجأ إليه"], // بِاللَّهِ
      [], // مِنَ
      [], // الشَّيطـٰنِ
      [] // الرَّجيمِ
    ],
    [ // آية 99
      [], // إِنَّهُ
      [], // لَيسَ
      [], // لَهُ
      [], // سُلطـٰنٌ
      [], // عَلَى
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَلىٰ
      [], // رَبِّهِم
      [] // يَتَوَكَّلونَ
    ],
    [ // آية 100
      [], // إِنَّما
      [], // سُلطـٰنُهُ
      [], // عَلَى
      [], // الَّذينَ
      ["يتولّونه : يتّخذونه وليّا مُطاعا"], // يَتَوَلَّونَهُ
      [], // وَالَّذينَ
      [], // هُم
      [], // بِهِ
      [] // مُشرِكونَ
    ],
    [ // آية 101
      [], // وَإِذا
      [], // بَدَّلنا
      [], // ءايَةً
      [], // مَكانَ
      [], // ءايَةٍ
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [], // يُنَزِّلُ
      [], // قالوا
      [], // إِنَّما
      [], // أَنتَ
      [], // مُفتَرٍ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 102
      [], // قُل
      [], // نَزَّلَهُ
      ["روح القدس : الرّوح المطهّر جبريل عليه السلام"], // روحُ
      ["روح القدس : الرّوح المطهّر جبريل عليه السلام"], // القُدُسِ
      [], // مِن
      [], // رَبِّكَ
      [], // بِالحَقِّ
      [], // لِيُثَبِّتَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَهُدًى
      [], // وَبُشرىٰ
      [] // لِلمُسلِمينَ
    ],
    [ // آية 103
      [], // وَلَقَد
      [], // نَعلَمُ
      [], // أَنَّهُم
      [], // يَقولونَ
      [], // إِنَّما
      [], // يُعَلِّمُهُ
      [], // بَشَرٌ
      [], // لِسانُ
      [], // الَّذى
      ["يُلحدون إليه : يُميلون و ينسُبُون إليه أنّه يُعلّمه"], // يُلحِدونَ
      ["يُلحدون إليه : يُميلون و ينسُبُون إليه أنّه يُعلّمه"], // إِلَيهِ
      [], // أَعجَمِىٌّ
      [], // وَهـٰذا
      [], // لِسانٌ
      [], // عَرَبِىٌّ
      [] // مُبينٌ
    ],
    [ // آية 104
      [], // إِنَّ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // لا
      [], // يَهديهِمُ
      [], // اللَّهُ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 105
      [], // إِنَّما
      [], // يَفتَرِى
      [], // الكَذِبَ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // الكـٰذِبونَ
    ],
    [ // آية 106
      [], // مَن
      [], // كَفَرَ
      [], // بِاللَّهِ
      [], // مِن
      [], // بَعدِ
      [], // إيمـٰنِهِ
      [], // إِلّا
      [], // مَن
      [], // أُكرِهَ
      [], // وَقَلبُهُ
      [], // مُطمَئِنٌّ
      [], // بِالإيمـٰنِ
      [], // وَلـٰكِن
      [], // مَن
      [], // شَرَحَ
      [], // بِالكُفرِ
      [], // صَدرًا
      [], // فَعَلَيهِم
      [], // غَضَبٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 107
      [], // ذٰلِكَ
      [], // بِأَنَّهُمُ
      ["استحبّوا : اختاروا و آثَروا"], // استَحَبُّوا
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // عَلَى
      [], // الـٔاخِرَةِ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 108
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      ["طبع : ختم"], // طَبَعَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // وَسَمعِهِم
      [], // وَأَبصـٰرِهِم
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // الغـٰفِلونَ
    ],
    [ // آية 109
      [], // لا
      [], // جَرَمَ
      [], // أَنَّهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 110
      [], // ثُمَّ
      [], // إِنَّ
      [], // رَبَّكَ
      ["للذين هاجروا : لهم بالولاية و النّصر لا عليهم"], // لِلَّذينَ
      ["للذين هاجروا : لهم بالولاية و النّصر لا عليهم"], // هاجَروا
      [], // مِن
      [], // بَعدِ
      [], // ما
      ["فُتنوا : ابتُلوا و عُذّبوا لإسلامهم"], // فُتِنوا
      [], // ثُمَّ
      [], // جـٰهَدوا
      [], // وَصَبَروا
      [], // إِنَّ
      [], // رَبَّكَ
      [], // مِن
      [], // بَعدِها
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 111
      [], // يَومَ
      [], // تَأتى
      [], // كُلُّ
      [], // نَفسٍ
      [], // تُجـٰدِلُ
      [], // عَن
      [], // نَفسِها
      [], // وَتُوَفّىٰ
      [], // كُلُّ
      [], // نَفسٍ
      [], // ما
      [], // عَمِلَت
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 112
      [], // وَضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // قَريَةً
      [], // كانَت
      [], // ءامِنَةً
      [], // مُطمَئِنَّةً
      [], // يَأتيها
      [], // رِزقُها
      ["رغدا : طيّبا واسعا أو هنيئا لا عناء فيه"], // رَغَدًا
      [], // مِن
      [], // كُلِّ
      [], // مَكانٍ
      [], // فَكَفَرَت
      [], // بِأَنعُمِ
      [], // اللَّهِ
      [], // فَأَذٰقَهَا
      [], // اللَّهُ
      [], // لِباسَ
      [], // الجوعِ
      [], // وَالخَوفِ
      [], // بِما
      [], // كانوا
      [] // يَصنَعونَ
    ],
    [ // آية 113
      [], // وَلَقَد
      [], // جاءَهُم
      [], // رَسولٌ
      [], // مِنهُم
      [], // فَكَذَّبوهُ
      [], // فَأَخَذَهُمُ
      [], // العَذابُ
      [], // وَهُم
      [] // ظـٰلِمونَ
    ],
    [ // آية 114
      [], // فَكُلوا
      [], // مِمّا
      [], // رَزَقَكُمُ
      [], // اللَّهُ
      [], // حَلـٰلًا
      [], // طَيِّبًا
      [], // وَاشكُروا
      [], // نِعمَتَ
      [], // اللَّهِ
      [], // إِن
      [], // كُنتُم
      [], // إِيّاهُ
      [] // تَعبُدونَ
    ],
    [ // آية 115
      [], // إِنَّما
      [], // حَرَّمَ
      [], // عَلَيكُمُ
      [], // المَيتَةَ
      [], // وَالدَّمَ
      [], // وَلَحمَ
      [], // الخِنزيرِ
      [], // وَما
      [], // أُهِلَّ
      [], // لِغَيرِ
      [], // اللَّهِ
      [], // بِهِ
      [], // فَمَنِ
      [], // اضطُرَّ
      ["غير باغ : غير طالب للمُحرّم للَذة إو استئثار"], // غَيرَ
      ["غير باغ : غير طالب للمُحرّم للَذة إو استئثار"], // باغٍ
      [], // وَلا
      [], // عادٍ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 116
      [], // وَلا
      [], // تَقولوا
      [], // لِما
      [], // تَصِفُ
      [], // أَلسِنَتُكُمُ
      [], // الكَذِبَ
      [], // هـٰذا
      [], // حَلـٰلٌ
      [], // وَهـٰذا
      [], // حَرامٌ
      [], // لِتَفتَروا
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَفتَرونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // لا
      [] // يُفلِحونَ
    ],
    [ // آية 117
      [], // مَتـٰعٌ
      [], // قَليلٌ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 118
      [], // وَعَلَى
      [], // الَّذينَ
      [], // هادوا
      [], // حَرَّمنا
      [], // ما
      [], // قَصَصنا
      [], // عَلَيكَ
      [], // مِن
      [], // قَبلُ
      [], // وَما
      [], // ظَلَمنـٰهُم
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 119
      [], // ثُمَّ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // لِلَّذينَ
      [], // عَمِلُوا
      [], // السّوءَ
      [], // بِجَهـٰلَةٍ
      [], // ثُمَّ
      [], // تابوا
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // وَأَصلَحوا
      [], // إِنَّ
      [], // رَبَّكَ
      [], // مِن
      [], // بَعدِها
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 120
      [], // إِنَّ
      [], // إِبرٰهيمَ
      ["كان أمّة : معلِّما للخير ، أو مؤمنا وحده"], // كانَ
      ["كان أمّة : معلِّما للخير ، أو مؤمنا وحده"], // أُمَّةً
      ["قانتا لله : مُطيعا خاضعا له تعالى"], // قانِتًا
      ["قانتا لله : مُطيعا خاضعا له تعالى"], // لِلَّهِ
      ["حنيفا : مائلا عن الباطل إلى الدّين الحقّ"], // حَنيفًا
      [], // وَلَم
      [], // يَكُ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 121
      [], // شاكِرًا
      [], // لِأَنعُمِهِ
      [], // اجتَبىٰهُ
      [], // وَهَدىٰهُ
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 122
      [], // وَءاتَينـٰهُ
      [], // فِى
      [], // الدُّنيا
      [], // حَسَنَةً
      [], // وَإِنَّهُ
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // لَمِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 123
      [], // ثُمَّ
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // أَنِ
      [], // اتَّبِع
      [], // مِلَّةَ
      [], // إِبرٰهيمَ
      [], // حَنيفًا
      [], // وَما
      [], // كانَ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 124
      [], // إِنَّما
      ["جُعِل السّبت : فُرض تعظيمُه و التّخلّي فيه للعبادة"], // جُعِلَ
      ["جُعِل السّبت : فُرض تعظيمُه و التّخلّي فيه للعبادة"], // السَّبتُ
      [], // عَلَى
      [], // الَّذينَ
      [], // اختَلَفوا
      [], // فيهِ
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَيَحكُمُ
      [], // بَينَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // فيما
      [], // كانوا
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 125
      [], // ادعُ
      [], // إِلىٰ
      [], // سَبيلِ
      [], // رَبِّكَ
      [], // بِالحِكمَةِ
      [], // وَالمَوعِظَةِ
      [], // الحَسَنَةِ
      [], // وَجـٰدِلهُم
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِمَن
      [], // ضَلَّ
      [], // عَن
      [], // سَبيلِهِ
      [], // وَهُوَ
      [], // أَعلَمُ
      [] // بِالمُهتَدينَ
    ],
    [ // آية 126
      [], // وَإِن
      [], // عاقَبتُم
      [], // فَعاقِبوا
      [], // بِمِثلِ
      [], // ما
      [], // عوقِبتُم
      [], // بِهِ
      [], // وَلَئِن
      [], // صَبَرتُم
      [], // لَهُوَ
      [], // خَيرٌ
      [] // لِلصّـٰبِرينَ
    ],
    [ // آية 127
      [], // وَاصبِر
      [], // وَما
      [], // صَبرُكَ
      [], // إِلّا
      [], // بِاللَّهِ
      [], // وَلا
      [], // تَحزَن
      [], // عَلَيهِم
      [], // وَلا
      [], // تَكُ
      [], // فى
      ["ضيْق : ضيق صدر و حَرَج"], // ضَيقٍ
      [], // مِمّا
      [] // يَمكُرونَ
    ],
    [ // آية 128
      [], // إِنَّ
      [], // اللَّهَ
      [], // مَعَ
      [], // الَّذينَ
      [], // اتَّقَوا
      [], // وَالَّذينَ
      [], // هُم
      [] // مُحسِنونَ
    ]
];

export default meanings;