const meanings = [
  [ // سورة 17: الإسراء
[ // آية 1
      [], // سُبحـٰنَ
      [], // الَّذى
      ["أسرى بعبده : جعَلَ البراق يسري به صلى الله عليه و سلم"], // أَسرىٰ
      ["أسرى بعبده : جعَلَ البراق يسري به صلى الله عليه و سلم"], // بِعَبدِهِ
      [], // لَيلًا
      [], // مِنَ
      [], // المَسجِدِ
      [], // الحَرامِ
      [], // إِلَى
      [], // المَسجِدِ
      [], // الأَقصَا
      [], // الَّذى
      [], // بـٰرَكنا
      [], // حَولَهُ
      [], // لِنُرِيَهُ
      [], // مِن
      [], // ءايـٰتِنا
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // البَصيرُ
    ],
    [ // آية 2
      [], // وَءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // وَجَعَلنـٰهُ
      [], // هُدًى
      [], // لِبَنى
      [], // إِسرٰءيلَ
      [], // أَلّا
      [], // تَتَّخِذوا
      [], // مِن
      [], // دونى
      ["وكيلا : ربّا تكلون إليه أموركم"] // وَكيلًا
    ],
    [ // آية 3
      [], // ذُرِّيَّةَ
      [], // مَن
      [], // حَمَلنا
      [], // مَعَ
      [], // نوحٍ
      [], // إِنَّهُ
      [], // كانَ
      [], // عَبدًا
      [] // شَكورًا
    ],
    [ // آية 4
      [], // وَقَضَينا
      [], // إِلىٰ
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // فِى
      [], // الكِتـٰبِ
      [], // لَتُفسِدُنَّ
      [], // فِى
      [], // الأَرضِ
      [], // مَرَّتَينِ
      [], // وَلَتَعلُنَّ
      [], // عُلُوًّا
      [] // كَبيرًا
    ],
    [ // آية 5
      [], // فَإِذا
      [], // جاءَ
      [], // وَعدُ
      [], // أولىٰهُما
      [], // بَعَثنا
      [], // عَلَيكُم
      [], // عِبادًا
      [], // لَنا
      [], // أُولى
      [], // بَأسٍ
      [], // شَديدٍ
      ["فجاسوا : تردّدوا لطلبكم باستقصاء"], // فَجاسوا
      [], // خِلـٰلَ
      [], // الدِّيارِ
      [], // وَكانَ
      [], // وَعدًا
      [] // مَفعولًا
    ],
    [ // آية 6
      [], // ثُمَّ
      [], // رَدَدنا
      [], // لَكُمُ
      ["الكَرّة : الدّولة و الغَلَبَة"], // الكَرَّةَ
      [], // عَلَيهِم
      [], // وَأَمدَدنـٰكُم
      [], // بِأَموٰلٍ
      [], // وَبَنينَ
      [], // وَجَعَلنـٰكُم
      ["أكثر نفيرا : أكثر عددا أو عشيرة من أعدائكم"], // أَكثَرَ
      ["أكثر نفيرا : أكثر عددا أو عشيرة من أعدائكم"] // نَفيرًا
    ],
    [ // آية 7
      [], // إِن
      [], // أَحسَنتُم
      [], // أَحسَنتُم
      [], // لِأَنفُسِكُم
      [], // وَإِن
      [], // أَسَأتُم
      [], // فَلَها
      [], // فَإِذا
      [], // جاءَ
      [], // وَعدُ
      [], // الـٔاخِرَةِ
      [], // لِيَسـۥـٔوا
      [], // وُجوهَكُم
      [], // وَلِيَدخُلُوا
      [], // المَسجِدَ
      [], // كَما
      [], // دَخَلوهُ
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // وَلِيُتَبِّروا
      ["ما علوْا : ما استولوا عليه"], // ما
      ["ما علوْا : ما استولوا عليه"], // عَلَوا
      [] // تَتبيرًا
    ],
    [ // آية 8
      [], // عَسىٰ
      [], // رَبُّكُم
      [], // أَن
      [], // يَرحَمَكُم
      [], // وَإِن
      [], // عُدتُم
      [], // عُدنا
      [], // وَجَعَلنا
      [], // جَهَنَّمَ
      [], // لِلكـٰفِرينَ
      [] // حَصيرًا
    ],
    [ // آية 9
      [], // إِنَّ
      [], // هـٰذَا
      [], // القُرءانَ
      [], // يَهدى
      [], // لِلَّتى
      [], // هِىَ
      [], // أَقوَمُ
      [], // وَيُبَشِّرُ
      [], // المُؤمِنينَ
      [], // الَّذينَ
      [], // يَعمَلونَ
      [], // الصّـٰلِحـٰتِ
      [], // أَنَّ
      [], // لَهُم
      [], // أَجرًا
      [] // كَبيرًا
    ],
    [ // آية 10
      [], // وَأَنَّ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // أَعتَدنا
      [], // لَهُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 11
      [], // وَيَدعُ
      [], // الإِنسـٰنُ
      [], // بِالشَّرِّ
      [], // دُعاءَهُ
      [], // بِالخَيرِ
      [], // وَكانَ
      [], // الإِنسـٰنُ
      [] // عَجولًا
    ],
    [ // آية 12
      [], // وَجَعَلنَا
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // ءايَتَينِ
      [], // فَمَحَونا
      [], // ءايَةَ
      [], // الَّيلِ
      [], // وَجَعَلنا
      [], // ءايَةَ
      [], // النَّهارِ
      [], // مُبصِرَةً
      [], // لِتَبتَغوا
      [], // فَضلًا
      [], // مِن
      [], // رَبِّكُم
      [], // وَلِتَعلَموا
      [], // عَدَدَ
      [], // السِّنينَ
      [], // وَالحِسابَ
      [], // وَكُلَّ
      [], // شَىءٍ
      [], // فَصَّلنـٰهُ
      [] // تَفصيلًا
    ],
    [ // آية 13
      [], // وَكُلَّ
      [], // إِنسـٰنٍ
      [], // أَلزَمنـٰهُ
      [], // طـٰئِرَهُ
      [], // فى
      [], // عُنُقِهِ
      [], // وَنُخرِجُ
      [], // لَهُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // كِتـٰبًا
      [], // يَلقىٰهُ
      [] // مَنشورًا
    ],
    [ // آية 14
      [], // اقرَأ
      [], // كِتـٰبَكَ
      [], // كَفىٰ
      [], // بِنَفسِكَ
      [], // اليَومَ
      [], // عَلَيكَ
      ["حسيبا : حاسبا و عادّا . أو محاسبا"] // حَسيبًا
    ],
    [ // آية 15
      [], // مَنِ
      [], // اهتَدىٰ
      [], // فَإِنَّما
      [], // يَهتَدى
      [], // لِنَفسِهِ
      [], // وَمَن
      [], // ضَلَّ
      [], // فَإِنَّما
      [], // يَضِلُّ
      [], // عَلَيها
      [], // وَلا
      [], // تَزِرُ
      [], // وازِرَةٌ
      [], // وِزرَ
      [], // أُخرىٰ
      [], // وَما
      [], // كُنّا
      [], // مُعَذِّبينَ
      [], // حَتّىٰ
      [], // نَبعَثَ
      [] // رَسولًا
    ],
    [ // آية 16
      [], // وَإِذا
      [], // أَرَدنا
      [], // أَن
      [], // نُهلِكَ
      [], // قَريَةً
      ["أمَرنا مُترفيها : أمرنا متنعّميها بطاعة الله"], // أَمَرنا
      ["أمَرنا مُترفيها : أمرنا متنعّميها بطاعة الله"], // مُترَفيها
      ["ففسقوا فيها : فتمرّدوا و عَصوْا"], // فَفَسَقوا
      ["ففسقوا فيها : فتمرّدوا و عَصوْا"], // فيها
      [], // فَحَقَّ
      [], // عَلَيهَا
      [], // القَولُ
      [], // فَدَمَّرنـٰها
      [] // تَدميرًا
    ],
    [ // آية 17
      [], // وَكَم
      [], // أَهلَكنا
      [], // مِنَ
      ["القرون : الأمم المكذبة"], // القُرونِ
      [], // مِن
      [], // بَعدِ
      [], // نوحٍ
      [], // وَكَفىٰ
      [], // بِرَبِّكَ
      [], // بِذُنوبِ
      [], // عِبادِهِ
      [], // خَبيرًا
      [] // بَصيرًا
    ],
    [ // آية 18
      [], // مَن
      [], // كانَ
      [], // يُريدُ
      [], // العاجِلَةَ
      [], // عَجَّلنا
      [], // لَهُ
      [], // فيها
      [], // ما
      [], // نَشاءُ
      [], // لِمَن
      [], // نُريدُ
      [], // ثُمَّ
      [], // جَعَلنا
      [], // لَهُ
      [], // جَهَنَّمَ
      [], // يَصلىٰها
      [], // مَذمومًا
      ["مدحورا : مطرودا مُبعدا من رحمة الله"] // مَدحورًا
    ],
    [ // آية 19
      [], // وَمَن
      [], // أَرادَ
      [], // الـٔاخِرَةَ
      [], // وَسَعىٰ
      [], // لَها
      [], // سَعيَها
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَأُولـٰئِكَ
      [], // كانَ
      [], // سَعيُهُم
      [] // مَشكورًا
    ],
    [ // آية 20
      ["كُلاّ نمِدّ : نزيد من العطاء مرّة بعد أخرى"], // كُلًّا
      ["كُلاّ نمِدّ : نزيد من العطاء مرّة بعد أخرى"], // نُمِدُّ
      [], // هـٰؤُلاءِ
      [], // وَهـٰؤُلاءِ
      [], // مِن
      [], // عَطاءِ
      [], // رَبِّكَ
      [], // وَما
      [], // كانَ
      [], // عَطاءُ
      [], // رَبِّكَ
      ["محظورا : ممنوعا عمّن يريده تعالى"] // مَحظورًا
    ],
    [ // آية 21
      [], // انظُر
      [], // كَيفَ
      [], // فَضَّلنا
      [], // بَعضَهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // وَلَلـٔاخِرَةُ
      [], // أَكبَرُ
      [], // دَرَجـٰتٍ
      [], // وَأَكبَرُ
      [] // تَفضيلًا
    ],
    [ // آية 22
      [], // لا
      [], // تَجعَل
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // فَتَقعُدَ
      [], // مَذمومًا
      ["مخذولا : غير منصور و لا مُعان من الله"] // مَخذولًا
    ],
    [ // آية 23
      [], // وَقَضىٰ
      [], // رَبُّكَ
      [], // أَلّا
      [], // تَعبُدوا
      [], // إِلّا
      [], // إِيّاهُ
      [], // وَبِالوٰلِدَينِ
      [], // إِحسـٰنًا
      [], // إِمّا
      [], // يَبلُغَنَّ
      [], // عِندَكَ
      [], // الكِبَرَ
      [], // أَحَدُهُما
      [], // أَو
      [], // كِلاهُما
      [], // فَلا
      [], // تَقُل
      [], // لَهُما
      ["أفّ : كلمة تضجُّر و كراهيّة و تبرّم"], // أُفٍّ
      [], // وَلا
      [], // تَنهَرهُما
      [], // وَقُل
      [], // لَهُما
      ["قولا كريما : حسنا جميلا ليّنا"], // قَولًا
      ["قولا كريما : حسنا جميلا ليّنا"] // كَريمًا
    ],
    [ // آية 24
      [], // وَاخفِض
      [], // لَهُما
      [], // جَناحَ
      [], // الذُّلِّ
      [], // مِنَ
      [], // الرَّحمَةِ
      [], // وَقُل
      [], // رَبِّ
      [], // ارحَمهُما
      [], // كَما
      [], // رَبَّيانى
      [] // صَغيرًا
    ],
    [ // آية 25
      [], // رَبُّكُم
      [], // أَعلَمُ
      [], // بِما
      [], // فى
      [], // نُفوسِكُم
      [], // إِن
      [], // تَكونوا
      [], // صـٰلِحينَ
      [], // فَإِنَّهُ
      [], // كانَ
      [], // لِلأَوّٰبينَ
      [] // غَفورًا
    ],
    [ // آية 26
      [], // وَءاتِ
      [], // ذَا
      [], // القُربىٰ
      [], // حَقَّهُ
      [], // وَالمِسكينَ
      [], // وَابنَ
      [], // السَّبيلِ
      [], // وَلا
      [], // تُبَذِّر
      [] // تَبذيرًا
    ],
    [ // آية 27
      [], // إِنَّ
      [], // المُبَذِّرينَ
      [], // كانوا
      [], // إِخوٰنَ
      [], // الشَّيـٰطينِ
      [], // وَكانَ
      [], // الشَّيطـٰنُ
      [], // لِرَبِّهِ
      [] // كَفورًا
    ],
    [ // آية 28
      [], // وَإِمّا
      [], // تُعرِضَنَّ
      [], // عَنهُمُ
      [], // ابتِغاءَ
      [], // رَحمَةٍ
      [], // مِن
      [], // رَبِّكَ
      [], // تَرجوها
      [], // فَقُل
      [], // لَهُم
      [], // قَولًا
      [] // مَيسورًا
    ],
    [ // آية 29
      [], // وَلا
      [], // تَجعَل
      ["يَدَك مغلولة : كناية عن الشّح"], // يَدَكَ
      ["يَدَك مغلولة : كناية عن الشّح"], // مَغلولَةً
      [], // إِلىٰ
      [], // عُنُقِكَ
      [], // وَلا
      ["تبسطها كلّ البسط : كناية عن التّبذير و الإسراف"], // تَبسُطها
      ["تبسطها كلّ البسط : كناية عن التّبذير و الإسراف"], // كُلَّ
      ["تبسطها كلّ البسط : كناية عن التّبذير و الإسراف"], // البَسطِ
      [], // فَتَقعُدَ
      [], // مَلومًا
      ["محسورا : نادما أو مُنقطعا بك مُعدما"] // مَحسورًا
    ],
    [ // آية 30
      [], // إِنَّ
      [], // رَبَّكَ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيَقدِرُ
      [], // إِنَّهُ
      [], // كانَ
      [], // بِعِبادِهِ
      [], // خَبيرًا
      [] // بَصيرًا
    ],
    [ // آية 31
      [], // وَلا
      [], // تَقتُلوا
      [], // أَولـٰدَكُم
      [], // خَشيَةَ
      [], // إِملـٰقٍ
      [], // نَحنُ
      [], // نَرزُقُهُم
      [], // وَإِيّاكُم
      [], // إِنَّ
      [], // قَتلَهُم
      [], // كانَ
      [], // خِطـًٔا
      [] // كَبيرًا
    ],
    [ // آية 32
      [], // وَلا
      [], // تَقرَبُوا
      [], // الزِّنىٰ
      [], // إِنَّهُ
      [], // كانَ
      [], // فـٰحِشَةً
      [], // وَساءَ
      [] // سَبيلًا
    ],
    [ // آية 33
      [], // وَلا
      [], // تَقتُلُوا
      [], // النَّفسَ
      [], // الَّتى
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَمَن
      [], // قُتِلَ
      [], // مَظلومًا
      [], // فَقَد
      [], // جَعَلنا
      [], // لِوَلِيِّهِ
      [], // سُلطـٰنًا
      [], // فَلا
      [], // يُسرِف
      [], // فِى
      [], // القَتلِ
      [], // إِنَّهُ
      [], // كانَ
      [] // مَنصورًا
    ],
    [ // آية 34
      [], // وَلا
      [], // تَقرَبوا
      [], // مالَ
      [], // اليَتيمِ
      [], // إِلّا
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // حَتّىٰ
      ["يبلغ أشدّه : قوّته على حفظ ماله و رشده فيه"], // يَبلُغَ
      ["يبلغ أشدّه : قوّته على حفظ ماله و رشده فيه"], // أَشُدَّهُ
      [], // وَأَوفوا
      [], // بِالعَهدِ
      [], // إِنَّ
      [], // العَهدَ
      [], // كانَ
      [] // مَسـٔولًا
    ],
    [ // آية 35
      [], // وَأَوفُوا
      [], // الكَيلَ
      [], // إِذا
      [], // كِلتُم
      [], // وَزِنوا
      ["بالقسطاس المستقيم : بالميزان العدل"], // بِالقِسطاسِ
      ["بالقسطاس المستقيم : بالميزان العدل"], // المُستَقيمِ
      [], // ذٰلِكَ
      [], // خَيرٌ
      [], // وَأَحسَنُ
      [] // تَأويلًا
    ],
    [ // آية 36
      [], // وَلا
      [], // تَقفُ
      [], // ما
      [], // لَيسَ
      [], // لَكَ
      [], // بِهِ
      [], // عِلمٌ
      [], // إِنَّ
      [], // السَّمعَ
      [], // وَالبَصَرَ
      [], // وَالفُؤادَ
      [], // كُلُّ
      [], // أُولـٰئِكَ
      [], // كانَ
      [], // عَنهُ
      [] // مَسـٔولًا
    ],
    [ // آية 37
      [], // وَلا
      [], // تَمشِ
      [], // فِى
      [], // الأَرضِ
      ["مرَحا : فرحا و بطرا و اختيالا و فخرا"], // مَرَحًا
      [], // إِنَّكَ
      [], // لَن
      [], // تَخرِقَ
      [], // الأَرضَ
      [], // وَلَن
      [], // تَبلُغَ
      [], // الجِبالَ
      [] // طولًا
    ],
    [ // آية 38
      [], // كُلُّ
      [], // ذٰلِكَ
      [], // كانَ
      [], // سَيِّئُهُ
      [], // عِندَ
      [], // رَبِّكَ
      [] // مَكروهًا
    ],
    [ // آية 39
      [], // ذٰلِكَ
      [], // مِمّا
      [], // أَوحىٰ
      [], // إِلَيكَ
      [], // رَبُّكَ
      [], // مِنَ
      [], // الحِكمَةِ
      [], // وَلا
      [], // تَجعَل
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // فَتُلقىٰ
      [], // فى
      [], // جَهَنَّمَ
      [], // مَلومًا
      ["مدحورا : مُبعدا من رحمة الله"] // مَدحورًا
    ],
    [ // آية 40
      [], // أَفَأَصفىٰكُم
      [], // رَبُّكُم
      [], // بِالبَنينَ
      [], // وَاتَّخَذَ
      [], // مِنَ
      [], // المَلـٰئِكَةِ
      [], // إِنـٰثًا
      [], // إِنَّكُم
      [], // لَتَقولونَ
      [], // قَولًا
      [] // عَظيمًا
    ],
    [ // آية 41
      [], // وَلَقَد
      ["صرّفنا : كرّرنا القول بأساليب مختلفة"], // صَرَّفنا
      [], // فى
      [], // هـٰذَا
      [], // القُرءانِ
      [], // لِيَذَّكَّروا
      [], // وَما
      [], // يَزيدُهُم
      [], // إِلّا
      ["نفورا : تباعُدا و إعراضا عن الحقّ"] // نُفورًا
    ],
    [ // آية 42
      [], // قُل
      [], // لَو
      [], // كانَ
      [], // مَعَهُ
      [], // ءالِهَةٌ
      [], // كَما
      [], // يَقولونَ
      [], // إِذًا
      ["لابتغوْا : لَطلبوا"], // لَابتَغَوا
      [], // إِلىٰ
      [], // ذِى
      [], // العَرشِ
      ["سبيلا : بالمُغالبة و الممانعة"] // سَبيلًا
    ],
    [ // آية 43
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [], // يَقولونَ
      [], // عُلُوًّا
      [] // كَبيرًا
    ],
    [ // آية 44
      [], // تُسَبِّحُ
      [], // لَهُ
      [], // السَّمـٰوٰتُ
      [], // السَّبعُ
      [], // وَالأَرضُ
      [], // وَمَن
      [], // فيهِنَّ
      [], // وَإِن
      [], // مِن
      [], // شَىءٍ
      [], // إِلّا
      [], // يُسَبِّحُ
      [], // بِحَمدِهِ
      [], // وَلـٰكِن
      [], // لا
      [], // تَفقَهونَ
      [], // تَسبيحَهُم
      [], // إِنَّهُ
      [], // كانَ
      [], // حَليمًا
      [] // غَفورًا
    ],
    [ // آية 45
      [], // وَإِذا
      [], // قَرَأتَ
      [], // القُرءانَ
      [], // جَعَلنا
      [], // بَينَكَ
      [], // وَبَينَ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      ["حجابا مستورا : ساترا أو مستورا عن الحسّ"], // حِجابًا
      ["حجابا مستورا : ساترا أو مستورا عن الحسّ"] // مَستورًا
    ],
    [ // آية 46
      [], // وَجَعَلنا
      [], // عَلىٰ
      [], // قُلوبِهِم
      ["أكنّة : أغطية  كثيرة مانعة"], // أَكِنَّةً
      [], // أَن
      [], // يَفقَهوهُ
      [], // وَفى
      [], // ءاذانِهِم
      ["وقرا : صمما و ثقلا في السّمع عظيما"], // وَقرًا
      [], // وَإِذا
      [], // ذَكَرتَ
      [], // رَبَّكَ
      [], // فِى
      [], // القُرءانِ
      [], // وَحدَهُ
      [], // وَلَّوا
      [], // عَلىٰ
      [], // أَدبـٰرِهِم
      [] // نُفورًا
    ],
    [ // آية 47
      [], // نَحنُ
      [], // أَعلَمُ
      [], // بِما
      [], // يَستَمِعونَ
      [], // بِهِ
      [], // إِذ
      [], // يَستَمِعونَ
      [], // إِلَيكَ
      [], // وَإِذ
      ["هم نجوى : مُتناجون في أمرك فيما بينهم"], // هُم
      ["هم نجوى : مُتناجون في أمرك فيما بينهم"], // نَجوىٰ
      [], // إِذ
      [], // يَقولُ
      [], // الظّـٰلِمونَ
      [], // إِن
      [], // تَتَّبِعونَ
      [], // إِلّا
      [], // رَجُلًا
      ["مسحورا : مغلوبا على عقله بالسِّحر أو ساحرا"] // مَسحورًا
    ],
    [ // آية 48
      [], // انظُر
      [], // كَيفَ
      [], // ضَرَبوا
      [], // لَكَ
      [], // الأَمثالَ
      [], // فَضَلّوا
      [], // فَلا
      [], // يَستَطيعونَ
      [] // سَبيلًا
    ],
    [ // آية 49
      [], // وَقالوا
      [], // أَءِذا
      [], // كُنّا
      [], // عِظـٰمًا
      [], // وَرُفـٰتًا
      [], // أَءِنّا
      [], // لَمَبعوثونَ
      [], // خَلقًا
      [] // جَديدًا
    ],
    [ // آية 50
      [], // قُل
      [], // كونوا
      [], // حِجارَةً
      [], // أَو
      [] // حَديدًا
    ],
    [ // آية 51
      [], // أَو
      [], // خَلقًا
      [], // مِمّا
      ["يكبر : يعظم عن قبول الحياة كالسّماوات"], // يَكبُرُ
      [], // فى
      [], // صُدورِكُم
      [], // فَسَيَقولونَ
      [], // مَن
      [], // يُعيدُنا
      [], // قُلِ
      [], // الَّذى
      ["فطركم : أبدعكم و أحدثكم"], // فَطَرَكُم
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // فَسَيُنغِضونَ
      [], // إِلَيكَ
      [], // رُءوسَهُم
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هُوَ
      [], // قُل
      [], // عَسىٰ
      [], // أَن
      [], // يَكونَ
      [] // قَريبًا
    ],
    [ // آية 52
      [], // يَومَ
      [], // يَدعوكُم
      [], // فَتَستَجيبونَ
      ["بحمده : مُنْقادين انْنقياد الحامدين له"], // بِحَمدِهِ
      [], // وَتَظُنّونَ
      [], // إِن
      [], // لَبِثتُم
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 53
      [], // وَقُل
      [], // لِعِبادى
      [], // يَقولُوا
      [], // الَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      ["ينزغ بينهم : يُفسد و يُهيج الشّرّ بينهم"], // يَنزَغُ
      ["ينزغ بينهم : يُفسد و يُهيج الشّرّ بينهم"], // بَينَهُم
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      [], // كانَ
      [], // لِلإِنسـٰنِ
      [], // عَدُوًّا
      [] // مُبينًا
    ],
    [ // آية 54
      [], // رَبُّكُم
      [], // أَعلَمُ
      [], // بِكُم
      [], // إِن
      [], // يَشَأ
      [], // يَرحَمكُم
      [], // أَو
      [], // إِن
      [], // يَشَأ
      [], // يُعَذِّبكُم
      [], // وَما
      [], // أَرسَلنـٰكَ
      [], // عَلَيهِم
      [] // وَكيلًا
    ],
    [ // آية 55
      [], // وَرَبُّكَ
      [], // أَعلَمُ
      [], // بِمَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلَقَد
      [], // فَضَّلنا
      [], // بَعضَ
      [], // النَّبِيّـۧنَ
      [], // عَلىٰ
      [], // بَعضٍ
      [], // وَءاتَينا
      [], // داوۥدَ
      ["زبورا : كتابا فيه تحميد و تمجيد و مواعظ"] // زَبورًا
    ],
    [ // آية 56
      [], // قُلِ
      [], // ادعُوا
      [], // الَّذينَ
      [], // زَعَمتُم
      [], // مِن
      [], // دونِهِ
      [], // فَلا
      [], // يَملِكونَ
      [], // كَشفَ
      [], // الضُّرِّ
      [], // عَنكُم
      [], // وَلا
      ["تحويلا : نقلَه إلى غيركم ممّن لم يعبُدهم"] // تَحويلًا
    ],
    [ // آية 57
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // يَدعونَ
      [], // يَبتَغونَ
      [], // إِلىٰ
      [], // رَبِّهِمُ
      ["الوسيلة : القربة بالطاعة و العبادة"], // الوَسيلَةَ
      [], // أَيُّهُم
      [], // أَقرَبُ
      [], // وَيَرجونَ
      [], // رَحمَتَهُ
      [], // وَيَخافونَ
      [], // عَذابَهُ
      [], // إِنَّ
      [], // عَذابَ
      [], // رَبِّكَ
      [], // كانَ
      [] // مَحذورًا
    ],
    [ // آية 58
      [], // وَإِن
      [], // مِن
      [], // قَريَةٍ
      [], // إِلّا
      [], // نَحنُ
      [], // مُهلِكوها
      [], // قَبلَ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // أَو
      [], // مُعَذِّبوها
      [], // عَذابًا
      [], // شَديدًا
      [], // كانَ
      [], // ذٰلِكَ
      [], // فِى
      [], // الكِتـٰبِ
      [] // مَسطورًا
    ],
    [ // آية 59
      [], // وَما
      [], // مَنَعَنا
      [], // أَن
      [], // نُرسِلَ
      [], // بِالـٔايـٰتِ
      [], // إِلّا
      [], // أَن
      [], // كَذَّبَ
      [], // بِهَا
      [], // الأَوَّلونَ
      [], // وَءاتَينا
      [], // ثَمودَ
      [], // النّاقَةَ
      ["مُبصرة : آية بيّنةً واضحةً"], // مُبصِرَةً
      ["فظلموا بها : فكروا بها ظالمين فأُهلكوا"], // فَظَلَموا
      ["فظلموا بها : فكروا بها ظالمين فأُهلكوا"], // بِها
      [], // وَما
      [], // نُرسِلُ
      [], // بِالـٔايـٰتِ
      [], // إِلّا
      [] // تَخويفًا
    ],
    [ // آية 60
      [], // وَإِذ
      [], // قُلنا
      [], // لَكَ
      [], // إِنَّ
      [], // رَبَّكَ
      ["أحاط بالنّاس : علما و قدْرة فهم في قبضته تعالى"], // أَحاطَ
      ["أحاط بالنّاس : علما و قدْرة فهم في قبضته تعالى"], // بِالنّاسِ
      [], // وَما
      [], // جَعَلنَا
      [], // الرُّءيَا
      [], // الَّتى
      [], // أَرَينـٰكَ
      [], // إِلّا
      [], // فِتنَةً
      [], // لِلنّاسِ
      [], // وَالشَّجَرَةَ
      [], // المَلعونَةَ
      [], // فِى
      [], // القُرءانِ
      [], // وَنُخَوِّفُهُم
      [], // فَما
      [], // يَزيدُهُم
      [], // إِلّا
      [], // طُغيـٰنًا
      [] // كَبيرًا
    ],
    [ // آية 61
      [], // وَإِذ
      [], // قُلنا
      [], // لِلمَلـٰئِكَةِ
      [], // اسجُدوا
      [], // لِـٔادَمَ
      [], // فَسَجَدوا
      [], // إِلّا
      [], // إِبليسَ
      [], // قالَ
      [], // ءَأَسجُدُ
      [], // لِمَن
      [], // خَلَقتَ
      [] // طينًا
    ],
    [ // آية 62
      [], // قالَ
      [], // أَرَءَيتَكَ
      [], // هـٰذَا
      [], // الَّذى
      [], // كَرَّمتَ
      [], // عَلَىَّ
      [], // لَئِن
      [], // أَخَّرتَنِ
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      ["لأحتنكنّ ذرّيّته : لأستولينّ عليهم . أو لأستأصلنّهم بالإغواء"], // لَأَحتَنِكَنَّ
      ["لأحتنكنّ ذرّيّته : لأستولينّ عليهم . أو لأستأصلنّهم بالإغواء"], // ذُرِّيَّتَهُ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 63
      [], // قالَ
      [], // اذهَب
      [], // فَمَن
      [], // تَبِعَكَ
      [], // مِنهُم
      [], // فَإِنَّ
      [], // جَهَنَّمَ
      [], // جَزاؤُكُم
      [], // جَزاءً
      [] // مَوفورًا
    ],
    [ // آية 64
      [], // وَاستَفزِز
      [], // مَنِ
      [], // استَطَعتَ
      [], // مِنهُم
      [], // بِصَوتِكَ
      [], // وَأَجلِب
      [], // عَلَيهِم
      [], // بِخَيلِكَ
      [], // وَرَجِلِكَ
      [], // وَشارِكهُم
      [], // فِى
      [], // الأَموٰلِ
      [], // وَالأَولـٰدِ
      [], // وَعِدهُم
      [], // وَما
      [], // يَعِدُهُمُ
      [], // الشَّيطـٰنُ
      [], // إِلّا
      ["غرورا : باطلا و خِداعا"] // غُرورًا
    ],
    [ // آية 65
      [], // إِنَّ
      [], // عِبادى
      [], // لَيسَ
      [], // لَكَ
      [], // عَلَيهِم
      [], // سُلطـٰنٌ
      [], // وَكَفىٰ
      [], // بِرَبِّكَ
      [] // وَكيلًا
    ],
    [ // آية 66
      [], // رَبُّكُمُ
      [], // الَّذى
      [], // يُزجى
      [], // لَكُمُ
      [], // الفُلكَ
      [], // فِى
      [], // البَحرِ
      [], // لِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // إِنَّهُ
      [], // كانَ
      [], // بِكُم
      [] // رَحيمًا
    ],
    [ // آية 67
      [], // وَإِذا
      [], // مَسَّكُمُ
      [], // الضُّرُّ
      [], // فِى
      [], // البَحرِ
      [], // ضَلَّ
      [], // مَن
      [], // تَدعونَ
      [], // إِلّا
      [], // إِيّاهُ
      [], // فَلَمّا
      [], // نَجّىٰكُم
      [], // إِلَى
      [], // البَرِّ
      [], // أَعرَضتُم
      [], // وَكانَ
      [], // الإِنسـٰنُ
      [] // كَفورًا
    ],
    [ // آية 68
      [], // أَفَأَمِنتُم
      ["أن يخسف بكم : يُغوّر و يُغيّب بكم تحت الثرى"], // أَن
      ["أن يخسف بكم : يُغوّر و يُغيّب بكم تحت الثرى"], // يَخسِفَ
      ["أن يخسف بكم : يُغوّر و يُغيّب بكم تحت الثرى"], // بِكُم
      [], // جانِبَ
      [], // البَرِّ
      [], // أَو
      [], // يُرسِلَ
      [], // عَلَيكُم
      ["حاصبا : ريحا شديدة ترميكم بالحصباء"], // حاصِبًا
      [], // ثُمَّ
      [], // لا
      [], // تَجِدوا
      [], // لَكُم
      [] // وَكيلًا
    ],
    [ // آية 69
      [], // أَم
      [], // أَمِنتُم
      [], // أَن
      [], // يُعيدَكُم
      [], // فيهِ
      [], // تارَةً
      [], // أُخرىٰ
      [], // فَيُرسِلَ
      [], // عَلَيكُم
      ["قاصفا : عاصفا شديدا مُهلكا"], // قاصِفًا
      [], // مِنَ
      [], // الرّيحِ
      [], // فَيُغرِقَكُم
      [], // بِما
      [], // كَفَرتُم
      [], // ثُمَّ
      [], // لا
      [], // تَجِدوا
      [], // لَكُم
      [], // عَلَينا
      [], // بِهِ
      ["تبيعا : نصيرا أو مُطالبا بالثأر منّا"] // تَبيعًا
    ],
    [ // آية 70
      [], // وَلَقَد
      [], // كَرَّمنا
      [], // بَنى
      [], // ءادَمَ
      [], // وَحَمَلنـٰهُم
      [], // فِى
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // وَرَزَقنـٰهُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // وَفَضَّلنـٰهُم
      [], // عَلىٰ
      [], // كَثيرٍ
      [], // مِمَّن
      [], // خَلَقنا
      [] // تَفضيلًا
    ],
    [ // آية 71
      [], // يَومَ
      [], // نَدعوا
      [], // كُلَّ
      [], // أُناسٍ
      [], // بِإِمـٰمِهِم
      [], // فَمَن
      [], // أوتِىَ
      [], // كِتـٰبَهُ
      [], // بِيَمينِهِ
      [], // فَأُولـٰئِكَ
      [], // يَقرَءونَ
      [], // كِتـٰبَهُم
      [], // وَلا
      [], // يُظلَمونَ
      ["فتيلا : قدْر الخيط في شِقّ النواة من الجزاء"] // فَتيلًا
    ],
    [ // آية 72
      [], // وَمَن
      [], // كانَ
      [], // فى
      [], // هـٰذِهِ
      [], // أَعمىٰ
      [], // فَهُوَ
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // أَعمىٰ
      [], // وَأَضَلُّ
      [] // سَبيلًا
    ],
    [ // آية 73
      [], // وَإِن
      [], // كادوا
      ["ليَفتنونك : ليوقِعونك في الفتنة و ليصرفونك"], // لَيَفتِنونَكَ
      [], // عَنِ
      [], // الَّذى
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // لِتَفتَرِىَ
      [], // عَلَينا
      [], // غَيرَهُ
      [], // وَإِذًا
      [], // لَاتَّخَذوكَ
      [] // خَليلًا
    ],
    [ // آية 74
      [], // وَلَولا
      [], // أَن
      [], // ثَبَّتنـٰكَ
      [], // لَقَد
      [], // كِدتَ
      ["تركنُ إليهم : تميل إليهم"], // تَركَنُ
      ["تركنُ إليهم : تميل إليهم"], // إِلَيهِم
      [], // شَيـًٔا
      [] // قَليلًا
    ],
    [ // آية 75
      [], // إِذًا
      [], // لَأَذَقنـٰكَ
      [], // ضِعفَ
      [], // الحَيوٰةِ
      [], // وَضِعفَ
      [], // المَماتِ
      [], // ثُمَّ
      [], // لا
      [], // تَجِدُ
      [], // لَكَ
      [], // عَلَينا
      [] // نَصيرًا
    ],
    [ // آية 76
      [], // وَإِن
      [], // كادوا
      ["ليستفزّونك : لَيستخفّونك و يُـزعِجونك"], // لَيَستَفِزّونَكَ
      [], // مِنَ
      [], // الأَرضِ
      [], // لِيُخرِجوكَ
      [], // مِنها
      [], // وَإِذًا
      [], // لا
      [], // يَلبَثونَ
      [], // خِلـٰفَكَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 77
      [], // سُنَّةَ
      [], // مَن
      [], // قَد
      [], // أَرسَلنا
      [], // قَبلَكَ
      [], // مِن
      [], // رُسُلِنا
      [], // وَلا
      [], // تَجِدُ
      [], // لِسُنَّتِنا
      ["تحويلا : تغييرا و تبديلا"] // تَحويلًا
    ],
    [ // آية 78
      [], // أَقِمِ
      [], // الصَّلوٰةَ
      ["لدُلوك الشّمس : بعد أو عند زوالها عن كبد السّماء"], // لِدُلوكِ
      ["لدُلوك الشّمس : بعد أو عند زوالها عن كبد السّماء"], // الشَّمسِ
      [], // إِلىٰ
      [], // غَسَقِ
      [], // الَّيلِ
      [], // وَقُرءانَ
      [], // الفَجرِ
      [], // إِنَّ
      [], // قُرءانَ
      [], // الفَجرِ
      [], // كانَ
      [] // مَشهودًا
    ],
    [ // آية 79
      [], // وَمِنَ
      [], // الَّيلِ
      ["فتهجّدْ : التّهجّد : الصّلاة ليلا بعد الإستيقاظ"], // فَتَهَجَّد
      [], // بِهِ
      ["نافلة لك : فريضة زائدة خاصّة بك"], // نافِلَةً
      ["نافلة لك : فريضة زائدة خاصّة بك"], // لَكَ
      [], // عَسىٰ
      [], // أَن
      [], // يَبعَثَكَ
      [], // رَبُّكَ
      ["مقاما محمودا : مقام الشفاعة العُظمى"], // مَقامًا
      ["مقاما محمودا : مقام الشفاعة العُظمى"] // مَحمودًا
    ],
    [ // آية 80
      [], // وَقُل
      [], // رَبِّ
      [], // أَدخِلنى
      ["مُدخل صدق : إدْخالا مرضيّا جيّدا في أموري"], // مُدخَلَ
      ["مُدخل صدق : إدْخالا مرضيّا جيّدا في أموري"], // صِدقٍ
      [], // وَأَخرِجنى
      [], // مُخرَجَ
      [], // صِدقٍ
      [], // وَاجعَل
      [], // لى
      [], // مِن
      [], // لَدُنكَ
      [], // سُلطـٰنًا
      [] // نَصيرًا
    ],
    [ // آية 81
      [], // وَقُل
      [], // جاءَ
      [], // الحَقُّ
      [], // وَزَهَقَ
      [], // البـٰطِلُ
      [], // إِنَّ
      [], // البـٰطِلَ
      [], // كانَ
      [] // زَهوقًا
    ],
    [ // آية 82
      [], // وَنُنَزِّلُ
      [], // مِنَ
      [], // القُرءانِ
      [], // ما
      [], // هُوَ
      [], // شِفاءٌ
      [], // وَرَحمَةٌ
      [], // لِلمُؤمِنينَ
      [], // وَلا
      [], // يَزيدُ
      [], // الظّـٰلِمينَ
      [], // إِلّا
      ["خسارا : هلاكا بسبب كُفرهم به"] // خَسارًا
    ],
    [ // آية 83
      [], // وَإِذا
      [], // أَنعَمنا
      [], // عَلَى
      [], // الإِنسـٰنِ
      [], // أَعرَضَ
      [], // وَنَـٔا
      [], // بِجانِبِهِ
      [], // وَإِذا
      [], // مَسَّهُ
      [], // الشَّرُّ
      [], // كانَ
      [] // يَـٔوسًا
    ],
    [ // آية 84
      [], // قُل
      [], // كُلٌّ
      [], // يَعمَلُ
      [], // عَلىٰ
      ["شاكلته : مذهبــِـهِ الذي يُشاكلُ حاله"], // شاكِلَتِهِ
      [], // فَرَبُّكُم
      [], // أَعلَمُ
      [], // بِمَن
      [], // هُوَ
      [], // أَهدىٰ
      [] // سَبيلًا
    ],
    [ // آية 85
      [], // وَيَسـَٔلونَكَ
      [], // عَنِ
      [], // الرّوحِ
      [], // قُلِ
      [], // الرّوحُ
      [], // مِن
      [], // أَمرِ
      [], // رَبّى
      [], // وَما
      [], // أوتيتُم
      [], // مِنَ
      [], // العِلمِ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 86
      [], // وَلَئِن
      [], // شِئنا
      [], // لَنَذهَبَنَّ
      [], // بِالَّذى
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // ثُمَّ
      [], // لا
      [], // تَجِدُ
      [], // لَكَ
      [], // بِهِ
      [], // عَلَينا
      ["وكيلا : منْ تعهّد يإعادته إليك"] // وَكيلًا
    ],
    [ // آية 87
      [], // إِلّا
      [], // رَحمَةً
      [], // مِن
      [], // رَبِّكَ
      [], // إِنَّ
      [], // فَضلَهُ
      [], // كانَ
      [], // عَلَيكَ
      [] // كَبيرًا
    ],
    [ // آية 88
      [], // قُل
      [], // لَئِنِ
      [], // اجتَمَعَتِ
      [], // الإِنسُ
      [], // وَالجِنُّ
      [], // عَلىٰ
      [], // أَن
      [], // يَأتوا
      [], // بِمِثلِ
      [], // هـٰذَا
      [], // القُرءانِ
      [], // لا
      [], // يَأتونَ
      [], // بِمِثلِهِ
      [], // وَلَو
      [], // كانَ
      [], // بَعضُهُم
      [], // لِبَعضٍ
      ["ظهيرا : مُعينا"] // ظَهيرًا
    ],
    [ // آية 89
      [], // وَلَقَد
      ["صرّفنا : ردّدنا بأساليب مختلفة"], // صَرَّفنا
      [], // لِلنّاسِ
      [], // فى
      [], // هـٰذَا
      [], // القُرءانِ
      [], // مِن
      ["كلّ مثل : معنى غريب حسن بديع"], // كُلِّ
      ["كلّ مثل : معنى غريب حسن بديع"], // مَثَلٍ
      ["فأبى : فلمْ يرضَ"], // فَأَبىٰ
      [], // أَكثَرُ
      [], // النّاسِ
      [], // إِلّا
      ["كُفورا : جُحُودا للحقّ"] // كُفورًا
    ],
    [ // آية 90
      [], // وَقالوا
      [], // لَن
      [], // نُؤمِنَ
      [], // لَكَ
      [], // حَتّىٰ
      [], // تَفجُرَ
      [], // لَنا
      [], // مِنَ
      [], // الأَرضِ
      ["ينبوعا : عينا لا ينْضَبُ ماؤها"] // يَنبوعًا
    ],
    [ // آية 91
      [], // أَو
      [], // تَكونَ
      [], // لَكَ
      [], // جَنَّةٌ
      [], // مِن
      [], // نَخيلٍ
      [], // وَعِنَبٍ
      [], // فَتُفَجِّرَ
      [], // الأَنهـٰرَ
      [], // خِلـٰلَها
      [] // تَفجيرًا
    ],
    [ // آية 92
      [], // أَو
      [], // تُسقِطَ
      [], // السَّماءَ
      [], // كَما
      [], // زَعَمتَ
      [], // عَلَينا
      ["كِسفا : قِطعا"], // كِسَفًا
      [], // أَو
      [], // تَأتِىَ
      [], // بِاللَّهِ
      [], // وَالمَلـٰئِكَةِ
      ["قبيلا : مُقابلة و عِيانا . أو جماعة"] // قَبيلًا
    ],
    [ // آية 93
      [], // أَو
      [], // يَكونَ
      [], // لَكَ
      [], // بَيتٌ
      [], // مِن
      ["زُخرف : ذهَبٍ"], // زُخرُفٍ
      [], // أَو
      [], // تَرقىٰ
      [], // فِى
      [], // السَّماءِ
      [], // وَلَن
      [], // نُؤمِنَ
      [], // لِرُقِيِّكَ
      [], // حَتّىٰ
      [], // تُنَزِّلَ
      [], // عَلَينا
      [], // كِتـٰبًا
      [], // نَقرَؤُهُ
      [], // قُل
      [], // سُبحانَ
      [], // رَبّى
      [], // هَل
      [], // كُنتُ
      [], // إِلّا
      [], // بَشَرًا
      [] // رَسولًا
    ],
    [ // آية 94
      [], // وَما
      [], // مَنَعَ
      [], // النّاسَ
      [], // أَن
      [], // يُؤمِنوا
      [], // إِذ
      [], // جاءَهُمُ
      [], // الهُدىٰ
      [], // إِلّا
      [], // أَن
      [], // قالوا
      [], // أَبَعَثَ
      [], // اللَّهُ
      [], // بَشَرًا
      [] // رَسولًا
    ],
    [ // آية 95
      [], // قُل
      [], // لَو
      [], // كانَ
      [], // فِى
      [], // الأَرضِ
      [], // مَلـٰئِكَةٌ
      [], // يَمشونَ
      [], // مُطمَئِنّينَ
      [], // لَنَزَّلنا
      [], // عَلَيهِم
      [], // مِنَ
      [], // السَّماءِ
      [], // مَلَكًا
      [] // رَسولًا
    ],
    [ // آية 96
      [], // قُل
      [], // كَفىٰ
      [], // بِاللَّهِ
      [], // شَهيدًا
      [], // بَينى
      [], // وَبَينَكُم
      [], // إِنَّهُ
      [], // كانَ
      [], // بِعِبادِهِ
      [], // خَبيرًا
      [] // بَصيرًا
    ],
    [ // آية 97
      [], // وَمَن
      [], // يَهدِ
      [], // اللَّهُ
      [], // فَهُوَ
      [], // المُهتَدِ
      [], // وَمَن
      [], // يُضلِل
      [], // فَلَن
      [], // تَجِدَ
      [], // لَهُم
      [], // أَولِياءَ
      [], // مِن
      [], // دونِهِ
      [], // وَنَحشُرُهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // عَلىٰ
      [], // وُجوهِهِم
      [], // عُميًا
      [], // وَبُكمًا
      [], // وَصُمًّا
      [], // مَأوىٰهُم
      [], // جَهَنَّمُ
      [], // كُلَّما
      ["خبتْ : سكَنَ لَهبُها"], // خَبَت
      [], // زِدنـٰهُم
      [] // سَعيرًا
    ],
    [ // آية 98
      [], // ذٰلِكَ
      [], // جَزاؤُهُم
      [], // بِأَنَّهُم
      [], // كَفَروا
      [], // بِـٔايـٰتِنا
      [], // وَقالوا
      [], // أَءِذا
      [], // كُنّا
      [], // عِظـٰمًا
      [], // وَرُفـٰتًا
      [], // أَءِنّا
      [], // لَمَبعوثونَ
      [], // خَلقًا
      [] // جَديدًا
    ],
    [ // آية 99
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنَّ
      [], // اللَّهَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // قادِرٌ
      [], // عَلىٰ
      [], // أَن
      [], // يَخلُقَ
      [], // مِثلَهُم
      [], // وَجَعَلَ
      [], // لَهُم
      [], // أَجَلًا
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // فَأَبَى
      [], // الظّـٰلِمونَ
      [], // إِلّا
      [] // كُفورًا
    ],
    [ // آية 100
      [], // قُل
      [], // لَو
      [], // أَنتُم
      [], // تَملِكونَ
      [], // خَزائِنَ
      [], // رَحمَةِ
      [], // رَبّى
      [], // إِذًا
      [], // لَأَمسَكتُم
      [], // خَشيَةَ
      [], // الإِنفاقِ
      [], // وَكانَ
      [], // الإِنسـٰنُ
      [] // قَتورًا
    ],
    [ // آية 101
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسىٰ
      [], // تِسعَ
      [], // ءايـٰتٍ
      [], // بَيِّنـٰتٍ
      [], // فَسـَٔل
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // إِذ
      [], // جاءَهُم
      [], // فَقالَ
      [], // لَهُ
      [], // فِرعَونُ
      [], // إِنّى
      [], // لَأَظُنُّكَ
      [], // يـٰموسىٰ
      ["مسحورا : مغلوبا على عقلك بالسّحر أو ساحرا"] // مَسحورًا
    ],
    [ // آية 102
      [], // قالَ
      [], // لَقَد
      [], // عَلِمتَ
      [], // ما
      [], // أَنزَلَ
      [], // هـٰؤُلاءِ
      [], // إِلّا
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      ["بَصائر : بيّنات تُبَصِّر من يشهدها بصدقي"], // بَصائِرَ
      [], // وَإِنّى
      [], // لَأَظُنُّكَ
      [], // يـٰفِرعَونُ
      ["مثبورا : هالكا أو مصروفا عن الخير"] // مَثبورًا
    ],
    [ // آية 103
      [], // فَأَرادَ
      [], // أَن
      ["يستفزّهم : يَستخِفّهُمْ و يُزعجهم للخروج"], // يَستَفِزَّهُم
      [], // مِنَ
      [], // الأَرضِ
      [], // فَأَغرَقنـٰهُ
      [], // وَمَن
      [], // مَعَهُ
      [] // جَميعًا
    ],
    [ // آية 104
      [], // وَقُلنا
      [], // مِن
      [], // بَعدِهِ
      [], // لِبَنى
      [], // إِسرٰءيلَ
      [], // اسكُنُوا
      [], // الأَرضَ
      [], // فَإِذا
      [], // جاءَ
      [], // وَعدُ
      [], // الـٔاخِرَةِ
      [], // جِئنا
      [], // بِكُم
      ["لفيفا : جميعا مُختلطين"] // لَفيفًا
    ],
    [ // آية 105
      [], // وَبِالحَقِّ
      [], // أَنزَلنـٰهُ
      [], // وَبِالحَقِّ
      [], // نَزَلَ
      [], // وَما
      [], // أَرسَلنـٰكَ
      [], // إِلّا
      [], // مُبَشِّرًا
      [] // وَنَذيرًا
    ],
    [ // آية 106
      [], // وَقُرءانًا
      [], // فَرَقنـٰهُ
      [], // لِتَقرَأَهُ
      [], // عَلَى
      [], // النّاسِ
      ["على مُكث : على تُؤَدَة و تأنّ"], // عَلىٰ
      ["على مُكث : على تُؤَدَة و تأنّ"], // مُكثٍ
      [], // وَنَزَّلنـٰهُ
      [] // تَنزيلًا
    ],
    [ // آية 107
      [], // قُل
      [], // ءامِنوا
      [], // بِهِ
      [], // أَو
      [], // لا
      [], // تُؤمِنوا
      [], // إِنَّ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // مِن
      [], // قَبلِهِ
      [], // إِذا
      [], // يُتلىٰ
      [], // عَلَيهِم
      [], // يَخِرّونَ
      [], // لِلأَذقانِ
      [] // سُجَّدًا
    ],
    [ // آية 108
      [], // وَيَقولونَ
      [], // سُبحـٰنَ
      [], // رَبِّنا
      [], // إِن
      [], // كانَ
      [], // وَعدُ
      [], // رَبِّنا
      [] // لَمَفعولًا
    ],
    [ // آية 109
      [], // وَيَخِرّونَ
      [], // لِلأَذقانِ
      [], // يَبكونَ
      [], // وَيَزيدُهُم
      [] // خُشوعًا
    ],
    [ // آية 110
      [], // قُلِ
      [], // ادعُوا
      [], // اللَّهَ
      [], // أَوِ
      [], // ادعُوا
      [], // الرَّحمـٰنَ
      [], // أَيًّا
      [], // ما
      [], // تَدعوا
      [], // فَلَهُ
      [], // الأَسماءُ
      [], // الحُسنىٰ
      [], // وَلا
      [], // تَجهَر
      [], // بِصَلاتِكَ
      [], // وَلا
      [], // تُخافِت
      [], // بِها
      [], // وَابتَغِ
      [], // بَينَ
      [], // ذٰلِكَ
      [] // سَبيلًا
    ],
    [ // آية 111
      [], // وَقُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // لَم
      [], // يَتَّخِذ
      [], // وَلَدًا
      [], // وَلَم
      [], // يَكُن
      [], // لَهُ
      [], // شَريكٌ
      [], // فِى
      [], // المُلكِ
      [], // وَلَم
      [], // يَكُن
      [], // لَهُ
      [], // وَلِىٌّ
      [], // مِنَ
      [], // الذُّلِّ
      [], // وَكَبِّرهُ
      [] // تَكبيرًا
    ]
  ]
];

export default meanings;