const meanings = [
[ // آية 1
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // أَنزَلَ
      [], // عَلىٰ
      [], // عَبدِهِ
      [], // الكِتـٰبَ
      [], // وَلَم
      [], // يَجعَل
      [], // لَهُ
      [] // عِوَجا
    ],
    [ // آية 2
      ["قيِّما : مُستقيما معتدلا أو بمصالح العباد"], // قَيِّمًا
      [], // لِيُنذِرَ
      ["بأسا : عذابًا آجلا أو عاجلا"], // بَأسًا
      [], // شَديدًا
      [], // مِن
      [], // لَدُنهُ
      [], // وَيُبَشِّرَ
      [], // المُؤمِنينَ
      [], // الَّذينَ
      [], // يَعمَلونَ
      [], // الصّـٰلِحـٰتِ
      [], // أَنَّ
      [], // لَهُم
      [], // أَجرًا
      [] // حَسَنًا
    ],
    [ // آية 3
      [], // مـٰكِثينَ
      [], // فيهِ
      [] // أَبَدًا
    ],
    [ // آية 4
      [], // وَيُنذِرَ
      [], // الَّذينَ
      [], // قالُوا
      [], // اتَّخَذَ
      [], // اللَّهُ
      [] // وَلَدًا
    ],
    [ // آية 5
      [], // ما
      [], // لَهُم
      [], // بِهِ
      [], // مِن
      [], // عِلمٍ
      [], // وَلا
      [], // لِـٔابائِهِم
      [], // كَبُرَت
      [], // كَلِمَةً
      [], // تَخرُجُ
      [], // مِن
      [], // أَفوٰهِهِم
      [], // إِن
      [], // يَقولونَ
      [], // إِلّا
      [] // كَذِبًا
    ],
    [ // آية 6
      [], // فَلَعَلَّكَ
      [], // بـٰخِعٌ
      [], // نَفسَكَ
      [], // عَلىٰ
      [], // ءاثـٰرِهِم
      [], // إِن
      [], // لَم
      [], // يُؤمِنوا
      [], // بِهـٰذَا
      [], // الحَديثِ
      ["أسفا : غصبا. و حُزنا عليهم أو غيظا"] // أَسَفًا
    ],
    [ // آية 7
      [], // إِنّا
      [], // جَعَلنا
      [], // ما
      [], // عَلَى
      [], // الأَرضِ
      [], // زينَةً
      [], // لَها
      ["لِنبلوهم : لِنختبرَهم مع علمنا بحالهم"], // لِنَبلُوَهُم
      [], // أَيُّهُم
      ["أحسن عملا : أزهد فيها و أسرع في طاعتِنا"], // أَحسَنُ
      ["أحسن عملا : أزهد فيها و أسرع في طاعتِنا"] // عَمَلًا
    ],
    [ // آية 8
      [], // وَإِنّا
      [], // لَجـٰعِلونَ
      [], // ما
      [], // عَلَيها
      ["صعيدا جُرزا : تُرابا أجْرَد لا نبات فيه"], // صَعيدًا
      ["صعيدا جُرزا : تُرابا أجْرَد لا نبات فيه"] // جُرُزًا
    ],
    [ // آية 9
      ["أم حسبت : بل أظنَنْـتَ"], // أَم
      ["أم حسبت : بل أظنَنْـتَ"], // حَسِبتَ
      [], // أَنَّ
      [], // أَصحـٰبَ
      [], // الكَهفِ
      [], // وَالرَّقيمِ
      [], // كانوا
      [], // مِن
      [], // ءايـٰتِنا
      [] // عَجَبًا
    ],
    [ // آية 10
      [], // إِذ
      ["أوى الفتية : التجئوا هَرَبا بِدِينهم . ."], // أَوَى
      ["أوى الفتية : التجئوا هَرَبا بِدِينهم . ."], // الفِتيَةُ
      [], // إِلَى
      [], // الكَهفِ
      [], // فَقالوا
      [], // رَبَّنا
      [], // ءاتِنا
      [], // مِن
      [], // لَدُنكَ
      [], // رَحمَةً
      [], // وَهَيِّئ
      [], // لَنا
      [], // مِن
      [], // أَمرِنا
      ["رشدا : اهتداءً إلى طريق الحقّ"] // رَشَدًا
    ],
    [ // آية 11
      [], // فَضَرَبنا
      [], // عَلىٰ
      [], // ءاذانِهِم
      [], // فِى
      [], // الكَهفِ
      [], // سِنينَ
      [] // عَدَدًا
    ],
    [ // آية 12
      [], // ثُمَّ
      [], // بَعَثنـٰهُم
      [], // لِنَعلَمَ
      [], // أَىُّ
      [], // الحِزبَينِ
      [], // أَحصىٰ
      [], // لِما
      [], // لَبِثوا
      ["أمدا : مدّة و عدد سِنين أو غاية"] // أَمَدًا
    ],
    [ // آية 13
      [], // نَحنُ
      [], // نَقُصُّ
      [], // عَلَيكَ
      [], // نَبَأَهُم
      [], // بِالحَقِّ
      [], // إِنَّهُم
      [], // فِتيَةٌ
      [], // ءامَنوا
      [], // بِرَبِّهِم
      [], // وَزِدنـٰهُم
      [] // هُدًى
    ],
    [ // آية 14
      [], // وَرَبَطنا
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // إِذ
      [], // قاموا
      [], // فَقالوا
      [], // رَبُّنا
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لَن
      [], // نَدعُوَا۟
      [], // مِن
      [], // دونِهِ
      [], // إِلـٰهًا
      [], // لَقَد
      [], // قُلنا
      [], // إِذًا
      ["شططا : قولا مُفرطافي البعد عن الحقّ"] // شَطَطًا
    ],
    [ // آية 15
      [], // هـٰؤُلاءِ
      [], // قَومُنَا
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِهِ
      [], // ءالِهَةً
      [], // لَولا
      [], // يَأتونَ
      [], // عَلَيهِم
      [], // بِسُلطـٰنٍ
      [], // بَيِّنٍ
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [] // كَذِبًا
    ],
    [ // آية 16
      [], // وَإِذِ
      [], // اعتَزَلتُموهُم
      [], // وَما
      [], // يَعبُدونَ
      [], // إِلَّا
      [], // اللَّهَ
      [], // فَأوۥا
      [], // إِلَى
      [], // الكَهفِ
      [], // يَنشُر
      [], // لَكُم
      [], // رَبُّكُم
      [], // مِن
      [], // رَحمَتِهِ
      [], // وَيُهَيِّئ
      [], // لَكُم
      [], // مِن
      [], // أَمرِكُم
      ["مرفقا : ما تنتفعون به في عيشكم"] // مِرفَقًا
    ],
    [ // آية 17
      [], // وَتَرَى
      [], // الشَّمسَ
      [], // إِذا
      [], // طَلَعَت
      [], // تَزٰوَرُ
      [], // عَن
      [], // كَهفِهِم
      [], // ذاتَ
      [], // اليَمينِ
      [], // وَإِذا
      [], // غَرَبَت
      ["تقرضهم : تعدِلُ عنهم و تبتعد"], // تَقرِضُهُم
      [], // ذاتَ
      [], // الشِّمالِ
      [], // وَهُم
      [], // فى
      ["فجوة منه : مُتسع من الكهف"], // فَجوَةٍ
      ["فجوة منه : مُتسع من الكهف"], // مِنهُ
      [], // ذٰلِكَ
      [], // مِن
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // مَن
      [], // يَهدِ
      [], // اللَّهُ
      [], // فَهُوَ
      [], // المُهتَدِ
      [], // وَمَن
      [], // يُضلِل
      [], // فَلَن
      [], // تَجِدَ
      [], // لَهُ
      [], // وَلِيًّا
      [] // مُرشِدًا
    ],
    [ // آية 18
      [], // وَتَحسَبُهُم
      [], // أَيقاظًا
      [], // وَهُم
      [], // رُقودٌ
      [], // وَنُقَلِّبُهُم
      [], // ذاتَ
      [], // اليَمينِ
      [], // وَذاتَ
      [], // الشِّمالِ
      [], // وَكَلبُهُم
      [], // بـٰسِطٌ
      [], // ذِراعَيهِ
      [], // بِالوَصيدِ
      [], // لَوِ
      [], // اطَّلَعتَ
      [], // عَلَيهِم
      [], // لَوَلَّيتَ
      [], // مِنهُم
      [], // فِرارًا
      [], // وَلَمُلِئتَ
      [], // مِنهُم
      [] // رُعبًا
    ],
    [ // آية 19
      [], // وَكَذٰلِكَ
      [], // بَعَثنـٰهُم
      [], // لِيَتَساءَلوا
      [], // بَينَهُم
      [], // قالَ
      [], // قائِلٌ
      [], // مِنهُم
      [], // كَم
      [], // لَبِثتُم
      [], // قالوا
      [], // لَبِثنا
      [], // يَومًا
      [], // أَو
      [], // بَعضَ
      [], // يَومٍ
      [], // قالوا
      [], // رَبُّكُم
      [], // أَعلَمُ
      [], // بِما
      [], // لَبِثتُم
      [], // فَابعَثوا
      [], // أَحَدَكُم
      ["بوَرقكم : بدارهمكم المضروبة"], // بِوَرِقِكُم
      [], // هـٰذِهِ
      [], // إِلَى
      [], // المَدينَةِ
      [], // فَليَنظُر
      [], // أَيُّها
      ["أزكى طعاما : أحلّ، أو أجود طعاما"], // أَزكىٰ
      ["أزكى طعاما : أحلّ، أو أجود طعاما"], // طَعامًا
      [], // فَليَأتِكُم
      [], // بِرِزقٍ
      [], // مِنهُ
      [], // وَليَتَلَطَّف
      [], // وَلا
      [], // يُشعِرَنَّ
      [], // بِكُم
      [] // أَحَدًا
    ],
    [ // آية 20
      [], // إِنَّهُم
      [], // إِن
      ["يظهروا عليكم : يطّلعوا عليكم أو يغلبوا"], // يَظهَروا
      ["يظهروا عليكم : يطّلعوا عليكم أو يغلبوا"], // عَلَيكُم
      [], // يَرجُموكُم
      [], // أَو
      [], // يُعيدوكُم
      [], // فى
      [], // مِلَّتِهِم
      [], // وَلَن
      [], // تُفلِحوا
      [], // إِذًا
      [] // أَبَدًا
    ],
    [ // آية 21
      [], // وَكَذٰلِكَ
      ["أعثرنا عليهم : أطلَعنا النّاس عليهم"], // أَعثَرنا
      ["أعثرنا عليهم : أطلَعنا النّاس عليهم"], // عَلَيهِم
      [], // لِيَعلَموا
      [], // أَنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَأَنَّ
      [], // السّاعَةَ
      [], // لا
      [], // رَيبَ
      [], // فيها
      [], // إِذ
      [], // يَتَنـٰزَعونَ
      [], // بَينَهُم
      [], // أَمرَهُم
      [], // فَقالُوا
      [], // ابنوا
      [], // عَلَيهِم
      [], // بُنيـٰنًا
      [], // رَبُّهُم
      [], // أَعلَمُ
      [], // بِهِم
      [], // قالَ
      [], // الَّذينَ
      [], // غَلَبوا
      [], // عَلىٰ
      [], // أَمرِهِم
      [], // لَنَتَّخِذَنَّ
      [], // عَلَيهِم
      [] // مَسجِدًا
    ],
    [ // آية 22
      [], // سَيَقولونَ
      [], // ثَلـٰثَةٌ
      [], // رابِعُهُم
      [], // كَلبُهُم
      [], // وَيَقولونَ
      [], // خَمسَةٌ
      [], // سادِسُهُم
      [], // كَلبُهُم
      ["رجما بالغيب : قذفًا بالظّن غير يقين"], // رَجمًا
      ["رجما بالغيب : قذفًا بالظّن غير يقين"], // بِالغَيبِ
      [], // وَيَقولونَ
      [], // سَبعَةٌ
      [], // وَثامِنُهُم
      [], // كَلبُهُم
      [], // قُل
      [], // رَبّى
      [], // أَعلَمُ
      [], // بِعِدَّتِهِم
      [], // ما
      [], // يَعلَمُهُم
      [], // إِلّا
      [], // قَليلٌ
      [], // فَلا
      [], // تُمارِ
      [], // فيهِم
      [], // إِلّا
      [], // مِراءً
      [], // ظـٰهِرًا
      [], // وَلا
      [], // تَستَفتِ
      [], // فيهِم
      [], // مِنهُم
      [] // أَحَدًا
    ],
    [ // آية 23
      [], // وَلا
      [], // تَقولَنَّ
      [], // لِشَا۟ىءٍ
      [], // إِنّى
      [], // فاعِلٌ
      [], // ذٰلِكَ
      [] // غَدًا
    ],
    [ // آية 24
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // وَاذكُر
      [], // رَبَّكَ
      [], // إِذا
      [], // نَسيتَ
      [], // وَقُل
      [], // عَسىٰ
      [], // أَن
      [], // يَهدِيَنِ
      [], // رَبّى
      [], // لِأَقرَبَ
      [], // مِن
      [], // هـٰذا
      ["رشدا : هداية و إرشادًا للنّاس"] // رَشَدًا
    ],
    [ // آية 25
      [], // وَلَبِثوا
      [], // فى
      [], // كَهفِهِم
      [], // ثَلـٰثَ
      [], // مِا۟ئَةٍ
      [], // سِنينَ
      [], // وَازدادوا
      [] // تِسعًا
    ],
    [ // آية 26
      [], // قُلِ
      [], // اللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [], // لَبِثوا
      [], // لَهُ
      [], // غَيبُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      ["أبصر به : ما أبصر الله بكلّ موجود"], // أَبصِر
      ["أبصر به : ما أبصر الله بكلّ موجود"], // بِهِ
      [], // وَأَسمِع
      [], // ما
      [], // لَهُم
      [], // مِن
      [], // دونِهِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [], // يُشرِكُ
      [], // فى
      [], // حُكمِهِ
      [] // أَحَدًا
    ],
    [ // آية 27
      [], // وَاتلُ
      [], // ما
      [], // أوحِىَ
      [], // إِلَيكَ
      [], // مِن
      [], // كِتابِ
      [], // رَبِّكَ
      [], // لا
      [], // مُبَدِّلَ
      [], // لِكَلِمـٰتِهِ
      [], // وَلَن
      [], // تَجِدَ
      [], // مِن
      [], // دونِهِ
      ["مُلتحدا : مَلجأ و مَوْئلا"] // مُلتَحَدًا
    ],
    [ // آية 28
      [], // وَاصبِر
      [], // نَفسَكَ
      [], // مَعَ
      [], // الَّذينَ
      [], // يَدعونَ
      [], // رَبَّهُم
      [], // بِالغَدوٰةِ
      [], // وَالعَشِىِّ
      [], // يُريدونَ
      [], // وَجهَهُ
      [], // وَلا
      [], // تَعدُ
      [], // عَيناكَ
      [], // عَنهُم
      [], // تُريدُ
      [], // زينَةَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَلا
      [], // تُطِع
      [], // مَن
      ["أغفلنا قلبه : جعلناه غافلا ساهيًا"], // أَغفَلنا
      ["أغفلنا قلبه : جعلناه غافلا ساهيًا"], // قَلبَهُ
      [], // عَن
      [], // ذِكرِنا
      [], // وَاتَّبَعَ
      [], // هَوىٰهُ
      [], // وَكانَ
      [], // أَمرُهُ
      ["فرُطا : إسرافًا . أو تضْييعا و هلاكا"] // فُرُطًا
    ],
    [ // آية 29
      [], // وَقُلِ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكُم
      [], // فَمَن
      [], // شاءَ
      [], // فَليُؤمِن
      [], // وَمَن
      [], // شاءَ
      [], // فَليَكفُر
      [], // إِنّا
      [], // أَعتَدنا
      [], // لِلظّـٰلِمينَ
      [], // نارًا
      [], // أَحاطَ
      [], // بِهِم
      ["سُرادقها : فُسْطاطُها . أو لهبُها و دُخانها"], // سُرادِقُها
      [], // وَإِن
      [], // يَستَغيثوا
      [], // يُغاثوا
      [], // بِماءٍ
      ["كَالمهل : كدُرديّ الزّيت أو كالمُذاب من المعادن"], // كَالمُهلِ
      [], // يَشوِى
      [], // الوُجوهَ
      [], // بِئسَ
      [], // الشَّرابُ
      [], // وَساءَت
      [] // مُرتَفَقًا
    ],
    [ // آية 30
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // إِنّا
      [], // لا
      [], // نُضيعُ
      [], // أَجرَ
      [], // مَن
      [], // أَحسَنَ
      [] // عَمَلًا
    ],
    [ // آية 31
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // جَنّـٰتُ
      [], // عَدنٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهِمُ
      [], // الأَنهـٰرُ
      [], // يُحَلَّونَ
      [], // فيها
      [], // مِن
      [], // أَساوِرَ
      [], // مِن
      [], // ذَهَبٍ
      [], // وَيَلبَسونَ
      [], // ثِيابًا
      [], // خُضرًا
      [], // مِن
      ["سُندس : رقيق الدّيباج (الحرير)"], // سُندُسٍ
      [], // وَإِستَبرَقٍ
      [], // مُتَّكِـٔينَ
      [], // فيها
      [], // عَلَى
      ["الأرائك : السّرُر في الحجال (جمع حجلة محركة – بيت يزين بالثياب و الأسرّة و الستور)"], // الأَرائِكِ
      [], // نِعمَ
      [], // الثَّوابُ
      [], // وَحَسُنَت
      [] // مُرتَفَقًا
    ],
    [ // آية 32
      [], // وَاضرِب
      [], // لَهُم
      [], // مَثَلًا
      [], // رَجُلَينِ
      [], // جَعَلنا
      [], // لِأَحَدِهِما
      ["جنّتين : بُستانين"], // جَنَّتَينِ
      [], // مِن
      [], // أَعنـٰبٍ
      [], // وَحَفَفنـٰهُما
      [], // بِنَخلٍ
      [], // وَجَعَلنا
      [], // بَينَهُما
      [] // زَرعًا
    ],
    [ // آية 33
      [], // كِلتَا
      [], // الجَنَّتَينِ
      [], // ءاتَت
      ["أُكُلها : ثمرها الذي يُؤكل"], // أُكُلَها
      [], // وَلَم
      [], // تَظلِم
      [], // مِنهُ
      [], // شَيـًٔا
      [], // وَفَجَّرنا
      [], // خِلـٰلَهُما
      [] // نَهَرًا
    ],
    [ // آية 34
      [], // وَكانَ
      [], // لَهُ
      ["ثمرٌ : أموالٌ كثيرة مُثمّرة"], // ثَمَرٌ
      [], // فَقالَ
      [], // لِصـٰحِبِهِ
      [], // وَهُوَ
      [], // يُحاوِرُهُ
      [], // أَنا۠
      [], // أَكثَرُ
      [], // مِنكَ
      [], // مالًا
      [], // وَأَعَزُّ
      [] // نَفَرًا
    ],
    [ // آية 35
      [], // وَدَخَلَ
      [], // جَنَّتَهُ
      [], // وَهُوَ
      [], // ظالِمٌ
      [], // لِنَفسِهِ
      [], // قالَ
      [], // ما
      [], // أَظُنُّ
      [], // أَن
      ["تبيد : تهلك و تفنى و تخرب"], // تَبيدَ
      [], // هـٰذِهِ
      [] // أَبَدًا
    ],
    [ // آية 36
      [], // وَما
      [], // أَظُنُّ
      [], // السّاعَةَ
      [], // قائِمَةً
      [], // وَلَئِن
      [], // رُدِدتُ
      [], // إِلىٰ
      [], // رَبّى
      [], // لَأَجِدَنَّ
      [], // خَيرًا
      [], // مِنها
      ["مُنقلبا : مرْجعا و عاقِيةً"] // مُنقَلَبًا
    ],
    [ // آية 37
      [], // قالَ
      [], // لَهُ
      [], // صاحِبُهُ
      [], // وَهُوَ
      [], // يُحاوِرُهُ
      [], // أَكَفَرتَ
      [], // بِالَّذى
      [], // خَلَقَكَ
      [], // مِن
      [], // تُرابٍ
      [], // ثُمَّ
      [], // مِن
      [], // نُطفَةٍ
      [], // ثُمَّ
      [], // سَوّىٰكَ
      [] // رَجُلًا
    ],
    [ // آية 38
      [], // لـٰكِنّا۠
      [], // هُوَ
      [], // اللَّهُ
      [], // رَبّى
      [], // وَلا
      [], // أُشرِكُ
      [], // بِرَبّى
      [] // أَحَدًا
    ],
    [ // آية 39
      [], // وَلَولا
      [], // إِذ
      [], // دَخَلتَ
      [], // جَنَّتَكَ
      [], // قُلتَ
      [], // ما
      [], // شاءَ
      [], // اللَّهُ
      [], // لا
      [], // قُوَّةَ
      [], // إِلّا
      [], // بِاللَّهِ
      [], // إِن
      [], // تَرَنِ
      [], // أَنا۠
      [], // أَقَلَّ
      [], // مِنكَ
      [], // مالًا
      [] // وَوَلَدًا
    ],
    [ // آية 40
      [], // فَعَسىٰ
      [], // رَبّى
      [], // أَن
      [], // يُؤتِيَنِ
      [], // خَيرًا
      [], // مِن
      [], // جَنَّتِكَ
      [], // وَيُرسِلَ
      [], // عَلَيها
      ["حُسبانا : عذابا كالصّواعق و الآفات"], // حُسبانًا
      [], // مِنَ
      [], // السَّماءِ
      ["فتُصبح صعيدا زلقا : رمْلا هائلا أو أرضا جُرُزا لا نبات فيها يُزلق عليها لِملاسَتِها"], // فَتُصبِحَ
      ["فتُصبح صعيدا زلقا : رمْلا هائلا أو أرضا جُرُزا لا نبات فيها يُزلق عليها لِملاسَتِها"], // صَعيدًا
      ["فتُصبح صعيدا زلقا : رمْلا هائلا أو أرضا جُرُزا لا نبات فيها يُزلق عليها لِملاسَتِها"] // زَلَقًا
    ],
    [ // آية 41
      [], // أَو
      [], // يُصبِحَ
      [], // ماؤُها
      ["غورا : غائرا ذاهبا في الأرض"], // غَورًا
      [], // فَلَن
      [], // تَستَطيعَ
      [], // لَهُ
      [] // طَلَبًا
    ],
    [ // آية 42
      [], // وَأُحيطَ
      [], // بِثَمَرِهِ
      [], // فَأَصبَحَ
      ["يُقلّب كفّيه : كِماية عن النّدم و التّحسّر"], // يُقَلِّبُ
      ["يُقلّب كفّيه : كِماية عن النّدم و التّحسّر"], // كَفَّيهِ
      [], // عَلىٰ
      [], // ما
      [], // أَنفَقَ
      [], // فيها
      [], // وَهِىَ
      ["خاوية على عُرُوشها : ساقطة على سُقوفها التي سَقطت"], // خاوِيَةٌ
      ["خاوية على عُرُوشها : ساقطة على سُقوفها التي سَقطت"], // عَلىٰ
      ["خاوية على عُرُوشها : ساقطة على سُقوفها التي سَقطت"], // عُروشِها
      [], // وَيَقولُ
      [], // يـٰلَيتَنى
      [], // لَم
      [], // أُشرِك
      [], // بِرَبّى
      [] // أَحَدًا
    ],
    [ // آية 43
      [], // وَلَم
      [], // تَكُن
      [], // لَهُ
      [], // فِئَةٌ
      [], // يَنصُرونَهُ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَما
      [], // كانَ
      [] // مُنتَصِرًا
    ],
    [ // آية 44
      [], // هُنالِكَ
      [], // الوَلـٰيَةُ
      [], // لِلَّهِ
      [], // الحَقِّ
      [], // هُوَ
      [], // خَيرٌ
      [], // ثَوابًا
      [], // وَخَيرٌ
      [] // عُقبًا
    ],
    [ // آية 45
      [], // وَاضرِب
      [], // لَهُم
      [], // مَثَلَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // كَماءٍ
      [], // أَنزَلنـٰهُ
      [], // مِنَ
      [], // السَّماءِ
      [], // فَاختَلَطَ
      [], // بِهِ
      [], // نَباتُ
      [], // الأَرضِ
      [], // فَأَصبَحَ
      ["هشيما : يابسا متفتّتا بعد نضارته"], // هَشيمًا
      [], // تَذروهُ
      [], // الرِّيـٰحُ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // مُقتَدِرًا
    ],
    [ // آية 46
      [], // المالُ
      [], // وَالبَنونَ
      [], // زينَةُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَالبـٰقِيـٰتُ
      [], // الصّـٰلِحـٰتُ
      [], // خَيرٌ
      [], // عِندَ
      [], // رَبِّكَ
      [], // ثَوابًا
      [], // وَخَيرٌ
      [] // أَمَلًا
    ],
    [ // آية 47
      [], // وَيَومَ
      [], // نُسَيِّرُ
      [], // الجِبالَ
      [], // وَتَرَى
      [], // الأَرضَ
      ["بارزة : ظاهرة لا يسترها شيء"], // بارِزَةً
      [], // وَحَشَرنـٰهُم
      [], // فَلَم
      [], // نُغادِر
      [], // مِنهُم
      [] // أَحَدًا
    ],
    [ // آية 48
      [], // وَعُرِضوا
      [], // عَلىٰ
      [], // رَبِّكَ
      [], // صَفًّا
      [], // لَقَد
      [], // جِئتُمونا
      [], // كَما
      [], // خَلَقنـٰكُم
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // بَل
      [], // زَعَمتُم
      [], // أَلَّن
      [], // نَجعَلَ
      [], // لَكُم
      ["موعدا : وقتا لإنجازنا الوعد بالبعث و الجزاء"] // مَوعِدًا
    ],
    [ // آية 49
      [], // وَوُضِعَ
      [], // الكِتـٰبُ
      [], // فَتَرَى
      [], // المُجرِمينَ
      ["مُشفقين : خائفين وَجلين"], // مُشفِقينَ
      [], // مِمّا
      [], // فيهِ
      [], // وَيَقولونَ
      [], // يـٰوَيلَتَنا
      [], // مالِ
      [], // هـٰذَا
      [], // الكِتـٰبِ
      [], // لا
      [], // يُغادِرُ
      [], // صَغيرَةً
      [], // وَلا
      [], // كَبيرَةً
      [], // إِلّا
      [], // أَحصىٰها
      [], // وَوَجَدوا
      [], // ما
      [], // عَمِلوا
      [], // حاضِرًا
      [], // وَلا
      [], // يَظلِمُ
      [], // رَبُّكَ
      [] // أَحَدًا
    ],
    [ // آية 50
      [], // وَإِذ
      [], // قُلنا
      [], // لِلمَلـٰئِكَةِ
      [], // اسجُدوا
      [], // لِـٔادَمَ
      [], // فَسَجَدوا
      [], // إِلّا
      [], // إِبليسَ
      [], // كانَ
      [], // مِنَ
      [], // الجِنِّ
      [], // فَفَسَقَ
      [], // عَن
      [], // أَمرِ
      [], // رَبِّهِ
      [], // أَفَتَتَّخِذونَهُ
      [], // وَذُرِّيَّتَهُ
      [], // أَولِياءَ
      [], // مِن
      [], // دونى
      [], // وَهُم
      [], // لَكُم
      [], // عَدُوٌّ
      [], // بِئسَ
      [], // لِلظّـٰلِمينَ
      [] // بَدَلًا
    ],
    [ // آية 51
      [], // ما
      [], // أَشهَدتُهُم
      [], // خَلقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلا
      [], // خَلقَ
      [], // أَنفُسِهِم
      [], // وَما
      [], // كُنتُ
      [], // مُتَّخِذَ
      [], // المُضِلّينَ
      ["عضُدا : أعوانا و أنصارا"] // عَضُدًا
    ],
    [ // آية 52
      [], // وَيَومَ
      [], // يَقولُ
      [], // نادوا
      [], // شُرَكاءِىَ
      [], // الَّذينَ
      [], // زَعَمتُم
      [], // فَدَعَوهُم
      [], // فَلَم
      [], // يَستَجيبوا
      [], // لَهُم
      [], // وَجَعَلنا
      [], // بَينَهُم
      ["مَوْبقا : مهلِكا يشتركون فيه و هو النّار"] // مَوبِقًا
    ],
    [ // آية 53
      [], // وَرَءَا
      [], // المُجرِمونَ
      [], // النّارَ
      [], // فَظَنّوا
      [], // أَنَّهُم
      ["مُواقعوها : واقعون فيها أو داخلون فيها"], // مُواقِعوها
      [], // وَلَم
      [], // يَجِدوا
      [], // عَنها
      ["مصرفا : معدلا و مكانا ينصرفون إليه"] // مَصرِفًا
    ],
    [ // آية 54
      [], // وَلَقَد
      ["صرّفنا : كرّرنا بأساليب مُختلفة"], // صَرَّفنا
      [], // فى
      [], // هـٰذَا
      [], // القُرءانِ
      [], // لِلنّاسِ
      [], // مِن
      ["كلّ مثل : معنى غريب بديع كالمثل في غرابته"], // كُلِّ
      ["كلّ مثل : معنى غريب بديع كالمثل في غرابته"], // مَثَلٍ
      [], // وَكانَ
      [], // الإِنسـٰنُ
      [], // أَكثَرَ
      [], // شَىءٍ
      [] // جَدَلًا
    ],
    [ // آية 55
      [], // وَما
      [], // مَنَعَ
      [], // النّاسَ
      [], // أَن
      [], // يُؤمِنوا
      [], // إِذ
      [], // جاءَهُمُ
      [], // الهُدىٰ
      [], // وَيَستَغفِروا
      [], // رَبَّهُم
      [], // إِلّا
      [], // أَن
      [], // تَأتِيَهُم
      ["سنّة الأوّلين : عذاب الاستئصال إذا لم يُؤمنوا"], // سُنَّةُ
      ["سنّة الأوّلين : عذاب الاستئصال إذا لم يُؤمنوا"], // الأَوَّلينَ
      [], // أَو
      [], // يَأتِيَهُمُ
      [], // العَذابُ
      ["قُبُلا : أنواعا و ألوانا أو عيانا و مقابلة"] // قُبُلًا
    ],
    [ // آية 56
      [], // وَما
      [], // نُرسِلُ
      [], // المُرسَلينَ
      [], // إِلّا
      [], // مُبَشِّرينَ
      [], // وَمُنذِرينَ
      [], // وَيُجـٰدِلُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِالبـٰطِلِ
      [], // لِيُدحِضوا
      [], // بِهِ
      [], // الحَقَّ
      [], // وَاتَّخَذوا
      [], // ءايـٰتى
      [], // وَما
      [], // أُنذِروا
      [] // هُزُوًا
    ],
    [ // آية 57
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّن
      [], // ذُكِّرَ
      [], // بِـٔايـٰتِ
      [], // رَبِّهِ
      [], // فَأَعرَضَ
      [], // عَنها
      [], // وَنَسِىَ
      [], // ما
      [], // قَدَّمَت
      [], // يَداهُ
      [], // إِنّا
      [], // جَعَلنا
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // أَكِنَّةً
      [], // أَن
      [], // يَفقَهوهُ
      [], // وَفى
      [], // ءاذانِهِم
      ["وقرا : صممًا و ثقلا في السّمع عظيما"], // وَقرًا
      [], // وَإِن
      [], // تَدعُهُم
      [], // إِلَى
      [], // الهُدىٰ
      [], // فَلَن
      [], // يَهتَدوا
      [], // إِذًا
      [] // أَبَدًا
    ],
    [ // آية 58
      [], // وَرَبُّكَ
      [], // الغَفورُ
      [], // ذُو
      [], // الرَّحمَةِ
      [], // لَو
      [], // يُؤاخِذُهُم
      [], // بِما
      [], // كَسَبوا
      [], // لَعَجَّلَ
      [], // لَهُمُ
      [], // العَذابَ
      [], // بَل
      [], // لَهُم
      [], // مَوعِدٌ
      [], // لَن
      [], // يَجِدوا
      [], // مِن
      [], // دونِهِ
      ["موئِلا : منجى و ملجأ و مخلصا"] // مَوئِلًا
    ],
    [ // آية 59
      [], // وَتِلكَ
      [], // القُرىٰ
      [], // أَهلَكنـٰهُم
      [], // لَمّا
      [], // ظَلَموا
      [], // وَجَعَلنا
      ["لمَهلِكهم : لهلاكهم"], // لِمَهلِكِهِم
      [] // مَوعِدًا
    ],
    [ // آية 60
      [], // وَإِذ
      [], // قالَ
      [], // موسىٰ
      [], // لِفَتىٰهُ
      [], // لا
      [], // أَبرَحُ
      [], // حَتّىٰ
      [], // أَبلُغَ
      ["مجمع البحرين : مُلتقاهما"], // مَجمَعَ
      ["مجمع البحرين : مُلتقاهما"], // البَحرَينِ
      [], // أَو
      [], // أَمضِىَ
      [] // حُقُبًا
    ],
    [ // آية 61
      [], // فَلَمّا
      [], // بَلَغا
      [], // مَجمَعَ
      [], // بَينِهِما
      [], // نَسِيا
      [], // حوتَهُما
      [], // فَاتَّخَذَ
      [], // سَبيلَهُ
      [], // فِى
      [], // البَحرِ
      ["سَربا : مسلكا و منفذا"] // سَرَبًا
    ],
    [ // آية 62
      [], // فَلَمّا
      [], // جاوَزا
      [], // قالَ
      [], // لِفَتىٰهُ
      [], // ءاتِنا
      [], // غَداءَنا
      [], // لَقَد
      [], // لَقينا
      [], // مِن
      [], // سَفَرِنا
      [], // هـٰذا
      ["نصَبا : تعبا و شدّة و إعياءً"] // نَصَبًا
    ],
    [ // آية 63
      [], // قالَ
      [], // أَرَءَيتَ
      [], // إِذ
      ["أوينا : إلتجأنا"], // أَوَينا
      [], // إِلَى
      [], // الصَّخرَةِ
      [], // فَإِنّى
      [], // نَسيتُ
      [], // الحوتَ
      [], // وَما
      [], // أَنسىٰنيهُ
      [], // إِلَّا
      [], // الشَّيطـٰنُ
      [], // أَن
      [], // أَذكُرَهُ
      [], // وَاتَّخَذَ
      [], // سَبيلَهُ
      [], // فِى
      [], // البَحرِ
      ["عجبا : سبيلا أو اتّخاذا يُتعجّب منه"] // عَجَبًا
    ],
    [ // آية 64
      [], // قالَ
      [], // ذٰلِكَ
      [], // ما
      [], // كُنّا
      [], // نَبغِ
      [], // فَارتَدّا
      [], // عَلىٰ
      [], // ءاثارِهِما
      ["قصصا : يقصّان آثارهما و يتّبعانها اتّباعا"] // قَصَصًا
    ],
    [ // آية 65
      [], // فَوَجَدا
      ["عبْدا : الخضر عليه السّلام"], // عَبدًا
      [], // مِن
      [], // عِبادِنا
      [], // ءاتَينـٰهُ
      [], // رَحمَةً
      [], // مِن
      [], // عِندِنا
      [], // وَعَلَّمنـٰهُ
      [], // مِن
      [], // لَدُنّا
      [] // عِلمًا
    ],
    [ // آية 66
      [], // قالَ
      [], // لَهُ
      [], // موسىٰ
      [], // هَل
      [], // أَتَّبِعُكَ
      [], // عَلىٰ
      [], // أَن
      [], // تُعَلِّمَنِ
      [], // مِمّا
      [], // عُلِّمتَ
      ["رُشدا : صوابا . أو إصابة خيْر"] // رُشدًا
    ],
    [ // آية 67
      [], // قالَ
      [], // إِنَّكَ
      [], // لَن
      [], // تَستَطيعَ
      [], // مَعِىَ
      [] // صَبرًا
    ],
    [ // آية 68
      [], // وَكَيفَ
      [], // تَصبِرُ
      [], // عَلىٰ
      [], // ما
      [], // لَم
      [], // تُحِط
      [], // بِهِ
      ["خُبرا : علما و معرفة"] // خُبرًا
    ],
    [ // آية 69
      [], // قالَ
      [], // سَتَجِدُنى
      [], // إِن
      [], // شاءَ
      [], // اللَّهُ
      [], // صابِرًا
      [], // وَلا
      [], // أَعصى
      [], // لَكَ
      [] // أَمرًا
    ],
    [ // آية 70
      [], // قالَ
      [], // فَإِنِ
      [], // اتَّبَعتَنى
      [], // فَلا
      [], // تَسـَٔلنى
      [], // عَن
      [], // شَىءٍ
      [], // حَتّىٰ
      [], // أُحدِثَ
      [], // لَكَ
      [], // مِنهُ
      [] // ذِكرًا
    ],
    [ // آية 71
      [], // فَانطَلَقا
      [], // حَتّىٰ
      [], // إِذا
      [], // رَكِبا
      [], // فِى
      [], // السَّفينَةِ
      [], // خَرَقَها
      [], // قالَ
      [], // أَخَرَقتَها
      [], // لِتُغرِقَ
      [], // أَهلَها
      [], // لَقَد
      [], // جِئتَ
      [], // شَيـًٔا
      [] // إِمرًا
    ],
    [ // آية 72
      [], // قالَ
      [], // أَلَم
      [], // أَقُل
      [], // إِنَّكَ
      [], // لَن
      [], // تَستَطيعَ
      [], // مَعِىَ
      [] // صَبرًا
    ],
    [ // آية 73
      [], // قالَ
      [], // لا
      [], // تُؤاخِذنى
      [], // بِما
      [], // نَسيتُ
      [], // وَلا
      [], // تُرهِقنى
      [], // مِن
      [], // أَمرى
      ["عُسرا : صُعوبة و مشقّة"] // عُسرًا
    ],
    [ // آية 74
      [], // فَانطَلَقا
      [], // حَتّىٰ
      [], // إِذا
      [], // لَقِيا
      [], // غُلـٰمًا
      [], // فَقَتَلَهُ
      [], // قالَ
      [], // أَقَتَلتَ
      [], // نَفسًا
      [], // زَكِيَّةً
      [], // بِغَيرِ
      [], // نَفسٍ
      [], // لَقَد
      [], // جِئتَ
      [], // شَيـًٔا
      [] // نُكرًا
    ],
    [ // آية 75
      [], // قالَ
      [], // أَلَم
      [], // أَقُل
      [], // لَكَ
      [], // إِنَّكَ
      [], // لَن
      [], // تَستَطيعَ
      [], // مَعِىَ
      [] // صَبرًا
    ],
    [ // آية 76
      [], // قالَ
      [], // إِن
      [], // سَأَلتُكَ
      [], // عَن
      [], // شَىءٍ
      [], // بَعدَها
      [], // فَلا
      [], // تُصـٰحِبنى
      [], // قَد
      [], // بَلَغتَ
      [], // مِن
      [], // لَدُنّى
      [] // عُذرًا
    ],
    [ // آية 77
      [], // فَانطَلَقا
      [], // حَتّىٰ
      [], // إِذا
      [], // أَتَيا
      [], // أَهلَ
      [], // قَريَةٍ
      [], // استَطعَما
      [], // أَهلَها
      ["فأبوْا : فامتنعوا"], // فَأَبَوا
      [], // أَن
      [], // يُضَيِّفوهُما
      [], // فَوَجَدا
      [], // فيها
      [], // جِدارًا
      [], // يُريدُ
      [], // أَن
      ["ينْقضّ : ينهدم و يسقط بسرعة"], // يَنقَضَّ
      [], // فَأَقامَهُ
      [], // قالَ
      [], // لَو
      [], // شِئتَ
      [], // لَتَّخَذتَ
      [], // عَلَيهِ
      [] // أَجرًا
    ],
    [ // آية 78
      [], // قالَ
      [], // هـٰذا
      [], // فِراقُ
      [], // بَينى
      [], // وَبَينِكَ
      [], // سَأُنَبِّئُكَ
      [], // بِتَأويلِ
      [], // ما
      [], // لَم
      [], // تَستَطِع
      [], // عَلَيهِ
      [] // صَبرًا
    ],
    [ // آية 79
      [], // أَمَّا
      [], // السَّفينَةُ
      [], // فَكانَت
      [], // لِمَسـٰكينَ
      [], // يَعمَلونَ
      [], // فِى
      [], // البَحرِ
      [], // فَأَرَدتُ
      [], // أَن
      [], // أَعيبَها
      [], // وَكانَ
      ["وراءهم : أمامهم و بين أيديهم"], // وَراءَهُم
      [], // مَلِكٌ
      [], // يَأخُذُ
      [], // كُلَّ
      [], // سَفينَةٍ
      ["غَصبا : استلابا بغير حق"] // غَصبًا
    ],
    [ // آية 80
      [], // وَأَمَّا
      [], // الغُلـٰمُ
      [], // فَكانَ
      [], // أَبَواهُ
      [], // مُؤمِنَينِ
      [], // فَخَشينا
      [], // أَن
      ["يُرهقهما : يُكلّفهما أو يُغشيهما"], // يُرهِقَهُما
      [], // طُغيـٰنًا
      [] // وَكُفرًا
    ],
    [ // آية 81
      [], // فَأَرَدنا
      [], // أَن
      [], // يُبدِلَهُما
      [], // رَبُّهُما
      [], // خَيرًا
      [], // مِنهُ
      [], // زَكوٰةً
      [], // وَأَقرَبَ
      [] // رُحمًا
    ],
    [ // آية 82
      [], // وَأَمَّا
      [], // الجِدارُ
      [], // فَكانَ
      [], // لِغُلـٰمَينِ
      [], // يَتيمَينِ
      [], // فِى
      [], // المَدينَةِ
      [], // وَكانَ
      [], // تَحتَهُ
      [], // كَنزٌ
      [], // لَهُما
      [], // وَكانَ
      [], // أَبوهُما
      [], // صـٰلِحًا
      [], // فَأَرادَ
      [], // رَبُّكَ
      [], // أَن
      ["يبلغا أشدّهما : قوّتهما و شدّتهما و كمال عقلهما"], // يَبلُغا
      ["يبلغا أشدّهما : قوّتهما و شدّتهما و كمال عقلهما"], // أَشُدَّهُما
      [], // وَيَستَخرِجا
      [], // كَنزَهُما
      [], // رَحمَةً
      [], // مِن
      [], // رَبِّكَ
      [], // وَما
      [], // فَعَلتُهُ
      [], // عَن
      [], // أَمرى
      [], // ذٰلِكَ
      [], // تَأويلُ
      [], // ما
      [], // لَم
      [], // تَسطِع
      [], // عَلَيهِ
      [] // صَبرًا
    ],
    [ // آية 83
      [], // وَيَسـَٔلونَكَ
      [], // عَن
      [], // ذِى
      [], // القَرنَينِ
      [], // قُل
      [], // سَأَتلوا
      [], // عَلَيكُم
      [], // مِنهُ
      [] // ذِكرًا
    ],
    [ // آية 84
      [], // إِنّا
      [], // مَكَّنّا
      [], // لَهُ
      [], // فِى
      [], // الأَرضِ
      [], // وَءاتَينـٰهُ
      [], // مِن
      [], // كُلِّ
      [], // شَىءٍ
      ["سببا : علما و طريقا يُوصّله إليه"] // سَبَبًا
    ],
    [ // آية 85
      ["فأتبَعَ سببا : سلك طريقا يُوَصّله إلى المغرب"], // فَأَتبَعَ
      ["فأتبَعَ سببا : سلك طريقا يُوَصّله إلى المغرب"] // سَبَبًا
    ],
    [ // آية 86
      [], // حَتّىٰ
      [], // إِذا
      [], // بَلَغَ
      [], // مَغرِبَ
      [], // الشَّمسِ
      [], // وَجَدَها
      [], // تَغرُبُ
      [], // فى
      [], // عَينٍ
      ["حَمِئة : ذات حمأة (الطّين الأسود)"], // حَمِئَةٍ
      [], // وَوَجَدَ
      [], // عِندَها
      [], // قَومًا
      [], // قُلنا
      [], // يـٰذَا
      [], // القَرنَينِ
      [], // إِمّا
      [], // أَن
      [], // تُعَذِّبَ
      [], // وَإِمّا
      [], // أَن
      [], // تَتَّخِذَ
      [], // فيهِم
      ["حسنا : هو الدّعوة إلى الحقّ و الهدى"] // حُسنًا
    ],
    [ // آية 87
      [], // قالَ
      [], // أَمّا
      [], // مَن
      [], // ظَلَمَ
      [], // فَسَوفَ
      [], // نُعَذِّبُهُ
      [], // ثُمَّ
      [], // يُرَدُّ
      [], // إِلىٰ
      [], // رَبِّهِ
      [], // فَيُعَذِّبُهُ
      ["عذابا نكرا : منكرا فظيعا"], // عَذابًا
      ["عذابا نكرا : منكرا فظيعا"] // نُكرًا
    ],
    [ // آية 88
      [], // وَأَمّا
      [], // مَن
      [], // ءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // فَلَهُ
      [], // جَزاءً
      [], // الحُسنىٰ
      [], // وَسَنَقولُ
      [], // لَهُ
      [], // مِن
      [], // أَمرِنا
      [] // يُسرًا
    ],
    [ // آية 89
      [], // ثُمَّ
      [], // أَتبَعَ
      [] // سَبَبًا
    ],
    [ // آية 90
      [], // حَتّىٰ
      [], // إِذا
      [], // بَلَغَ
      [], // مَطلِعَ
      [], // الشَّمسِ
      [], // وَجَدَها
      [], // تَطلُعُ
      [], // عَلىٰ
      [], // قَومٍ
      [], // لَم
      [], // نَجعَل
      [], // لَهُم
      [], // مِن
      [], // دونِها
      ["سِترا : ساترا من اللّباس و البناء"] // سِترًا
    ],
    [ // آية 91
      [], // كَذٰلِكَ
      [], // وَقَد
      [], // أَحَطنا
      [], // بِما
      [], // لَدَيهِ
      ["خُبرا : علما شاملا"] // خُبرًا
    ],
    [ // آية 92
      [], // ثُمَّ
      [], // أَتبَعَ
      [] // سَبَبًا
    ],
    [ // آية 93
      [], // حَتّىٰ
      [], // إِذا
      [], // بَلَغَ
      [], // بَينَ
      ["السّدّين : جبلين مُنيفين"], // السَّدَّينِ
      [], // وَجَدَ
      [], // مِن
      [], // دونِهِما
      [], // قَومًا
      [], // لا
      [], // يَكادونَ
      [], // يَفقَهونَ
      [] // قَولًا
    ],
    [ // آية 94
      [], // قالوا
      [], // يـٰذَا
      [], // القَرنَينِ
      [], // إِنَّ
      [], // يَأجوجَ
      [], // وَمَأجوجَ
      [], // مُفسِدونَ
      [], // فِى
      [], // الأَرضِ
      [], // فَهَل
      [], // نَجعَلُ
      [], // لَكَ
      ["خَرْجَا : جُعلا من المال تستعين به في البناء"], // خَرجًا
      [], // عَلىٰ
      [], // أَن
      [], // تَجعَلَ
      [], // بَينَنا
      [], // وَبَينَهُم
      ["سدّا : حاجزا فلا يصلون إلينا"] // سَدًّا
    ],
    [ // آية 95
      [], // قالَ
      [], // ما
      [], // مَكَّنّى
      [], // فيهِ
      [], // رَبّى
      [], // خَيرٌ
      [], // فَأَعينونى
      [], // بِقُوَّةٍ
      [], // أَجعَل
      [], // بَينَكُم
      [], // وَبَينَهُم
      ["ردْمَا : حاجزا حصينا متينا"] // رَدمًا
    ],
    [ // آية 96
      [], // ءاتونى
      ["زُبر الحديد : قِطعه العظيمة الضخمة"], // زُبَرَ
      ["زُبر الحديد : قِطعه العظيمة الضخمة"], // الحَديدِ
      [], // حَتّىٰ
      [], // إِذا
      [], // ساوىٰ
      [], // بَينَ
      ["الصّدفين : جانبي الجبلين"], // الصَّدَفَينِ
      [], // قالَ
      [], // انفُخوا
      [], // حَتّىٰ
      [], // إِذا
      [], // جَعَلَهُ
      [], // نارًا
      [], // قالَ
      [], // ءاتونى
      [], // أُفرِغ
      [], // عَلَيهِ
      ["قِطرا : نُحاسًا مُذابا"] // قِطرًا
    ],
    [ // آية 97
      [], // فَمَا
      [], // اسطـٰعوا
      [], // أَن
      ["يظْهروه : يعلوا على ظهره لارتفاعه"], // يَظهَروهُ
      [], // وَمَا
      [], // استَطـٰعوا
      [], // لَهُ
      ["نقبا : خرقا و ثقبا لصلابته و ثخانته"] // نَقبًا
    ],
    [ // آية 98
      [], // قالَ
      [], // هـٰذا
      [], // رَحمَةٌ
      [], // مِن
      [], // رَبّى
      [], // فَإِذا
      [], // جاءَ
      [], // وَعدُ
      [], // رَبّى
      ["جعله دكّاء : مدكوكا مُسوّى بالأرض"], // جَعَلَهُ
      ["جعله دكّاء : مدكوكا مُسوّى بالأرض"], // دَكّاءَ
      [], // وَكانَ
      [], // وَعدُ
      [], // رَبّى
      [] // حَقًّا
    ],
    [ // آية 99
      [], // وَتَرَكنا
      [], // بَعضَهُم
      [], // يَومَئِذٍ
      ["يموج : يختلط و يضطرب"], // يَموجُ
      [], // فى
      [], // بَعضٍ
      [], // وَنُفِخَ
      [], // فِى
      [], // الصّورِ
      [], // فَجَمَعنـٰهُم
      [] // جَمعًا
    ],
    [ // آية 100
      [], // وَعَرَضنا
      [], // جَهَنَّمَ
      [], // يَومَئِذٍ
      [], // لِلكـٰفِرينَ
      [] // عَرضًا
    ],
    [ // آية 101
      [], // الَّذينَ
      [], // كانَت
      [], // أَعيُنُهُم
      [], // فى
      ["غِطاء : غشاء غليظ و ستر كثيف"], // غِطاءٍ
      [], // عَن
      [], // ذِكرى
      [], // وَكانوا
      [], // لا
      [], // يَستَطيعونَ
      [] // سَمعًا
    ],
    [ // آية 102
      [], // أَفَحَسِبَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَن
      [], // يَتَّخِذوا
      [], // عِبادى
      [], // مِن
      [], // دونى
      [], // أَولِياءَ
      [], // إِنّا
      [], // أَعتَدنا
      [], // جَهَنَّمَ
      [], // لِلكـٰفِرينَ
      [] // نُزُلًا
    ],
    [ // آية 103
      [], // قُل
      [], // هَل
      [], // نُنَبِّئُكُم
      [], // بِالأَخسَرينَ
      [] // أَعمـٰلًا
    ],
    [ // آية 104
      [], // الَّذينَ
      [], // ضَلَّ
      [], // سَعيُهُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَهُم
      [], // يَحسَبونَ
      [], // أَنَّهُم
      [], // يُحسِنونَ
      [] // صُنعًا
    ],
    [ // آية 105
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      [], // وَلِقائِهِ
      [], // فَحَبِطَت
      [], // أَعمـٰلُهُم
      [], // فَلا
      [], // نُقيمُ
      [], // لَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      ["وزنا : مقدرا و اعتبارا لحبوط أعمالهم"] // وَزنًا
    ],
    [ // آية 106
      [], // ذٰلِكَ
      [], // جَزاؤُهُم
      [], // جَهَنَّمُ
      [], // بِما
      [], // كَفَروا
      [], // وَاتَّخَذوا
      [], // ءايـٰتى
      [], // وَرُسُلى
      [] // هُزُوًا
    ],
    [ // آية 107
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // كانَت
      [], // لَهُم
      [], // جَنّـٰتُ
      ["الفردوس : أعلى الجنّة و أوسطها و أفضلها"], // الفِردَوسِ
      [] // نُزُلًا
    ],
    [ // آية 108
      [], // خـٰلِدينَ
      [], // فيها
      [], // لا
      [], // يَبغونَ
      [], // عَنها
      ["حِوَلا : تحوّلا و انتقالا"] // حِوَلًا
    ],
    [ // آية 109
      [], // قُل
      [], // لَو
      [], // كانَ
      [], // البَحرُ
      ["مِدادًا : هو المّادة التي يكتب بها"], // مِدادًا
      [], // لِكَلِمـٰتِ
      [], // رَبّى
      ["لَنَفِدَ البحر : فنيَ و فَزع"], // لَنَفِدَ
      ["لَنَفِدَ البحر : فنيَ و فَزع"], // البَحرُ
      [], // قَبلَ
      [], // أَن
      [], // تَنفَدَ
      [], // كَلِمـٰتُ
      [], // رَبّى
      [], // وَلَو
      [], // جِئنا
      [], // بِمِثلِهِ
      ["مَدَدًا : عونا و زيادة"] // مَدَدًا
    ],
    [ // آية 110
      [], // قُل
      [], // إِنَّما
      [], // أَنا۠
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // أَنَّما
      [], // إِلـٰهُكُم
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // فَمَن
      [], // كانَ
      [], // يَرجوا
      [], // لِقاءَ
      [], // رَبِّهِ
      [], // فَليَعمَل
      [], // عَمَلًا
      [], // صـٰلِحًا
      [], // وَلا
      [], // يُشرِك
      [], // بِعِبادَةِ
      [], // رَبِّهِ
      [] // أَحَدًا
    ]
];

export default meanings;