const meanings = [
[ // آية 1
      [] // كهيعص
    ],
    [ // آية 2
      [], // ذِكرُ
      [], // رَحمَتِ
      [], // رَبِّكَ
      [], // عَبدَهُ
      [] // زَكَرِيّا
    ],
    [ // آية 3
      [], // إِذ
      [], // نادىٰ
      [], // رَبَّهُ
      ["نداءً خفيا : دعاءً مستورا لم يسمعه أحد"], // نِداءً
      ["نداءً خفيا : دعاءً مستورا لم يسمعه أحد"] // خَفِيًّا
    ],
    [ // آية 4
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      ["وهَنَ العظم : ضَعُـفَ و رَقّ"], // وَهَنَ
      ["وهَنَ العظم : ضَعُـفَ و رَقّ"], // العَظمُ
      [], // مِنّى
      [], // وَاشتَعَلَ
      [], // الرَّأسُ
      [], // شَيبًا
      [], // وَلَم
      [], // أَكُن
      [], // بِدُعائِكَ
      [], // رَبِّ
      ["شقيّا : خائبا في وقت مّا"] // شَقِيًّا
    ],
    [ // آية 5
      [], // وَإِنّى
      [], // خِفتُ
      [], // المَوٰلِىَ
      [], // مِن
      [], // وَراءى
      [], // وَكانَتِ
      [], // امرَأَتى
      [], // عاقِرًا
      [], // فَهَب
      [], // لى
      [], // مِن
      [], // لَدُنكَ
      ["وليّا : ابناً يلي الأمر بعدي"] // وَلِيًّا
    ],
    [ // آية 6
      [], // يَرِثُنى
      [], // وَيَرِثُ
      [], // مِن
      [], // ءالِ
      [], // يَعقوبَ
      [], // وَاجعَلهُ
      [], // رَبِّ
      [] // رَضِيًّا
    ],
    [ // آية 7
      [], // يـٰزَكَرِيّا
      [], // إِنّا
      [], // نُبَشِّرُكَ
      [], // بِغُلـٰمٍ
      [], // اسمُهُ
      [], // يَحيىٰ
      [], // لَم
      [], // نَجعَل
      [], // لَهُ
      [], // مِن
      [], // قَبلُ
      [] // سَمِيًّا
    ],
    [ // آية 8
      [], // قالَ
      [], // رَبِّ
      [], // أَنّىٰ
      [], // يَكونُ
      [], // لى
      [], // غُلـٰمٌ
      [], // وَكانَتِ
      [], // امرَأَتى
      [], // عاقِرًا
      [], // وَقَد
      [], // بَلَغتُ
      [], // مِنَ
      [], // الكِبَرِ
      ["عتيّا : حالةً لا سبيل إلى مُداواتها"] // عِتِيًّا
    ],
    [ // آية 9
      [], // قالَ
      [], // كَذٰلِكَ
      [], // قالَ
      [], // رَبُّكَ
      [], // هُوَ
      [], // عَلَىَّ
      [], // هَيِّنٌ
      [], // وَقَد
      [], // خَلَقتُكَ
      [], // مِن
      [], // قَبلُ
      [], // وَلَم
      [], // تَكُ
      [] // شَيـًٔا
    ],
    [ // آية 10
      [], // قالَ
      [], // رَبِّ
      [], // اجعَل
      [], // لى
      [], // ءايَةً
      [], // قالَ
      [], // ءايَتُكَ
      [], // أَلّا
      [], // تُكَلِّمَ
      [], // النّاسَ
      [], // ثَلـٰثَ
      [], // لَيالٍ
      ["سويّا : سليما لا خرس بك و لا علة"] // سَوِيًّا
    ],
    [ // آية 11
      [], // فَخَرَجَ
      [], // عَلىٰ
      [], // قَومِهِ
      ["من المحراب : المُصلّى أو الغرفة التـّي يتعبّد فيها"], // مِنَ
      ["من المحراب : المُصلّى أو الغرفة التـّي يتعبّد فيها"], // المِحرابِ
      [], // فَأَوحىٰ
      [], // إِلَيهِم
      [], // أَن
      [], // سَبِّحوا
      [], // بُكرَةً
      [] // وَعَشِيًّا
    ],
    [ // آية 12
      [], // يـٰيَحيىٰ
      [], // خُذِ
      [], // الكِتـٰبَ
      [], // بِقُوَّةٍ
      [], // وَءاتَينـٰهُ
      [], // الحُكمَ
      [] // صَبِيًّا
    ],
    [ // آية 13
      [], // وَحَنانًا
      [], // مِن
      [], // لَدُنّا
      [], // وَزَكوٰةً
      [], // وَكانَ
      [] // تَقِيًّا
    ],
    [ // آية 14
      [], // وَبَرًّا
      [], // بِوٰلِدَيهِ
      [], // وَلَم
      [], // يَكُن
      ["جبّارا عصيّا : مُتكبّرا مخالفا أمر ربّه"], // جَبّارًا
      ["جبّارا عصيّا : مُتكبّرا مخالفا أمر ربّه"] // عَصِيًّا
    ],
    [ // آية 15
      [], // وَسَلـٰمٌ
      [], // عَلَيهِ
      [], // يَومَ
      [], // وُلِدَ
      [], // وَيَومَ
      [], // يَموتُ
      [], // وَيَومَ
      [], // يُبعَثُ
      [] // حَيًّا
    ],
    [ // آية 16
      [], // وَاذكُر
      [], // فِى
      [], // الكِتـٰبِ
      [], // مَريَمَ
      [], // إِذِ
      ["انتبذت : اعتزلت و انفردتْ"], // انتَبَذَت
      [], // مِن
      [], // أَهلِها
      [], // مَكانًا
      [] // شَرقِيًّا
    ],
    [ // آية 17
      [], // فَاتَّخَذَت
      [], // مِن
      [], // دونِهِم
      ["حجابا : سِترا"], // حِجابًا
      [], // فَأَرسَلنا
      [], // إِلَيها
      ["روحنا : جبريل عليه السّلام"], // روحَنا
      [], // فَتَمَثَّلَ
      [], // لَها
      ["بشرا سويّا : إنسانا مُستوي الخلق تامّه"], // بَشَرًا
      ["بشرا سويّا : إنسانا مُستوي الخلق تامّه"] // سَوِيًّا
    ],
    [ // آية 18
      [], // قالَت
      [], // إِنّى
      [], // أَعوذُ
      [], // بِالرَّحمـٰنِ
      [], // مِنكَ
      [], // إِن
      [], // كُنتَ
      [] // تَقِيًّا
    ],
    [ // آية 19
      [], // قالَ
      [], // إِنَّما
      [], // أَنا۠
      [], // رَسولُ
      [], // رَبِّكِ
      [], // لِأَهَبَ
      [], // لَكِ
      [], // غُلـٰمًا
      [] // زَكِيًّا
    ],
    [ // آية 20
      [], // قالَت
      [], // أَنّىٰ
      [], // يَكونُ
      [], // لى
      [], // غُلـٰمٌ
      [], // وَلَم
      [], // يَمسَسنى
      [], // بَشَرٌ
      [], // وَلَم
      [], // أَكُ
      [] // بَغِيًّا
    ],
    [ // آية 21
      [], // قالَ
      [], // كَذٰلِكِ
      [], // قالَ
      [], // رَبُّكِ
      [], // هُوَ
      [], // عَلَىَّ
      [], // هَيِّنٌ
      [], // وَلِنَجعَلَهُ
      [], // ءايَةً
      [], // لِلنّاسِ
      [], // وَرَحمَةً
      [], // مِنّا
      [], // وَكانَ
      [], // أَمرًا
      [] // مَقضِيًّا
    ],
    [ // آية 22
      [], // فَحَمَلَتهُ
      [], // فَانتَبَذَت
      [], // بِهِ
      ["مكانا قصيّا : بعيدا من أهلها وراء الجبل"], // مَكانًا
      ["مكانا قصيّا : بعيدا من أهلها وراء الجبل"] // قَصِيًّا
    ],
    [ // آية 23
      ["فأجاءها المخاض : فألجأها و اضطرّها وجع الولادة"], // فَأَجاءَهَا
      ["فأجاءها المخاض : فألجأها و اضطرّها وجع الولادة"], // المَخاضُ
      [], // إِلىٰ
      [], // جِذعِ
      [], // النَّخلَةِ
      [], // قالَت
      [], // يـٰلَيتَنى
      [], // مِتُّ
      [], // قَبلَ
      [], // هـٰذا
      [], // وَكُنتُ
      ["نسيا منسيّا : شيئا حقيرا متروكا لا يخطر بالبال"], // نَسيًا
      ["نسيا منسيّا : شيئا حقيرا متروكا لا يخطر بالبال"] // مَنسِيًّا
    ],
    [ // آية 24
      [], // فَنادىٰها
      [], // مِن
      [], // تَحتِها
      [], // أَلّا
      [], // تَحزَنى
      [], // قَد
      [], // جَعَلَ
      [], // رَبُّكِ
      [], // تَحتَكِ
      ["سريّا : جدولا أو غلاما سامِيَ القـَدْر"] // سَرِيًّا
    ],
    [ // آية 25
      [], // وَهُزّى
      [], // إِلَيكِ
      [], // بِجِذعِ
      [], // النَّخلَةِ
      [], // تُسـٰقِط
      [], // عَلَيكِ
      ["رُطبًا جنيّا : صالحا  للاجْتِناء . أو طريّا"], // رُطَبًا
      ["رُطبًا جنيّا : صالحا  للاجْتِناء . أو طريّا"] // جَنِيًّا
    ],
    [ // آية 26
      [], // فَكُلى
      [], // وَاشرَبى
      [], // وَقَرّى
      [], // عَينًا
      [], // فَإِمّا
      [], // تَرَيِنَّ
      [], // مِنَ
      [], // البَشَرِ
      [], // أَحَدًا
      [], // فَقولى
      [], // إِنّى
      [], // نَذَرتُ
      [], // لِلرَّحمـٰنِ
      [], // صَومًا
      [], // فَلَن
      [], // أُكَلِّمَ
      [], // اليَومَ
      [] // إِنسِيًّا
    ],
    [ // آية 27
      [], // فَأَتَت
      [], // بِهِ
      [], // قَومَها
      [], // تَحمِلُهُ
      [], // قالوا
      [], // يـٰمَريَمُ
      [], // لَقَد
      [], // جِئتِ
      [], // شَيـًٔا
      [] // فَرِيًّا
    ],
    [ // آية 28
      [], // يـٰأُختَ
      [], // هـٰرونَ
      [], // ما
      [], // كانَ
      [], // أَبوكِ
      [], // امرَأَ
      [], // سَوءٍ
      [], // وَما
      [], // كانَت
      [], // أُمُّكِ
      [] // بَغِيًّا
    ],
    [ // آية 29
      [], // فَأَشارَت
      [], // إِلَيهِ
      [], // قالوا
      [], // كَيفَ
      [], // نُكَلِّمُ
      [], // مَن
      [], // كانَ
      [], // فِى
      [], // المَهدِ
      [] // صَبِيًّا
    ],
    [ // آية 30
      [], // قالَ
      [], // إِنّى
      [], // عَبدُ
      [], // اللَّهِ
      [], // ءاتىٰنِىَ
      [], // الكِتـٰبَ
      [], // وَجَعَلَنى
      [] // نَبِيًّا
    ],
    [ // آية 31
      [], // وَجَعَلَنى
      [], // مُبارَكًا
      [], // أَينَ
      [], // ما
      [], // كُنتُ
      [], // وَأَوصـٰنى
      [], // بِالصَّلوٰةِ
      [], // وَالزَّكوٰةِ
      [], // ما
      [], // دُمتُ
      [] // حَيًّا
    ],
    [ // آية 32
      [], // وَبَرًّا
      [], // بِوٰلِدَتى
      [], // وَلَم
      [], // يَجعَلنى
      [], // جَبّارًا
      [] // شَقِيًّا
    ],
    [ // آية 33
      [], // وَالسَّلـٰمُ
      [], // عَلَىَّ
      [], // يَومَ
      [], // وُلِدتُ
      [], // وَيَومَ
      [], // أَموتُ
      [], // وَيَومَ
      [], // أُبعَثُ
      [] // حَيًّا
    ],
    [ // آية 34
      [], // ذٰلِكَ
      [], // عيسَى
      [], // ابنُ
      [], // مَريَمَ
      [], // قَولَ
      [], // الحَقِّ
      [], // الَّذى
      [], // فيهِ
      ["يمترون : يشكّون أو يتجادلون بالباطل"] // يَمتَرونَ
    ],
    [ // آية 35
      [], // ما
      [], // كانَ
      [], // لِلَّهِ
      [], // أَن
      [], // يَتَّخِذَ
      [], // مِن
      [], // وَلَدٍ
      [], // سُبحـٰنَهُ
      [], // إِذا
      [], // قَضىٰ
      [], // أَمرًا
      [], // فَإِنَّما
      [], // يَقولُ
      [], // لَهُ
      [], // كُن
      [] // فَيَكونُ
    ],
    [ // آية 36
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // رَبّى
      [], // وَرَبُّكُم
      [], // فَاعبُدوهُ
      [], // هـٰذا
      [], // صِرٰطٌ
      [] // مُستَقيمٌ
    ],
    [ // آية 37
      [], // فَاختَلَفَ
      [], // الأَحزابُ
      [], // مِن
      [], // بَينِهِم
      [], // فَوَيلٌ
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // مَشهَدِ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 38
      [], // أَسمِع
      [], // بِهِم
      [], // وَأَبصِر
      [], // يَومَ
      [], // يَأتونَنا
      [], // لـٰكِنِ
      [], // الظّـٰلِمونَ
      [], // اليَومَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 39
      [], // وَأَنذِرهُم
      ["يوم الحسرة : النّدامة الشّديدة على ما فات"], // يَومَ
      ["يوم الحسرة : النّدامة الشّديدة على ما فات"], // الحَسرَةِ
      [], // إِذ
      [], // قُضِىَ
      [], // الأَمرُ
      [], // وَهُم
      [], // فى
      [], // غَفلَةٍ
      [], // وَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 40
      [], // إِنّا
      [], // نَحنُ
      [], // نَرِثُ
      [], // الأَرضَ
      [], // وَمَن
      [], // عَلَيها
      [], // وَإِلَينا
      [] // يُرجَعونَ
    ],
    [ // آية 41
      [], // وَاذكُر
      [], // فِى
      [], // الكِتـٰبِ
      [], // إِبرٰهيمَ
      [], // إِنَّهُ
      [], // كانَ
      [], // صِدّيقًا
      [] // نَبِيًّا
    ],
    [ // آية 42
      [], // إِذ
      [], // قالَ
      [], // لِأَبيهِ
      [], // يـٰأَبَتِ
      [], // لِمَ
      [], // تَعبُدُ
      [], // ما
      [], // لا
      [], // يَسمَعُ
      [], // وَلا
      [], // يُبصِرُ
      [], // وَلا
      [], // يُغنى
      [], // عَنكَ
      [] // شَيـًٔا
    ],
    [ // آية 43
      [], // يـٰأَبَتِ
      [], // إِنّى
      [], // قَد
      [], // جاءَنى
      [], // مِنَ
      [], // العِلمِ
      [], // ما
      [], // لَم
      [], // يَأتِكَ
      [], // فَاتَّبِعنى
      [], // أَهدِكَ
      [], // صِرٰطًا
      [] // سَوِيًّا
    ],
    [ // آية 44
      [], // يـٰأَبَتِ
      [], // لا
      [], // تَعبُدِ
      [], // الشَّيطـٰنَ
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      [], // كانَ
      [], // لِلرَّحمـٰنِ
      ["عصيّا : كثير العصيان"] // عَصِيًّا
    ],
    [ // آية 45
      [], // يـٰأَبَتِ
      [], // إِنّى
      [], // أَخافُ
      [], // أَن
      [], // يَمَسَّكَ
      [], // عَذابٌ
      [], // مِنَ
      [], // الرَّحمـٰنِ
      [], // فَتَكونَ
      [], // لِلشَّيطـٰنِ
      ["وليّا : قرينا تليه و يليك في النّار"] // وَلِيًّا
    ],
    [ // آية 46
      [], // قالَ
      [], // أَراغِبٌ
      [], // أَنتَ
      [], // عَن
      [], // ءالِهَتى
      [], // يـٰإِبرٰهيمُ
      [], // لَئِن
      [], // لَم
      [], // تَنتَهِ
      [], // لَأَرجُمَنَّكَ
      [], // وَاهجُرنى
      [] // مَلِيًّا
    ],
    [ // آية 47
      [], // قالَ
      [], // سَلـٰمٌ
      [], // عَلَيكَ
      [], // سَأَستَغفِرُ
      [], // لَكَ
      [], // رَبّى
      [], // إِنَّهُ
      [], // كانَ
      [], // بى
      [] // حَفِيًّا
    ],
    [ // آية 48
      [], // وَأَعتَزِلُكُم
      [], // وَما
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَأَدعوا
      [], // رَبّى
      [], // عَسىٰ
      [], // أَلّا
      [], // أَكونَ
      [], // بِدُعاءِ
      [], // رَبّى
      ["شقيّا : خائبا ضائع السّعي"] // شَقِيًّا
    ],
    [ // آية 49
      [], // فَلَمَّا
      [], // اعتَزَلَهُم
      [], // وَما
      [], // يَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَهَبنا
      [], // لَهُ
      [], // إِسحـٰقَ
      [], // وَيَعقوبَ
      [], // وَكُلًّا
      [], // جَعَلنا
      [] // نَبِيًّا
    ],
    [ // آية 50
      [], // وَوَهَبنا
      [], // لَهُم
      [], // مِن
      [], // رَحمَتِنا
      [], // وَجَعَلنا
      [], // لَهُم
      ["لسان صِدق : ثناءً حسنا في أهل كلّ دين"], // لِسانَ
      ["لسان صِدق : ثناءً حسنا في أهل كلّ دين"], // صِدقٍ
      [] // عَلِيًّا
    ],
    [ // آية 51
      [], // وَاذكُر
      [], // فِى
      [], // الكِتـٰبِ
      [], // موسىٰ
      [], // إِنَّهُ
      [], // كانَ
      [], // مُخلَصًا
      [], // وَكانَ
      [], // رَسولًا
      [] // نَبِيًّا
    ],
    [ // آية 52
      [], // وَنـٰدَينـٰهُ
      [], // مِن
      [], // جانِبِ
      [], // الطّورِ
      [], // الأَيمَنِ
      [], // وَقَرَّبنـٰهُ
      [] // نَجِيًّا
    ],
    [ // آية 53
      [], // وَوَهَبنا
      [], // لَهُ
      [], // مِن
      [], // رَحمَتِنا
      [], // أَخاهُ
      [], // هـٰرونَ
      [] // نَبِيًّا
    ],
    [ // آية 54
      [], // وَاذكُر
      [], // فِى
      [], // الكِتـٰبِ
      [], // إِسمـٰعيلَ
      [], // إِنَّهُ
      [], // كانَ
      [], // صادِقَ
      [], // الوَعدِ
      [], // وَكانَ
      [], // رَسولًا
      [] // نَبِيًّا
    ],
    [ // آية 55
      [], // وَكانَ
      [], // يَأمُرُ
      [], // أَهلَهُ
      [], // بِالصَّلوٰةِ
      [], // وَالزَّكوٰةِ
      [], // وَكانَ
      [], // عِندَ
      [], // رَبِّهِ
      [] // مَرضِيًّا
    ],
    [ // آية 56
      [], // وَاذكُر
      [], // فِى
      [], // الكِتـٰبِ
      [], // إِدريسَ
      [], // إِنَّهُ
      [], // كانَ
      [], // صِدّيقًا
      [] // نَبِيًّا
    ],
    [ // آية 57
      [], // وَرَفَعنـٰهُ
      [], // مَكانًا
      [] // عَلِيًّا
    ],
    [ // آية 58
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // أَنعَمَ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // مِنَ
      [], // النَّبِيّـۧنَ
      [], // مِن
      [], // ذُرِّيَّةِ
      [], // ءادَمَ
      [], // وَمِمَّن
      [], // حَمَلنا
      [], // مَعَ
      [], // نوحٍ
      [], // وَمِن
      [], // ذُرِّيَّةِ
      [], // إِبرٰهيمَ
      [], // وَإِسرٰءيلَ
      [], // وَمِمَّن
      [], // هَدَينا
      [], // وَاجتَبَينا
      [], // إِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُ
      [], // الرَّحمـٰنِ
      [], // خَرّوا
      [], // سُجَّدًا
      [] // وَبُكِيًّا
    ],
    [ // آية 59
      [], // فَخَلَفَ
      [], // مِن
      [], // بَعدِهِم
      ["خلفٌ : عَـقِـبٌ سَوْءٍ"], // خَلفٌ
      [], // أَضاعُوا
      [], // الصَّلوٰةَ
      [], // وَاتَّبَعُوا
      [], // الشَّهَوٰتِ
      [], // فَسَوفَ
      ["يلقون غيّا : جزاء الغيّ . أو واديا في جهنّم"], // يَلقَونَ
      ["يلقون غيّا : جزاء الغيّ . أو واديا في جهنّم"] // غَيًّا
    ],
    [ // آية 60
      [], // إِلّا
      [], // مَن
      [], // تابَ
      [], // وَءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // فَأُولـٰئِكَ
      [], // يَدخُلونَ
      [], // الجَنَّةَ
      [], // وَلا
      [], // يُظلَمونَ
      [] // شَيـًٔا
    ],
    [ // آية 61
      [], // جَنّـٰتِ
      [], // عَدنٍ
      [], // الَّتى
      [], // وَعَدَ
      [], // الرَّحمـٰنُ
      [], // عِبادَهُ
      [], // بِالغَيبِ
      [], // إِنَّهُ
      [], // كانَ
      [], // وَعدُهُ
      ["مأتيّا : آتيا أو مُــنـَـجَّــزًا"] // مَأتِيًّا
    ],
    [ // آية 62
      [], // لا
      [], // يَسمَعونَ
      [], // فيها
      ["لغوا : قبيحا أو فُضولا من الكلام"], // لَغوًا
      [], // إِلّا
      [], // سَلـٰمًا
      [], // وَلَهُم
      [], // رِزقُهُم
      [], // فيها
      [], // بُكرَةً
      [] // وَعَشِيًّا
    ],
    [ // آية 63
      [], // تِلكَ
      [], // الجَنَّةُ
      [], // الَّتى
      [], // نورِثُ
      [], // مِن
      [], // عِبادِنا
      [], // مَن
      [], // كانَ
      [] // تَقِيًّا
    ],
    [ // آية 64
      [], // وَما
      [], // نَتَنَزَّلُ
      [], // إِلّا
      [], // بِأَمرِ
      [], // رَبِّكَ
      [], // لَهُ
      [], // ما
      [], // بَينَ
      [], // أَيدينا
      [], // وَما
      [], // خَلفَنا
      [], // وَما
      [], // بَينَ
      [], // ذٰلِكَ
      [], // وَما
      [], // كانَ
      [], // رَبُّكَ
      [] // نَسِيًّا
    ],
    [ // آية 65
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // فَاعبُدهُ
      [], // وَاصطَبِر
      [], // لِعِبـٰدَتِهِ
      [], // هَل
      [], // تَعلَمُ
      [], // لَهُ
      ["سميّا : مُضاهيا في ذاته و صفاته : لا"] // سَمِيًّا
    ],
    [ // آية 66
      [], // وَيَقولُ
      [], // الإِنسـٰنُ
      [], // أَءِذا
      [], // ما
      [], // مِتُّ
      [], // لَسَوفَ
      [], // أُخرَجُ
      [] // حَيًّا
    ],
    [ // آية 67
      [], // أَوَلا
      [], // يَذكُرُ
      [], // الإِنسـٰنُ
      [], // أَنّا
      [], // خَلَقنـٰهُ
      [], // مِن
      [], // قَبلُ
      [], // وَلَم
      [], // يَكُ
      [] // شَيـًٔا
    ],
    [ // آية 68
      [], // فَوَرَبِّكَ
      [], // لَنَحشُرَنَّهُم
      [], // وَالشَّيـٰطينَ
      [], // ثُمَّ
      [], // لَنُحضِرَنَّهُم
      [], // حَولَ
      [], // جَهَنَّمَ
      ["جثيّا : باركِين على رُكبهم لشدّة الهول"] // جِثِيًّا
    ],
    [ // آية 69
      [], // ثُمَّ
      [], // لَنَنزِعَنَّ
      [], // مِن
      [], // كُلِّ
      [], // شيعَةٍ
      [], // أَيُّهُم
      [], // أَشَدُّ
      [], // عَلَى
      [], // الرَّحمـٰنِ
      ["عتيّا : عِـصيانا ، أو جراءة أو فُجورا"] // عِتِيًّا
    ],
    [ // آية 70
      [], // ثُمَّ
      [], // لَنَحنُ
      [], // أَعلَمُ
      [], // بِالَّذينَ
      [], // هُم
      [], // أَولىٰ
      [], // بِها
      ["صليّا : دُخولا أو مُقاساة لحرّها"] // صِلِيًّا
    ],
    [ // آية 71
      [], // وَإِن
      [], // مِنكُم
      [], // إِلّا
      ["واردها : بالمرور على الصّراط الممدود عليها"], // وارِدُها
      [], // كانَ
      [], // عَلىٰ
      [], // رَبِّكَ
      [], // حَتمًا
      [] // مَقضِيًّا
    ],
    [ // آية 72
      [], // ثُمَّ
      [], // نُنَجِّى
      [], // الَّذينَ
      [], // اتَّقَوا
      [], // وَنَذَرُ
      [], // الظّـٰلِمينَ
      [], // فيها
      [] // جِثِيًّا
    ],
    [ // آية 73
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // بَيِّنـٰتٍ
      [], // قالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // أَىُّ
      [], // الفَريقَينِ
      ["خيرٌ مُقاما : منزلا و سكنا"], // خَيرٌ
      ["خيرٌ مُقاما : منزلا و سكنا"], // مَقامًا
      [], // وَأَحسَنُ
      [] // نَدِيًّا
    ],
    [ // آية 74
      [], // وَكَم
      [], // أَهلَكنا
      [], // قَبلَهُم
      [], // مِن
      ["قرْنٍ : أمّة"], // قَرنٍ
      [], // هُم
      [], // أَحسَنُ
      [], // أَثـٰثًا
      [] // وَرِءيًا
    ],
    [ // آية 75
      [], // قُل
      [], // مَن
      [], // كانَ
      [], // فِى
      [], // الضَّلـٰلَةِ
      ["فليمدد له : يُمهله استدراجا"], // فَليَمدُد
      ["فليمدد له : يُمهله استدراجا"], // لَهُ
      [], // الرَّحمـٰنُ
      [], // مَدًّا
      [], // حَتّىٰ
      [], // إِذا
      [], // رَأَوا
      [], // ما
      [], // يوعَدونَ
      [], // إِمَّا
      [], // العَذابَ
      [], // وَإِمَّا
      [], // السّاعَةَ
      [], // فَسَيَعلَمونَ
      [], // مَن
      [], // هُوَ
      [], // شَرٌّ
      [], // مَكانًا
      [], // وَأَضعَفُ
      [] // جُندًا
    ],
    [ // آية 76
      [], // وَيَزيدُ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // اهتَدَوا
      [], // هُدًى
      [], // وَالبـٰقِيـٰتُ
      [], // الصّـٰلِحـٰتُ
      [], // خَيرٌ
      [], // عِندَ
      [], // رَبِّكَ
      [], // ثَوابًا
      [], // وَخَيرٌ
      [] // مَرَدًّا
    ],
    [ // آية 77
      [], // أَفَرَءَيتَ
      [], // الَّذى
      [], // كَفَرَ
      [], // بِـٔايـٰتِنا
      [], // وَقالَ
      [], // لَأوتَيَنَّ
      [], // مالًا
      [] // وَوَلَدًا
    ],
    [ // آية 78
      [], // أَطَّلَعَ
      [], // الغَيبَ
      [], // أَمِ
      [], // اتَّخَذَ
      [], // عِندَ
      [], // الرَّحمـٰنِ
      [] // عَهدًا
    ],
    [ // آية 79
      [], // كَلّا
      [], // سَنَكتُبُ
      [], // ما
      [], // يَقولُ
      [], // وَنَمُدُّ
      [], // لَهُ
      [], // مِنَ
      [], // العَذابِ
      [] // مَدًّا
    ],
    [ // آية 80
      [], // وَنَرِثُهُ
      [], // ما
      [], // يَقولُ
      [], // وَيَأتينا
      [] // فَردًا
    ],
    [ // آية 81
      [], // وَاتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ءالِهَةً
      [], // لِيَكونوا
      [], // لَهُم
      ["عزّا : شُفعاء و أنصارا يتعزّزون بهم"] // عِزًّا
    ],
    [ // آية 82
      [], // كَلّا
      [], // سَيَكفُرونَ
      [], // بِعِبادَتِهِم
      [], // وَيَكونونَ
      [], // عَلَيهِم
      ["ضدّا : ذلاّ و هوانا لا عزّا أو أعوانا عليهم"] // ضِدًّا
    ],
    [ // آية 83
      [], // أَلَم
      [], // تَرَ
      [], // أَنّا
      [], // أَرسَلنَا
      [], // الشَّيـٰطينَ
      [], // عَلَى
      [], // الكـٰفِرينَ
      ["تؤزّهم أزّا : تُغريهم بالمعاصي إغراء"], // تَؤُزُّهُم
      ["تؤزّهم أزّا : تُغريهم بالمعاصي إغراء"] // أَزًّا
    ],
    [ // آية 84
      [], // فَلا
      [], // تَعجَل
      [], // عَلَيهِم
      [], // إِنَّما
      [], // نَعُدُّ
      [], // لَهُم
      [] // عَدًّا
    ],
    [ // آية 85
      [], // يَومَ
      [], // نَحشُرُ
      [], // المُتَّقينَ
      [], // إِلَى
      [], // الرَّحمـٰنِ
      ["وفدا : ركبانا . أو وافدين استرفاداً"] // وَفدًا
    ],
    [ // آية 86
      [], // وَنَسوقُ
      [], // المُجرِمينَ
      [], // إِلىٰ
      [], // جَهَنَّمَ
      ["وردا : عِطاشا . أو كالدّوابّ التي تَردُ الماء"] // وِردًا
    ],
    [ // آية 87
      [], // لا
      [], // يَملِكونَ
      [], // الشَّفـٰعَةَ
      [], // إِلّا
      [], // مَنِ
      [], // اتَّخَذَ
      [], // عِندَ
      [], // الرَّحمـٰنِ
      [] // عَهدًا
    ],
    [ // آية 88
      [], // وَقالُوا
      [], // اتَّخَذَ
      [], // الرَّحمـٰنُ
      [] // وَلَدًا
    ],
    [ // آية 89
      [], // لَقَد
      [], // جِئتُم
      [], // شَيـًٔا
      [] // إِدًّا
    ],
    [ // آية 90
      [], // تَكادُ
      [], // السَّمـٰوٰتُ
      ["يتفطّرن منه : يتشـقـّـقـْن و يتفــتـّــتـْن من شناعته"], // يَتَفَطَّرنَ
      ["يتفطّرن منه : يتشـقـّـقـْن و يتفــتـّــتـْن من شناعته"], // مِنهُ
      [], // وَتَنشَقُّ
      [], // الأَرضُ
      [], // وَتَخِرُّ
      [], // الجِبالُ
      [] // هَدًّا
    ],
    [ // آية 91
      [], // أَن
      [], // دَعَوا
      [], // لِلرَّحمـٰنِ
      [] // وَلَدًا
    ],
    [ // آية 92
      [], // وَما
      [], // يَنبَغى
      [], // لِلرَّحمـٰنِ
      [], // أَن
      [], // يَتَّخِذَ
      [] // وَلَدًا
    ],
    [ // آية 93
      [], // إِن
      [], // كُلُّ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // إِلّا
      [], // ءاتِى
      [], // الرَّحمـٰنِ
      [] // عَبدًا
    ],
    [ // آية 94
      [], // لَقَد
      [], // أَحصىٰهُم
      [], // وَعَدَّهُم
      [] // عَدًّا
    ],
    [ // آية 95
      [], // وَكُلُّهُم
      [], // ءاتيهِ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [] // فَردًا
    ],
    [ // آية 96
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // سَيَجعَلُ
      [], // لَهُمُ
      [], // الرَّحمـٰنُ
      ["وُدّا : مودّة و محبّة في القلوب"] // وُدًّا
    ],
    [ // آية 97
      [], // فَإِنَّما
      [], // يَسَّرنـٰهُ
      [], // بِلِسانِكَ
      [], // لِتُبَشِّرَ
      [], // بِهِ
      [], // المُتَّقينَ
      [], // وَتُنذِرَ
      [], // بِهِ
      ["قوما لدّا : شديدي الخصومة بالباطل"], // قَومًا
      ["قوما لدّا : شديدي الخصومة بالباطل"] // لُدًّا
    ],
    [ // آية 98
      [], // وَكَم
      [], // أَهلَكنا
      [], // قَبلَهُم
      [], // مِن
      ["قرْن : أمّة"], // قَرنٍ
      [], // هَل
      ["تحِسّ : تجد . أو ترى . أو تعلم"], // تُحِسُّ
      [], // مِنهُم
      [], // مِن
      [], // أَحَدٍ
      [], // أَو
      [], // تَسمَعُ
      [], // لَهُم
      ["ركزا : صوْتا خفيّا"] // رِكزًا
    ]
];

export default meanings;