const meanings = [
  [ // سورة 20: طه
[ // آية 1
      [] // طه
    ],
    [ // آية 2
      [], // ما
      [], // أَنزَلنا
      [], // عَلَيكَ
      [], // القُرءانَ
      ["لِتشقى : لتتعب بالإفراط في مُكابدة الشدائد و التأسّف على قومك"] // لِتَشقىٰ
    ],
    [ // آية 3
      [], // إِلّا
      [], // تَذكِرَةً
      [], // لِمَن
      [] // يَخشىٰ
    ],
    [ // آية 4
      [], // تَنزيلًا
      [], // مِمَّن
      [], // خَلَقَ
      [], // الأَرضَ
      [], // وَالسَّمـٰوٰتِ
      [] // العُلَى
    ],
    [ // آية 5
      [], // الرَّحمـٰنُ
      ["على العرش استوى : استواءً يليق به تعالى"], // عَلَى
      ["على العرش استوى : استواءً يليق به تعالى"], // العَرشِ
      ["على العرش استوى : استواءً يليق به تعالى"] // استَوىٰ
    ],
    [ // آية 6
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // وَما
      [], // تَحتَ
      [] // الثَّرىٰ
    ],
    [ // آية 7
      [], // وَإِن
      [], // تَجهَر
      [], // بِالقَولِ
      [], // فَإِنَّهُ
      [], // يَعلَمُ
      [], // السِّرَّ
      [] // وَأَخفَى
    ],
    [ // آية 8
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // لَهُ
      [], // الأَسماءُ
      [] // الحُسنىٰ
    ],
    [ // آية 9
      [], // وَهَل
      [], // أَتىٰكَ
      [], // حَديثُ
      [] // موسىٰ
    ],
    [ // آية 10
      [], // إِذ
      [], // رَءا
      [], // نارًا
      [], // فَقالَ
      [], // لِأَهلِهِ
      [], // امكُثوا
      [], // إِنّى
      [], // ءانَستُ
      [], // نارًا
      [], // لَعَلّى
      [], // ءاتيكُم
      [], // مِنها
      ["بقبس : بشعلة نار مقبوسة على رأس عود"], // بِقَبَسٍ
      [], // أَو
      [], // أَجِدُ
      [], // عَلَى
      [], // النّارِ
      ["هدًى : هاديا يهديني إلى الطريق"] // هُدًى
    ],
    [ // آية 11
      [], // فَلَمّا
      [], // أَتىٰها
      [], // نودِىَ
      [] // يـٰموسىٰ
    ],
    [ // آية 12
      [], // إِنّى
      [], // أَنا۠
      [], // رَبُّكَ
      [], // فَاخلَع
      [], // نَعلَيكَ
      [], // إِنَّكَ
      [], // بِالوادِ
      [], // المُقَدَّسِ
      ["طُوى : اسم للوادي"] // طُوًى
    ],
    [ // آية 13
      [], // وَأَنَا
      [], // اختَرتُكَ
      [], // فَاستَمِع
      [], // لِما
      [] // يوحىٰ
    ],
    [ // آية 14
      [], // إِنَّنى
      [], // أَنَا
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // أَنا۠
      [], // فَاعبُدنى
      [], // وَأَقِمِ
      [], // الصَّلوٰةَ
      [] // لِذِكرى
    ],
    [ // آية 15
      [], // إِنَّ
      [], // السّاعَةَ
      [], // ءاتِيَةٌ
      ["أكاد أخفيها : أقربُ أن أسترها من نفسي"], // أَكادُ
      ["أكاد أخفيها : أقربُ أن أسترها من نفسي"], // أُخفيها
      [], // لِتُجزىٰ
      [], // كُلُّ
      [], // نَفسٍ
      [], // بِما
      [] // تَسعىٰ
    ],
    [ // آية 16
      [], // فَلا
      [], // يَصُدَّنَّكَ
      [], // عَنها
      [], // مَن
      [], // لا
      [], // يُؤمِنُ
      [], // بِها
      [], // وَاتَّبَعَ
      [], // هَوىٰهُ
      [] // فَتَردىٰ
    ],
    [ // آية 17
      [], // وَما
      [], // تِلكَ
      [], // بِيَمينِكَ
      [] // يـٰموسىٰ
    ],
    [ // آية 18
      [], // قالَ
      [], // هِىَ
      [], // عَصاىَ
      [], // أَتَوَكَّؤُا۟
      [], // عَلَيها
      [], // وَأَهُشُّ
      [], // بِها
      [], // عَلىٰ
      [], // غَنَمى
      [], // وَلِىَ
      [], // فيها
      [], // مَـٔارِبُ
      [] // أُخرىٰ
    ],
    [ // آية 19
      [], // قالَ
      [], // أَلقِها
      [] // يـٰموسىٰ
    ],
    [ // آية 20
      [], // فَأَلقىٰها
      [], // فَإِذا
      [], // هِىَ
      ["حيّة تسعى : تمشي بسرعة و خفة"], // حَيَّةٌ
      ["حيّة تسعى : تمشي بسرعة و خفة"] // تَسعىٰ
    ],
    [ // آية 21
      [], // قالَ
      [], // خُذها
      [], // وَلا
      [], // تَخَف
      [], // سَنُعيدُها
      [], // سيرَتَهَا
      [] // الأولىٰ
    ],
    [ // آية 22
      [], // وَاضمُم
      [], // يَدَكَ
      ["إلى جناحك : إلى جنبك تحت العضد الأيسر"], // إِلىٰ
      ["إلى جناحك : إلى جنبك تحت العضد الأيسر"], // جَناحِكَ
      [], // تَخرُج
      ["بيضاء : لها شعاع الشّمس"], // بَيضاءَ
      [], // مِن
      ["غير سُوء : غير داءٍ بَرَص و نحوه"], // غَيرِ
      ["غير سُوء : غير داءٍ بَرَص و نحوه"], // سوءٍ
      [], // ءايَةً
      [] // أُخرىٰ
    ],
    [ // آية 23
      [], // لِنُرِيَكَ
      [], // مِن
      [], // ءايـٰتِنَا
      [] // الكُبرَى
    ],
    [ // آية 24
      [], // اذهَب
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // إِنَّهُ
      ["طغى : جاوز الحدّ في العتوّ و التجبّر"] // طَغىٰ
    ],
    [ // آية 25
      [], // قالَ
      [], // رَبِّ
      [], // اشرَح
      [], // لى
      [] // صَدرى
    ],
    [ // آية 26
      [], // وَيَسِّر
      [], // لى
      [] // أَمرى
    ],
    [ // آية 27
      [], // وَاحلُل
      [], // عُقدَةً
      [], // مِن
      [] // لِسانى
    ],
    [ // آية 28
      [], // يَفقَهوا
      [] // قَولى
    ],
    [ // آية 29
      [], // وَاجعَل
      [], // لى
      ["وزيرا : ظهيرا و مُعينا"], // وَزيرًا
      [], // مِن
      [] // أَهلى
    ],
    [ // آية 30
      [], // هـٰرونَ
      [] // أَخِى
    ],
    [ // آية 31
      [], // اشدُد
      [], // بِهِ
      [] // أَزرى
    ],
    [ // آية 32
      [], // وَأَشرِكهُ
      [], // فى
      [] // أَمرى
    ],
    [ // آية 33
      [], // كَى
      [], // نُسَبِّحَكَ
      [] // كَثيرًا
    ],
    [ // آية 34
      [], // وَنَذكُرَكَ
      [] // كَثيرًا
    ],
    [ // آية 35
      [], // إِنَّكَ
      [], // كُنتَ
      [], // بِنا
      [] // بَصيرًا
    ],
    [ // آية 36
      [], // قالَ
      [], // قَد
      ["أوتيت سؤْلك : أعطِيت مَسْـئولك و مطلوبك"], // أوتيتَ
      ["أوتيت سؤْلك : أعطِيت مَسْـئولك و مطلوبك"], // سُؤلَكَ
      [] // يـٰموسىٰ
    ],
    [ // آية 37
      [], // وَلَقَد
      [], // مَنَنّا
      [], // عَلَيكَ
      [], // مَرَّةً
      [] // أُخرىٰ
    ],
    [ // آية 38
      [], // إِذ
      [], // أَوحَينا
      [], // إِلىٰ
      [], // أُمِّكَ
      [], // ما
      [] // يوحىٰ
    ],
    [ // آية 39
      [], // أَنِ
      [], // اقذِفيهِ
      [], // فِى
      [], // التّابوتِ
      [], // فَاقذِفيهِ
      [], // فِى
      [], // اليَمِّ
      [], // فَليُلقِهِ
      [], // اليَمُّ
      [], // بِالسّاحِلِ
      [], // يَأخُذهُ
      [], // عَدُوٌّ
      [], // لى
      [], // وَعَدُوٌّ
      [], // لَهُ
      [], // وَأَلقَيتُ
      [], // عَلَيكَ
      [], // مَحَبَّةً
      [], // مِنّى
      [], // وَلِتُصنَعَ
      [], // عَلىٰ
      [] // عَينى
    ],
    [ // آية 40
      [], // إِذ
      [], // تَمشى
      [], // أُختُكَ
      [], // فَتَقولُ
      [], // هَل
      [], // أَدُلُّكُم
      [], // عَلىٰ
      ["من يكفله : من يضمّه إليه و يحفظه و يُربّيه"], // مَن
      ["من يكفله : من يضمّه إليه و يحفظه و يُربّيه"], // يَكفُلُهُ
      [], // فَرَجَعنـٰكَ
      [], // إِلىٰ
      [], // أُمِّكَ
      [], // كَى
      ["تقرّ عينها : تـُـسَرّ بلقائك"], // تَقَرَّ
      ["تقرّ عينها : تـُـسَرّ بلقائك"], // عَينُها
      [], // وَلا
      [], // تَحزَنَ
      [], // وَقَتَلتَ
      [], // نَفسًا
      [], // فَنَجَّينـٰكَ
      [], // مِنَ
      [], // الغَمِّ
      [], // وَفَتَنّـٰكَ
      [], // فُتونًا
      [], // فَلَبِثتَ
      [], // سِنينَ
      [], // فى
      [], // أَهلِ
      [], // مَديَنَ
      [], // ثُمَّ
      ["جئت على قدر : على وَفق الوقت المقدّر لإرسالك"], // جِئتَ
      ["جئت على قدر : على وَفق الوقت المقدّر لإرسالك"], // عَلىٰ
      ["جئت على قدر : على وَفق الوقت المقدّر لإرسالك"], // قَدَرٍ
      [] // يـٰموسىٰ
    ],
    [ // آية 41
      [], // وَاصطَنَعتُكَ
      [] // لِنَفسِى
    ],
    [ // آية 42
      [], // اذهَب
      [], // أَنتَ
      [], // وَأَخوكَ
      [], // بِـٔايـٰتى
      [], // وَلا
      [], // تَنِيا
      [], // فى
      [] // ذِكرِى
    ],
    [ // آية 43
      [], // اذهَبا
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // إِنَّهُ
      [] // طَغىٰ
    ],
    [ // آية 44
      [], // فَقولا
      [], // لَهُ
      [], // قَولًا
      [], // لَيِّنًا
      [], // لَعَلَّهُ
      [], // يَتَذَكَّرُ
      [], // أَو
      [] // يَخشىٰ
    ],
    [ // آية 45
      [], // قالا
      [], // رَبَّنا
      [], // إِنَّنا
      [], // نَخافُ
      [], // أَن
      ["يفرُط علينا : يعجل علينا بالعقوبة"], // يَفرُطَ
      ["يفرُط علينا : يعجل علينا بالعقوبة"], // عَلَينا
      [], // أَو
      [], // أَن
      ["يطغى : يزداد طُغيانا و عُـتوّاو جراءة"] // يَطغىٰ
    ],
    [ // آية 46
      [], // قالَ
      [], // لا
      [], // تَخافا
      [], // إِنَّنى
      [], // مَعَكُما
      [], // أَسمَعُ
      [] // وَأَرىٰ
    ],
    [ // آية 47
      [], // فَأتِياهُ
      [], // فَقولا
      [], // إِنّا
      [], // رَسولا
      [], // رَبِّكَ
      [], // فَأَرسِل
      [], // مَعَنا
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // وَلا
      [], // تُعَذِّبهُم
      [], // قَد
      [], // جِئنـٰكَ
      [], // بِـٔايَةٍ
      [], // مِن
      [], // رَبِّكَ
      [], // وَالسَّلـٰمُ
      [], // عَلىٰ
      [], // مَنِ
      [], // اتَّبَعَ
      [] // الهُدىٰ
    ],
    [ // آية 48
      [], // إِنّا
      [], // قَد
      [], // أوحِىَ
      [], // إِلَينا
      [], // أَنَّ
      [], // العَذابَ
      [], // عَلىٰ
      [], // مَن
      [], // كَذَّبَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 49
      [], // قالَ
      [], // فَمَن
      [], // رَبُّكُما
      [] // يـٰموسىٰ
    ],
    [ // آية 50
      [], // قالَ
      [], // رَبُّنَا
      [], // الَّذى
      [], // أَعطىٰ
      [], // كُلَّ
      [], // شَىءٍ
      [], // خَلقَهُ
      [], // ثُمَّ
      ["هَدَى : أرشدَه إلى ما يصلح له"] // هَدىٰ
    ],
    [ // آية 51
      [], // قالَ
      [], // فَما
      [], // بالُ
      [], // القُرونِ
      [] // الأولىٰ
    ],
    [ // آية 52
      [], // قالَ
      [], // عِلمُها
      [], // عِندَ
      [], // رَبّى
      [], // فى
      [], // كِتـٰبٍ
      [], // لا
      [], // يَضِلُّ
      [], // رَبّى
      [], // وَلا
      [] // يَنسَى
    ],
    [ // آية 53
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الأَرضَ
      ["مهدا : كالفراش الذي يُوطّأ للصّبي"], // مَهدًا
      [], // وَسَلَكَ
      [], // لَكُم
      [], // فيها
      [], // سُبُلًا
      [], // وَأَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَخرَجنا
      [], // بِهِ
      [], // أَزوٰجًا
      [], // مِن
      [], // نَباتٍ
      [] // شَتّىٰ
    ],
    [ // آية 54
      [], // كُلوا
      [], // وَارعَوا
      [], // أَنعـٰمَكُم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِأُولِى
      [] // النُّهىٰ
    ],
    [ // آية 55
      [], // مِنها
      [], // خَلَقنـٰكُم
      [], // وَفيها
      [], // نُعيدُكُم
      [], // وَمِنها
      [], // نُخرِجُكُم
      [], // تارَةً
      [] // أُخرىٰ
    ],
    [ // آية 56
      [], // وَلَقَد
      [], // أَرَينـٰهُ
      [], // ءايـٰتِنا
      [], // كُلَّها
      [], // فَكَذَّبَ
      [] // وَأَبىٰ
    ],
    [ // آية 57
      [], // قالَ
      [], // أَجِئتَنا
      [], // لِتُخرِجَنا
      [], // مِن
      [], // أَرضِنا
      [], // بِسِحرِكَ
      [] // يـٰموسىٰ
    ],
    [ // آية 58
      [], // فَلَنَأتِيَنَّكَ
      [], // بِسِحرٍ
      [], // مِثلِهِ
      [], // فَاجعَل
      [], // بَينَنا
      [], // وَبَينَكَ
      [], // مَوعِدًا
      [], // لا
      [], // نُخلِفُهُ
      [], // نَحنُ
      [], // وَلا
      [], // أَنتَ
      ["مكانا سُوى : وَسَطا أو مُستويا من الأرض"], // مَكانًا
      ["مكانا سُوى : وَسَطا أو مُستويا من الأرض"] // سُوًى
    ],
    [ // آية 59
      [], // قالَ
      [], // مَوعِدُكُم
      ["يوم الزّينة : يوم عيدكم (يوم مشهود)"], // يَومُ
      ["يوم الزّينة : يوم عيدكم (يوم مشهود)"], // الزّينَةِ
      [], // وَأَن
      [], // يُحشَرَ
      [], // النّاسُ
      [] // ضُحًى
    ],
    [ // آية 60
      [], // فَتَوَلّىٰ
      [], // فِرعَونُ
      ["فجمع كيده : سحَرته الذين يكيد بهم"], // فَجَمَعَ
      ["فجمع كيده : سحَرته الذين يكيد بهم"], // كَيدَهُ
      [], // ثُمَّ
      [] // أَتىٰ
    ],
    [ // آية 61
      [], // قالَ
      [], // لَهُم
      [], // موسىٰ
      ["ويلكم : دُعاء عليهم بالهلاك"], // وَيلَكُم
      [], // لا
      [], // تَفتَروا
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      ["فيُسحتكم : فيستأصلكم و يُبيدكم"], // فَيُسحِتَكُم
      [], // بِعَذابٍ
      [], // وَقَد
      [], // خابَ
      [], // مَنِ
      [] // افتَرىٰ
    ],
    [ // آية 62
      [], // فَتَنـٰزَعوا
      [], // أَمرَهُم
      [], // بَينَهُم
      [], // وَأَسَرُّوا
      [] // النَّجوىٰ
    ],
    [ // آية 63
      [], // قالوا
      [], // إِن
      [], // هـٰذٰنِ
      [], // لَسـٰحِرٰنِ
      [], // يُريدانِ
      [], // أَن
      [], // يُخرِجاكُم
      [], // مِن
      [], // أَرضِكُم
      [], // بِسِحرِهِما
      [], // وَيَذهَبا
      ["بطريقتكم المُثلى : بسنّتكم و شريعتكم الفضلى"], // بِطَريقَتِكُمُ
      ["بطريقتكم المُثلى : بسنّتكم و شريعتكم الفضلى"] // المُثلىٰ
    ],
    [ // آية 64
      ["فأجمعوا كيدَكم : فأحكموا سِحركم و اعزموا عليه"], // فَأَجمِعوا
      ["فأجمعوا كيدَكم : فأحكموا سِحركم و اعزموا عليه"], // كَيدَكُم
      [], // ثُمَّ
      [], // ائتوا
      [], // صَفًّا
      [], // وَقَد
      [], // أَفلَحَ
      [], // اليَومَ
      [], // مَنِ
      [] // استَعلىٰ
    ],
    [ // آية 65
      [], // قالوا
      [], // يـٰموسىٰ
      [], // إِمّا
      [], // أَن
      [], // تُلقِىَ
      [], // وَإِمّا
      [], // أَن
      [], // نَكونَ
      [], // أَوَّلَ
      [], // مَن
      [] // أَلقىٰ
    ],
    [ // آية 66
      [], // قالَ
      [], // بَل
      [], // أَلقوا
      [], // فَإِذا
      [], // حِبالُهُم
      [], // وَعِصِيُّهُم
      [], // يُخَيَّلُ
      [], // إِلَيهِ
      [], // مِن
      [], // سِحرِهِم
      [], // أَنَّها
      [] // تَسعىٰ
    ],
    [ // آية 67
      [], // فَأَوجَسَ
      [], // فى
      [], // نَفسِهِ
      [], // خيفَةً
      [] // موسىٰ
    ],
    [ // آية 68
      [], // قُلنا
      [], // لا
      [], // تَخَف
      [], // إِنَّكَ
      [], // أَنتَ
      [] // الأَعلىٰ
    ],
    [ // آية 69
      [], // وَأَلقِ
      [], // ما
      [], // فى
      [], // يَمينِكَ
      ["تلقف : تبتلعْ و تلتقـِمْ بسرعة"], // تَلقَف
      [], // ما
      [], // صَنَعوا
      [], // إِنَّما
      [], // صَنَعوا
      [], // كَيدُ
      [], // سـٰحِرٍ
      [], // وَلا
      [], // يُفلِحُ
      [], // السّاحِرُ
      [], // حَيثُ
      [] // أَتىٰ
    ],
    [ // آية 70
      [], // فَأُلقِىَ
      [], // السَّحَرَةُ
      [], // سُجَّدًا
      [], // قالوا
      [], // ءامَنّا
      [], // بِرَبِّ
      [], // هـٰرونَ
      [] // وَموسىٰ
    ],
    [ // آية 71
      [], // قالَ
      [], // ءامَنتُم
      [], // لَهُ
      [], // قَبلَ
      [], // أَن
      [], // ءاذَنَ
      [], // لَكُم
      [], // إِنَّهُ
      [], // لَكَبيرُكُمُ
      [], // الَّذى
      [], // عَلَّمَكُمُ
      [], // السِّحرَ
      [], // فَلَأُقَطِّعَنَّ
      [], // أَيدِيَكُم
      [], // وَأَرجُلَكُم
      [], // مِن
      [], // خِلـٰفٍ
      [], // وَلَأُصَلِّبَنَّكُم
      [], // فى
      [], // جُذوعِ
      [], // النَّخلِ
      [], // وَلَتَعلَمُنَّ
      [], // أَيُّنا
      [], // أَشَدُّ
      [], // عَذابًا
      [] // وَأَبقىٰ
    ],
    [ // آية 72
      [], // قالوا
      [], // لَن
      [], // نُؤثِرَكَ
      [], // عَلىٰ
      [], // ما
      [], // جاءَنا
      [], // مِنَ
      [], // البَيِّنـٰتِ
      [], // وَالَّذى
      [], // فَطَرَنا
      [], // فَاقضِ
      [], // ما
      [], // أَنتَ
      [], // قاضٍ
      [], // إِنَّما
      [], // تَقضى
      [], // هـٰذِهِ
      [], // الحَيوٰةَ
      [] // الدُّنيا
    ],
    [ // آية 73
      [], // إِنّا
      [], // ءامَنّا
      [], // بِرَبِّنا
      [], // لِيَغفِرَ
      [], // لَنا
      [], // خَطـٰيـٰنا
      [], // وَما
      [], // أَكرَهتَنا
      [], // عَلَيهِ
      [], // مِنَ
      [], // السِّحرِ
      [], // وَاللَّهُ
      [], // خَيرٌ
      [] // وَأَبقىٰ
    ],
    [ // آية 74
      [], // إِنَّهُ
      [], // مَن
      [], // يَأتِ
      [], // رَبَّهُ
      [], // مُجرِمًا
      [], // فَإِنَّ
      [], // لَهُ
      [], // جَهَنَّمَ
      [], // لا
      [], // يَموتُ
      [], // فيها
      [], // وَلا
      [] // يَحيىٰ
    ],
    [ // آية 75
      [], // وَمَن
      [], // يَأتِهِ
      [], // مُؤمِنًا
      [], // قَد
      [], // عَمِلَ
      [], // الصّـٰلِحـٰتِ
      [], // فَأُولـٰئِكَ
      [], // لَهُمُ
      [], // الدَّرَجـٰتُ
      [] // العُلىٰ
    ],
    [ // آية 76
      [], // جَنّـٰتُ
      [], // عَدنٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَذٰلِكَ
      [], // جَزاءُ
      [], // مَن
      ["تزكّى : تطهّر من دنس الشّرك و الكفر"] // تَزَكّىٰ
    ],
    [ // آية 77
      [], // وَلَقَد
      [], // أَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // أَن
      [], // أَسرِ
      [], // بِعِبادى
      [], // فَاضرِب
      [], // لَهُم
      [], // طَريقًا
      [], // فِى
      [], // البَحرِ
      [], // يَبَسًا
      [], // لا
      [], // تَخـٰفُ
      [], // دَرَكًا
      [], // وَلا
      [] // تَخشىٰ
    ],
    [ // آية 78
      [], // فَأَتبَعَهُم
      [], // فِرعَونُ
      [], // بِجُنودِهِ
      [], // فَغَشِيَهُم
      [], // مِنَ
      [], // اليَمِّ
      [], // ما
      [] // غَشِيَهُم
    ],
    [ // آية 79
      [], // وَأَضَلَّ
      [], // فِرعَونُ
      [], // قَومَهُ
      [], // وَما
      [] // هَدىٰ
    ],
    [ // آية 80
      [], // يـٰبَنى
      [], // إِسرٰءيلَ
      [], // قَد
      [], // أَنجَينـٰكُم
      [], // مِن
      [], // عَدُوِّكُم
      [], // وَوٰعَدنـٰكُم
      [], // جانِبَ
      [], // الطّورِ
      [], // الأَيمَنَ
      [], // وَنَزَّلنا
      [], // عَلَيكُمُ
      ["المنّ : مادّة صمغية حلوة كالعسل"], // المَنَّ
      [] // وَالسَّلوىٰ
    ],
    [ // آية 81
      [], // كُلوا
      [], // مِن
      [], // طَيِّبـٰتِ
      [], // ما
      [], // رَزَقنـٰكُم
      [], // وَلا
      [], // تَطغَوا
      [], // فيهِ
      ["فيحلّ عليكم : فيجب عليكم و يلزمكم"], // فَيَحِلَّ
      ["فيحلّ عليكم : فيجب عليكم و يلزمكم"], // عَلَيكُم
      [], // غَضَبى
      [], // وَمَن
      [], // يَحلِل
      [], // عَلَيهِ
      [], // غَضَبى
      [], // فَقَد
      ["هَوَى : هلك . أو وَقع في الهاوية"] // هَوىٰ
    ],
    [ // آية 82
      [], // وَإِنّى
      [], // لَغَفّارٌ
      [], // لِمَن
      [], // تابَ
      [], // وَءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // ثُمَّ
      [] // اهتَدىٰ
    ],
    [ // آية 83
      [], // وَما
      [], // أَعجَلَكَ
      [], // عَن
      [], // قَومِكَ
      [] // يـٰموسىٰ
    ],
    [ // آية 84
      [], // قالَ
      [], // هُم
      [], // أُولاءِ
      [], // عَلىٰ
      [], // أَثَرى
      [], // وَعَجِلتُ
      [], // إِلَيكَ
      [], // رَبِّ
      [] // لِتَرضىٰ
    ],
    [ // آية 85
      [], // قالَ
      [], // فَإِنّا
      [], // قَد
      [], // فَتَنّا
      [], // قَومَكَ
      [], // مِن
      [], // بَعدِكَ
      [], // وَأَضَلَّهُمُ
      [] // السّامِرِىُّ
    ],
    [ // آية 86
      [], // فَرَجَعَ
      [], // موسىٰ
      [], // إِلىٰ
      [], // قَومِهِ
      [], // غَضبـٰنَ
      ["أسِفا : حزينا . أو شديد الغضب"], // أَسِفًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَلَم
      [], // يَعِدكُم
      [], // رَبُّكُم
      [], // وَعدًا
      [], // حَسَنًا
      [], // أَفَطالَ
      [], // عَلَيكُمُ
      [], // العَهدُ
      [], // أَم
      [], // أَرَدتُم
      [], // أَن
      [], // يَحِلَّ
      [], // عَلَيكُم
      [], // غَضَبٌ
      [], // مِن
      [], // رَبِّكُم
      [], // فَأَخلَفتُم
      [] // مَوعِدى
    ],
    [ // آية 87
      [], // قالوا
      [], // ما
      [], // أَخلَفنا
      [], // مَوعِدَكَ
      ["بملكِنا : بقدرتِنا و طاقتِنا"], // بِمَلكِنا
      [], // وَلـٰكِنّا
      [], // حُمِّلنا
      ["أوْزارا : أثقالا أو آثاما و تبـِعات"], // أَوزارًا
      ["من زينة القوم : من حليّ قبط مصر"], // مِن
      ["من زينة القوم : من حليّ قبط مصر"], // زينَةِ
      ["من زينة القوم : من حليّ قبط مصر"], // القَومِ
      [], // فَقَذَفنـٰها
      [], // فَكَذٰلِكَ
      [], // أَلقَى
      [] // السّامِرِىُّ
    ],
    [ // آية 88
      [], // فَأَخرَجَ
      [], // لَهُم
      ["عِجلا جسدا : مُجسّدا : أي أحمر من ذهب"], // عِجلًا
      ["عِجلا جسدا : مُجسّدا : أي أحمر من ذهب"], // جَسَدًا
      ["لهُ خوار : صوت كصوت البقر"], // لَهُ
      ["لهُ خوار : صوت كصوت البقر"], // خُوارٌ
      [], // فَقالوا
      [], // هـٰذا
      [], // إِلـٰهُكُم
      [], // وَإِلـٰهُ
      [], // موسىٰ
      [] // فَنَسِىَ
    ],
    [ // آية 89
      [], // أَفَلا
      [], // يَرَونَ
      [], // أَلّا
      [], // يَرجِعُ
      [], // إِلَيهِم
      [], // قَولًا
      [], // وَلا
      [], // يَملِكُ
      [], // لَهُم
      [], // ضَرًّا
      [], // وَلا
      [] // نَفعًا
    ],
    [ // آية 90
      [], // وَلَقَد
      [], // قالَ
      [], // لَهُم
      [], // هـٰرونُ
      [], // مِن
      [], // قَبلُ
      [], // يـٰقَومِ
      [], // إِنَّما
      [], // فُتِنتُم
      [], // بِهِ
      [], // وَإِنَّ
      [], // رَبَّكُمُ
      [], // الرَّحمـٰنُ
      [], // فَاتَّبِعونى
      [], // وَأَطيعوا
      [] // أَمرى
    ],
    [ // آية 91
      [], // قالوا
      [], // لَن
      [], // نَبرَحَ
      [], // عَلَيهِ
      [], // عـٰكِفينَ
      [], // حَتّىٰ
      [], // يَرجِعَ
      [], // إِلَينا
      [] // موسىٰ
    ],
    [ // آية 92
      [], // قالَ
      [], // يـٰهـٰرونُ
      ["ما منعَك : ما حمَلك و اضطرّك"], // ما
      ["ما منعَك : ما حمَلك و اضطرّك"], // مَنَعَكَ
      [], // إِذ
      [], // رَأَيتَهُم
      [] // ضَلّوا
    ],
    [ // آية 93
      [], // أَلّا
      [], // تَتَّبِعَنِ
      [], // أَفَعَصَيتَ
      [] // أَمرى
    ],
    [ // آية 94
      [], // قالَ
      [], // يَبنَؤُمَّ
      [], // لا
      [], // تَأخُذ
      [], // بِلِحيَتى
      [], // وَلا
      [], // بِرَأسى
      [], // إِنّى
      [], // خَشيتُ
      [], // أَن
      [], // تَقولَ
      [], // فَرَّقتَ
      [], // بَينَ
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // وَلَم
      [], // تَرقُب
      [] // قَولى
    ],
    [ // آية 95
      [], // قالَ
      [], // فَما
      [], // خَطبُكَ
      [] // يـٰسـٰمِرِىُّ
    ],
    [ // آية 96
      [], // قالَ
      ["بَصُرتُ : علِمتُ بالبصيرة"], // بَصُرتُ
      [], // بِما
      [], // لَم
      [], // يَبصُروا
      [], // بِهِ
      [], // فَقَبَضتُ
      [], // قَبضَةً
      [], // مِن
      ["أثر الرّسول : أثر فرس جبريل عليه السلام"], // أَثَرِ
      ["أثر الرّسول : أثر فرس جبريل عليه السلام"], // الرَّسولِ
      ["فنبذتها : ألقيتُها في الحليّ المُذاب"], // فَنَبَذتُها
      [], // وَكَذٰلِكَ
      ["سوّلت : زيّـنت و حسّـنت"], // سَوَّلَت
      [], // لى
      [] // نَفسى
    ],
    [ // آية 97
      [], // قالَ
      [], // فَاذهَب
      [], // فَإِنَّ
      [], // لَكَ
      [], // فِى
      [], // الحَيوٰةِ
      [], // أَن
      [], // تَقولَ
      [], // لا
      [], // مِساسَ
      [], // وَإِنَّ
      [], // لَكَ
      [], // مَوعِدًا
      [], // لَن
      [], // تُخلَفَهُ
      [], // وَانظُر
      [], // إِلىٰ
      [], // إِلـٰهِكَ
      [], // الَّذى
      [], // ظَلتَ
      [], // عَلَيهِ
      [], // عاكِفًا
      [], // لَنُحَرِّقَنَّهُ
      [], // ثُمَّ
      [], // لَنَنسِفَنَّهُ
      [], // فِى
      [], // اليَمِّ
      [] // نَسفًا
    ],
    [ // آية 98
      [], // إِنَّما
      [], // إِلـٰهُكُمُ
      [], // اللَّهُ
      [], // الَّذى
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // وَسِعَ
      [], // كُلَّ
      [], // شَىءٍ
      [] // عِلمًا
    ],
    [ // آية 99
      [], // كَذٰلِكَ
      [], // نَقُصُّ
      [], // عَلَيكَ
      [], // مِن
      [], // أَنباءِ
      [], // ما
      [], // قَد
      [], // سَبَقَ
      [], // وَقَد
      [], // ءاتَينـٰكَ
      [], // مِن
      [], // لَدُنّا
      [] // ذِكرًا
    ],
    [ // آية 100
      [], // مَن
      [], // أَعرَضَ
      [], // عَنهُ
      [], // فَإِنَّهُ
      [], // يَحمِلُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      ["وزرا : عقوبة ثقيلة على إعراضه"] // وِزرًا
    ],
    [ // آية 101
      [], // خـٰلِدينَ
      [], // فيهِ
      [], // وَساءَ
      [], // لَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [] // حِملًا
    ],
    [ // آية 102
      [], // يَومَ
      [], // يُنفَخُ
      [], // فِى
      [], // الصّورِ
      [], // وَنَحشُرُ
      [], // المُجرِمينَ
      [], // يَومَئِذٍ
      ["زرقا : زُرق العيون . أو عُميا . أو عطاشا"] // زُرقًا
    ],
    [ // آية 103
      [], // يَتَخـٰفَتونَ
      [], // بَينَهُم
      [], // إِن
      [], // لَبِثتُم
      [], // إِلّا
      [] // عَشرًا
    ],
    [ // آية 104
      [], // نَحنُ
      [], // أَعلَمُ
      [], // بِما
      [], // يَقولونَ
      [], // إِذ
      [], // يَقولُ
      [], // أَمثَلُهُم
      [], // طَريقَةً
      [], // إِن
      [], // لَبِثتُم
      [], // إِلّا
      [] // يَومًا
    ],
    [ // آية 105
      [], // وَيَسـَٔلونَكَ
      [], // عَنِ
      [], // الجِبالِ
      [], // فَقُل
      ["ينسفها : يقتلعها أو يفتتها و يقرّقها بالرّياح"], // يَنسِفُها
      [], // رَبّى
      [] // نَسفًا
    ],
    [ // آية 106
      [], // فَيَذَرُها
      ["قاعا : أرضا ملساء لا نبات و لا بناء فيها"], // قاعًا
      ["صفصفا : أرضا مُستوية أو لا نبات فيها"] // صَفصَفًا
    ],
    [ // آية 107
      [], // لا
      [], // تَرىٰ
      [], // فيها
      ["عِوَجا : مكانا مُنخفضا. أو انخفاضا"], // عِوَجًا
      [], // وَلا
      [] // أَمتًا
    ],
    [ // آية 108
      [], // يَومَئِذٍ
      [], // يَتَّبِعونَ
      [], // الدّاعِىَ
      [], // لا
      [], // عِوَجَ
      [], // لَهُ
      [], // وَخَشَعَتِ
      [], // الأَصواتُ
      [], // لِلرَّحمـٰنِ
      [], // فَلا
      [], // تَسمَعُ
      [], // إِلّا
      ["هَمْسا : صوتا خفيّا خافتا"] // هَمسًا
    ],
    [ // آية 109
      [], // يَومَئِذٍ
      [], // لا
      [], // تَنفَعُ
      [], // الشَّفـٰعَةُ
      [], // إِلّا
      [], // مَن
      [], // أَذِنَ
      [], // لَهُ
      [], // الرَّحمـٰنُ
      [], // وَرَضِىَ
      [], // لَهُ
      [] // قَولًا
    ],
    [ // آية 110
      [], // يَعلَمُ
      [], // ما
      [], // بَينَ
      [], // أَيديهِم
      [], // وَما
      [], // خَلفَهُم
      [], // وَلا
      [], // يُحيطونَ
      [], // بِهِ
      [] // عِلمًا
    ],
    [ // آية 111
      [], // وَعَنَتِ
      [], // الوُجوهُ
      [], // لِلحَىِّ
      ["القيّوم : الدّائم القيام بتدبير الخلق"], // القَيّومِ
      [], // وَقَد
      [], // خابَ
      [], // مَن
      ["حمل ظلما : شركا و كفرا"], // حَمَلَ
      ["حمل ظلما : شركا و كفرا"] // ظُلمًا
    ],
    [ // آية 112
      [], // وَمَن
      [], // يَعمَل
      [], // مِنَ
      [], // الصّـٰلِحـٰتِ
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَلا
      [], // يَخافُ
      [], // ظُلمًا
      [], // وَلا
      ["هضما : نقصا من ثوابه"] // هَضمًا
    ],
    [ // آية 113
      [], // وَكَذٰلِكَ
      [], // أَنزَلنـٰهُ
      [], // قُرءانًا
      [], // عَرَبِيًّا
      [], // وَصَرَّفنا
      [], // فيهِ
      [], // مِنَ
      [], // الوَعيدِ
      [], // لَعَلَّهُم
      [], // يَتَّقونَ
      [], // أَو
      [], // يُحدِثُ
      [], // لَهُم
      ["ذِكرا : عِظة و اعتبارا"] // ذِكرًا
    ],
    [ // آية 114
      [], // فَتَعـٰلَى
      [], // اللَّهُ
      [], // المَلِكُ
      [], // الحَقُّ
      [], // وَلا
      [], // تَعجَل
      [], // بِالقُرءانِ
      [], // مِن
      [], // قَبلِ
      ["أن يُقضى إليك : أن يُفرغ و يُتمّ إليك"], // أَن
      ["أن يُقضى إليك : أن يُفرغ و يُتمّ إليك"], // يُقضىٰ
      ["أن يُقضى إليك : أن يُفرغ و يُتمّ إليك"], // إِلَيكَ
      [], // وَحيُهُ
      [], // وَقُل
      [], // رَبِّ
      [], // زِدنى
      [] // عِلمًا
    ],
    [ // آية 115
      [], // وَلَقَد
      [], // عَهِدنا
      [], // إِلىٰ
      [], // ءادَمَ
      [], // مِن
      [], // قَبلُ
      [], // فَنَسِىَ
      [], // وَلَم
      [], // نَجِد
      [], // لَهُ
      [] // عَزمًا
    ],
    [ // آية 116
      [], // وَإِذ
      [], // قُلنا
      [], // لِلمَلـٰئِكَةِ
      [], // اسجُدوا
      [], // لِـٔادَمَ
      [], // فَسَجَدوا
      [], // إِلّا
      [], // إِبليسَ
      ["أبى : امتنع من السّجود استكبارا"] // أَبىٰ
    ],
    [ // آية 117
      [], // فَقُلنا
      [], // يـٰـٔادَمُ
      [], // إِنَّ
      [], // هـٰذا
      [], // عَدُوٌّ
      [], // لَكَ
      [], // وَلِزَوجِكَ
      [], // فَلا
      [], // يُخرِجَنَّكُما
      [], // مِنَ
      [], // الجَنَّةِ
      [] // فَتَشقىٰ
    ],
    [ // آية 118
      [], // إِنَّ
      [], // لَكَ
      [], // أَلّا
      [], // تَجوعَ
      [], // فيها
      [], // وَلا
      [] // تَعرىٰ
    ],
    [ // آية 119
      [], // وَأَنَّكَ
      [], // لا
      [], // تَظمَؤُا۟
      [], // فيها
      [], // وَلا
      [] // تَضحىٰ
    ],
    [ // آية 120
      [], // فَوَسوَسَ
      [], // إِلَيهِ
      [], // الشَّيطـٰنُ
      [], // قالَ
      [], // يـٰـٔادَمُ
      [], // هَل
      [], // أَدُلُّكَ
      [], // عَلىٰ
      [], // شَجَرَةِ
      [], // الخُلدِ
      [], // وَمُلكٍ
      [], // لا
      [] // يَبلىٰ
    ],
    [ // آية 121
      [], // فَأَكَلا
      [], // مِنها
      [], // فَبَدَت
      [], // لَهُما
      [], // سَوءٰتُهُما
      [], // وَطَفِقا
      [], // يَخصِفانِ
      [], // عَلَيهِما
      [], // مِن
      [], // وَرَقِ
      [], // الجَنَّةِ
      [], // وَعَصىٰ
      [], // ءادَمُ
      [], // رَبَّهُ
      ["فغوى : فضّل عن مطلوبه أو عن النّهي"] // فَغَوىٰ
    ],
    [ // آية 122
      [], // ثُمَّ
      [], // اجتَبـٰهُ
      [], // رَبُّهُ
      [], // فَتابَ
      [], // عَلَيهِ
      [] // وَهَدىٰ
    ],
    [ // آية 123
      [], // قالَ
      [], // اهبِطا
      [], // مِنها
      [], // جَميعًا
      [], // بَعضُكُم
      [], // لِبَعضٍ
      [], // عَدُوٌّ
      [], // فَإِمّا
      [], // يَأتِيَنَّكُم
      [], // مِنّى
      [], // هُدًى
      [], // فَمَنِ
      [], // اتَّبَعَ
      [], // هُداىَ
      [], // فَلا
      [], // يَضِلُّ
      [], // وَلا
      [] // يَشقىٰ
    ],
    [ // آية 124
      [], // وَمَن
      [], // أَعرَضَ
      [], // عَن
      [], // ذِكرى
      [], // فَإِنَّ
      [], // لَهُ
      ["معيشة ضنكا : ضيّقة شديدة (في قبره)"], // مَعيشَةً
      ["معيشة ضنكا : ضيّقة شديدة (في قبره)"], // ضَنكًا
      [], // وَنَحشُرُهُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [] // أَعمىٰ
    ],
    [ // آية 125
      [], // قالَ
      [], // رَبِّ
      [], // لِمَ
      [], // حَشَرتَنى
      [], // أَعمىٰ
      [], // وَقَد
      [], // كُنتُ
      [] // بَصيرًا
    ],
    [ // آية 126
      [], // قالَ
      [], // كَذٰلِكَ
      [], // أَتَتكَ
      [], // ءايـٰتُنا
      [], // فَنَسيتَها
      [], // وَكَذٰلِكَ
      [], // اليَومَ
      [] // تُنسىٰ
    ],
    [ // آية 127
      [], // وَكَذٰلِكَ
      [], // نَجزى
      [], // مَن
      [], // أَسرَفَ
      [], // وَلَم
      [], // يُؤمِن
      [], // بِـٔايـٰتِ
      [], // رَبِّهِ
      [], // وَلَعَذابُ
      [], // الـٔاخِرَةِ
      [], // أَشَدُّ
      [] // وَأَبقىٰ
    ],
    [ // آية 128
      ["أفلم يهد لهم : أغفلوا فلم يُبيّن لهم مآلهم"], // أَفَلَم
      ["أفلم يهد لهم : أغفلوا فلم يُبيّن لهم مآلهم"], // يَهدِ
      ["أفلم يهد لهم : أغفلوا فلم يُبيّن لهم مآلهم"], // لَهُم
      ["كم أهلكنا : كثرة إهلاكنا الأمم الماضية"], // كَم
      ["كم أهلكنا : كثرة إهلاكنا الأمم الماضية"], // أَهلَكنا
      [], // قَبلَهُم
      [], // مِنَ
      [], // القُرونِ
      [], // يَمشونَ
      [], // فى
      [], // مَسـٰكِنِهِم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِأُولِى
      [] // النُّهىٰ
    ],
    [ // آية 129
      [], // وَلَولا
      [], // كَلِمَةٌ
      [], // سَبَقَت
      [], // مِن
      [], // رَبِّكَ
      ["لكان لزاما : لكان إهلاكهم عاجلا لازما"], // لَكانَ
      ["لكان لزاما : لكان إهلاكهم عاجلا لازما"], // لِزامًا
      [], // وَأَجَلٌ
      [] // مُسَمًّى
    ],
    [ // آية 130
      [], // فَاصبِر
      [], // عَلىٰ
      [], // ما
      [], // يَقولونَ
      [], // وَسَبِّح
      [], // بِحَمدِ
      [], // رَبِّكَ
      [], // قَبلَ
      [], // طُلوعِ
      [], // الشَّمسِ
      [], // وَقَبلَ
      [], // غُروبِها
      [], // وَمِن
      [], // ءانائِ
      [], // الَّيلِ
      [], // فَسَبِّح
      [], // وَأَطرافَ
      [], // النَّهارِ
      [], // لَعَلَّكَ
      [] // تَرضىٰ
    ],
    [ // آية 131
      [], // وَلا
      [], // تَمُدَّنَّ
      [], // عَينَيكَ
      [], // إِلىٰ
      [], // ما
      [], // مَتَّعنا
      [], // بِهِ
      [], // أَزوٰجًا
      [], // مِنهُم
      [], // زَهرَةَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      ["لِنفتنهم فيه : لنجعله فتنة لهم و ابتلاء"], // لِنَفتِنَهُم
      ["لِنفتنهم فيه : لنجعله فتنة لهم و ابتلاء"], // فيهِ
      [], // وَرِزقُ
      [], // رَبِّكَ
      [], // خَيرٌ
      [] // وَأَبقىٰ
    ],
    [ // آية 132
      [], // وَأمُر
      [], // أَهلَكَ
      [], // بِالصَّلوٰةِ
      [], // وَاصطَبِر
      [], // عَلَيها
      [], // لا
      [], // نَسـَٔلُكَ
      [], // رِزقًا
      [], // نَحنُ
      [], // نَرزُقُكَ
      [], // وَالعـٰقِبَةُ
      [] // لِلتَّقوىٰ
    ],
    [ // آية 133
      [], // وَقالوا
      [], // لَولا
      [], // يَأتينا
      [], // بِـٔايَةٍ
      [], // مِن
      [], // رَبِّهِ
      [], // أَوَلَم
      [], // تَأتِهِم
      [], // بَيِّنَةُ
      [], // ما
      [], // فِى
      [], // الصُّحُفِ
      [] // الأولىٰ
    ],
    [ // آية 134
      [], // وَلَو
      [], // أَنّا
      [], // أَهلَكنـٰهُم
      [], // بِعَذابٍ
      ["من قبله : من قبل الإثبات بالبيّنة"], // مِن
      ["من قبله : من قبل الإثبات بالبيّنة"], // قَبلِهِ
      [], // لَقالوا
      [], // رَبَّنا
      [], // لَولا
      [], // أَرسَلتَ
      [], // إِلَينا
      [], // رَسولًا
      [], // فَنَتَّبِعَ
      [], // ءايـٰتِكَ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // نَذِلَّ
      [] // وَنَخزىٰ
    ],
    [ // آية 135
      [], // قُل
      [], // كُلٌّ
      ["مُتربّصٌ : مُنتظر مآله"], // مُتَرَبِّصٌ
      [], // فَتَرَبَّصوا
      [], // فَسَتَعلَمونَ
      [], // مَن
      [], // أَصحـٰبُ
      [], // الصِّرٰطِ
      [], // السَّوِىِّ
      [], // وَمَنِ
      [] // اهتَدىٰ
    ]
  ]
];

export default meanings;