const meanings = [
[ // آية 1
      ["اقترب : قرُب و دنا"], // اقتَرَبَ
      [], // لِلنّاسِ
      [], // حِسابُهُم
      [], // وَهُم
      [], // فى
      [], // غَفلَةٍ
      [] // مُعرِضونَ
    ],
    [ // آية 2
      [], // ما
      [], // يَأتيهِم
      [], // مِن
      [], // ذِكرٍ
      [], // مِن
      [], // رَبِّهِم
      ["مُحدَث : تنزيله بالوحي"], // مُحدَثٍ
      [], // إِلَّا
      [], // استَمَعوهُ
      [], // وَهُم
      [] // يَلعَبونَ
    ],
    [ // آية 3
      [], // لاهِيَةً
      [], // قُلوبُهُم
      [], // وَأَسَرُّوا
      [], // النَّجوَى
      [], // الَّذينَ
      [], // ظَلَموا
      [], // هَل
      [], // هـٰذا
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // أَفَتَأتونَ
      [], // السِّحرَ
      [], // وَأَنتُم
      [] // تُبصِرونَ
    ],
    [ // آية 4
      [], // قالَ
      [], // رَبّى
      [], // يَعلَمُ
      [], // القَولَ
      [], // فِى
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 5
      [], // بَل
      [], // قالوا
      [], // أَضغـٰثُ
      [], // أَحلـٰمٍ
      [], // بَلِ
      [], // افتَرىٰهُ
      [], // بَل
      [], // هُوَ
      [], // شاعِرٌ
      [], // فَليَأتِنا
      [], // بِـٔايَةٍ
      [], // كَما
      [], // أُرسِلَ
      [] // الأَوَّلونَ
    ],
    [ // آية 6
      [], // ما
      [], // ءامَنَت
      [], // قَبلَهُم
      [], // مِن
      [], // قَريَةٍ
      [], // أَهلَكنـٰها
      [], // أَفَهُم
      [] // يُؤمِنونَ
    ],
    [ // آية 7
      [], // وَما
      [], // أَرسَلنا
      [], // قَبلَكَ
      [], // إِلّا
      [], // رِجالًا
      [], // نوحى
      [], // إِلَيهِم
      [], // فَسـَٔلوا
      [], // أَهلَ
      [], // الذِّكرِ
      [], // إِن
      [], // كُنتُم
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 8
      [], // وَما
      [], // جَعَلنـٰهُم
      ["جسدا : أجسادا ، أو ذوي جسد"], // جَسَدًا
      [], // لا
      [], // يَأكُلونَ
      [], // الطَّعامَ
      [], // وَما
      [], // كانوا
      [] // خـٰلِدينَ
    ],
    [ // آية 9
      [], // ثُمَّ
      [], // صَدَقنـٰهُمُ
      [], // الوَعدَ
      [], // فَأَنجَينـٰهُم
      [], // وَمَن
      [], // نَشاءُ
      [], // وَأَهلَكنَا
      [] // المُسرِفينَ
    ],
    [ // آية 10
      [], // لَقَد
      [], // أَنزَلنا
      [], // إِلَيكُم
      [], // كِتـٰبًا
      ["فيه ذكركم : موعظتكم أو شرفكم و صيتكم"], // فيهِ
      ["فيه ذكركم : موعظتكم أو شرفكم و صيتكم"], // ذِكرُكُم
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 11
      [], // وَكَم
      [], // قَصَمنا
      [], // مِن
      [], // قَريَةٍ
      [], // كانَت
      [], // ظالِمَةً
      [], // وَأَنشَأنا
      [], // بَعدَها
      [], // قَومًا
      [] // ءاخَرينَ
    ],
    [ // آية 12
      [], // فَلَمّا
      ["أحسّوا بأسنا : أدركوا بحاسّتهم عذابنا الشديد"], // أَحَسّوا
      ["أحسّوا بأسنا : أدركوا بحاسّتهم عذابنا الشديد"], // بَأسَنا
      [], // إِذا
      [], // هُم
      [], // مِنها
      ["يركضون : يهربون مسرعين"] // يَركُضونَ
    ],
    [ // آية 13
      [], // لا
      [], // تَركُضوا
      [], // وَارجِعوا
      [], // إِلىٰ
      [], // ما
      ["أترفتم فيه : نعّمتم فيه فبَطِرتم"], // أُترِفتُم
      ["أترفتم فيه : نعّمتم فيه فبَطِرتم"], // فيهِ
      [], // وَمَسـٰكِنِكُم
      [], // لَعَلَّكُم
      [] // تُسـَٔلونَ
    ],
    [ // آية 14
      [], // قالوا
      [], // يـٰوَيلَنا
      [], // إِنّا
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 15
      [], // فَما
      [], // زالَت
      [], // تِلكَ
      [], // دَعوىٰهُم
      [], // حَتّىٰ
      [], // جَعَلنـٰهُم
      ["حصيدا : كالنّبات المحصود بالمناجل"], // حَصيدًا
      [] // خـٰمِدينَ
    ],
    [ // آية 16
      [], // وَما
      [], // خَلَقنَا
      [], // السَّماءَ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [] // لـٰعِبينَ
    ],
    [ // آية 17
      [], // لَو
      [], // أَرَدنا
      [], // أَن
      ["نتّخذ لهوا : ما يُـتـَـلهّى به من صاحبة أو ولد"], // نَتَّخِذَ
      ["نتّخذ لهوا : ما يُـتـَـلهّى به من صاحبة أو ولد"], // لَهوًا
      [], // لَاتَّخَذنـٰهُ
      [], // مِن
      [], // لَدُنّا
      [], // إِن
      [], // كُنّا
      [] // فـٰعِلينَ
    ],
    [ // آية 18
      [], // بَل
      ["نقذف بالحق : نرمي به و نورده"], // نَقذِفُ
      ["نقذف بالحق : نرمي به و نورده"], // بِالحَقِّ
      [], // عَلَى
      [], // البـٰطِلِ
      ["فيدمغه : يمحقه و يدحضه"], // فَيَدمَغُهُ
      [], // فَإِذا
      [], // هُوَ
      ["زاهق : ذاهب مُضمحلٌ"], // زاهِقٌ
      [], // وَلَكُمُ
      [], // الوَيلُ
      [], // مِمّا
      [] // تَصِفونَ
    ],
    [ // آية 19
      [], // وَلَهُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَمَن
      [], // عِندَهُ
      [], // لا
      [], // يَستَكبِرونَ
      [], // عَن
      [], // عِبادَتِهِ
      [], // وَلا
      [] // يَستَحسِرونَ
    ],
    [ // آية 20
      [], // يُسَبِّحونَ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // لا
      [] // يَفتُرونَ
    ],
    [ // آية 21
      [], // أَمِ
      [], // اتَّخَذوا
      [], // ءالِهَةً
      [], // مِنَ
      [], // الأَرضِ
      ["هم ينشرون : هم يُحيون الموتى – كلاّ"], // هُم
      ["هم ينشرون : هم يُحيون الموتى – كلاّ"] // يُنشِرونَ
    ],
    [ // آية 22
      [], // لَو
      [], // كانَ
      [], // فيهِما
      [], // ءالِهَةٌ
      [], // إِلَّا
      [], // اللَّهُ
      ["لفسدتا : لأختلّ نظامهما و خربتا بالتـّـنازع"], // لَفَسَدَتا
      [], // فَسُبحـٰنَ
      [], // اللَّهِ
      [], // رَبِّ
      [], // العَرشِ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 23
      [], // لا
      [], // يُسـَٔلُ
      [], // عَمّا
      [], // يَفعَلُ
      [], // وَهُم
      [] // يُسـَٔلونَ
    ],
    [ // آية 24
      [], // أَمِ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِهِ
      [], // ءالِهَةً
      [], // قُل
      [], // هاتوا
      [], // بُرهـٰنَكُم
      [], // هـٰذا
      [], // ذِكرُ
      [], // مَن
      [], // مَعِىَ
      [], // وَذِكرُ
      [], // مَن
      [], // قَبلى
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [], // يَعلَمونَ
      [], // الحَقَّ
      [], // فَهُم
      [] // مُعرِضونَ
    ],
    [ // آية 25
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // نوحى
      [], // إِلَيهِ
      [], // أَنَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // أَنا۠
      [] // فَاعبُدونِ
    ],
    [ // آية 26
      [], // وَقالُوا
      [], // اتَّخَذَ
      [], // الرَّحمـٰنُ
      ["ولدا : قالوا الملائكة بنات الله"], // وَلَدًا
      [], // سُبحـٰنَهُ
      [], // بَل
      [], // عِبادٌ
      [] // مُكرَمونَ
    ],
    [ // آية 27
      [], // لا
      [], // يَسبِقونَهُ
      [], // بِالقَولِ
      [], // وَهُم
      [], // بِأَمرِهِ
      [] // يَعمَلونَ
    ],
    [ // آية 28
      [], // يَعلَمُ
      [], // ما
      [], // بَينَ
      [], // أَيديهِم
      [], // وَما
      [], // خَلفَهُم
      [], // وَلا
      [], // يَشفَعونَ
      [], // إِلّا
      [], // لِمَنِ
      [], // ارتَضىٰ
      [], // وَهُم
      [], // مِن
      [], // خَشيَتِهِ
      ["مُشفقون : خائفون حذرون"] // مُشفِقونَ
    ],
    [ // آية 29
      [], // وَمَن
      [], // يَقُل
      [], // مِنهُم
      [], // إِنّى
      [], // إِلـٰهٌ
      [], // مِن
      [], // دونِهِ
      [], // فَذٰلِكَ
      [], // نَجزيهِ
      [], // جَهَنَّمَ
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // الظّـٰلِمينَ
    ],
    [ // آية 30
      [], // أَوَلَم
      [], // يَرَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَنَّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      ["كانتا رتقا : كانتا مُلتصِقتين بلا فصْـلٍ"], // كانَتا
      ["كانتا رتقا : كانتا مُلتصِقتين بلا فصْـلٍ"], // رَتقًا
      [], // فَفَتَقنـٰهُما
      [], // وَجَعَلنا
      [], // مِنَ
      [], // الماءِ
      [], // كُلَّ
      [], // شَىءٍ
      [], // حَىٍّ
      [], // أَفَلا
      [] // يُؤمِنونَ
    ],
    [ // آية 31
      [], // وَجَعَلنا
      [], // فِى
      [], // الأَرضِ
      [], // رَوٰسِىَ
      ["أن تميد بهم : لئلاّ تضطرب بهم فلا تثبُت"], // أَن
      ["أن تميد بهم : لئلاّ تضطرب بهم فلا تثبُت"], // تَميدَ
      ["أن تميد بهم : لئلاّ تضطرب بهم فلا تثبُت"], // بِهِم
      [], // وَجَعَلنا
      [], // فيها
      ["فِجاجا سُبُلا : طُرُقا واسعة مسلوكة"], // فِجاجًا
      ["فِجاجا سُبُلا : طُرُقا واسعة مسلوكة"], // سُبُلًا
      [], // لَعَلَّهُم
      [] // يَهتَدونَ
    ],
    [ // آية 32
      [], // وَجَعَلنَا
      [], // السَّماءَ
      ["سقفا محفوظا : مصونا من الوُقوع أو التّغيّر"], // سَقفًا
      ["سقفا محفوظا : مصونا من الوُقوع أو التّغيّر"], // مَحفوظًا
      [], // وَهُم
      [], // عَن
      [], // ءايـٰتِها
      [] // مُعرِضونَ
    ],
    [ // آية 33
      [], // وَهُوَ
      [], // الَّذى
      [], // خَلَقَ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // وَالشَّمسَ
      [], // وَالقَمَرَ
      [], // كُلٌّ
      [], // فى
      [], // فَلَكٍ
      [] // يَسبَحونَ
    ],
    [ // آية 34
      [], // وَما
      [], // جَعَلنا
      [], // لِبَشَرٍ
      [], // مِن
      [], // قَبلِكَ
      [], // الخُلدَ
      [], // أَفَإِي۟ن
      [], // مِتَّ
      [], // فَهُمُ
      [] // الخـٰلِدونَ
    ],
    [ // آية 35
      [], // كُلُّ
      [], // نَفسٍ
      [], // ذائِقَةُ
      [], // المَوتِ
      [], // وَنَبلوكُم
      [], // بِالشَّرِّ
      [], // وَالخَيرِ
      [], // فِتنَةً
      [], // وَإِلَينا
      [] // تُرجَعونَ
    ],
    [ // آية 36
      [], // وَإِذا
      [], // رَءاكَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // يَتَّخِذونَكَ
      [], // إِلّا
      [], // هُزُوًا
      [], // أَهـٰذَا
      [], // الَّذى
      [], // يَذكُرُ
      [], // ءالِهَتَكُم
      [], // وَهُم
      [], // بِذِكرِ
      [], // الرَّحمـٰنِ
      [], // هُم
      [] // كـٰفِرونَ
    ],
    [ // آية 37
      [], // خُلِقَ
      [], // الإِنسـٰنُ
      [], // مِن
      [], // عَجَلٍ
      [], // سَأُو۟ريكُم
      [], // ءايـٰتى
      [], // فَلا
      [] // تَستَعجِلونِ
    ],
    [ // آية 38
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 39
      [], // لَو
      [], // يَعلَمُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // حينَ
      [], // لا
      [], // يَكُفّونَ
      [], // عَن
      [], // وُجوهِهِمُ
      [], // النّارَ
      [], // وَلا
      [], // عَن
      [], // ظُهورِهِم
      [], // وَلا
      [], // هُم
      [] // يُنصَرونَ
    ],
    [ // آية 40
      [], // بَل
      [], // تَأتيهِم
      ["بغتة : فجأة"], // بَغتَةً
      ["فتبهتهم : تحيّرُهم و تدهشهم"], // فَتَبهَتُهُم
      [], // فَلا
      [], // يَستَطيعونَ
      [], // رَدَّها
      [], // وَلا
      [], // هُم
      ["يُنظرون : يُمهلون و يُؤخّرون"] // يُنظَرونَ
    ],
    [ // آية 41
      [], // وَلَقَدِ
      [], // استُهزِئَ
      [], // بِرُسُلٍ
      [], // مِن
      [], // قَبلِكَ
      ["فحاق : أحاط . أو نزل"], // فَحاقَ
      [], // بِالَّذينَ
      [], // سَخِروا
      [], // مِنهُم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 42
      [], // قُل
      [], // مَن
      [], // يَكلَؤُكُم
      [], // بِالَّيلِ
      [], // وَالنَّهارِ
      [], // مِنَ
      [], // الرَّحمـٰنِ
      [], // بَل
      [], // هُم
      [], // عَن
      [], // ذِكرِ
      [], // رَبِّهِم
      [] // مُعرِضونَ
    ],
    [ // آية 43
      [], // أَم
      [], // لَهُم
      [], // ءالِهَةٌ
      [], // تَمنَعُهُم
      [], // مِن
      [], // دونِنا
      [], // لا
      [], // يَستَطيعونَ
      [], // نَصرَ
      [], // أَنفُسِهِم
      [], // وَلا
      [], // هُم
      [], // مِنّا
      ["يُصحَبون : يُجارون و يمنعون أو يُنصرون"] // يُصحَبونَ
    ],
    [ // آية 44
      [], // بَل
      [], // مَتَّعنا
      [], // هـٰؤُلاءِ
      [], // وَءاباءَهُم
      [], // حَتّىٰ
      [], // طالَ
      [], // عَلَيهِمُ
      [], // العُمُرُ
      [], // أَفَلا
      [], // يَرَونَ
      [], // أَنّا
      [], // نَأتِى
      [], // الأَرضَ
      [], // نَنقُصُها
      [], // مِن
      [], // أَطرافِها
      [], // أَفَهُمُ
      [] // الغـٰلِبونَ
    ],
    [ // آية 45
      [], // قُل
      [], // إِنَّما
      [], // أُنذِرُكُم
      [], // بِالوَحىِ
      [], // وَلا
      [], // يَسمَعُ
      [], // الصُّمُّ
      [], // الدُّعاءَ
      [], // إِذا
      [], // ما
      [] // يُنذَرونَ
    ],
    [ // آية 46
      [], // وَلَئِن
      [], // مَسَّتهُم
      ["نفحة : دُفعة يسيرة . أو نصيب يسير"], // نَفحَةٌ
      [], // مِن
      [], // عَذابِ
      [], // رَبِّكَ
      [], // لَيَقولُنَّ
      [], // يـٰوَيلَنا
      [], // إِنّا
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 47
      [], // وَنَضَعُ
      [], // المَوٰزينَ
      ["القسط : العدل . أو ذوات العدل"], // القِسطَ
      [], // لِيَومِ
      [], // القِيـٰمَةِ
      [], // فَلا
      [], // تُظلَمُ
      [], // نَفسٌ
      [], // شَيـًٔا
      [], // وَإِن
      [], // كانَ
      ["مثقال حبّة : وزن أقلّ شيء"], // مِثقالَ
      ["مثقال حبّة : وزن أقلّ شيء"], // حَبَّةٍ
      [], // مِن
      [], // خَردَلٍ
      [], // أَتَينا
      [], // بِها
      [], // وَكَفىٰ
      [], // بِنا
      [] // حـٰسِبينَ
    ],
    [ // آية 48
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسىٰ
      [], // وَهـٰرونَ
      [], // الفُرقانَ
      [], // وَضِياءً
      [], // وَذِكرًا
      [] // لِلمُتَّقينَ
    ],
    [ // آية 49
      [], // الَّذينَ
      [], // يَخشَونَ
      [], // رَبَّهُم
      [], // بِالغَيبِ
      [], // وَهُم
      [], // مِنَ
      [], // السّاعَةِ
      ["مُشفقون : خائفون خذرون"] // مُشفِقونَ
    ],
    [ // آية 50
      [], // وَهـٰذا
      [], // ذِكرٌ
      [], // مُبارَكٌ
      [], // أَنزَلنـٰهُ
      [], // أَفَأَنتُم
      [], // لَهُ
      [] // مُنكِرونَ
    ],
    [ // آية 51
      [], // وَلَقَد
      [], // ءاتَينا
      [], // إِبرٰهيمَ
      [], // رُشدَهُ
      [], // مِن
      [], // قَبلُ
      [], // وَكُنّا
      [], // بِهِ
      [] // عـٰلِمينَ
    ],
    [ // آية 52
      [], // إِذ
      [], // قالَ
      [], // لِأَبيهِ
      [], // وَقَومِهِ
      [], // ما
      [], // هـٰذِهِ
      ["التّماثيل : الأصنام المصنوعة بأيديكم"], // التَّماثيلُ
      [], // الَّتى
      [], // أَنتُم
      [], // لَها
      [] // عـٰكِفونَ
    ],
    [ // آية 53
      [], // قالوا
      [], // وَجَدنا
      [], // ءاباءَنا
      [], // لَها
      [] // عـٰبِدينَ
    ],
    [ // آية 54
      [], // قالَ
      [], // لَقَد
      [], // كُنتُم
      [], // أَنتُم
      [], // وَءاباؤُكُم
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 55
      [], // قالوا
      [], // أَجِئتَنا
      [], // بِالحَقِّ
      [], // أَم
      [], // أَنتَ
      [], // مِنَ
      [] // اللّـٰعِبينَ
    ],
    [ // آية 56
      [], // قالَ
      [], // بَل
      [], // رَبُّكُم
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // الَّذى
      ["فطرهنّ : خلقهنّ و أبدعهنّ"], // فَطَرَهُنَّ
      [], // وَأَنا۠
      [], // عَلىٰ
      [], // ذٰلِكُم
      [], // مِنَ
      [] // الشّـٰهِدينَ
    ],
    [ // آية 57
      [], // وَتَاللَّهِ
      [], // لَأَكيدَنَّ
      [], // أَصنـٰمَكُم
      [], // بَعدَ
      [], // أَن
      [], // تُوَلّوا
      [] // مُدبِرينَ
    ],
    [ // آية 58
      [], // فَجَعَلَهُم
      [], // جُذٰذًا
      [], // إِلّا
      [], // كَبيرًا
      [], // لَهُم
      [], // لَعَلَّهُم
      [], // إِلَيهِ
      [] // يَرجِعونَ
    ],
    [ // آية 59
      [], // قالوا
      [], // مَن
      [], // فَعَلَ
      [], // هـٰذا
      [], // بِـٔالِهَتِنا
      [], // إِنَّهُ
      [], // لَمِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 60
      [], // قالوا
      [], // سَمِعنا
      [], // فَتًى
      [], // يَذكُرُهُم
      [], // يُقالُ
      [], // لَهُ
      [] // إِبرٰهيمُ
    ],
    [ // آية 61
      [], // قالوا
      [], // فَأتوا
      [], // بِهِ
      ["على أعين النّاس : ظاهرا بمرأى  من النّاس"], // عَلىٰ
      ["على أعين النّاس : ظاهرا بمرأى  من النّاس"], // أَعيُنِ
      ["على أعين النّاس : ظاهرا بمرأى  من النّاس"], // النّاسِ
      [], // لَعَلَّهُم
      [] // يَشهَدونَ
    ],
    [ // آية 62
      [], // قالوا
      [], // ءَأَنتَ
      [], // فَعَلتَ
      [], // هـٰذا
      [], // بِـٔالِهَتِنا
      [] // يـٰإِبرٰهيمُ
    ],
    [ // آية 63
      [], // قالَ
      [], // بَل
      [], // فَعَلَهُ
      [], // كَبيرُهُم
      [], // هـٰذا
      [], // فَسـَٔلوهُم
      [], // إِن
      [], // كانوا
      [] // يَنطِقونَ
    ],
    [ // آية 64
      [], // فَرَجَعوا
      [], // إِلىٰ
      [], // أَنفُسِهِم
      [], // فَقالوا
      [], // إِنَّكُم
      [], // أَنتُمُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 65
      [], // ثُمَّ
      ["نُكِسوا على رءوسهم : رجعوا إلى الباطل و العناد"], // نُكِسوا
      ["نُكِسوا على رءوسهم : رجعوا إلى الباطل و العناد"], // عَلىٰ
      ["نُكِسوا على رءوسهم : رجعوا إلى الباطل و العناد"], // رُءوسِهِم
      [], // لَقَد
      [], // عَلِمتَ
      [], // ما
      [], // هـٰؤُلاءِ
      [] // يَنطِقونَ
    ],
    [ // آية 66
      [], // قالَ
      [], // أَفَتَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَنفَعُكُم
      [], // شَيـًٔا
      [], // وَلا
      [] // يَضُرُّكُم
    ],
    [ // آية 67
      [], // أُفٍّ
      [], // لَكُم
      [], // وَلِما
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 68
      [], // قالوا
      [], // حَرِّقوهُ
      [], // وَانصُروا
      [], // ءالِهَتَكُم
      [], // إِن
      [], // كُنتُم
      [] // فـٰعِلينَ
    ],
    [ // آية 69
      [], // قُلنا
      [], // يـٰنارُ
      [], // كونى
      [], // بَردًا
      [], // وَسَلـٰمًا
      [], // عَلىٰ
      [] // إِبرٰهيمَ
    ],
    [ // آية 70
      [], // وَأَرادوا
      [], // بِهِ
      [], // كَيدًا
      [], // فَجَعَلنـٰهُمُ
      [] // الأَخسَرينَ
    ],
    [ // آية 71
      [], // وَنَجَّينـٰهُ
      [], // وَلوطًا
      ["إلى الأرض : مُنهيا إلى أرض الشّـام"], // إِلَى
      ["إلى الأرض : مُنهيا إلى أرض الشّـام"], // الأَرضِ
      [], // الَّتى
      [], // بـٰرَكنا
      [], // فيها
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 72
      [], // وَوَهَبنا
      [], // لَهُ
      [], // إِسحـٰقَ
      [], // وَيَعقوبَ
      ["نافلة : عطيّة أو زيادة عمّا سأل"], // نافِلَةً
      [], // وَكُلًّا
      [], // جَعَلنا
      [] // صـٰلِحينَ
    ],
    [ // آية 73
      [], // وَجَعَلنـٰهُم
      [], // أَئِمَّةً
      [], // يَهدونَ
      [], // بِأَمرِنا
      [], // وَأَوحَينا
      [], // إِلَيهِم
      [], // فِعلَ
      [], // الخَيرٰتِ
      [], // وَإِقامَ
      [], // الصَّلوٰةِ
      [], // وَإيتاءَ
      [], // الزَّكوٰةِ
      [], // وَكانوا
      [], // لَنا
      [] // عـٰبِدينَ
    ],
    [ // آية 74
      [], // وَلوطًا
      [], // ءاتَينـٰهُ
      [], // حُكمًا
      [], // وَعِلمًا
      [], // وَنَجَّينـٰهُ
      [], // مِنَ
      [], // القَريَةِ
      [], // الَّتى
      [], // كانَت
      [], // تَعمَلُ
      [], // الخَبـٰئِثَ
      [], // إِنَّهُم
      [], // كانوا
      ["قوم سوْء : فساد و فعلٍ مكروه"], // قَومَ
      ["قوم سوْء : فساد و فعلٍ مكروه"], // سَوءٍ
      [] // فـٰسِقينَ
    ],
    [ // آية 75
      [], // وَأَدخَلنـٰهُ
      [], // فى
      [], // رَحمَتِنا
      [], // إِنَّهُ
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 76
      [], // وَنوحًا
      [], // إِذ
      [], // نادىٰ
      [], // مِن
      [], // قَبلُ
      [], // فَاستَجَبنا
      [], // لَهُ
      [], // فَنَجَّينـٰهُ
      [], // وَأَهلَهُ
      [], // مِنَ
      [], // الكَربِ
      [] // العَظيمِ
    ],
    [ // آية 77
      [], // وَنَصَرنـٰهُ
      [], // مِنَ
      [], // القَومِ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // إِنَّهُم
      [], // كانوا
      [], // قَومَ
      [], // سَوءٍ
      [], // فَأَغرَقنـٰهُم
      [] // أَجمَعينَ
    ],
    [ // آية 78
      [], // وَداوۥدَ
      [], // وَسُلَيمـٰنَ
      [], // إِذ
      [], // يَحكُمانِ
      [], // فِى
      ["الحرث : الزّرع . أو الكرم"], // الحَرثِ
      [], // إِذ
      ["نفشت فيه : انتشرت فيه ليلا بلا راعٍ فرعته"], // نَفَشَت
      ["نفشت فيه : انتشرت فيه ليلا بلا راعٍ فرعته"], // فيهِ
      [], // غَنَمُ
      [], // القَومِ
      [], // وَكُنّا
      [], // لِحُكمِهِم
      [] // شـٰهِدينَ
    ],
    [ // آية 79
      [], // فَفَهَّمنـٰها
      [], // سُلَيمـٰنَ
      [], // وَكُلًّا
      [], // ءاتَينا
      [], // حُكمًا
      [], // وَعِلمًا
      [], // وَسَخَّرنا
      [], // مَعَ
      [], // داوۥدَ
      [], // الجِبالَ
      [], // يُسَبِّحنَ
      [], // وَالطَّيرَ
      [], // وَكُنّا
      [] // فـٰعِلينَ
    ],
    [ // آية 80
      [], // وَعَلَّمنـٰهُ
      ["صنعة لَبوس : عمل الدّروع تلبس في الحرب"], // صَنعَةَ
      ["صنعة لَبوس : عمل الدّروع تلبس في الحرب"], // لَبوسٍ
      [], // لَكُم
      ["لِتُحصنكم : لتحفظكم و تقيكم"], // لِتُحصِنَكُم
      [], // مِن
      ["بأسكم : حرب عدوّكم و إصابتكم بسلاحه"], // بَأسِكُم
      [], // فَهَل
      [], // أَنتُم
      [] // شـٰكِرونَ
    ],
    [ // آية 81
      [], // وَلِسُلَيمـٰنَ
      [], // الرّيحَ
      ["عاصفة : شديدة الهبوب"], // عاصِفَةً
      [], // تَجرى
      [], // بِأَمرِهِ
      [], // إِلَى
      [], // الأَرضِ
      [], // الَّتى
      [], // بـٰرَكنا
      [], // فيها
      [], // وَكُنّا
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عـٰلِمينَ
    ],
    [ // آية 82
      [], // وَمِنَ
      [], // الشَّيـٰطينِ
      [], // مَن
      ["يغوصون له : في البحار لاستخراج نفائسها"], // يَغوصونَ
      ["يغوصون له : في البحار لاستخراج نفائسها"], // لَهُ
      [], // وَيَعمَلونَ
      [], // عَمَلًا
      [], // دونَ
      [], // ذٰلِكَ
      [], // وَكُنّا
      [], // لَهُم
      [] // حـٰفِظينَ
    ],
    [ // آية 83
      [], // وَأَيّوبَ
      [], // إِذ
      [], // نادىٰ
      [], // رَبَّهُ
      [], // أَنّى
      [], // مَسَّنِىَ
      [], // الضُّرُّ
      [], // وَأَنتَ
      [], // أَرحَمُ
      [] // الرّٰحِمينَ
    ],
    [ // آية 84
      [], // فَاستَجَبنا
      [], // لَهُ
      [], // فَكَشَفنا
      [], // ما
      [], // بِهِ
      [], // مِن
      [], // ضُرٍّ
      [], // وَءاتَينـٰهُ
      [], // أَهلَهُ
      [], // وَمِثلَهُم
      [], // مَعَهُم
      [], // رَحمَةً
      [], // مِن
      [], // عِندِنا
      [], // وَذِكرىٰ
      [] // لِلعـٰبِدينَ
    ],
    [ // آية 85
      [], // وَإِسمـٰعيلَ
      [], // وَإِدريسَ
      [], // وَذَا
      [], // الكِفلِ
      [], // كُلٌّ
      [], // مِنَ
      [] // الصّـٰبِرينَ
    ],
    [ // آية 86
      [], // وَأَدخَلنـٰهُم
      [], // فى
      [], // رَحمَتِنا
      [], // إِنَّهُم
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 87
      [], // وَذَا
      [], // النّونِ
      [], // إِذ
      [], // ذَهَبَ
      [], // مُغـٰضِبًا
      [], // فَظَنَّ
      [], // أَن
      [], // لَن
      [], // نَقدِرَ
      [], // عَلَيهِ
      [], // فَنادىٰ
      [], // فِى
      [], // الظُّلُمـٰتِ
      [], // أَن
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // أَنتَ
      [], // سُبحـٰنَكَ
      [], // إِنّى
      [], // كُنتُ
      [], // مِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 88
      [], // فَاستَجَبنا
      [], // لَهُ
      [], // وَنَجَّينـٰهُ
      [], // مِنَ
      [], // الغَمِّ
      [], // وَكَذٰلِكَ
      [], // نُـۨجِى
      [] // المُؤمِنينَ
    ],
    [ // آية 89
      [], // وَزَكَرِيّا
      [], // إِذ
      [], // نادىٰ
      [], // رَبَّهُ
      [], // رَبِّ
      [], // لا
      [], // تَذَرنى
      [], // فَردًا
      [], // وَأَنتَ
      [], // خَيرُ
      [] // الوٰرِثينَ
    ],
    [ // آية 90
      [], // فَاستَجَبنا
      [], // لَهُ
      [], // وَوَهَبنا
      [], // لَهُ
      [], // يَحيىٰ
      [], // وَأَصلَحنا
      [], // لَهُ
      [], // زَوجَهُ
      [], // إِنَّهُم
      [], // كانوا
      [], // يُسـٰرِعونَ
      [], // فِى
      [], // الخَيرٰتِ
      [], // وَيَدعونَنا
      [], // رَغَبًا
      [], // وَرَهَبًا
      [], // وَكانوا
      [], // لَنا
      [] // خـٰشِعينَ
    ],
    [ // آية 91
      [], // وَالَّتى
      ["أحصنت فرجها : حفظته من الحلال و الحرام"], // أَحصَنَت
      ["أحصنت فرجها : حفظته من الحلال و الحرام"], // فَرجَها
      [], // فَنَفَخنا
      [], // فيها
      ["من روحنا : من جهة روحنا و هو جبريل"], // مِن
      ["من روحنا : من جهة روحنا و هو جبريل"], // روحِنا
      [], // وَجَعَلنـٰها
      [], // وَابنَها
      [], // ءايَةً
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 92
      [], // إِنَّ
      [], // هـٰذِهِ
      ["أمّتكم : ملّـتكم (الإسلام)"], // أُمَّتُكُم
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // وَأَنا۠
      [], // رَبُّكُم
      [] // فَاعبُدونِ
    ],
    [ // آية 93
      [], // وَتَقَطَّعوا
      [], // أَمرَهُم
      [], // بَينَهُم
      [], // كُلٌّ
      [], // إِلَينا
      [] // رٰجِعونَ
    ],
    [ // آية 94
      [], // فَمَن
      [], // يَعمَل
      [], // مِنَ
      [], // الصّـٰلِحـٰتِ
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَلا
      [], // كُفرانَ
      [], // لِسَعيِهِ
      [], // وَإِنّا
      [], // لَهُ
      [] // كـٰتِبونَ
    ],
    [ // آية 95
      [], // وَحَرٰمٌ
      [], // عَلىٰ
      [], // قَريَةٍ
      [], // أَهلَكنـٰها
      ["أنّهم لا يرجعون : إلينا بالبعث للجزاء"], // أَنَّهُم
      ["أنّهم لا يرجعون : إلينا بالبعث للجزاء"], // لا
      ["أنّهم لا يرجعون : إلينا بالبعث للجزاء"] // يَرجِعونَ
    ],
    [ // آية 96
      [], // حَتّىٰ
      [], // إِذا
      [], // فُتِحَت
      [], // يَأجوجُ
      [], // وَمَأجوجُ
      [], // وَهُم
      [], // مِن
      [], // كُلِّ
      ["حَدَبٍ : مرتفع من الأرض"], // حَدَبٍ
      ["ينسِلون : يُسرعون المشي في الخروج"] // يَنسِلونَ
    ],
    [ // آية 97
      [], // وَاقتَرَبَ
      ["الوعد الحقّ : البعث و الحساب و الجزاء"], // الوَعدُ
      ["الوعد الحقّ : البعث و الحساب و الجزاء"], // الحَقُّ
      [], // فَإِذا
      [], // هِىَ
      [], // شـٰخِصَةٌ
      [], // أَبصـٰرُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // يـٰوَيلَنا
      [], // قَد
      [], // كُنّا
      [], // فى
      [], // غَفلَةٍ
      [], // مِن
      [], // هـٰذا
      [], // بَل
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 98
      [], // إِنَّكُم
      [], // وَما
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      ["حصب جهنّم : حطبها ووقودها الذي به تهيَّج"], // حَصَبُ
      ["حصب جهنّم : حطبها ووقودها الذي به تهيَّج"], // جَهَنَّمَ
      [], // أَنتُم
      [], // لَها
      [] // وٰرِدونَ
    ],
    [ // آية 99
      [], // لَو
      [], // كانَ
      [], // هـٰؤُلاءِ
      [], // ءالِهَةً
      [], // ما
      [], // وَرَدوها
      [], // وَكُلٌّ
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 100
      [], // لَهُم
      [], // فيها
      ["زفير : تنفّس شديد تنتفخ منه الضّلوع"], // زَفيرٌ
      [], // وَهُم
      [], // فيها
      [], // لا
      [] // يَسمَعونَ
    ],
    [ // آية 101
      [], // إِنَّ
      [], // الَّذينَ
      [], // سَبَقَت
      [], // لَهُم
      [], // مِنَّا
      [], // الحُسنىٰ
      [], // أُولـٰئِكَ
      [], // عَنها
      [] // مُبعَدونَ
    ],
    [ // آية 102
      [], // لا
      [], // يَسمَعونَ
      [], // حَسيسَها
      [], // وَهُم
      [], // فى
      [], // مَا
      [], // اشتَهَت
      [], // أَنفُسُهُم
      [] // خـٰلِدونَ
    ],
    [ // آية 103
      [], // لا
      [], // يَحزُنُهُمُ
      ["الفزع الأكبر : حين نفخة البعث"], // الفَزَعُ
      ["الفزع الأكبر : حين نفخة البعث"], // الأَكبَرُ
      [], // وَتَتَلَقّىٰهُمُ
      [], // المَلـٰئِكَةُ
      [], // هـٰذا
      [], // يَومُكُمُ
      [], // الَّذى
      [], // كُنتُم
      [] // توعَدونَ
    ],
    [ // آية 104
      [], // يَومَ
      [], // نَطوِى
      [], // السَّماءَ
      [], // كَطَىِّ
      ["السجلّ : الصّحيفة التي يُكتب فيها"], // السِّجِلِّ
      ["للكتب : على ما كُتِب في السّجل"], // لِلكُتُبِ
      [], // كَما
      [], // بَدَأنا
      [], // أَوَّلَ
      [], // خَلقٍ
      [], // نُعيدُهُ
      [], // وَعدًا
      [], // عَلَينا
      [], // إِنّا
      [], // كُنّا
      [] // فـٰعِلينَ
    ],
    [ // آية 105
      [], // وَلَقَد
      [], // كَتَبنا
      [], // فِى
      ["الزّبور : الكُتب المنزّلة"], // الزَّبورِ
      [], // مِن
      [], // بَعدِ
      ["الذكر : اللّوح المحفوظ"], // الذِّكرِ
      [], // أَنَّ
      [], // الأَرضَ
      [], // يَرِثُها
      [], // عِبادِىَ
      [] // الصّـٰلِحونَ
    ],
    [ // آية 106
      [], // إِنَّ
      [], // فى
      [], // هـٰذا
      [], // لَبَلـٰغًا
      [], // لِقَومٍ
      [] // عـٰبِدينَ
    ],
    [ // آية 107
      [], // وَما
      [], // أَرسَلنـٰكَ
      [], // إِلّا
      [], // رَحمَةً
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 108
      [], // قُل
      [], // إِنَّما
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // أَنَّما
      [], // إِلـٰهُكُم
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // فَهَل
      [], // أَنتُم
      [] // مُسلِمونَ
    ],
    [ // آية 109
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَقُل
      [], // ءاذَنتُكُم
      ["على سواءٍ : مُستوين جميعا في الإعلام به"], // عَلىٰ
      ["على سواءٍ : مُستوين جميعا في الإعلام به"], // سَواءٍ
      [], // وَإِن
      [], // أَدرى
      [], // أَقَريبٌ
      [], // أَم
      [], // بَعيدٌ
      [], // ما
      [] // توعَدونَ
    ],
    [ // آية 110
      [], // إِنَّهُ
      [], // يَعلَمُ
      [], // الجَهرَ
      [], // مِنَ
      [], // القَولِ
      [], // وَيَعلَمُ
      [], // ما
      [] // تَكتُمونَ
    ],
    [ // آية 111
      [], // وَإِن
      [], // أَدرى
      [], // لَعَلَّهُ
      ["فتنة لكم : امتحان لكم"], // فِتنَةٌ
      ["فتنة لكم : امتحان لكم"], // لَكُم
      [], // وَمَتـٰعٌ
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 112
      [], // قـٰلَ
      [], // رَبِّ
      [], // احكُم
      [], // بِالحَقِّ
      [], // وَرَبُّنَا
      [], // الرَّحمـٰنُ
      [], // المُستَعانُ
      [], // عَلىٰ
      [], // ما
      [] // تَصِفونَ
    ]
];

export default meanings;