const meanings = [
  [ // سورة 22: الحج
[ // آية 1
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // اتَّقوا
      [], // رَبَّكُم
      [], // إِنَّ
      [], // زَلزَلَةَ
      [], // السّاعَةِ
      [], // شَىءٌ
      [] // عَظيمٌ
    ],
    [ // آية 2
      [], // يَومَ
      [], // تَرَونَها
      ["تذهل : تغفُلُ وتُشغلُ لشدة الهول"], // تَذهَلُ
      [], // كُلُّ
      [], // مُرضِعَةٍ
      [], // عَمّا
      [], // أَرضَعَت
      [], // وَتَضَعُ
      [], // كُلُّ
      [], // ذاتِ
      [], // حَملٍ
      [], // حَملَها
      [], // وَتَرَى
      [], // النّاسَ
      [], // سُكـٰرىٰ
      [], // وَما
      [], // هُم
      [], // بِسُكـٰرىٰ
      [], // وَلـٰكِنَّ
      [], // عَذابَ
      [], // اللَّهِ
      [] // شَديدٌ
    ],
    [ // آية 3
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يُجـٰدِلُ
      [], // فِى
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // وَيَتَّبِعُ
      [], // كُلَّ
      [], // شَيطـٰنٍ
      ["مريد : متمرّدٍ عاتٍ متجرد للفساد"] // مَريدٍ
    ],
    [ // آية 4
      [], // كُتِبَ
      [], // عَلَيهِ
      [], // أَنَّهُ
      [], // مَن
      ["تولاّه : اتخذه وليا وتبعه"], // تَوَلّاهُ
      [], // فَأَنَّهُ
      [], // يُضِلُّهُ
      [], // وَيَهديهِ
      [], // إِلىٰ
      [], // عَذابِ
      [] // السَّعيرِ
    ],
    [ // آية 5
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِن
      [], // كُنتُم
      [], // فى
      [], // رَيبٍ
      [], // مِنَ
      [], // البَعثِ
      [], // فَإِنّا
      [], // خَلَقنـٰكُم
      [], // مِن
      [], // تُرابٍ
      [], // ثُمَّ
      [], // مِن
      ["نطفة : منيّ"], // نُطفَةٍ
      [], // ثُمَّ
      [], // مِن
      ["علقة : قطعة دم جامدة"], // عَلَقَةٍ
      [], // ثُمَّ
      [], // مِن
      ["مُضغة : قطعة لحم قدر ما يمضغ"], // مُضغَةٍ
      ["مُخلقة : مستبينة الخلق مُصوّرة"], // مُخَلَّقَةٍ
      [], // وَغَيرِ
      [], // مُخَلَّقَةٍ
      [], // لِنُبَيِّنَ
      [], // لَكُم
      [], // وَنُقِرُّ
      [], // فِى
      [], // الأَرحامِ
      [], // ما
      [], // نَشاءُ
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // ثُمَّ
      [], // نُخرِجُكُم
      [], // طِفلًا
      [], // ثُمَّ
      ["لتبلغوا أشدكم : كمال قوتكم وعقلكم"], // لِتَبلُغوا
      ["لتبلغوا أشدكم : كمال قوتكم وعقلكم"], // أَشُدَّكُم
      [], // وَمِنكُم
      [], // مَن
      [], // يُتَوَفّىٰ
      [], // وَمِنكُم
      [], // مَن
      [], // يُرَدُّ
      [], // إِلىٰ
      ["أرذل العمر : أخسّـِـه , أي الخَرَف والهَرَم"], // أَرذَلِ
      ["أرذل العمر : أخسّـِـه , أي الخَرَف والهَرَم"], // العُمُرِ
      [], // لِكَيلا
      [], // يَعلَمَ
      [], // مِن
      [], // بَعدِ
      [], // عِلمٍ
      [], // شَيـًٔا
      [], // وَتَرَى
      [], // الأَرضَ
      [], // هامِدَةً
      [], // فَإِذا
      [], // أَنزَلنا
      [], // عَلَيهَا
      [], // الماءَ
      ["اهتزتْ : تحركت بالنبات"], // اهتَزَّت
      [], // وَرَبَت
      [], // وَأَنبَتَت
      [], // مِن
      [], // كُلِّ
      ["زوج بهيج : صنف حسن نضير"], // زَوجٍ
      ["زوج بهيج : صنف حسن نضير"] // بَهيجٍ
    ],
    [ // آية 6
      [], // ذٰلِكَ
      [], // بِأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الحَقُّ
      [], // وَأَنَّهُ
      [], // يُحىِ
      [], // المَوتىٰ
      [], // وَأَنَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 7
      [], // وَأَنَّ
      [], // السّاعَةَ
      [], // ءاتِيَةٌ
      [], // لا
      [], // رَيبَ
      [], // فيها
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // يَبعَثُ
      [], // مَن
      [], // فِى
      [] // القُبورِ
    ],
    [ // آية 8
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يُجـٰدِلُ
      [], // فِى
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // وَلا
      [], // هُدًى
      [], // وَلا
      [], // كِتـٰبٍ
      [] // مُنيرٍ
    ],
    [ // آية 9
      [], // ثانِىَ
      [], // عِطفِهِ
      [], // لِيُضِلَّ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // لَهُ
      [], // فِى
      [], // الدُّنيا
      [], // خِزىٌ
      [], // وَنُذيقُهُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // عَذابَ
      [] // الحَريقِ
    ],
    [ // آية 10
      [], // ذٰلِكَ
      [], // بِما
      [], // قَدَّمَت
      [], // يَداكَ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // لَيسَ
      [], // بِظَلّـٰمٍ
      [] // لِلعَبيدِ
    ],
    [ // آية 11
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يَعبُدُ
      [], // اللَّهَ
      ["على حرْف : شكّ وقلق و تزلزل في الدين"], // عَلىٰ
      ["على حرْف : شكّ وقلق و تزلزل في الدين"], // حَرفٍ
      [], // فَإِن
      [], // أَصابَهُ
      [], // خَيرٌ
      [], // اطمَأَنَّ
      [], // بِهِ
      [], // وَإِن
      [], // أَصابَتهُ
      [], // فِتنَةٌ
      [], // انقَلَبَ
      [], // عَلىٰ
      [], // وَجهِهِ
      [], // خَسِرَ
      [], // الدُّنيا
      [], // وَالـٔاخِرَةَ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الخُسرانُ
      [] // المُبينُ
    ],
    [ // آية 12
      [], // يَدعوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَضُرُّهُ
      [], // وَما
      [], // لا
      [], // يَنفَعُهُ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الضَّلـٰلُ
      [] // البَعيدُ
    ],
    [ // آية 13
      [], // يَدعوا
      [], // لَمَن
      [], // ضَرُّهُ
      [], // أَقرَبُ
      [], // مِن
      [], // نَفعِهِ
      [], // لَبِئسَ
      [], // المَولىٰ
      [], // وَلَبِئسَ
      ["العشير : المصاحب المعاشر"] // العَشيرُ
    ],
    [ // آية 14
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُدخِلُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَفعَلُ
      [], // ما
      [] // يُريدُ
    ],
    [ // آية 15
      [], // مَن
      [], // كانَ
      [], // يَظُنُّ
      [], // أَن
      [], // لَن
      ["ينصره الله : ينصر الله  رسوله صلى الله عليه وسلم"], // يَنصُرَهُ
      ["ينصره الله : ينصر الله  رسوله صلى الله عليه وسلم"], // اللَّهُ
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // فَليَمدُد
      ["بسبب إلى السماء : بحبل إلى سقف بيته"], // بِسَبَبٍ
      ["بسبب إلى السماء : بحبل إلى سقف بيته"], // إِلَى
      ["بسبب إلى السماء : بحبل إلى سقف بيته"], // السَّماءِ
      ["ثم ليقطع : ثم ليختنق به حتى يموت"], // ثُمَّ
      ["ثم ليقطع : ثم ليختنق به حتى يموت"], // ليَقطَع
      [], // فَليَنظُر
      [], // هَل
      [], // يُذهِبَنَّ
      ["كيده : صنيعه بنفسه"], // كَيدُهُ
      [], // ما
      [] // يَغيظُ
    ],
    [ // آية 16
      [], // وَكَذٰلِكَ
      [], // أَنزَلنـٰهُ
      [], // ءايـٰتٍ
      [], // بَيِّنـٰتٍ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // يَهدى
      [], // مَن
      [] // يُريدُ
    ],
    [ // آية 17
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَالَّذينَ
      [], // هادوا
      [], // وَالصّـٰبِـٔينَ
      [], // وَالنَّصـٰرىٰ
      [], // وَالمَجوسَ
      [], // وَالَّذينَ
      [], // أَشرَكوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَفصِلُ
      [], // بَينَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدٌ
    ],
    [ // آية 18
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      ["يسجد له : يخضع وينقاد لإرادته تعالى"], // يَسجُدُ
      ["يسجد له : يخضع وينقاد لإرادته تعالى"], // لَهُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // وَالشَّمسُ
      [], // وَالقَمَرُ
      [], // وَالنُّجومُ
      [], // وَالجِبالُ
      [], // وَالشَّجَرُ
      [], // وَالدَّوابُّ
      [], // وَكَثيرٌ
      [], // مِنَ
      [], // النّاسِ
      [], // وَكَثيرٌ
      [], // حَقَّ
      [], // عَلَيهِ
      [], // العَذابُ
      [], // وَمَن
      [], // يُهِنِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [], // مُكرِمٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَفعَلُ
      [], // ما
      [] // يَشاءُ
    ],
    [ // آية 19
      [], // هـٰذانِ
      [], // خَصمانِ
      [], // اختَصَموا
      [], // فى
      [], // رَبِّهِم
      [], // فَالَّذينَ
      [], // كَفَروا
      [], // قُطِّعَت
      [], // لَهُم
      [], // ثِيابٌ
      [], // مِن
      [], // نارٍ
      [], // يُصَبُّ
      [], // مِن
      [], // فَوقِ
      [], // رُءوسِهِمُ
      ["الحميم : الماء البالغ نهاية الحرارة"] // الحَميمُ
    ],
    [ // آية 20
      ["يُصهر به : يُذاب به"], // يُصهَرُ
      ["يُصهر به : يُذاب به"], // بِهِ
      [], // ما
      [], // فى
      [], // بُطونِهِم
      [] // وَالجُلودُ
    ],
    [ // آية 21
      [], // وَلَهُم
      [], // مَقـٰمِعُ
      [], // مِن
      [] // حَديدٍ
    ],
    [ // آية 22
      [], // كُلَّما
      [], // أَرادوا
      [], // أَن
      [], // يَخرُجوا
      [], // مِنها
      [], // مِن
      [], // غَمٍّ
      [], // أُعيدوا
      [], // فيها
      [], // وَذوقوا
      [], // عَذابَ
      [] // الحَريقِ
    ],
    [ // آية 23
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُدخِلُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // يُحَلَّونَ
      [], // فيها
      [], // مِن
      [], // أَساوِرَ
      [], // مِن
      [], // ذَهَبٍ
      [], // وَلُؤلُؤًا
      [], // وَلِباسُهُم
      [], // فيها
      [] // حَريرٌ
    ],
    [ // آية 24
      [], // وَهُدوا
      [], // إِلَى
      [], // الطَّيِّبِ
      [], // مِنَ
      [], // القَولِ
      [], // وَهُدوا
      [], // إِلىٰ
      [], // صِرٰطِ
      [] // الحَميدِ
    ],
    [ // آية 25
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَيَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالمَسجِدِ
      [], // الحَرامِ
      [], // الَّذى
      [], // جَعَلنـٰهُ
      [], // لِلنّاسِ
      [], // سَواءً
      [], // العـٰكِفُ
      [], // فيهِ
      [], // وَالبادِ
      [], // وَمَن
      [], // يُرِد
      [], // فيهِ
      ["بإلحاد بظلم : بميل عن الحق إلى الباطل"], // بِإِلحادٍ
      ["بإلحاد بظلم : بميل عن الحق إلى الباطل"], // بِظُلمٍ
      [], // نُذِقهُ
      [], // مِن
      [], // عَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 26
      [], // وَإِذ
      [], // بَوَّأنا
      [], // لِإِبرٰهيمَ
      [], // مَكانَ
      [], // البَيتِ
      [], // أَن
      [], // لا
      [], // تُشرِك
      [], // بى
      [], // شَيـًٔا
      [], // وَطَهِّر
      [], // بَيتِىَ
      [], // لِلطّائِفينَ
      [], // وَالقائِمينَ
      [], // وَالرُّكَّعِ
      [] // السُّجودِ
    ],
    [ // آية 27
      [], // وَأَذِّن
      [], // فِى
      [], // النّاسِ
      [], // بِالحَجِّ
      [], // يَأتوكَ
      ["رجالا : مشاة على أرجلهم"], // رِجالًا
      [], // وَعَلىٰ
      [], // كُلِّ
      ["ضامر : بعير مهزول من بُعد الشـقـّـة"], // ضامِرٍ
      [], // يَأتينَ
      [], // مِن
      [], // كُلِّ
      ["فج عميق : طريق بعيد"], // فَجٍّ
      ["فج عميق : طريق بعيد"] // عَميقٍ
    ],
    [ // آية 28
      [], // لِيَشهَدوا
      [], // مَنـٰفِعَ
      [], // لَهُم
      [], // وَيَذكُرُوا
      [], // اسمَ
      [], // اللَّهِ
      [], // فى
      [], // أَيّامٍ
      [], // مَعلومـٰتٍ
      [], // عَلىٰ
      [], // ما
      [], // رَزَقَهُم
      [], // مِن
      [], // بَهيمَةِ
      [], // الأَنعـٰمِ
      [], // فَكُلوا
      [], // مِنها
      [], // وَأَطعِمُوا
      [], // البائِسَ
      [] // الفَقيرَ
    ],
    [ // آية 29
      [], // ثُمَّ
      [], // ليَقضوا
      [], // تَفَثَهُم
      [], // وَليوفوا
      [], // نُذورَهُم
      [], // وَليَطَّوَّفوا
      [], // بِالبَيتِ
      [] // العَتيقِ
    ],
    [ // آية 30
      [], // ذٰلِكَ
      [], // وَمَن
      [], // يُعَظِّم
      [], // حُرُمـٰتِ
      [], // اللَّهِ
      [], // فَهُوَ
      [], // خَيرٌ
      [], // لَهُ
      [], // عِندَ
      [], // رَبِّهِ
      [], // وَأُحِلَّت
      [], // لَكُمُ
      [], // الأَنعـٰمُ
      [], // إِلّا
      [], // ما
      [], // يُتلىٰ
      [], // عَلَيكُم
      [], // فَاجتَنِبُوا
      [], // الرِّجسَ
      [], // مِنَ
      [], // الأَوثـٰنِ
      [], // وَاجتَنِبوا
      ["قول الزور : قول الباطل والكذب القبيح"], // قَولَ
      ["قول الزور : قول الباطل والكذب القبيح"] // الزّورِ
    ],
    [ // آية 31
      ["حُنفاء لله : مائلين عن الباطل الى دين الحقّ"], // حُنَفاءَ
      ["حُنفاء لله : مائلين عن الباطل الى دين الحقّ"], // لِلَّهِ
      [], // غَيرَ
      [], // مُشرِكينَ
      [], // بِهِ
      [], // وَمَن
      [], // يُشرِك
      [], // بِاللَّهِ
      [], // فَكَأَنَّما
      [], // خَرَّ
      [], // مِنَ
      [], // السَّماءِ
      [], // فَتَخطَفُهُ
      [], // الطَّيرُ
      [], // أَو
      ["تهوى به الريح : تُسقطه وتقذفه"], // تَهوى
      ["تهوى به الريح : تُسقطه وتقذفه"], // بِهِ
      ["تهوى به الريح : تُسقطه وتقذفه"], // الرّيحُ
      [], // فى
      ["مكان سحيق : موضع بعيد مُـهـلـِـك"], // مَكانٍ
      ["مكان سحيق : موضع بعيد مُـهـلـِـك"] // سَحيقٍ
    ],
    [ // آية 32
      [], // ذٰلِكَ
      [], // وَمَن
      [], // يُعَظِّم
      [], // شَعـٰئِرَ
      [], // اللَّهِ
      [], // فَإِنَّها
      [], // مِن
      [], // تَقوَى
      [] // القُلوبِ
    ],
    [ // آية 33
      [], // لَكُم
      [], // فيها
      [], // مَنـٰفِعُ
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // ثُمَّ
      ["محلها : وجوب نحرها"], // مَحِلُّها
      ["إلى البيت العتيق : منتهية إلى أرض الحرم كله"], // إِلَى
      ["إلى البيت العتيق : منتهية إلى أرض الحرم كله"], // البَيتِ
      ["إلى البيت العتيق : منتهية إلى أرض الحرم كله"] // العَتيقِ
    ],
    [ // آية 34
      [], // وَلِكُلِّ
      [], // أُمَّةٍ
      [], // جَعَلنا
      ["منسكا : نُسكا وعبادة ( الذبح قُربة لله )"], // مَنسَكًا
      [], // لِيَذكُرُوا
      [], // اسمَ
      [], // اللَّهِ
      [], // عَلىٰ
      [], // ما
      [], // رَزَقَهُم
      [], // مِن
      [], // بَهيمَةِ
      [], // الأَنعـٰمِ
      [], // فَإِلـٰهُكُم
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // فَلَهُ
      [], // أَسلِموا
      [], // وَبَشِّرِ
      [] // المُخبِتينَ
    ],
    [ // آية 35
      [], // الَّذينَ
      [], // إِذا
      [], // ذُكِرَ
      [], // اللَّهُ
      ["وجلت قلوبهم : خافت هـيْـبة و إجلالا منه تعالى"], // وَجِلَت
      ["وجلت قلوبهم : خافت هـيْـبة و إجلالا منه تعالى"], // قُلوبُهُم
      [], // وَالصّـٰبِرينَ
      [], // عَلىٰ
      [], // ما
      [], // أَصابَهُم
      [], // وَالمُقيمِى
      [], // الصَّلوٰةِ
      [], // وَمِمّا
      [], // رَزَقنـٰهُم
      [] // يُنفِقونَ
    ],
    [ // آية 36
      [], // وَالبُدنَ
      [], // جَعَلنـٰها
      [], // لَكُم
      [], // مِن
      [], // شَعـٰئِرِ
      [], // اللَّهِ
      [], // لَكُم
      [], // فيها
      [], // خَيرٌ
      [], // فَاذكُرُوا
      [], // اسمَ
      [], // اللَّهِ
      [], // عَلَيها
      ["صوافّ : قائمات صففن أيديَهُن وأرجـُـلهُن"], // صَوافَّ
      [], // فَإِذا
      ["وجبت جُنُوبُها : سقطت على الأرض بعد النحر"], // وَجَبَت
      ["وجبت جُنُوبُها : سقطت على الأرض بعد النحر"], // جُنوبُها
      [], // فَكُلوا
      [], // مِنها
      [], // وَأَطعِمُوا
      [], // القانِعَ
      [], // وَالمُعتَرَّ
      [], // كَذٰلِكَ
      [], // سَخَّرنـٰها
      [], // لَكُم
      [], // لَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 37
      [], // لَن
      [], // يَنالَ
      [], // اللَّهَ
      [], // لُحومُها
      [], // وَلا
      [], // دِماؤُها
      [], // وَلـٰكِن
      [], // يَنالُهُ
      [], // التَّقوىٰ
      [], // مِنكُم
      [], // كَذٰلِكَ
      [], // سَخَّرَها
      [], // لَكُم
      [], // لِتُكَبِّرُوا
      [], // اللَّهَ
      [], // عَلىٰ
      [], // ما
      [], // هَدىٰكُم
      [], // وَبَشِّرِ
      [] // المُحسِنينَ
    ],
    [ // آية 38
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُدٰفِعُ
      [], // عَنِ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [], // كُلَّ
      ["خوان كفور : خائن للأمانات – جاحد للنعم"], // خَوّانٍ
      ["خوان كفور : خائن للأمانات – جاحد للنعم"] // كَفورٍ
    ],
    [ // آية 39
      [], // أُذِنَ
      [], // لِلَّذينَ
      [], // يُقـٰتَلونَ
      [], // بِأَنَّهُم
      [], // ظُلِموا
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // نَصرِهِم
      [] // لَقَديرٌ
    ],
    [ // آية 40
      [], // الَّذينَ
      [], // أُخرِجوا
      [], // مِن
      [], // دِيـٰرِهِم
      [], // بِغَيرِ
      [], // حَقٍّ
      [], // إِلّا
      [], // أَن
      [], // يَقولوا
      [], // رَبُّنَا
      [], // اللَّهُ
      [], // وَلَولا
      [], // دَفعُ
      [], // اللَّهِ
      [], // النّاسَ
      [], // بَعضَهُم
      [], // بِبَعضٍ
      [], // لَهُدِّمَت
      [], // صَوٰمِعُ
      [], // وَبِيَعٌ
      [], // وَصَلَوٰتٌ
      [], // وَمَسـٰجِدُ
      [], // يُذكَرُ
      [], // فيهَا
      [], // اسمُ
      [], // اللَّهِ
      [], // كَثيرًا
      [], // وَلَيَنصُرَنَّ
      [], // اللَّهُ
      [], // مَن
      [], // يَنصُرُهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَقَوِىٌّ
      [] // عَزيزٌ
    ],
    [ // آية 41
      [], // الَّذينَ
      [], // إِن
      [], // مَكَّنّـٰهُم
      [], // فِى
      [], // الأَرضِ
      [], // أَقامُوا
      [], // الصَّلوٰةَ
      [], // وَءاتَوُا
      [], // الزَّكوٰةَ
      [], // وَأَمَروا
      [], // بِالمَعروفِ
      [], // وَنَهَوا
      [], // عَنِ
      [], // المُنكَرِ
      [], // وَلِلَّهِ
      [], // عـٰقِبَةُ
      [] // الأُمورِ
    ],
    [ // آية 42
      [], // وَإِن
      [], // يُكَذِّبوكَ
      [], // فَقَد
      [], // كَذَّبَت
      [], // قَبلَهُم
      [], // قَومُ
      [], // نوحٍ
      [], // وَعادٌ
      [] // وَثَمودُ
    ],
    [ // آية 43
      [], // وَقَومُ
      [], // إِبرٰهيمَ
      [], // وَقَومُ
      [] // لوطٍ
    ],
    [ // آية 44
      [], // وَأَصحـٰبُ
      [], // مَديَنَ
      [], // وَكُذِّبَ
      [], // موسىٰ
      [], // فَأَملَيتُ
      [], // لِلكـٰفِرينَ
      [], // ثُمَّ
      [], // أَخَذتُهُم
      [], // فَكَيفَ
      ["كان نكير : إنكاري عليهم بإهلاكهم"], // كانَ
      ["كان نكير : إنكاري عليهم بإهلاكهم"] // نَكيرِ
    ],
    [ // آية 45
      ["فكأين من قرية : فكثير من القرى"], // فَكَأَيِّن
      ["فكأين من قرية : فكثير من القرى"], // مِن
      ["فكأين من قرية : فكثير من القرى"], // قَريَةٍ
      [], // أَهلَكنـٰها
      [], // وَهِىَ
      [], // ظالِمَةٌ
      [], // فَهِىَ
      ["خاوية على عروشها : ساقطة حيطانها على سقوفها المتهدمة"], // خاوِيَةٌ
      ["خاوية على عروشها : ساقطة حيطانها على سقوفها المتهدمة"], // عَلىٰ
      ["خاوية على عروشها : ساقطة حيطانها على سقوفها المتهدمة"], // عُروشِها
      [], // وَبِئرٍ
      [], // مُعَطَّلَةٍ
      [], // وَقَصرٍ
      [] // مَشيدٍ
    ],
    [ // آية 46
      [], // أَفَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَتَكونَ
      [], // لَهُم
      [], // قُلوبٌ
      [], // يَعقِلونَ
      [], // بِها
      [], // أَو
      [], // ءاذانٌ
      [], // يَسمَعونَ
      [], // بِها
      [], // فَإِنَّها
      [], // لا
      [], // تَعمَى
      [], // الأَبصـٰرُ
      [], // وَلـٰكِن
      [], // تَعمَى
      [], // القُلوبُ
      [], // الَّتى
      [], // فِى
      [] // الصُّدورِ
    ],
    [ // آية 47
      [], // وَيَستَعجِلونَكَ
      [], // بِالعَذابِ
      [], // وَلَن
      [], // يُخلِفَ
      [], // اللَّهُ
      [], // وَعدَهُ
      [], // وَإِنَّ
      [], // يَومًا
      [], // عِندَ
      [], // رَبِّكَ
      [], // كَأَلفِ
      [], // سَنَةٍ
      [], // مِمّا
      [] // تَعُدّونَ
    ],
    [ // آية 48
      [], // وَكَأَيِّن
      [], // مِن
      [], // قَريَةٍ
      ["أمليت لها : أمْـهَـلـتـُـها"], // أَملَيتُ
      ["أمليت لها : أمْـهَـلـتـُـها"], // لَها
      [], // وَهِىَ
      [], // ظالِمَةٌ
      [], // ثُمَّ
      [], // أَخَذتُها
      [], // وَإِلَىَّ
      [] // المَصيرُ
    ],
    [ // آية 49
      [], // قُل
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِنَّما
      [], // أَنا۠
      [], // لَكُم
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 50
      [], // فَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَرِزقٌ
      [] // كَريمٌ
    ],
    [ // آية 51
      [], // وَالَّذينَ
      [], // سَعَوا
      [], // فى
      [], // ءايـٰتِنا
      [], // مُعـٰجِزينَ
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [] // الجَحيمِ
    ],
    [ // آية 52
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // مِن
      [], // رَسولٍ
      [], // وَلا
      [], // نَبِىٍّ
      [], // إِلّا
      [], // إِذا
      ["تمنّى : قرأ الآيات المنزلة عليه"], // تَمَنّىٰ
      [], // أَلقَى
      [], // الشَّيطـٰنُ
      [], // فى
      [], // أُمنِيَّتِهِ
      [], // فَيَنسَخُ
      [], // اللَّهُ
      [], // ما
      [], // يُلقِى
      [], // الشَّيطـٰنُ
      [], // ثُمَّ
      [], // يُحكِمُ
      [], // اللَّهُ
      [], // ءايـٰتِهِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 53
      [], // لِيَجعَلَ
      [], // ما
      [], // يُلقِى
      [], // الشَّيطـٰنُ
      [], // فِتنَةً
      [], // لِلَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // وَالقاسِيَةِ
      [], // قُلوبُهُم
      [], // وَإِنَّ
      [], // الظّـٰلِمينَ
      [], // لَفى
      [], // شِقاقٍ
      [] // بَعيدٍ
    ],
    [ // آية 54
      [], // وَلِيَعلَمَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // أَنَّهُ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكَ
      [], // فَيُؤمِنوا
      [], // بِهِ
      [], // فَتُخبِتَ
      [], // لَهُ
      [], // قُلوبُهُم
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَهادِ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 55
      [], // وَلا
      [], // يَزالُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فى
      ["ِمرية منه : شك وقلق من القرآن"], // مِريَةٍ
      ["ِمرية منه : شك وقلق من القرآن"], // مِنهُ
      [], // حَتّىٰ
      [], // تَأتِيَهُمُ
      [], // السّاعَةُ
      [], // بَغتَةً
      [], // أَو
      [], // يَأتِيَهُم
      [], // عَذابُ
      ["يوم عقيم : لا يوم بعده ( يوم القيامة )"], // يَومٍ
      ["يوم عقيم : لا يوم بعده ( يوم القيامة )"] // عَقيمٍ
    ],
    [ // آية 56
      [], // المُلكُ
      [], // يَومَئِذٍ
      [], // لِلَّهِ
      [], // يَحكُمُ
      [], // بَينَهُم
      [], // فَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فى
      [], // جَنّـٰتِ
      [] // النَّعيمِ
    ],
    [ // آية 57
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // وَكَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // فَأُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 58
      [], // وَالَّذينَ
      [], // هاجَروا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // ثُمَّ
      [], // قُتِلوا
      [], // أَو
      [], // ماتوا
      [], // لَيَرزُقَنَّهُمُ
      [], // اللَّهُ
      [], // رِزقًا
      [], // حَسَنًا
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَهُوَ
      [], // خَيرُ
      [] // الرّٰزِقينَ
    ],
    [ // آية 59
      [], // لَيُدخِلَنَّهُم
      ["مُدخلا : الجنة . أو درجات رفيعة فيها"], // مُدخَلًا
      [], // يَرضَونَهُ
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَعَليمٌ
      [] // حَليمٌ
    ],
    [ // آية 60
      [], // ذٰلِكَ
      [], // وَمَن
      [], // عاقَبَ
      [], // بِمِثلِ
      [], // ما
      [], // عوقِبَ
      [], // بِهِ
      [], // ثُمَّ
      [], // بُغِىَ
      [], // عَلَيهِ
      [], // لَيَنصُرَنَّهُ
      [], // اللَّهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَعَفُوٌّ
      [] // غَفورٌ
    ],
    [ // آية 61
      [], // ذٰلِكَ
      [], // بِأَنَّ
      [], // اللَّهَ
      ["يُولج : يُدخل"], // يولِجُ
      [], // الَّيلَ
      [], // فِى
      [], // النَّهارِ
      [], // وَيولِجُ
      [], // النَّهارَ
      [], // فِى
      [], // الَّيلِ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // بَصيرٌ
    ],
    [ // آية 62
      [], // ذٰلِكَ
      [], // بِأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الحَقُّ
      [], // وَأَنَّ
      [], // ما
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // هُوَ
      [], // البـٰطِلُ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // العَلِىُّ
      [] // الكَبيرُ
    ],
    [ // آية 63
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَتُصبِحُ
      [], // الأَرضُ
      [], // مُخضَرَّةً
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَطيفٌ
      [] // خَبيرٌ
    ],
    [ // آية 64
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَهُوَ
      [], // الغَنِىُّ
      [] // الحَميدُ
    ],
    [ // آية 65
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // سَخَّرَ
      [], // لَكُم
      [], // ما
      [], // فِى
      [], // الأَرضِ
      [], // وَالفُلكَ
      [], // تَجرى
      [], // فِى
      [], // البَحرِ
      [], // بِأَمرِهِ
      [], // وَيُمسِكُ
      [], // السَّماءَ
      [], // أَن
      [], // تَقَعَ
      [], // عَلَى
      [], // الأَرضِ
      [], // إِلّا
      [], // بِإِذنِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِالنّاسِ
      [], // لَرَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 66
      [], // وَهُوَ
      [], // الَّذى
      [], // أَحياكُم
      [], // ثُمَّ
      [], // يُميتُكُم
      [], // ثُمَّ
      [], // يُحييكُم
      [], // إِنَّ
      [], // الإِنسـٰنَ
      [] // لَكَفورٌ
    ],
    [ // آية 67
      [], // لِكُلِّ
      [], // أُمَّةٍ
      [], // جَعَلنا
      ["منسكا : شريعة خاصة . أو نـُسُـكا وعبادة"], // مَنسَكًا
      [], // هُم
      [], // ناسِكوهُ
      [], // فَلا
      [], // يُنـٰزِعُنَّكَ
      [], // فِى
      [], // الأَمرِ
      [], // وَادعُ
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // إِنَّكَ
      [], // لَعَلىٰ
      [], // هُدًى
      [] // مُستَقيمٍ
    ],
    [ // آية 68
      [], // وَإِن
      [], // جـٰدَلوكَ
      [], // فَقُلِ
      [], // اللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 69
      [], // اللَّهُ
      [], // يَحكُمُ
      [], // بَينَكُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // فيما
      [], // كُنتُم
      [], // فيهِ
      [] // تَختَلِفونَ
    ],
    [ // آية 70
      [], // أَلَم
      [], // تَعلَم
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // ما
      [], // فِى
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // فى
      [], // كِتـٰبٍ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرٌ
    ],
    [ // آية 71
      [], // وَيَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لَم
      [], // يُنَزِّل
      [], // بِهِ
      [], // سُلطـٰنًا
      [], // وَما
      [], // لَيسَ
      [], // لَهُم
      [], // بِهِ
      [], // عِلمٌ
      [], // وَما
      [], // لِلظّـٰلِمينَ
      [], // مِن
      [] // نَصيرٍ
    ],
    [ // آية 72
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // بَيِّنـٰتٍ
      [], // تَعرِفُ
      [], // فى
      [], // وُجوهِ
      [], // الَّذينَ
      [], // كَفَرُوا
      ["المنكر : الأمر المستقبح من العبوس والتجهّم"], // المُنكَرَ
      [], // يَكادونَ
      [], // يَسطونَ
      [], // بِالَّذينَ
      [], // يَتلونَ
      [], // عَلَيهِم
      [], // ءايـٰتِنا
      [], // قُل
      [], // أَفَأُنَبِّئُكُم
      [], // بِشَرٍّ
      [], // مِن
      [], // ذٰلِكُمُ
      [], // النّارُ
      [], // وَعَدَهَا
      [], // اللَّهُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 73
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // ضُرِبَ
      [], // مَثَلٌ
      [], // فَاستَمِعوا
      [], // لَهُ
      [], // إِنَّ
      [], // الَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // لَن
      [], // يَخلُقوا
      [], // ذُبابًا
      [], // وَلَوِ
      [], // اجتَمَعوا
      [], // لَهُ
      [], // وَإِن
      [], // يَسلُبهُمُ
      [], // الذُّبابُ
      [], // شَيـًٔا
      [], // لا
      [], // يَستَنقِذوهُ
      [], // مِنهُ
      [], // ضَعُفَ
      [], // الطّالِبُ
      [] // وَالمَطلوبُ
    ],
    [ // آية 74
      ["ما قدروا الله : ما عظّـموه . أو ما عَرَفوه"], // ما
      ["ما قدروا الله : ما عظّـموه . أو ما عَرَفوه"], // قَدَرُوا
      ["ما قدروا الله : ما عظّـموه . أو ما عَرَفوه"], // اللَّهَ
      [], // حَقَّ
      [], // قَدرِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَقَوِىٌّ
      [] // عَزيزٌ
    ],
    [ // آية 75
      [], // اللَّهُ
      [], // يَصطَفى
      [], // مِنَ
      [], // المَلـٰئِكَةِ
      [], // رُسُلًا
      [], // وَمِنَ
      [], // النّاسِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // بَصيرٌ
    ],
    [ // آية 76
      [], // يَعلَمُ
      [], // ما
      [], // بَينَ
      [], // أَيديهِم
      [], // وَما
      [], // خَلفَهُم
      [], // وَإِلَى
      [], // اللَّهِ
      [], // تُرجَعُ
      [] // الأُمورُ
    ],
    [ // آية 77
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اركَعوا
      [], // وَاسجُدوا
      [], // وَاعبُدوا
      [], // رَبَّكُم
      [], // وَافعَلُوا
      [], // الخَيرَ
      [], // لَعَلَّكُم
      [] // تُفلِحونَ
    ],
    [ // آية 78
      [], // وَجـٰهِدوا
      [], // فِى
      [], // اللَّهِ
      [], // حَقَّ
      [], // جِهادِهِ
      [], // هُوَ
      [], // اجتَبىٰكُم
      [], // وَما
      [], // جَعَلَ
      [], // عَلَيكُم
      [], // فِى
      [], // الدّينِ
      [], // مِن
      ["حرج : ضيق بتكليف يشقّ ويعسُرُ"], // حَرَجٍ
      [], // مِلَّةَ
      [], // أَبيكُم
      [], // إِبرٰهيمَ
      [], // هُوَ
      [], // سَمّىٰكُمُ
      [], // المُسلِمينَ
      [], // مِن
      [], // قَبلُ
      [], // وَفى
      [], // هـٰذا
      [], // لِيَكونَ
      [], // الرَّسولُ
      [], // شَهيدًا
      [], // عَلَيكُم
      [], // وَتَكونوا
      [], // شُهَداءَ
      [], // عَلَى
      [], // النّاسِ
      [], // فَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَءاتُوا
      [], // الزَّكوٰةَ
      [], // وَاعتَصِموا
      [], // بِاللَّهِ
      [], // هُوَ
      [], // مَولىٰكُم
      [], // فَنِعمَ
      [], // المَولىٰ
      [], // وَنِعمَ
      [] // النَّصيرُ
    ]
  ]
];

export default meanings;