const meanings = [
[ // آية 1
      [], // قَد
      ["أفلح المؤمنون : فازوا وسعِدوا ونجَوْا"], // أَفلَحَ
      ["أفلح المؤمنون : فازوا وسعِدوا ونجَوْا"] // المُؤمِنونَ
    ],
    [ // آية 2
      [], // الَّذينَ
      [], // هُم
      [], // فى
      [], // صَلاتِهِم
      [] // خـٰشِعونَ
    ],
    [ // آية 3
      [], // وَالَّذينَ
      [], // هُم
      [], // عَنِ
      ["اللغو : مالا يَجْمُـلُ من القول والفعل"], // اللَّغوِ
      [] // مُعرِضونَ
    ],
    [ // آية 4
      [], // وَالَّذينَ
      [], // هُم
      [], // لِلزَّكوٰةِ
      [] // فـٰعِلونَ
    ],
    [ // آية 5
      [], // وَالَّذينَ
      [], // هُم
      [], // لِفُروجِهِم
      [] // حـٰفِظونَ
    ],
    [ // آية 6
      [], // إِلّا
      [], // عَلىٰ
      [], // أَزوٰجِهِم
      [], // أَو
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُهُم
      [], // فَإِنَّهُم
      [], // غَيرُ
      [] // مَلومينَ
    ],
    [ // آية 7
      [], // فَمَنِ
      [], // ابتَغىٰ
      [], // وَراءَ
      [], // ذٰلِكَ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      ["العادُون : المُجاوزون الحلال إلى الحرام"] // العادونَ
    ],
    [ // آية 8
      [], // وَالَّذينَ
      [], // هُم
      [], // لِأَمـٰنـٰتِهِم
      [], // وَعَهدِهِم
      [] // رٰعونَ
    ],
    [ // آية 9
      [], // وَالَّذينَ
      [], // هُم
      [], // عَلىٰ
      [], // صَلَوٰتِهِم
      [] // يُحافِظونَ
    ],
    [ // آية 10
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الوٰرِثونَ
    ],
    [ // آية 11
      [], // الَّذينَ
      [], // يَرِثونَ
      ["الفردوس : أعلى الجنان و أوسطها و أفضلها"], // الفِردَوسَ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 12
      [], // وَلَقَد
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // مِن
      [], // سُلـٰلَةٍ
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 13
      [], // ثُمَّ
      [], // جَعَلنـٰهُ
      [], // نُطفَةً
      [], // فى
      ["قرار مكين : مستقر مُـتمكن وهو الرحم"], // قَرارٍ
      ["قرار مكين : مستقر مُـتمكن وهو الرحم"] // مَكينٍ
    ],
    [ // آية 14
      [], // ثُمَّ
      [], // خَلَقنَا
      [], // النُّطفَةَ
      ["علقة : دما متجمدا"], // عَلَقَةً
      [], // فَخَلَقنَا
      [], // العَلَقَةَ
      ["مُضغة : قطعة لحم قـَـدْر ما يُمضغ"], // مُضغَةً
      [], // فَخَلَقنَا
      [], // المُضغَةَ
      [], // عِظـٰمًا
      [], // فَكَسَونَا
      [], // العِظـٰمَ
      [], // لَحمًا
      [], // ثُمَّ
      [], // أَنشَأنـٰهُ
      [], // خَلقًا
      [], // ءاخَرَ
      [], // فَتَبارَكَ
      [], // اللَّهُ
      [], // أَحسَنُ
      [] // الخـٰلِقينَ
    ],
    [ // آية 15
      [], // ثُمَّ
      [], // إِنَّكُم
      [], // بَعدَ
      [], // ذٰلِكَ
      [] // لَمَيِّتونَ
    ],
    [ // آية 16
      [], // ثُمَّ
      [], // إِنَّكُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [] // تُبعَثونَ
    ],
    [ // آية 17
      [], // وَلَقَد
      [], // خَلَقنا
      [], // فَوقَكُم
      ["سبع طرائق : سبع سموات طباقا أو طُرُقا للملائكة أو للكواكب في مسيرها"], // سَبعَ
      ["سبع طرائق : سبع سموات طباقا أو طُرُقا للملائكة أو للكواكب في مسيرها"], // طَرائِقَ
      [], // وَما
      [], // كُنّا
      [], // عَنِ
      [], // الخَلقِ
      [] // غـٰفِلينَ
    ],
    [ // آية 18
      [], // وَأَنزَلنا
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      ["بقدَر : بمقدار الحاجة والمصلحة"], // بِقَدَرٍ
      [], // فَأَسكَنّـٰهُ
      [], // فِى
      [], // الأَرضِ
      [], // وَإِنّا
      [], // عَلىٰ
      [], // ذَهابٍ
      [], // بِهِ
      [] // لَقـٰدِرونَ
    ],
    [ // آية 19
      [], // فَأَنشَأنا
      [], // لَكُم
      [], // بِهِ
      [], // جَنّـٰتٍ
      [], // مِن
      [], // نَخيلٍ
      [], // وَأَعنـٰبٍ
      [], // لَكُم
      [], // فيها
      [], // فَوٰكِهُ
      [], // كَثيرَةٌ
      [], // وَمِنها
      [] // تَأكُلونَ
    ],
    [ // آية 20
      [], // وَشَجَرَةً
      [], // تَخرُجُ
      [], // مِن
      [], // طورِ
      [], // سَيناءَ
      [], // تَنبُتُ
      ["بالدهن : مُـلتبسًا ثمرها بالزيت"], // بِالدُّهنِ
      [], // وَصِبغٍ
      [] // لِلـٔاكِلينَ
    ],
    [ // آية 21
      [], // وَإِنَّ
      [], // لَكُم
      [], // فِى
      [], // الأَنعـٰمِ
      ["لعبرة : لعظة وآية على القدْرَة والرّحمة"], // لَعِبرَةً
      [], // نُسقيكُم
      [], // مِمّا
      [], // فى
      [], // بُطونِها
      [], // وَلَكُم
      [], // فيها
      [], // مَنـٰفِعُ
      [], // كَثيرَةٌ
      [], // وَمِنها
      [] // تَأكُلونَ
    ],
    [ // آية 22
      ["وعليها : وعلى الإبل منها"], // وَعَلَيها
      [], // وَعَلَى
      [], // الفُلكِ
      [] // تُحمَلونَ
    ],
    [ // آية 23
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // نوحًا
      [], // إِلىٰ
      [], // قَومِهِ
      [], // فَقالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // أَفَلا
      [] // تَتَّقونَ
    ],
    [ // آية 24
      [], // فَقالَ
      [], // المَلَؤُا۟
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَومِهِ
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // يُريدُ
      [], // أَن
      ["يتفضل عليكم : يترأس ويَشْرُف عليكم"], // يَتَفَضَّلَ
      ["يتفضل عليكم : يترأس ويَشْرُف عليكم"], // عَلَيكُم
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // لَأَنزَلَ
      [], // مَلـٰئِكَةً
      [], // ما
      [], // سَمِعنا
      [], // بِهـٰذا
      [], // فى
      [], // ءابائِنَا
      [] // الأَوَّلينَ
    ],
    [ // آية 25
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // رَجُلٌ
      [], // بِهِ
      [], // جِنَّةٌ
      ["فتربصوا به : انتظروا و اصبروا عليه"], // فَتَرَبَّصوا
      ["فتربصوا به : انتظروا و اصبروا عليه"], // بِهِ
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 26
      [], // قالَ
      [], // رَبِّ
      [], // انصُرنى
      [], // بِما
      [] // كَذَّبونِ
    ],
    [ // آية 27
      [], // فَأَوحَينا
      [], // إِلَيهِ
      [], // أَنِ
      [], // اصنَعِ
      [], // الفُلكَ
      [], // بِأَعيُنِنا
      [], // وَوَحيِنا
      [], // فَإِذا
      [], // جاءَ
      [], // أَمرُنا
      [], // وَفارَ
      [], // التَّنّورُ
      [], // فَاسلُك
      [], // فيها
      [], // مِن
      [], // كُلٍّ
      [], // زَوجَينِ
      [], // اثنَينِ
      [], // وَأَهلَكَ
      [], // إِلّا
      [], // مَن
      [], // سَبَقَ
      [], // عَلَيهِ
      [], // القَولُ
      [], // مِنهُم
      [], // وَلا
      [], // تُخـٰطِبنى
      [], // فِى
      [], // الَّذينَ
      [], // ظَلَموا
      [], // إِنَّهُم
      [] // مُغرَقونَ
    ],
    [ // آية 28
      [], // فَإِذَا
      [], // استَوَيتَ
      [], // أَنتَ
      [], // وَمَن
      [], // مَعَكَ
      [], // عَلَى
      [], // الفُلكِ
      [], // فَقُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // نَجّىٰنا
      [], // مِنَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 29
      [], // وَقُل
      [], // رَبِّ
      [], // أَنزِلنى
      ["مُنزلا : إنزالا . أو مكان إنزال"], // مُنزَلًا
      [], // مُبارَكًا
      [], // وَأَنتَ
      [], // خَيرُ
      [] // المُنزِلينَ
    ],
    [ // آية 30
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // وَإِن
      [], // كُنّا
      ["لمُبتلين : لمُختبرين عبادنا بهذه الآيات"] // لَمُبتَلينَ
    ],
    [ // آية 31
      [], // ثُمَّ
      [], // أَنشَأنا
      [], // مِن
      [], // بَعدِهِم
      [], // قَرنًا
      [] // ءاخَرينَ
    ],
    [ // آية 32
      [], // فَأَرسَلنا
      [], // فيهِم
      [], // رَسولًا
      [], // مِنهُم
      [], // أَنِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // أَفَلا
      [] // تَتَّقونَ
    ],
    [ // آية 33
      [], // وَقالَ
      [], // المَلَأُ
      [], // مِن
      [], // قَومِهِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَكَذَّبوا
      [], // بِلِقاءِ
      [], // الـٔاخِرَةِ
      [], // وَأَترَفنـٰهُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // يَأكُلُ
      [], // مِمّا
      [], // تَأكُلونَ
      [], // مِنهُ
      [], // وَيَشرَبُ
      [], // مِمّا
      [] // تَشرَبونَ
    ],
    [ // آية 34
      [], // وَلَئِن
      [], // أَطَعتُم
      [], // بَشَرًا
      [], // مِثلَكُم
      [], // إِنَّكُم
      [], // إِذًا
      [] // لَخـٰسِرونَ
    ],
    [ // آية 35
      [], // أَيَعِدُكُم
      [], // أَنَّكُم
      [], // إِذا
      [], // مِتُّم
      [], // وَكُنتُم
      [], // تُرابًا
      [], // وَعِظـٰمًا
      [], // أَنَّكُم
      [] // مُخرَجونَ
    ],
    [ // آية 36
      [], // هَيهاتَ
      [], // هَيهاتَ
      [], // لِما
      [] // توعَدونَ
    ],
    [ // آية 37
      [], // إِن
      [], // هِىَ
      [], // إِلّا
      [], // حَياتُنَا
      [], // الدُّنيا
      [], // نَموتُ
      [], // وَنَحيا
      [], // وَما
      [], // نَحنُ
      [] // بِمَبعوثينَ
    ],
    [ // آية 38
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // رَجُلٌ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // وَما
      [], // نَحنُ
      [], // لَهُ
      [] // بِمُؤمِنينَ
    ],
    [ // آية 39
      [], // قالَ
      [], // رَبِّ
      [], // انصُرنى
      [], // بِما
      [] // كَذَّبونِ
    ],
    [ // آية 40
      [], // قالَ
      [], // عَمّا
      [], // قَليلٍ
      [], // لَيُصبِحُنَّ
      [] // نـٰدِمينَ
    ],
    [ // آية 41
      ["فأخذتهم الصيحة : صيحة جبريل أو العذاب المُصْــــَطـلِـم"], // فَأَخَذَتهُمُ
      ["فأخذتهم الصيحة : صيحة جبريل أو العذاب المُصْــــَطـلِـم"], // الصَّيحَةُ
      [], // بِالحَقِّ
      [], // فَجَعَلنـٰهُم
      [], // غُثاءً
      [], // فَبُعدًا
      [], // لِلقَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 42
      [], // ثُمَّ
      [], // أَنشَأنا
      [], // مِن
      [], // بَعدِهِم
      [], // قُرونًا
      [] // ءاخَرينَ
    ],
    [ // آية 43
      [], // ما
      [], // تَسبِقُ
      [], // مِن
      [], // أُمَّةٍ
      [], // أَجَلَها
      [], // وَما
      [] // يَستَـٔخِرونَ
    ],
    [ // آية 44
      [], // ثُمَّ
      [], // أَرسَلنا
      [], // رُسُلَنا
      [], // تَترا
      [], // كُلَّ
      [], // ما
      [], // جاءَ
      [], // أُمَّةً
      [], // رَسولُها
      [], // كَذَّبوهُ
      [], // فَأَتبَعنا
      [], // بَعضَهُم
      [], // بَعضًا
      [], // وَجَعَلنـٰهُم
      [], // أَحاديثَ
      [], // فَبُعدًا
      [], // لِقَومٍ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 45
      [], // ثُمَّ
      [], // أَرسَلنا
      [], // موسىٰ
      [], // وَأَخاهُ
      [], // هـٰرونَ
      [], // بِـٔايـٰتِنا
      [], // وَسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 46
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      [], // فَاستَكبَروا
      [], // وَكانوا
      ["قوْما عالين : متكبرين أو متطاولين بالظلم"], // قَومًا
      ["قوْما عالين : متكبرين أو متطاولين بالظلم"] // عالينَ
    ],
    [ // آية 47
      [], // فَقالوا
      [], // أَنُؤمِنُ
      [], // لِبَشَرَينِ
      [], // مِثلِنا
      [], // وَقَومُهُما
      [], // لَنا
      [] // عـٰبِدونَ
    ],
    [ // آية 48
      [], // فَكَذَّبوهُما
      [], // فَكانوا
      [], // مِنَ
      [] // المُهلَكينَ
    ],
    [ // آية 49
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // لَعَلَّهُم
      [] // يَهتَدونَ
    ],
    [ // آية 50
      [], // وَجَعَلنَا
      [], // ابنَ
      [], // مَريَمَ
      [], // وَأُمَّهُ
      [], // ءايَةً
      [], // وَءاوَينـٰهُما
      ["إلى رَبوة : إلى مكان مرتفع من البلاد"], // إِلىٰ
      ["إلى رَبوة : إلى مكان مرتفع من البلاد"], // رَبوَةٍ
      [], // ذاتِ
      [], // قَرارٍ
      [] // وَمَعينٍ
    ],
    [ // آية 51
      [], // يـٰأَيُّهَا
      [], // الرُّسُلُ
      [], // كُلوا
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // وَاعمَلوا
      [], // صـٰلِحًا
      [], // إِنّى
      [], // بِما
      [], // تَعمَلونَ
      [] // عَليمٌ
    ],
    [ // آية 52
      [], // وَإِنَّ
      [], // هـٰذِهِ
      ["أمتكم : مِلـّـتكم وشريعتكم"], // أُمَّتُكُم
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // وَأَنا۠
      [], // رَبُّكُم
      [] // فَاتَّقونِ
    ],
    [ // آية 53
      ["فتقطعوا أمرهم : تفرقوا في أمْر دينهم"], // فَتَقَطَّعوا
      ["فتقطعوا أمرهم : تفرقوا في أمْر دينهم"], // أَمرَهُم
      [], // بَينَهُم
      ["زبُرا : قطعا وفرقا وأحزابا مختلفة"], // زُبُرًا
      [], // كُلُّ
      [], // حِزبٍ
      [], // بِما
      [], // لَدَيهِم
      [] // فَرِحونَ
    ],
    [ // آية 54
      [], // فَذَرهُم
      [], // فى
      ["غَمْرَتِهم : جَهالتهم وضلالتهم"], // غَمرَتِهِم
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 55
      [], // أَيَحسَبونَ
      [], // أَنَّما
      [], // نُمِدُّهُم
      [], // بِهِ
      [], // مِن
      [], // مالٍ
      [] // وَبَنينَ
    ],
    [ // آية 56
      [], // نُسارِعُ
      [], // لَهُم
      [], // فِى
      [], // الخَيرٰتِ
      [], // بَل
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 57
      [], // إِنَّ
      [], // الَّذينَ
      [], // هُم
      [], // مِن
      [], // خَشيَةِ
      [], // رَبِّهِم
      ["مُشفقون : خائفون حَذِرون"] // مُشفِقونَ
    ],
    [ // آية 58
      [], // وَالَّذينَ
      [], // هُم
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      [] // يُؤمِنونَ
    ],
    [ // آية 59
      [], // وَالَّذينَ
      [], // هُم
      [], // بِرَبِّهِم
      [], // لا
      [] // يُشرِكونَ
    ],
    [ // آية 60
      [], // وَالَّذينَ
      [], // يُؤتونَ
      [], // ما
      [], // ءاتَوا
      [], // وَقُلوبُهُم
      [], // وَجِلَةٌ
      [], // أَنَّهُم
      [], // إِلىٰ
      [], // رَبِّهِم
      [] // رٰجِعونَ
    ],
    [ // آية 61
      [], // أُولـٰئِكَ
      [], // يُسـٰرِعونَ
      [], // فِى
      [], // الخَيرٰتِ
      [], // وَهُم
      [], // لَها
      [] // سـٰبِقونَ
    ],
    [ // آية 62
      [], // وَلا
      [], // نُكَلِّفُ
      [], // نَفسًا
      [], // إِلّا
      ["وسعها : قدر طاقتها من الأعمال"], // وُسعَها
      [], // وَلَدَينا
      [], // كِتـٰبٌ
      [], // يَنطِقُ
      [], // بِالحَقِّ
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 63
      [], // بَل
      [], // قُلوبُهُم
      [], // فى
      ["غمرة : جهالة وغفلة وغطاء"], // غَمرَةٍ
      [], // مِن
      [], // هـٰذا
      [], // وَلَهُم
      [], // أَعمـٰلٌ
      [], // مِن
      [], // دونِ
      [], // ذٰلِكَ
      [], // هُم
      [], // لَها
      [] // عـٰمِلونَ
    ],
    [ // آية 64
      [], // حَتّىٰ
      [], // إِذا
      [], // أَخَذنا
      ["مترفيهم : مُنعّميهم  الذين أبْطرَتـْـهم النِّعَم"], // مُترَفيهِم
      [], // بِالعَذابِ
      [], // إِذا
      [], // هُم
      [] // يَجـَٔرونَ
    ],
    [ // آية 65
      [], // لا
      [], // تَجـَٔرُوا
      [], // اليَومَ
      [], // إِنَّكُم
      [], // مِنّا
      [], // لا
      [] // تُنصَرونَ
    ],
    [ // آية 66
      [], // قَد
      [], // كانَت
      [], // ءايـٰتى
      [], // تُتلىٰ
      [], // عَلَيكُم
      [], // فَكُنتُم
      [], // عَلىٰ
      [], // أَعقـٰبِكُم
      ["تنكِصون : ترجعون معرضين عن سماعها"] // تَنكِصونَ
    ],
    [ // آية 67
      ["مستكبرين به : مستعظمين بالبيت الحرام"], // مُستَكبِرينَ
      ["مستكبرين به : مستعظمين بالبيت الحرام"], // بِهِ
      [], // سـٰمِرًا
      ["تهجرون : تهْذون بالطعن في القرآن"] // تَهجُرونَ
    ],
    [ // آية 68
      [], // أَفَلَم
      [], // يَدَّبَّرُوا
      [], // القَولَ
      [], // أَم
      [], // جاءَهُم
      [], // ما
      [], // لَم
      [], // يَأتِ
      [], // ءاباءَهُمُ
      [] // الأَوَّلينَ
    ],
    [ // آية 69
      [], // أَم
      [], // لَم
      [], // يَعرِفوا
      [], // رَسولَهُم
      [], // فَهُم
      [], // لَهُ
      [] // مُنكِرونَ
    ],
    [ // آية 70
      [], // أَم
      [], // يَقولونَ
      [], // بِهِ
      [], // جِنَّةٌ
      [], // بَل
      [], // جاءَهُم
      [], // بِالحَقِّ
      [], // وَأَكثَرُهُم
      [], // لِلحَقِّ
      [] // كـٰرِهونَ
    ],
    [ // آية 71
      [], // وَلَوِ
      [], // اتَّبَعَ
      [], // الحَقُّ
      [], // أَهواءَهُم
      [], // لَفَسَدَتِ
      [], // السَّمـٰوٰتُ
      [], // وَالأَرضُ
      [], // وَمَن
      [], // فيهِنَّ
      [], // بَل
      [], // أَتَينـٰهُم
      [], // بِذِكرِهِم
      [], // فَهُم
      [], // عَن
      [], // ذِكرِهِم
      [] // مُعرِضونَ
    ],
    [ // آية 72
      [], // أَم
      [], // تَسـَٔلُهُم
      ["خَرْجا : جُعلا و أجْرًا من المال"], // خَرجًا
      [], // فَخَراجُ
      [], // رَبِّكَ
      [], // خَيرٌ
      [], // وَهُوَ
      [], // خَيرُ
      [] // الرّٰزِقينَ
    ],
    [ // آية 73
      [], // وَإِنَّكَ
      [], // لَتَدعوهُم
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 74
      [], // وَإِنَّ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // عَنِ
      [], // الصِّرٰطِ
      [] // لَنـٰكِبونَ
    ],
    [ // آية 75
      [], // وَلَو
      [], // رَحِمنـٰهُم
      [], // وَكَشَفنا
      [], // ما
      [], // بِهِم
      [], // مِن
      [], // ضُرٍّ
      [], // لَلَجّوا
      [], // فى
      [], // طُغيـٰنِهِم
      ["يعمهون : يعمون عن الرشد أو يتحيرون"] // يَعمَهونَ
    ],
    [ // آية 76
      [], // وَلَقَد
      [], // أَخَذنـٰهُم
      [], // بِالعَذابِ
      ["فما استكانوا : فما خضعوا وأظهروا المسكنة"], // فَمَا
      ["فما استكانوا : فما خضعوا وأظهروا المسكنة"], // استَكانوا
      [], // لِرَبِّهِم
      [], // وَما
      [] // يَتَضَرَّعونَ
    ],
    [ // آية 77
      [], // حَتّىٰ
      [], // إِذا
      [], // فَتَحنا
      [], // عَلَيهِم
      [], // بابًا
      [], // ذا
      [], // عَذابٍ
      [], // شَديدٍ
      [], // إِذا
      [], // هُم
      [], // فيهِ
      ["مُبلسون : مُتحيرون آيسون من كل خير"] // مُبلِسونَ
    ],
    [ // آية 78
      [], // وَهُوَ
      [], // الَّذى
      [], // أَنشَأَ
      [], // لَكُمُ
      [], // السَّمعَ
      [], // وَالأَبصـٰرَ
      [], // وَالأَفـِٔدَةَ
      [], // قَليلًا
      [], // ما
      [] // تَشكُرونَ
    ],
    [ // آية 79
      [], // وَهُوَ
      [], // الَّذى
      ["ذرأكم : خلقكم وبثكم بالتناسل"], // ذَرَأَكُم
      [], // فِى
      [], // الأَرضِ
      [], // وَإِلَيهِ
      [] // تُحشَرونَ
    ],
    [ // آية 80
      [], // وَهُوَ
      [], // الَّذى
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // وَلَهُ
      [], // اختِلـٰفُ
      [], // الَّيلِ
      [], // وَالنَّهارِ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 81
      [], // بَل
      [], // قالوا
      [], // مِثلَ
      [], // ما
      [], // قالَ
      [] // الأَوَّلونَ
    ],
    [ // آية 82
      [], // قالوا
      [], // أَءِذا
      [], // مِتنا
      [], // وَكُنّا
      [], // تُرابًا
      [], // وَعِظـٰمًا
      [], // أَءِنّا
      [] // لَمَبعوثونَ
    ],
    [ // آية 83
      [], // لَقَد
      [], // وُعِدنا
      [], // نَحنُ
      [], // وَءاباؤُنا
      [], // هـٰذا
      [], // مِن
      [], // قَبلُ
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 84
      [], // قُل
      [], // لِمَنِ
      [], // الأَرضُ
      [], // وَمَن
      [], // فيها
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 85
      [], // سَيَقولونَ
      [], // لِلَّهِ
      [], // قُل
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 86
      [], // قُل
      [], // مَن
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // السَّبعِ
      [], // وَرَبُّ
      [], // العَرشِ
      [] // العَظيمِ
    ],
    [ // آية 87
      [], // سَيَقولونَ
      [], // لِلَّهِ
      [], // قُل
      [], // أَفَلا
      [] // تَتَّقونَ
    ],
    [ // آية 88
      [], // قُل
      [], // مَن
      [], // بِيَدِهِ
      ["ملكوت : هو الملك الواسع العظيم"], // مَلَكوتُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَهُوَ
      [], // يُجيرُ
      [], // وَلا
      [], // يُجارُ
      [], // عَلَيهِ
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 89
      [], // سَيَقولونَ
      [], // لِلَّهِ
      [], // قُل
      [], // فَأَنّىٰ
      [] // تُسحَرونَ
    ],
    [ // آية 90
      [], // بَل
      [], // أَتَينـٰهُم
      [], // بِالحَقِّ
      [], // وَإِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 91
      [], // مَا
      [], // اتَّخَذَ
      [], // اللَّهُ
      [], // مِن
      [], // وَلَدٍ
      [], // وَما
      [], // كانَ
      [], // مَعَهُ
      [], // مِن
      [], // إِلـٰهٍ
      [], // إِذًا
      [], // لَذَهَبَ
      [], // كُلُّ
      [], // إِلـٰهٍ
      [], // بِما
      [], // خَلَقَ
      [], // وَلَعَلا
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // سُبحـٰنَ
      [], // اللَّهِ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 92
      [], // عـٰلِمِ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // فَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 93
      [], // قُل
      [], // رَبِّ
      [], // إِمّا
      [], // تُرِيَنّى
      [], // ما
      [] // يوعَدونَ
    ],
    [ // آية 94
      [], // رَبِّ
      [], // فَلا
      [], // تَجعَلنى
      [], // فِى
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 95
      [], // وَإِنّا
      [], // عَلىٰ
      [], // أَن
      [], // نُرِيَكَ
      [], // ما
      [], // نَعِدُهُم
      [] // لَقـٰدِرونَ
    ],
    [ // آية 96
      [], // ادفَع
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // السَّيِّئَةَ
      [], // نَحنُ
      [], // أَعلَمُ
      [], // بِما
      [] // يَصِفونَ
    ],
    [ // آية 97
      [], // وَقُل
      [], // رَبِّ
      ["أعوذ بك : أعتصم وأمتنع بك"], // أَعوذُ
      ["أعوذ بك : أعتصم وأمتنع بك"], // بِكَ
      [], // مِن
      [], // هَمَزٰتِ
      [] // الشَّيـٰطينِ
    ],
    [ // آية 98
      [], // وَأَعوذُ
      [], // بِكَ
      [], // رَبِّ
      [], // أَن
      [] // يَحضُرونِ
    ],
    [ // آية 99
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَ
      [], // أَحَدَهُمُ
      [], // المَوتُ
      [], // قالَ
      [], // رَبِّ
      [] // ارجِعونِ
    ],
    [ // آية 100
      [], // لَعَلّى
      [], // أَعمَلُ
      [], // صـٰلِحًا
      [], // فيما
      [], // تَرَكتُ
      [], // كَلّا
      [], // إِنَّها
      [], // كَلِمَةٌ
      [], // هُوَ
      [], // قائِلُها
      [], // وَمِن
      [], // وَرائِهِم
      [], // بَرزَخٌ
      [], // إِلىٰ
      [], // يَومِ
      [] // يُبعَثونَ
    ],
    [ // آية 101
      [], // فَإِذا
      [], // نُفِخَ
      [], // فِى
      [], // الصّورِ
      [], // فَلا
      [], // أَنسابَ
      [], // بَينَهُم
      [], // يَومَئِذٍ
      [], // وَلا
      [] // يَتَساءَلونَ
    ],
    [ // آية 102
      [], // فَمَن
      [], // ثَقُلَت
      [], // مَوٰزينُهُ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 103
      [], // وَمَن
      [], // خَفَّت
      [], // مَوٰزينُهُ
      [], // فَأُولـٰئِكَ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // فى
      [], // جَهَنَّمَ
      [] // خـٰلِدونَ
    ],
    [ // آية 104
      ["تلفح : تحرق"], // تَلفَحُ
      [], // وُجوهَهُمُ
      [], // النّارُ
      [], // وَهُم
      [], // فيها
      [] // كـٰلِحونَ
    ],
    [ // آية 105
      [], // أَلَم
      [], // تَكُن
      [], // ءايـٰتى
      [], // تُتلىٰ
      [], // عَلَيكُم
      [], // فَكُنتُم
      [], // بِها
      [] // تُكَذِّبونَ
    ],
    [ // آية 106
      [], // قالوا
      [], // رَبَّنا
      ["غلبت علينا : استولت علينا وملكتنا"], // غَلَبَت
      ["غلبت علينا : استولت علينا وملكتنا"], // عَلَينا
      [], // شِقوَتُنا
      [], // وَكُنّا
      [], // قَومًا
      [] // ضالّينَ
    ],
    [ // آية 107
      [], // رَبَّنا
      [], // أَخرِجنا
      [], // مِنها
      [], // فَإِن
      [], // عُدنا
      [], // فَإِنّا
      [] // ظـٰلِمونَ
    ],
    [ // آية 108
      [], // قالَ
      [], // اخسَـٔوا
      [], // فيها
      [], // وَلا
      [] // تُكَلِّمونِ
    ],
    [ // آية 109
      [], // إِنَّهُ
      [], // كانَ
      [], // فَريقٌ
      [], // مِن
      [], // عِبادى
      [], // يَقولونَ
      [], // رَبَّنا
      [], // ءامَنّا
      [], // فَاغفِر
      [], // لَنا
      [], // وَارحَمنا
      [], // وَأَنتَ
      [], // خَيرُ
      [] // الرّٰحِمينَ
    ],
    [ // آية 110
      [], // فَاتَّخَذتُموهُم
      [], // سِخرِيًّا
      [], // حَتّىٰ
      [], // أَنسَوكُم
      [], // ذِكرى
      [], // وَكُنتُم
      [], // مِنهُم
      [] // تَضحَكونَ
    ],
    [ // آية 111
      [], // إِنّى
      [], // جَزَيتُهُمُ
      [], // اليَومَ
      [], // بِما
      [], // صَبَروا
      [], // أَنَّهُم
      [], // هُمُ
      [] // الفائِزونَ
    ],
    [ // آية 112
      [], // قـٰلَ
      [], // كَم
      [], // لَبِثتُم
      [], // فِى
      [], // الأَرضِ
      [], // عَدَدَ
      [] // سِنينَ
    ],
    [ // آية 113
      [], // قالوا
      [], // لَبِثنا
      [], // يَومًا
      [], // أَو
      [], // بَعضَ
      [], // يَومٍ
      [], // فَسـَٔلِ
      [] // العادّينَ
    ],
    [ // آية 114
      [], // قـٰلَ
      [], // إِن
      [], // لَبِثتُم
      [], // إِلّا
      [], // قَليلًا
      [], // لَو
      [], // أَنَّكُم
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 115
      [], // أَفَحَسِبتُم
      [], // أَنَّما
      [], // خَلَقنـٰكُم
      [], // عَبَثًا
      [], // وَأَنَّكُم
      [], // إِلَينا
      [], // لا
      [] // تُرجَعونَ
    ],
    [ // آية 116
      [], // فَتَعـٰلَى
      [], // اللَّهُ
      [], // المَلِكُ
      [], // الحَقُّ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // رَبُّ
      [], // العَرشِ
      [] // الكَريمِ
    ],
    [ // آية 117
      [], // وَمَن
      [], // يَدعُ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // لا
      [], // بُرهـٰنَ
      [], // لَهُ
      [], // بِهِ
      [], // فَإِنَّما
      [], // حِسابُهُ
      [], // عِندَ
      [], // رَبِّهِ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // الكـٰفِرونَ
    ],
    [ // آية 118
      [], // وَقُل
      [], // رَبِّ
      [], // اغفِر
      [], // وَارحَم
      [], // وَأَنتَ
      [], // خَيرُ
      [] // الرّٰحِمينَ
    ]
];

export default meanings;