const meanings = [
[ // آية 1
      [], // سورَةٌ
      [], // أَنزَلنـٰها
      [], // وَفَرَضنـٰها
      [], // وَأَنزَلنا
      [], // فيها
      [], // ءايـٰتٍ
      [], // بَيِّنـٰتٍ
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 2
      [], // الزّانِيَةُ
      [], // وَالزّانى
      [], // فَاجلِدوا
      [], // كُلَّ
      [], // وٰحِدٍ
      [], // مِنهُما
      [], // مِا۟ئَةَ
      [], // جَلدَةٍ
      [], // وَلا
      [], // تَأخُذكُم
      [], // بِهِما
      [], // رَأفَةٌ
      [], // فى
      [], // دينِ
      [], // اللَّهِ
      [], // إِن
      [], // كُنتُم
      [], // تُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَليَشهَد
      [], // عَذابَهُما
      [], // طائِفَةٌ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 3
      [], // الزّانى
      [], // لا
      [], // يَنكِحُ
      [], // إِلّا
      [], // زانِيَةً
      [], // أَو
      [], // مُشرِكَةً
      [], // وَالزّانِيَةُ
      [], // لا
      [], // يَنكِحُها
      [], // إِلّا
      [], // زانٍ
      [], // أَو
      [], // مُشرِكٌ
      [], // وَحُرِّمَ
      [], // ذٰلِكَ
      [], // عَلَى
      [] // المُؤمِنينَ
    ],
    [ // آية 4
      [], // وَالَّذينَ
      [], // يَرمونَ
      [], // المُحصَنـٰتِ
      [], // ثُمَّ
      [], // لَم
      [], // يَأتوا
      [], // بِأَربَعَةِ
      [], // شُهَداءَ
      [], // فَاجلِدوهُم
      [], // ثَمـٰنينَ
      [], // جَلدَةً
      [], // وَلا
      [], // تَقبَلوا
      [], // لَهُم
      [], // شَهـٰدَةً
      [], // أَبَدًا
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // الفـٰسِقونَ
    ],
    [ // آية 5
      [], // إِلَّا
      [], // الَّذينَ
      [], // تابوا
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // وَأَصلَحوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 6
      [], // وَالَّذينَ
      [], // يَرمونَ
      [], // أَزوٰجَهُم
      [], // وَلَم
      [], // يَكُن
      [], // لَهُم
      [], // شُهَداءُ
      [], // إِلّا
      [], // أَنفُسُهُم
      [], // فَشَهـٰدَةُ
      [], // أَحَدِهِم
      [], // أَربَعُ
      [], // شَهـٰدٰتٍ
      [], // بِاللَّهِ
      [], // إِنَّهُ
      [], // لَمِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 7
      [], // وَالخـٰمِسَةُ
      [], // أَنَّ
      [], // لَعنَتَ
      [], // اللَّهِ
      [], // عَلَيهِ
      [], // إِن
      [], // كانَ
      [], // مِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 8
      [], // وَيَدرَؤُا۟
      [], // عَنهَا
      [], // العَذابَ
      [], // أَن
      [], // تَشهَدَ
      [], // أَربَعَ
      [], // شَهـٰدٰتٍ
      [], // بِاللَّهِ
      [], // إِنَّهُ
      [], // لَمِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 9
      [], // وَالخـٰمِسَةَ
      [], // أَنَّ
      [], // غَضَبَ
      [], // اللَّهِ
      [], // عَلَيها
      [], // إِن
      [], // كانَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 10
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَرَحمَتُهُ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // تَوّابٌ
      [] // حَكيمٌ
    ],
    [ // آية 11
      [], // إِنَّ
      [], // الَّذينَ
      [], // جاءو
      ["بالإفك : أقبح الكذب و أفحشه"], // بِالإِفكِ
      ["عصبة منكم : جماعة منكم"], // عُصبَةٌ
      ["عصبة منكم : جماعة منكم"], // مِنكُم
      [], // لا
      [], // تَحسَبوهُ
      [], // شَرًّا
      [], // لَكُم
      [], // بَل
      [], // هُوَ
      [], // خَيرٌ
      [], // لَكُم
      [], // لِكُلِّ
      [], // امرِئٍ
      [], // مِنهُم
      [], // مَا
      [], // اكتَسَبَ
      [], // مِنَ
      [], // الإِثمِ
      [], // وَالَّذى
      ["تولّى كبره : تحمّل معظمه (رأس المنافقين)"], // تَوَلّىٰ
      ["تولّى كبره : تحمّل معظمه (رأس المنافقين)"], // كِبرَهُ
      [], // مِنهُم
      [], // لَهُ
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 12
      [], // لَولا
      [], // إِذ
      [], // سَمِعتُموهُ
      [], // ظَنَّ
      [], // المُؤمِنونَ
      [], // وَالمُؤمِنـٰتُ
      [], // بِأَنفُسِهِم
      [], // خَيرًا
      [], // وَقالوا
      [], // هـٰذا
      [], // إِفكٌ
      [] // مُبينٌ
    ],
    [ // آية 13
      [], // لَولا
      [], // جاءو
      [], // عَلَيهِ
      [], // بِأَربَعَةِ
      [], // شُهَداءَ
      [], // فَإِذ
      [], // لَم
      [], // يَأتوا
      [], // بِالشُّهَداءِ
      [], // فَأُولـٰئِكَ
      [], // عِندَ
      [], // اللَّهِ
      [], // هُمُ
      [] // الكـٰذِبونَ
    ],
    [ // آية 14
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَرَحمَتُهُ
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // لَمَسَّكُم
      [], // فى
      [], // ما
      ["أفضتم فيه : خضتم فيه من حديث الإفك"], // أَفَضتُم
      ["أفضتم فيه : خضتم فيه من حديث الإفك"], // فيهِ
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 15
      [], // إِذ
      [], // تَلَقَّونَهُ
      [], // بِأَلسِنَتِكُم
      [], // وَتَقولونَ
      [], // بِأَفواهِكُم
      [], // ما
      [], // لَيسَ
      [], // لَكُم
      [], // بِهِ
      [], // عِلمٌ
      [], // وَتَحسَبونَهُ
      [], // هَيِّنًا
      [], // وَهُوَ
      [], // عِندَ
      [], // اللَّهِ
      [] // عَظيمٌ
    ],
    [ // آية 16
      [], // وَلَولا
      [], // إِذ
      [], // سَمِعتُموهُ
      [], // قُلتُم
      [], // ما
      [], // يَكونُ
      [], // لَنا
      [], // أَن
      [], // نَتَكَلَّمَ
      [], // بِهـٰذا
      [], // سُبحـٰنَكَ
      [], // هـٰذا
      [], // بُهتـٰنٌ
      [] // عَظيمٌ
    ],
    [ // آية 17
      [], // يَعِظُكُمُ
      [], // اللَّهُ
      [], // أَن
      [], // تَعودوا
      [], // لِمِثلِهِ
      [], // أَبَدًا
      [], // إِن
      [], // كُنتُم
      [] // مُؤمِنينَ
    ],
    [ // آية 18
      [], // وَيُبَيِّنُ
      [], // اللَّهُ
      [], // لَكُمُ
      [], // الـٔايـٰتِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 19
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُحِبّونَ
      [], // أَن
      [], // تَشيعَ
      [], // الفـٰحِشَةُ
      [], // فِى
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لَهُم
      [], // عَذابٌ
      [], // أَليمٌ
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // وَأَنتُم
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 20
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَرَحمَتُهُ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // رَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 21
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَتَّبِعوا
      [], // خُطُوٰتِ
      [], // الشَّيطـٰنِ
      [], // وَمَن
      [], // يَتَّبِع
      [], // خُطُوٰتِ
      [], // الشَّيطـٰنِ
      [], // فَإِنَّهُ
      [], // يَأمُرُ
      ["بالفحشاء : ما عَظُم قبحه من الذنوب"], // بِالفَحشاءِ
      [], // وَالمُنكَرِ
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَرَحمَتُهُ
      ["ما زكى : ما تطهّر من دنس الذنوب"], // ما
      ["ما زكى : ما تطهّر من دنس الذنوب"], // زَكىٰ
      [], // مِنكُم
      [], // مِن
      [], // أَحَدٍ
      [], // أَبَدًا
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // يُزَكّى
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 22
      [], // وَلا
      [], // يَأتَلِ
      ["أولوا الفضل : أصحاب الزيادة في الدّين"], // أُولُوا
      ["أولوا الفضل : أصحاب الزيادة في الدّين"], // الفَضلِ
      [], // مِنكُم
      [], // وَالسَّعَةِ
      [], // أَن
      [], // يُؤتوا
      [], // أُولِى
      [], // القُربىٰ
      [], // وَالمَسـٰكينَ
      [], // وَالمُهـٰجِرينَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَليَعفوا
      [], // وَليَصفَحوا
      [], // أَلا
      [], // تُحِبّونَ
      [], // أَن
      [], // يَغفِرَ
      [], // اللَّهُ
      [], // لَكُم
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 23
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَرمونَ
      [], // المُحصَنـٰتِ
      [], // الغـٰفِلـٰتِ
      [], // المُؤمِنـٰتِ
      [], // لُعِنوا
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 24
      [], // يَومَ
      [], // تَشهَدُ
      [], // عَلَيهِم
      [], // أَلسِنَتُهُم
      [], // وَأَيديهِم
      [], // وَأَرجُلُهُم
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 25
      [], // يَومَئِذٍ
      [], // يُوَفّيهِمُ
      [], // اللَّهُ
      ["دينهم الحقّ : جزاءهم الثابت لهم بالعدل"], // دينَهُمُ
      ["دينهم الحقّ : جزاءهم الثابت لهم بالعدل"], // الحَقَّ
      [], // وَيَعلَمونَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الحَقُّ
      [] // المُبينُ
    ],
    [ // آية 26
      [], // الخَبيثـٰتُ
      [], // لِلخَبيثينَ
      [], // وَالخَبيثونَ
      [], // لِلخَبيثـٰتِ
      [], // وَالطَّيِّبـٰتُ
      [], // لِلطَّيِّبينَ
      [], // وَالطَّيِّبونَ
      [], // لِلطَّيِّبـٰتِ
      [], // أُولـٰئِكَ
      [], // مُبَرَّءونَ
      [], // مِمّا
      [], // يَقولونَ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَرِزقٌ
      [] // كَريمٌ
    ],
    [ // آية 27
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَدخُلوا
      [], // بُيوتًا
      [], // غَيرَ
      [], // بُيوتِكُم
      [], // حَتّىٰ
      ["تستأنسوا : تستأذنوا ممن يملك الإذن"], // تَستَأنِسوا
      [], // وَتُسَلِّموا
      [], // عَلىٰ
      [], // أَهلِها
      [], // ذٰلِكُم
      [], // خَيرٌ
      [], // لَكُم
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 28
      [], // فَإِن
      [], // لَم
      [], // تَجِدوا
      [], // فيها
      [], // أَحَدًا
      [], // فَلا
      [], // تَدخُلوها
      [], // حَتّىٰ
      [], // يُؤذَنَ
      [], // لَكُم
      [], // وَإِن
      [], // قيلَ
      [], // لَكُمُ
      [], // ارجِعوا
      [], // فَارجِعوا
      [], // هُوَ
      ["أزكى لكم : أطهر لكم من دنس الريبة و الدّناءة"], // أَزكىٰ
      ["أزكى لكم : أطهر لكم من دنس الريبة و الدّناءة"], // لَكُم
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // عَليمٌ
    ],
    [ // آية 29
      [], // لَيسَ
      [], // عَلَيكُم
      ["جناح : إثم"], // جُناحٌ
      [], // أَن
      [], // تَدخُلوا
      [], // بُيوتًا
      [], // غَيرَ
      [], // مَسكونَةٍ
      [], // فيها
      [], // مَتـٰعٌ
      [], // لَكُم
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // ما
      [], // تُبدونَ
      [], // وَما
      [] // تَكتُمونَ
    ],
    [ // آية 30
      [], // قُل
      [], // لِلمُؤمِنينَ
      [], // يَغُضّوا
      [], // مِن
      [], // أَبصـٰرِهِم
      [], // وَيَحفَظوا
      [], // فُروجَهُم
      [], // ذٰلِكَ
      [], // أَزكىٰ
      [], // لَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // خَبيرٌ
      [], // بِما
      [] // يَصنَعونَ
    ],
    [ // آية 31
      [], // وَقُل
      [], // لِلمُؤمِنـٰتِ
      [], // يَغضُضنَ
      [], // مِن
      [], // أَبصـٰرِهِنَّ
      [], // وَيَحفَظنَ
      [], // فُروجَهُنَّ
      [], // وَلا
      [], // يُبدينَ
      ["زينتهن : مواضع زينتهن من الجسد"], // زينَتَهُنَّ
      [], // إِلّا
      ["ما ظهر منها : الوجه و الكفين و القدمين"], // ما
      ["ما ظهر منها : الوجه و الكفين و القدمين"], // ظَهَرَ
      ["ما ظهر منها : الوجه و الكفين و القدمين"], // مِنها
      [], // وَليَضرِبنَ
      [], // بِخُمُرِهِنَّ
      ["على جيوبهن : على مواضعها (صدورهن و ما حواليها)"], // عَلىٰ
      ["على جيوبهن : على مواضعها (صدورهن و ما حواليها)"], // جُيوبِهِنَّ
      [], // وَلا
      [], // يُبدينَ
      [], // زينَتَهُنَّ
      [], // إِلّا
      ["لبعولتهن : لأزواجهن"], // لِبُعولَتِهِنَّ
      [], // أَو
      [], // ءابائِهِنَّ
      [], // أَو
      [], // ءاباءِ
      [], // بُعولَتِهِنَّ
      [], // أَو
      [], // أَبنائِهِنَّ
      [], // أَو
      [], // أَبناءِ
      [], // بُعولَتِهِنَّ
      [], // أَو
      [], // إِخوٰنِهِنَّ
      [], // أَو
      [], // بَنى
      [], // إِخوٰنِهِنَّ
      [], // أَو
      [], // بَنى
      [], // أَخَوٰتِهِنَّ
      [], // أَو
      ["نسائهن : المختصّات بهن بالصحبة أو الخدمة"], // نِسائِهِنَّ
      [], // أَو
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُهُنَّ
      [], // أَوِ
      [], // التّـٰبِعينَ
      [], // غَيرِ
      [], // أُولِى
      [], // الإِربَةِ
      [], // مِنَ
      [], // الرِّجالِ
      [], // أَوِ
      [], // الطِّفلِ
      [], // الَّذينَ
      ["لم يظهروا : لم يبلغوا حد الشهوة"], // لَم
      ["لم يظهروا : لم يبلغوا حد الشهوة"], // يَظهَروا
      [], // عَلىٰ
      [], // عَورٰتِ
      [], // النِّساءِ
      [], // وَلا
      [], // يَضرِبنَ
      [], // بِأَرجُلِهِنَّ
      [], // لِيُعلَمَ
      [], // ما
      [], // يُخفينَ
      [], // مِن
      [], // زينَتِهِنَّ
      [], // وَتوبوا
      [], // إِلَى
      [], // اللَّهِ
      [], // جَميعًا
      [], // أَيُّهَ
      [], // المُؤمِنونَ
      [], // لَعَلَّكُم
      [] // تُفلِحونَ
    ],
    [ // آية 32
      [], // وَأَنكِحُوا
      [], // الأَيـٰمىٰ
      [], // مِنكُم
      [], // وَالصّـٰلِحينَ
      [], // مِن
      [], // عِبادِكُم
      [], // وَإِمائِكُم
      [], // إِن
      [], // يَكونوا
      [], // فُقَراءَ
      [], // يُغنِهِمُ
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // وَاللَّهُ
      [], // وٰسِعٌ
      [] // عَليمٌ
    ],
    [ // آية 33
      [], // وَليَستَعفِفِ
      [], // الَّذينَ
      [], // لا
      [], // يَجِدونَ
      [], // نِكاحًا
      [], // حَتّىٰ
      [], // يُغنِيَهُمُ
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // وَالَّذينَ
      [], // يَبتَغونَ
      [], // الكِتـٰبَ
      [], // مِمّا
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // فَكاتِبوهُم
      [], // إِن
      [], // عَلِمتُم
      [], // فيهِم
      [], // خَيرًا
      [], // وَءاتوهُم
      [], // مِن
      [], // مالِ
      [], // اللَّهِ
      [], // الَّذى
      [], // ءاتىٰكُم
      [], // وَلا
      [], // تُكرِهوا
      [], // فَتَيـٰتِكُم
      [], // عَلَى
      ["البغاء : الزّنى"], // البِغاءِ
      [], // إِن
      [], // أَرَدنَ
      [], // تَحَصُّنًا
      [], // لِتَبتَغوا
      [], // عَرَضَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَمَن
      [], // يُكرِههُنَّ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // مِن
      [], // بَعدِ
      [], // إِكرٰهِهِنَّ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 34
      [], // وَلَقَد
      [], // أَنزَلنا
      [], // إِلَيكُم
      [], // ءايـٰتٍ
      [], // مُبَيِّنـٰتٍ
      [], // وَمَثَلًا
      [], // مِنَ
      [], // الَّذينَ
      [], // خَلَوا
      [], // مِن
      [], // قَبلِكُم
      [], // وَمَوعِظَةً
      [] // لِلمُتَّقينَ
    ],
    [ // آية 35
      [], // اللَّهُ
      [], // نورُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // مَثَلُ
      [], // نورِهِ
      [], // كَمِشكوٰةٍ
      [], // فيها
      ["مصباح : سراج ضخم ثاقب"], // مِصباحٌ
      [], // المِصباحُ
      [], // فى
      [], // زُجاجَةٍ
      [], // الزُّجاجَةُ
      [], // كَأَنَّها
      [], // كَوكَبٌ
      [], // دُرِّىٌّ
      [], // يوقَدُ
      [], // مِن
      [], // شَجَرَةٍ
      [], // مُبـٰرَكَةٍ
      [], // زَيتونَةٍ
      [], // لا
      [], // شَرقِيَّةٍ
      [], // وَلا
      [], // غَربِيَّةٍ
      [], // يَكادُ
      [], // زَيتُها
      [], // يُضىءُ
      [], // وَلَو
      [], // لَم
      [], // تَمسَسهُ
      [], // نارٌ
      [], // نورٌ
      [], // عَلىٰ
      [], // نورٍ
      [], // يَهدِى
      [], // اللَّهُ
      [], // لِنورِهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَضرِبُ
      [], // اللَّهُ
      [], // الأَمثـٰلَ
      [], // لِلنّاسِ
      [], // وَاللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 36
      [], // فى
      ["بيوت : هي المساجد كلّها"], // بُيوتٍ
      [], // أَذِنَ
      [], // اللَّهُ
      ["أن ترفع : أن تُعظّم و تـُطهّر"], // أَن
      ["أن ترفع : أن تُعظّم و تـُطهّر"], // تُرفَعَ
      [], // وَيُذكَرَ
      [], // فيهَا
      [], // اسمُهُ
      [], // يُسَبِّحُ
      [], // لَهُ
      [], // فيها
      [], // بِالغُدُوِّ
      [] // وَالـٔاصالِ
    ],
    [ // آية 37
      [], // رِجالٌ
      [], // لا
      [], // تُلهيهِم
      [], // تِجـٰرَةٌ
      [], // وَلا
      [], // بَيعٌ
      [], // عَن
      [], // ذِكرِ
      [], // اللَّهِ
      [], // وَإِقامِ
      [], // الصَّلوٰةِ
      [], // وَإيتاءِ
      [], // الزَّكوٰةِ
      [], // يَخافونَ
      [], // يَومًا
      [], // تَتَقَلَّبُ
      [], // فيهِ
      [], // القُلوبُ
      [] // وَالأَبصـٰرُ
    ],
    [ // آية 38
      [], // لِيَجزِيَهُمُ
      [], // اللَّهُ
      [], // أَحسَنَ
      [], // ما
      [], // عَمِلوا
      [], // وَيَزيدَهُم
      [], // مِن
      [], // فَضلِهِ
      [], // وَاللَّهُ
      [], // يَرزُقُ
      [], // مَن
      [], // يَشاءُ
      ["بغير حساب : بلا نهاية لما يُعطي ، أو بتوسّع"], // بِغَيرِ
      ["بغير حساب : بلا نهاية لما يُعطي ، أو بتوسّع"] // حِسابٍ
    ],
    [ // آية 39
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // أَعمـٰلُهُم
      ["كسراب : شعاع يُرى ظهرا في البرّ عند اشتداد الحرّ كالماء السارب"], // كَسَرابٍ
      ["بقيعة : في منبسطة من الأرض متـسع"], // بِقيعَةٍ
      [], // يَحسَبُهُ
      [], // الظَّمـٔانُ
      [], // ماءً
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَهُ
      [], // لَم
      [], // يَجِدهُ
      [], // شَيـًٔا
      [], // وَوَجَدَ
      [], // اللَّهَ
      [], // عِندَهُ
      [], // فَوَفّىٰهُ
      [], // حِسابَهُ
      [], // وَاللَّهُ
      [], // سَريعُ
      [] // الحِسابِ
    ],
    [ // آية 40
      [], // أَو
      [], // كَظُلُمـٰتٍ
      [], // فى
      [], // بَحرٍ
      [], // لُجِّىٍّ
      [], // يَغشىٰهُ
      [], // مَوجٌ
      [], // مِن
      [], // فَوقِهِ
      [], // مَوجٌ
      [], // مِن
      [], // فَوقِهِ
      ["سحاب : غيم يحجب أنوار السّماء"], // سَحابٌ
      [], // ظُلُمـٰتٌ
      [], // بَعضُها
      [], // فَوقَ
      [], // بَعضٍ
      [], // إِذا
      [], // أَخرَجَ
      [], // يَدَهُ
      [], // لَم
      [], // يَكَد
      [], // يَرىٰها
      [], // وَمَن
      [], // لَم
      [], // يَجعَلِ
      [], // اللَّهُ
      [], // لَهُ
      [], // نورًا
      [], // فَما
      [], // لَهُ
      [], // مِن
      [] // نورٍ
    ],
    [ // آية 41
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // يُسَبِّحُ
      [], // لَهُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَالطَّيرُ
      [], // صـٰفّـٰتٍ
      [], // كُلٌّ
      [], // قَد
      [], // عَلِمَ
      [], // صَلاتَهُ
      [], // وَتَسبيحَهُ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [], // بِما
      [] // يَفعَلونَ
    ],
    [ // آية 42
      [], // وَلِلَّهِ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَإِلَى
      [], // اللَّهِ
      [] // المَصيرُ
    ],
    [ // آية 43
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // يُزجى
      [], // سَحابًا
      [], // ثُمَّ
      [], // يُؤَلِّفُ
      [], // بَينَهُ
      [], // ثُمَّ
      ["يجعله ركاما : مجتمعا بعضه فوق بعض"], // يَجعَلُهُ
      ["يجعله ركاما : مجتمعا بعضه فوق بعض"], // رُكامًا
      [], // فَتَرَى
      ["الودق : المطر"], // الوَدقَ
      [], // يَخرُجُ
      [], // مِن
      [], // خِلـٰلِهِ
      [], // وَيُنَزِّلُ
      [], // مِنَ
      [], // السَّماءِ
      [], // مِن
      [], // جِبالٍ
      [], // فيها
      [], // مِن
      [], // بَرَدٍ
      [], // فَيُصيبُ
      [], // بِهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَصرِفُهُ
      [], // عَن
      [], // مَن
      [], // يَشاءُ
      [], // يَكادُ
      [], // سَنا
      [], // بَرقِهِ
      [], // يَذهَبُ
      [] // بِالأَبصـٰرِ
    ],
    [ // آية 44
      [], // يُقَلِّبُ
      [], // اللَّهُ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَعِبرَةً
      [], // لِأُولِى
      [] // الأَبصـٰرِ
    ],
    [ // آية 45
      [], // وَاللَّهُ
      [], // خَلَقَ
      [], // كُلَّ
      [], // دابَّةٍ
      [], // مِن
      [], // ماءٍ
      [], // فَمِنهُم
      [], // مَن
      [], // يَمشى
      [], // عَلىٰ
      [], // بَطنِهِ
      [], // وَمِنهُم
      [], // مَن
      [], // يَمشى
      [], // عَلىٰ
      [], // رِجلَينِ
      [], // وَمِنهُم
      [], // مَن
      [], // يَمشى
      [], // عَلىٰ
      [], // أَربَعٍ
      [], // يَخلُقُ
      [], // اللَّهُ
      [], // ما
      [], // يَشاءُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 46
      [], // لَقَد
      [], // أَنزَلنا
      [], // ءايـٰتٍ
      [], // مُبَيِّنـٰتٍ
      [], // وَاللَّهُ
      [], // يَهدى
      [], // مَن
      [], // يَشاءُ
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 47
      [], // وَيَقولونَ
      [], // ءامَنّا
      [], // بِاللَّهِ
      [], // وَبِالرَّسولِ
      [], // وَأَطَعنا
      [], // ثُمَّ
      [], // يَتَوَلّىٰ
      [], // فَريقٌ
      [], // مِنهُم
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // وَما
      [], // أُولـٰئِكَ
      [] // بِالمُؤمِنينَ
    ],
    [ // آية 48
      [], // وَإِذا
      [], // دُعوا
      [], // إِلَى
      [], // اللَّهِ
      [], // وَرَسولِهِ
      [], // لِيَحكُمَ
      [], // بَينَهُم
      [], // إِذا
      [], // فَريقٌ
      [], // مِنهُم
      [] // مُعرِضونَ
    ],
    [ // آية 49
      [], // وَإِن
      [], // يَكُن
      [], // لَهُمُ
      [], // الحَقُّ
      [], // يَأتوا
      [], // إِلَيهِ
      ["مذعنين : منقادين مُطيعين"] // مُذعِنينَ
    ],
    [ // آية 50
      [], // أَفى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // أَمِ
      [], // ارتابوا
      [], // أَم
      [], // يَخافونَ
      ["أن يحيف : أن يجور"], // أَن
      ["أن يحيف : أن يجور"], // يَحيفَ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // وَرَسولُهُ
      [], // بَل
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 51
      [], // إِنَّما
      [], // كانَ
      [], // قَولَ
      [], // المُؤمِنينَ
      [], // إِذا
      [], // دُعوا
      [], // إِلَى
      [], // اللَّهِ
      [], // وَرَسولِهِ
      [], // لِيَحكُمَ
      [], // بَينَهُم
      [], // أَن
      [], // يَقولوا
      [], // سَمِعنا
      [], // وَأَطَعنا
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 52
      [], // وَمَن
      [], // يُطِعِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَيَخشَ
      [], // اللَّهَ
      [], // وَيَتَّقهِ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // الفائِزونَ
    ],
    [ // آية 53
      [], // وَأَقسَموا
      [], // بِاللَّهِ
      [], // جَهدَ
      [], // أَيمـٰنِهِم
      [], // لَئِن
      [], // أَمَرتَهُم
      [], // لَيَخرُجُنَّ
      [], // قُل
      [], // لا
      [], // تُقسِموا
      ["طاعة معروفة : طاعتكم طاعة معروفة باللسان"], // طاعَةٌ
      ["طاعة معروفة : طاعتكم طاعة معروفة باللسان"], // مَعروفَةٌ
      [], // إِنَّ
      [], // اللَّهَ
      [], // خَبيرٌ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 54
      [], // قُل
      [], // أَطيعُوا
      [], // اللَّهَ
      [], // وَأَطيعُوا
      [], // الرَّسولَ
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَإِنَّما
      [], // عَلَيهِ
      ["ما حُمّل : ما أمر به من التبليغ"], // ما
      ["ما حُمّل : ما أمر به من التبليغ"], // حُمِّلَ
      [], // وَعَلَيكُم
      ["ما حُمّلتم : ما أمرتم به من الطاعة و الإنقياد"], // ما
      ["ما حُمّلتم : ما أمرتم به من الطاعة و الإنقياد"], // حُمِّلتُم
      [], // وَإِن
      [], // تُطيعوهُ
      [], // تَهتَدوا
      [], // وَما
      [], // عَلَى
      [], // الرَّسولِ
      [], // إِلَّا
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 55
      [], // وَعَدَ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // مِنكُم
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَيَستَخلِفَنَّهُم
      [], // فِى
      [], // الأَرضِ
      [], // كَمَا
      [], // استَخلَفَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَلَيُمَكِّنَنَّ
      [], // لَهُم
      [], // دينَهُمُ
      [], // الَّذِى
      [], // ارتَضىٰ
      [], // لَهُم
      [], // وَلَيُبَدِّلَنَّهُم
      [], // مِن
      [], // بَعدِ
      [], // خَوفِهِم
      [], // أَمنًا
      [], // يَعبُدونَنى
      [], // لا
      [], // يُشرِكونَ
      [], // بى
      [], // شَيـًٔا
      [], // وَمَن
      [], // كَفَرَ
      [], // بَعدَ
      [], // ذٰلِكَ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // الفـٰسِقونَ
    ],
    [ // آية 56
      [], // وَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَءاتُوا
      [], // الزَّكوٰةَ
      [], // وَأَطيعُوا
      [], // الرَّسولَ
      [], // لَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 57
      [], // لا
      [], // تَحسَبَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      ["مُعجزين : فائتين من عذابنا بالهرب"], // مُعجِزينَ
      [], // فِى
      [], // الأَرضِ
      [], // وَمَأوىٰهُمُ
      [], // النّارُ
      [], // وَلَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 58
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لِيَستَـٔذِنكُمُ
      [], // الَّذينَ
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // وَالَّذينَ
      [], // لَم
      [], // يَبلُغُوا
      [], // الحُلُمَ
      [], // مِنكُم
      [], // ثَلـٰثَ
      [], // مَرّٰتٍ
      [], // مِن
      [], // قَبلِ
      [], // صَلوٰةِ
      [], // الفَجرِ
      [], // وَحينَ
      [], // تَضَعونَ
      [], // ثِيابَكُم
      [], // مِنَ
      [], // الظَّهيرَةِ
      [], // وَمِن
      [], // بَعدِ
      [], // صَلوٰةِ
      [], // العِشاءِ
      [], // ثَلـٰثُ
      [], // عَورٰتٍ
      [], // لَكُم
      [], // لَيسَ
      [], // عَلَيكُم
      [], // وَلا
      [], // عَلَيهِم
      ["جناح : حرج في الدخول بلا استئذان"], // جُناحٌ
      [], // بَعدَهُنَّ
      [], // طَوّٰفونَ
      [], // عَلَيكُم
      [], // بَعضُكُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // كَذٰلِكَ
      [], // يُبَيِّنُ
      [], // اللَّهُ
      [], // لَكُمُ
      [], // الـٔايـٰتِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 59
      [], // وَإِذا
      [], // بَلَغَ
      [], // الأَطفـٰلُ
      [], // مِنكُمُ
      [], // الحُلُمَ
      [], // فَليَستَـٔذِنوا
      [], // كَمَا
      [], // استَـٔذَنَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // كَذٰلِكَ
      [], // يُبَيِّنُ
      [], // اللَّهُ
      [], // لَكُم
      [], // ءايـٰتِهِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 60
      [], // وَالقَوٰعِدُ
      [], // مِنَ
      [], // النِّساءِ
      [], // الّـٰتى
      [], // لا
      [], // يَرجونَ
      [], // نِكاحًا
      [], // فَلَيسَ
      [], // عَلَيهِنَّ
      [], // جُناحٌ
      [], // أَن
      [], // يَضَعنَ
      [], // ثِيابَهُنَّ
      [], // غَيرَ
      [], // مُتَبَرِّجـٰتٍ
      [], // بِزينَةٍ
      [], // وَأَن
      [], // يَستَعفِفنَ
      [], // خَيرٌ
      [], // لَهُنَّ
      [], // وَاللَّهُ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 61
      [], // لَيسَ
      [], // عَلَى
      [], // الأَعمىٰ
      [], // حَرَجٌ
      [], // وَلا
      [], // عَلَى
      [], // الأَعرَجِ
      [], // حَرَجٌ
      [], // وَلا
      [], // عَلَى
      [], // المَريضِ
      [], // حَرَجٌ
      [], // وَلا
      [], // عَلىٰ
      [], // أَنفُسِكُم
      [], // أَن
      [], // تَأكُلوا
      [], // مِن
      [], // بُيوتِكُم
      [], // أَو
      [], // بُيوتِ
      [], // ءابائِكُم
      [], // أَو
      [], // بُيوتِ
      [], // أُمَّهـٰتِكُم
      [], // أَو
      [], // بُيوتِ
      [], // إِخوٰنِكُم
      [], // أَو
      [], // بُيوتِ
      [], // أَخَوٰتِكُم
      [], // أَو
      [], // بُيوتِ
      [], // أَعمـٰمِكُم
      [], // أَو
      [], // بُيوتِ
      [], // عَمّـٰتِكُم
      [], // أَو
      [], // بُيوتِ
      [], // أَخوٰلِكُم
      [], // أَو
      [], // بُيوتِ
      [], // خـٰلـٰتِكُم
      [], // أَو
      ["ما ملكتم مفاتحه : مما في تصرّفكم وكالة أو حفظا"], // ما
      ["ما ملكتم مفاتحه : مما في تصرّفكم وكالة أو حفظا"], // مَلَكتُم
      ["ما ملكتم مفاتحه : مما في تصرّفكم وكالة أو حفظا"], // مَفاتِحَهُ
      [], // أَو
      [], // صَديقِكُم
      [], // لَيسَ
      [], // عَلَيكُم
      [], // جُناحٌ
      [], // أَن
      [], // تَأكُلوا
      [], // جَميعًا
      [], // أَو
      ["أشتاتا : متفرّقين"], // أَشتاتًا
      [], // فَإِذا
      [], // دَخَلتُم
      [], // بُيوتًا
      [], // فَسَلِّموا
      [], // عَلىٰ
      [], // أَنفُسِكُم
      [], // تَحِيَّةً
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // مُبـٰرَكَةً
      [], // طَيِّبَةً
      [], // كَذٰلِكَ
      [], // يُبَيِّنُ
      [], // اللَّهُ
      [], // لَكُمُ
      [], // الـٔايـٰتِ
      [], // لَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 62
      [], // إِنَّمَا
      [], // المُؤمِنونَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَإِذا
      [], // كانوا
      [], // مَعَهُ
      [], // عَلىٰ
      ["أمر جامع : أمر مهمّ يجب اجتماعهم له"], // أَمرٍ
      ["أمر جامع : أمر مهمّ يجب اجتماعهم له"], // جامِعٍ
      [], // لَم
      [], // يَذهَبوا
      [], // حَتّىٰ
      [], // يَستَـٔذِنوهُ
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَستَـٔذِنونَكَ
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // فَإِذَا
      [], // استَـٔذَنوكَ
      [], // لِبَعضِ
      [], // شَأنِهِم
      [], // فَأذَن
      [], // لِمَن
      [], // شِئتَ
      [], // مِنهُم
      [], // وَاستَغفِر
      [], // لَهُمُ
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 63
      [], // لا
      [], // تَجعَلوا
      ["دعاء الرّسول : دعوته لكم للاجتماع أو نداءكم له"], // دُعاءَ
      ["دعاء الرّسول : دعوته لكم للاجتماع أو نداءكم له"], // الرَّسولِ
      [], // بَينَكُم
      [], // كَدُعاءِ
      [], // بَعضِكُم
      [], // بَعضًا
      [], // قَد
      [], // يَعلَمُ
      [], // اللَّهُ
      [], // الَّذينَ
      ["يتسلّلون منكم : يخرجون منكم تدريجا في خفية"], // يَتَسَلَّلونَ
      ["يتسلّلون منكم : يخرجون منكم تدريجا في خفية"], // مِنكُم
      ["لِواذا : يستتر بعضهم ببعض في الخروج"], // لِواذًا
      [], // فَليَحذَرِ
      [], // الَّذينَ
      ["يخالفون عن أمره : يعرضون أو يصدون عنه"], // يُخالِفونَ
      ["يخالفون عن أمره : يعرضون أو يصدون عنه"], // عَن
      ["يخالفون عن أمره : يعرضون أو يصدون عنه"], // أَمرِهِ
      [], // أَن
      [], // تُصيبَهُم
      ["فتنة : بلاء و محنة في الدنيا"], // فِتنَةٌ
      [], // أَو
      [], // يُصيبَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 64
      [], // أَلا
      [], // إِنَّ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // قَد
      [], // يَعلَمُ
      [], // ما
      [], // أَنتُم
      [], // عَلَيهِ
      [], // وَيَومَ
      [], // يُرجَعونَ
      [], // إِلَيهِ
      [], // فَيُنَبِّئُهُم
      [], // بِما
      [], // عَمِلوا
      [], // وَاللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ]
];

export default meanings;