const meanings = [
[ // آية 1
      [], // تَبارَكَ
      [], // الَّذى
      ["نزل الفرقان : القرآن الفاصل بين الحقّ و الباطل"], // نَزَّلَ
      ["نزل الفرقان : القرآن الفاصل بين الحقّ و الباطل"], // الفُرقانَ
      [], // عَلىٰ
      [], // عَبدِهِ
      [], // لِيَكونَ
      [], // لِلعـٰلَمينَ
      [] // نَذيرًا
    ],
    [ // آية 2
      [], // الَّذى
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلَم
      [], // يَتَّخِذ
      [], // وَلَدًا
      [], // وَلَم
      [], // يَكُن
      [], // لَهُ
      [], // شَريكٌ
      [], // فِى
      [], // المُلكِ
      [], // وَخَلَقَ
      [], // كُلَّ
      [], // شَىءٍ
      ["فقدّره : فهيّأه لما يصلح له و يليق به"], // فَقَدَّرَهُ
      [] // تَقديرًا
    ],
    [ // آية 3
      [], // وَاتَّخَذوا
      [], // مِن
      [], // دونِهِ
      [], // ءالِهَةً
      [], // لا
      [], // يَخلُقونَ
      [], // شَيـًٔا
      [], // وَهُم
      [], // يُخلَقونَ
      [], // وَلا
      [], // يَملِكونَ
      [], // لِأَنفُسِهِم
      [], // ضَرًّا
      [], // وَلا
      [], // نَفعًا
      [], // وَلا
      [], // يَملِكونَ
      [], // مَوتًا
      [], // وَلا
      [], // حَيوٰةً
      [], // وَلا
      ["نشورا : بعثا بعد الموت في الآخرة"] // نُشورًا
    ],
    [ // آية 4
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // إِفكٌ
      [], // افتَرىٰهُ
      [], // وَأَعانَهُ
      [], // عَلَيهِ
      [], // قَومٌ
      [], // ءاخَرونَ
      [], // فَقَد
      [], // جاءو
      [], // ظُلمًا
      [] // وَزورًا
    ],
    [ // آية 5
      [], // وَقالوا
      [], // أَسـٰطيرُ
      [], // الأَوَّلينَ
      [], // اكتَتَبَها
      [], // فَهِىَ
      [], // تُملىٰ
      [], // عَلَيهِ
      [], // بُكرَةً
      [] // وَأَصيلًا
    ],
    [ // آية 6
      [], // قُل
      [], // أَنزَلَهُ
      [], // الَّذى
      ["يعلم السّر : يعلم كلّما يغيب و يخفى"], // يَعلَمُ
      ["يعلم السّر : يعلم كلّما يغيب و يخفى"], // السِّرَّ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // إِنَّهُ
      [], // كانَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 7
      [], // وَقالوا
      [], // مالِ
      [], // هـٰذَا
      [], // الرَّسولِ
      [], // يَأكُلُ
      [], // الطَّعامَ
      [], // وَيَمشى
      [], // فِى
      [], // الأَسواقِ
      [], // لَولا
      [], // أُنزِلَ
      [], // إِلَيهِ
      [], // مَلَكٌ
      [], // فَيَكونَ
      [], // مَعَهُ
      [] // نَذيرًا
    ],
    [ // آية 8
      [], // أَو
      [], // يُلقىٰ
      [], // إِلَيهِ
      [], // كَنزٌ
      [], // أَو
      [], // تَكونُ
      [], // لَهُ
      ["جنّة يأكل منها : بستان مثمر يتعيّش منه"], // جَنَّةٌ
      ["جنّة يأكل منها : بستان مثمر يتعيّش منه"], // يَأكُلُ
      ["جنّة يأكل منها : بستان مثمر يتعيّش منه"], // مِنها
      [], // وَقالَ
      [], // الظّـٰلِمونَ
      [], // إِن
      [], // تَتَّبِعونَ
      [], // إِلّا
      ["رجلا مسحورا : غلب السّحر على عقله"], // رَجُلًا
      ["رجلا مسحورا : غلب السّحر على عقله"] // مَسحورًا
    ],
    [ // آية 9
      [], // انظُر
      [], // كَيفَ
      [], // ضَرَبوا
      [], // لَكَ
      [], // الأَمثـٰلَ
      [], // فَضَلّوا
      [], // فَلا
      [], // يَستَطيعونَ
      [] // سَبيلًا
    ],
    [ // آية 10
      [], // تَبارَكَ
      [], // الَّذى
      [], // إِن
      [], // شاءَ
      [], // جَعَلَ
      [], // لَكَ
      [], // خَيرًا
      [], // مِن
      [], // ذٰلِكَ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // وَيَجعَل
      [], // لَكَ
      [] // قُصورًا
    ],
    [ // آية 11
      [], // بَل
      [], // كَذَّبوا
      [], // بِالسّاعَةِ
      [], // وَأَعتَدنا
      [], // لِمَن
      [], // كَذَّبَ
      [], // بِالسّاعَةِ
      ["سعيرا : نارا عظيمة شديدة الإشتعال"] // سَعيرًا
    ],
    [ // آية 12
      [], // إِذا
      [], // رَأَتهُم
      [], // مِن
      [], // مَكانٍ
      [], // بَعيدٍ
      [], // سَمِعوا
      [], // لَها
      ["تغيّظا : صوت غليان كصوت المتغيّظ"], // تَغَيُّظًا
      [] // وَزَفيرًا
    ],
    [ // آية 13
      [], // وَإِذا
      [], // أُلقوا
      [], // مِنها
      [], // مَكانًا
      [], // ضَيِّقًا
      ["مقرّنين : مقرونه أيديهم إلى أعناقهم بالأغلال"], // مُقَرَّنينَ
      [], // دَعَوا
      [], // هُنالِكَ
      ["ثبورا : هلاكا فقالوا وَا ثبوراه"] // ثُبورًا
    ],
    [ // آية 14
      [], // لا
      [], // تَدعُوا
      [], // اليَومَ
      [], // ثُبورًا
      [], // وٰحِدًا
      [], // وَادعوا
      [], // ثُبورًا
      [] // كَثيرًا
    ],
    [ // آية 15
      [], // قُل
      [], // أَذٰلِكَ
      [], // خَيرٌ
      [], // أَم
      [], // جَنَّةُ
      [], // الخُلدِ
      [], // الَّتى
      [], // وُعِدَ
      [], // المُتَّقونَ
      [], // كانَت
      [], // لَهُم
      [], // جَزاءً
      [] // وَمَصيرًا
    ],
    [ // آية 16
      [], // لَهُم
      [], // فيها
      [], // ما
      [], // يَشاءونَ
      [], // خـٰلِدينَ
      [], // كانَ
      [], // عَلىٰ
      [], // رَبِّكَ
      [], // وَعدًا
      [] // مَسـٔولًا
    ],
    [ // آية 17
      [], // وَيَومَ
      [], // يَحشُرُهُم
      [], // وَما
      [], // يَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // فَيَقولُ
      [], // ءَأَنتُم
      [], // أَضلَلتُم
      [], // عِبادى
      [], // هـٰؤُلاءِ
      [], // أَم
      [], // هُم
      [], // ضَلُّوا
      [] // السَّبيلَ
    ],
    [ // آية 18
      [], // قالوا
      [], // سُبحـٰنَكَ
      [], // ما
      [], // كانَ
      [], // يَنبَغى
      [], // لَنا
      [], // أَن
      [], // نَتَّخِذَ
      [], // مِن
      [], // دونِكَ
      [], // مِن
      [], // أَولِياءَ
      [], // وَلـٰكِن
      [], // مَتَّعتَهُم
      [], // وَءاباءَهُم
      [], // حَتّىٰ
      ["نسوا الذكر : غفلوا عن دلائل الوحدانية"], // نَسُوا
      ["نسوا الذكر : غفلوا عن دلائل الوحدانية"], // الذِّكرَ
      [], // وَكانوا
      ["قوما بورا : هالكين . أو فاسدين"], // قَومًا
      ["قوما بورا : هالكين . أو فاسدين"] // بورًا
    ],
    [ // آية 19
      [], // فَقَد
      [], // كَذَّبوكُم
      [], // بِما
      [], // تَقولونَ
      [], // فَما
      [], // تَستَطيعونَ
      ["صرفا : دفعا للعذاب عن أنفسكم"], // صَرفًا
      [], // وَلا
      [], // نَصرًا
      [], // وَمَن
      [], // يَظلِم
      [], // مِنكُم
      [], // نُذِقهُ
      [], // عَذابًا
      [] // كَبيرًا
    ],
    [ // آية 20
      [], // وَما
      [], // أَرسَلنا
      [], // قَبلَكَ
      [], // مِنَ
      [], // المُرسَلينَ
      [], // إِلّا
      [], // إِنَّهُم
      [], // لَيَأكُلونَ
      [], // الطَّعامَ
      [], // وَيَمشونَ
      [], // فِى
      [], // الأَسواقِ
      [], // وَجَعَلنا
      [], // بَعضَكُم
      [], // لِبَعضٍ
      ["فتنة : ابتلاء و محنة"], // فِتنَةً
      [], // أَتَصبِرونَ
      [], // وَكانَ
      [], // رَبُّكَ
      [] // بَصيرًا
    ],
    [ // آية 21
      [], // وَقالَ
      [], // الَّذينَ
      [], // لا
      [], // يَرجونَ
      [], // لِقاءَنا
      [], // لَولا
      [], // أُنزِلَ
      [], // عَلَينَا
      [], // المَلـٰئِكَةُ
      [], // أَو
      [], // نَرىٰ
      [], // رَبَّنا
      [], // لَقَدِ
      [], // استَكبَروا
      [], // فى
      [], // أَنفُسِهِم
      [], // وَعَتَو
      [], // عُتُوًّا
      [] // كَبيرًا
    ],
    [ // آية 22
      [], // يَومَ
      [], // يَرَونَ
      [], // المَلـٰئِكَةَ
      [], // لا
      [], // بُشرىٰ
      [], // يَومَئِذٍ
      [], // لِلمُجرِمينَ
      [], // وَيَقولونَ
      ["حجرا محجورا : حراما محرّما عليكم البُشرى"], // حِجرًا
      ["حجرا محجورا : حراما محرّما عليكم البُشرى"] // مَحجورًا
    ],
    [ // آية 23
      [], // وَقَدِمنا
      [], // إِلىٰ
      [], // ما
      [], // عَمِلوا
      [], // مِن
      [], // عَمَلٍ
      [], // فَجَعَلنـٰهُ
      ["هباءً : كالهباء ( ما يُرى في الكُوى مع ضوء الشمس كالغبار)"], // هَباءً
      ["منثورا : مفرّقا ذاهبا"] // مَنثورًا
    ],
    [ // آية 24
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // يَومَئِذٍ
      [], // خَيرٌ
      [], // مُستَقَرًّا
      [], // وَأَحسَنُ
      ["مقيلا : مكان استرواح و تمتّع ظهيرة"] // مَقيلًا
    ],
    [ // آية 25
      [], // وَيَومَ
      ["تشقّق السّماء : تتفتح السموات"], // تَشَقَّقُ
      ["تشقّق السّماء : تتفتح السموات"], // السَّماءُ
      [], // بِالغَمـٰمِ
      [], // وَنُزِّلَ
      [], // المَلـٰئِكَةُ
      [] // تَنزيلًا
    ],
    [ // آية 26
      [], // المُلكُ
      [], // يَومَئِذٍ
      [], // الحَقُّ
      [], // لِلرَّحمـٰنِ
      [], // وَكانَ
      [], // يَومًا
      [], // عَلَى
      [], // الكـٰفِرينَ
      [] // عَسيرًا
    ],
    [ // آية 27
      [], // وَيَومَ
      [], // يَعَضُّ
      [], // الظّالِمُ
      [], // عَلىٰ
      [], // يَدَيهِ
      [], // يَقولُ
      [], // يـٰلَيتَنِى
      [], // اتَّخَذتُ
      [], // مَعَ
      [], // الرَّسولِ
      ["سبيلا : طريقا إلى الهدى أو إلى النجاة"] // سَبيلًا
    ],
    [ // آية 28
      [], // يـٰوَيلَتىٰ
      [], // لَيتَنى
      [], // لَم
      [], // أَتَّخِذ
      [], // فُلانًا
      [] // خَليلًا
    ],
    [ // آية 29
      [], // لَقَد
      [], // أَضَلَّنى
      [], // عَنِ
      [], // الذِّكرِ
      [], // بَعدَ
      [], // إِذ
      [], // جاءَنى
      [], // وَكانَ
      [], // الشَّيطـٰنُ
      [], // لِلإِنسـٰنِ
      [] // خَذولًا
    ],
    [ // آية 30
      [], // وَقالَ
      [], // الرَّسولُ
      [], // يـٰرَبِّ
      [], // إِنَّ
      [], // قَومِى
      [], // اتَّخَذوا
      [], // هـٰذَا
      [], // القُرءانَ
      ["مهجورا : متروكا مهملا"] // مَهجورًا
    ],
    [ // آية 31
      [], // وَكَذٰلِكَ
      [], // جَعَلنا
      [], // لِكُلِّ
      [], // نَبِىٍّ
      [], // عَدُوًّا
      [], // مِنَ
      [], // المُجرِمينَ
      [], // وَكَفىٰ
      [], // بِرَبِّكَ
      [], // هادِيًا
      [] // وَنَصيرًا
    ],
    [ // آية 32
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَولا
      [], // نُزِّلَ
      [], // عَلَيهِ
      [], // القُرءانُ
      [], // جُملَةً
      [], // وٰحِدَةً
      [], // كَذٰلِكَ
      [], // لِنُثَبِّتَ
      [], // بِهِ
      [], // فُؤادَكَ
      [], // وَرَتَّلنـٰهُ
      [] // تَرتيلًا
    ],
    [ // آية 33
      [], // وَلا
      [], // يَأتونَكَ
      [], // بِمَثَلٍ
      [], // إِلّا
      [], // جِئنـٰكَ
      [], // بِالحَقِّ
      [], // وَأَحسَنَ
      [] // تَفسيرًا
    ],
    [ // آية 34
      [], // الَّذينَ
      [], // يُحشَرونَ
      [], // عَلىٰ
      [], // وُجوهِهِم
      [], // إِلىٰ
      [], // جَهَنَّمَ
      [], // أُولـٰئِكَ
      [], // شَرٌّ
      [], // مَكانًا
      [], // وَأَضَلُّ
      [] // سَبيلًا
    ],
    [ // آية 35
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // وَجَعَلنا
      [], // مَعَهُ
      [], // أَخاهُ
      [], // هـٰرونَ
      [] // وَزيرًا
    ],
    [ // آية 36
      [], // فَقُلنَا
      [], // اذهَبا
      [], // إِلَى
      [], // القَومِ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // فَدَمَّرنـٰهُم
      [] // تَدميرًا
    ],
    [ // آية 37
      [], // وَقَومَ
      [], // نوحٍ
      [], // لَمّا
      [], // كَذَّبُوا
      [], // الرُّسُلَ
      [], // أَغرَقنـٰهُم
      [], // وَجَعَلنـٰهُم
      [], // لِلنّاسِ
      [], // ءايَةً
      [], // وَأَعتَدنا
      [], // لِلظّـٰلِمينَ
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 38
      [], // وَعادًا
      [], // وَثَمودَا۟
      [], // وَأَصحـٰبَ
      [], // الرَّسِّ
      [], // وَقُرونًا
      [], // بَينَ
      [], // ذٰلِكَ
      [] // كَثيرًا
    ],
    [ // آية 39
      [], // وَكُلًّا
      [], // ضَرَبنا
      [], // لَهُ
      [], // الأَمثـٰلَ
      [], // وَكُلًّا
      [], // تَبَّرنا
      [] // تَتبيرًا
    ],
    [ // آية 40
      [], // وَلَقَد
      [], // أَتَوا
      [], // عَلَى
      [], // القَريَةِ
      [], // الَّتى
      [], // أُمطِرَت
      ["مطر السّوء : حجارة من السماء مهلكة"], // مَطَرَ
      ["مطر السّوء : حجارة من السماء مهلكة"], // السَّوءِ
      [], // أَفَلَم
      [], // يَكونوا
      [], // يَرَونَها
      [], // بَل
      [], // كانوا
      ["لا يرجون نشورا : لا يتوقّعون بعثا بل ينكرونه"], // لا
      ["لا يرجون نشورا : لا يتوقّعون بعثا بل ينكرونه"], // يَرجونَ
      ["لا يرجون نشورا : لا يتوقّعون بعثا بل ينكرونه"] // نُشورًا
    ],
    [ // آية 41
      [], // وَإِذا
      [], // رَأَوكَ
      [], // إِن
      [], // يَتَّخِذونَكَ
      [], // إِلّا
      ["هزوا : مهزوءً به"], // هُزُوًا
      [], // أَهـٰذَا
      [], // الَّذى
      [], // بَعَثَ
      [], // اللَّهُ
      [] // رَسولًا
    ],
    [ // آية 42
      [], // إِن
      [], // كادَ
      [], // لَيُضِلُّنا
      [], // عَن
      [], // ءالِهَتِنا
      [], // لَولا
      [], // أَن
      [], // صَبَرنا
      [], // عَلَيها
      [], // وَسَوفَ
      [], // يَعلَمونَ
      [], // حينَ
      [], // يَرَونَ
      [], // العَذابَ
      [], // مَن
      [], // أَضَلُّ
      [] // سَبيلًا
    ],
    [ // آية 43
      [], // أَرَءَيتَ
      [], // مَنِ
      [], // اتَّخَذَ
      [], // إِلـٰهَهُ
      [], // هَوىٰهُ
      [], // أَفَأَنتَ
      [], // تَكونُ
      [], // عَلَيهِ
      ["وكيلا : حفيظا تمنعُه من عبادة ما يهواه"] // وَكيلًا
    ],
    [ // آية 44
      [], // أَم
      [], // تَحسَبُ
      [], // أَنَّ
      [], // أَكثَرَهُم
      [], // يَسمَعونَ
      [], // أَو
      [], // يَعقِلونَ
      [], // إِن
      [], // هُم
      [], // إِلّا
      [], // كَالأَنعـٰمِ
      [], // بَل
      [], // هُم
      [], // أَضَلُّ
      [] // سَبيلًا
    ],
    [ // آية 45
      [], // أَلَم
      [], // تَرَ
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // كَيفَ
      ["مدّ الظلّ : بسطه بين الفجر و طلوع الشّمس"], // مَدَّ
      ["مدّ الظلّ : بسطه بين الفجر و طلوع الشّمس"], // الظِّلَّ
      [], // وَلَو
      [], // شاءَ
      [], // لَجَعَلَهُ
      [], // ساكِنًا
      [], // ثُمَّ
      [], // جَعَلنَا
      [], // الشَّمسَ
      [], // عَلَيهِ
      [] // دَليلًا
    ],
    [ // آية 46
      [], // ثُمَّ
      [], // قَبَضنـٰهُ
      [], // إِلَينا
      [], // قَبضًا
      [] // يَسيرًا
    ],
    [ // آية 47
      [], // وَهُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الَّيلَ
      [], // لِباسًا
      [], // وَالنَّومَ
      [], // سُباتًا
      [], // وَجَعَلَ
      ["النهار نشورا : إمبعاثا من النّوم للسعي و العمل"], // النَّهارَ
      ["النهار نشورا : إمبعاثا من النّوم للسعي و العمل"] // نُشورًا
    ],
    [ // آية 48
      [], // وَهُوَ
      [], // الَّذى
      [], // أَرسَلَ
      [], // الرِّيـٰحَ
      [], // بُشرًا
      [], // بَينَ
      [], // يَدَى
      [], // رَحمَتِهِ
      [], // وَأَنزَلنا
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [] // طَهورًا
    ],
    [ // آية 49
      [], // لِنُحـِۧىَ
      [], // بِهِ
      [], // بَلدَةً
      [], // مَيتًا
      [], // وَنُسقِيَهُ
      [], // مِمّا
      [], // خَلَقنا
      [], // أَنعـٰمًا
      [], // وَأَناسِىَّ
      [] // كَثيرًا
    ],
    [ // آية 50
      [], // وَلَقَد
      [], // صَرَّفنـٰهُ
      [], // بَينَهُم
      [], // لِيَذَّكَّروا
      [], // فَأَبىٰ
      [], // أَكثَرُ
      [], // النّاسِ
      [], // إِلّا
      ["كفورا : جحودا و كفرانا بالنّعمة"] // كُفورًا
    ],
    [ // آية 51
      [], // وَلَو
      [], // شِئنا
      [], // لَبَعَثنا
      [], // فى
      [], // كُلِّ
      [], // قَريَةٍ
      [] // نَذيرًا
    ],
    [ // آية 52
      [], // فَلا
      [], // تُطِعِ
      [], // الكـٰفِرينَ
      [], // وَجـٰهِدهُم
      [], // بِهِ
      [], // جِهادًا
      [] // كَبيرًا
    ],
    [ // آية 53
      [], // وَهُوَ
      [], // الَّذى
      ["مرج البحرين : أرسلهما في مجاريهما أو أجراهما"], // مَرَجَ
      ["مرج البحرين : أرسلهما في مجاريهما أو أجراهما"], // البَحرَينِ
      [], // هـٰذا
      ["عذب فرات : حلو شديد العذوبة"], // عَذبٌ
      ["عذب فرات : حلو شديد العذوبة"], // فُراتٌ
      [], // وَهـٰذا
      ["ملح أجاج : شديد الكلوحة و الحرارة أو المرارة"], // مِلحٌ
      ["ملح أجاج : شديد الكلوحة و الحرارة أو المرارة"], // أُجاجٌ
      [], // وَجَعَلَ
      [], // بَينَهُما
      ["برزخا : حاجزا عظيما يمنع اختلاطهما"], // بَرزَخًا
      [], // وَحِجرًا
      [] // مَحجورًا
    ],
    [ // آية 54
      [], // وَهُوَ
      [], // الَّذى
      [], // خَلَقَ
      [], // مِنَ
      [], // الماءِ
      [], // بَشَرًا
      [], // فَجَعَلَهُ
      ["نسبا : ذوي نسب ذكورا يُنسب إليهم"], // نَسَبًا
      [], // وَصِهرًا
      [], // وَكانَ
      [], // رَبُّكَ
      [] // قَديرًا
    ],
    [ // آية 55
      [], // وَيَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَنفَعُهُم
      [], // وَلا
      [], // يَضُرُّهُم
      [], // وَكانَ
      [], // الكافِرُ
      ["على ربّه ظهيرا : مُعينا للشّيطان على ربّه بالشّرك"], // عَلىٰ
      ["على ربّه ظهيرا : مُعينا للشّيطان على ربّه بالشّرك"], // رَبِّهِ
      ["على ربّه ظهيرا : مُعينا للشّيطان على ربّه بالشّرك"] // ظَهيرًا
    ],
    [ // آية 56
      [], // وَما
      [], // أَرسَلنـٰكَ
      [], // إِلّا
      [], // مُبَشِّرًا
      [] // وَنَذيرًا
    ],
    [ // آية 57
      [], // قُل
      [], // ما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِلّا
      [], // مَن
      [], // شاءَ
      [], // أَن
      [], // يَتَّخِذَ
      [], // إِلىٰ
      [], // رَبِّهِ
      [] // سَبيلًا
    ],
    [ // آية 58
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // الحَىِّ
      [], // الَّذى
      [], // لا
      [], // يَموتُ
      [], // وَسَبِّح
      ["بحمده : مُثنيا عليه بأوصاف الكمال"], // بِحَمدِهِ
      [], // وَكَفىٰ
      [], // بِهِ
      [], // بِذُنوبِ
      [], // عِبادِهِ
      [] // خَبيرًا
    ],
    [ // آية 59
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // ثُمَّ
      ["استوى على العرش : إستواء يليق بكماله تعالى"], // استَوىٰ
      ["استوى على العرش : إستواء يليق بكماله تعالى"], // عَلَى
      ["استوى على العرش : إستواء يليق بكماله تعالى"], // العَرشِ
      [], // الرَّحمـٰنُ
      [], // فَسـَٔل
      [], // بِهِ
      [] // خَبيرًا
    ],
    [ // آية 60
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُمُ
      [], // اسجُدوا
      [], // لِلرَّحمـٰنِ
      [], // قالوا
      [], // وَمَا
      [], // الرَّحمـٰنُ
      [], // أَنَسجُدُ
      [], // لِما
      [], // تَأمُرُنا
      [], // وَزادَهُم
      [] // نُفورًا
    ],
    [ // آية 61
      [], // تَبارَكَ
      [], // الَّذى
      [], // جَعَلَ
      [], // فِى
      [], // السَّماءِ
      ["بروجا : منازل للكواكب السّيارة"], // بُروجًا
      [], // وَجَعَلَ
      [], // فيها
      [], // سِرٰجًا
      [], // وَقَمَرًا
      [] // مُنيرًا
    ],
    [ // آية 62
      [], // وَهُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // خِلفَةً
      [], // لِمَن
      [], // أَرادَ
      [], // أَن
      [], // يَذَّكَّرَ
      [], // أَو
      [], // أَرادَ
      [] // شُكورًا
    ],
    [ // آية 63
      [], // وَعِبادُ
      [], // الرَّحمـٰنِ
      [], // الَّذينَ
      [], // يَمشونَ
      [], // عَلَى
      [], // الأَرضِ
      ["هونا : بسكينة و وقار و تواضع"], // هَونًا
      [], // وَإِذا
      [], // خاطَبَهُمُ
      [], // الجـٰهِلونَ
      [], // قالوا
      [] // سَلـٰمًا
    ],
    [ // آية 64
      [], // وَالَّذينَ
      [], // يَبيتونَ
      [], // لِرَبِّهِم
      [], // سُجَّدًا
      [] // وَقِيـٰمًا
    ],
    [ // آية 65
      [], // وَالَّذينَ
      [], // يَقولونَ
      [], // رَبَّنَا
      [], // اصرِف
      [], // عَنّا
      [], // عَذابَ
      [], // جَهَنَّمَ
      [], // إِنَّ
      [], // عَذابَها
      ["كان غراما : لازما أو ممتدّا ، كلزوم الغريم"], // كانَ
      ["كان غراما : لازما أو ممتدّا ، كلزوم الغريم"] // غَرامًا
    ],
    [ // آية 66
      [], // إِنَّها
      [], // ساءَت
      [], // مُستَقَرًّا
      [] // وَمُقامًا
    ],
    [ // آية 67
      [], // وَالَّذينَ
      [], // إِذا
      [], // أَنفَقوا
      [], // لَم
      [], // يُسرِفوا
      [], // وَلَم
      [], // يَقتُروا
      [], // وَكانَ
      [], // بَينَ
      [], // ذٰلِكَ
      ["قواما : عدلا وسطا بين الطّرفين"] // قَوامًا
    ],
    [ // آية 68
      [], // وَالَّذينَ
      [], // لا
      [], // يَدعونَ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // وَلا
      [], // يَقتُلونَ
      [], // النَّفسَ
      [], // الَّتى
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَلا
      [], // يَزنونَ
      [], // وَمَن
      [], // يَفعَل
      [], // ذٰلِكَ
      [], // يَلقَ
      [] // أَثامًا
    ],
    [ // آية 69
      [], // يُضـٰعَف
      [], // لَهُ
      [], // العَذابُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَيَخلُد
      [], // فيهِ
      [] // مُهانًا
    ],
    [ // آية 70
      [], // إِلّا
      [], // مَن
      [], // تابَ
      [], // وَءامَنَ
      [], // وَعَمِلَ
      [], // عَمَلًا
      [], // صـٰلِحًا
      [], // فَأُولـٰئِكَ
      [], // يُبَدِّلُ
      [], // اللَّهُ
      [], // سَيِّـٔاتِهِم
      [], // حَسَنـٰتٍ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 71
      [], // وَمَن
      [], // تابَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // فَإِنَّهُ
      [], // يَتوبُ
      [], // إِلَى
      [], // اللَّهِ
      [] // مَتابًا
    ],
    [ // آية 72
      [], // وَالَّذينَ
      [], // لا
      [], // يَشهَدونَ
      [], // الزّورَ
      [], // وَإِذا
      ["مرّوا باللغو : بما ينبغي أن يُلغى و يُطرح"], // مَرّوا
      ["مرّوا باللغو : بما ينبغي أن يُلغى و يُطرح"], // بِاللَّغوِ
      ["مرّوا كراما : مُكرمين أنفسهم بالإعراض عنه"], // مَرّوا
      ["مرّوا كراما : مُكرمين أنفسهم بالإعراض عنه"] // كِرامًا
    ],
    [ // آية 73
      [], // وَالَّذينَ
      [], // إِذا
      [], // ذُكِّروا
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      ["لم يخروا : لم يسقطوا و لم يقعوا"], // لَم
      ["لم يخروا : لم يسقطوا و لم يقعوا"], // يَخِرّوا
      [], // عَلَيها
      [], // صُمًّا
      [] // وَعُميانًا
    ],
    [ // آية 74
      [], // وَالَّذينَ
      [], // يَقولونَ
      [], // رَبَّنا
      [], // هَب
      [], // لَنا
      [], // مِن
      [], // أَزوٰجِنا
      [], // وَذُرِّيّـٰتِنا
      ["قرّة أعين : مسرّة و فرحا"], // قُرَّةَ
      ["قرّة أعين : مسرّة و فرحا"], // أَعيُنٍ
      [], // وَاجعَلنا
      [], // لِلمُتَّقينَ
      ["إماما : قدوة و حجّة أو أئمّة"] // إِمامًا
    ],
    [ // آية 75
      [], // أُولـٰئِكَ
      ["يُجزون الغرفة : أعلى منازل الجنّة و أفضلها"], // يُجزَونَ
      ["يُجزون الغرفة : أعلى منازل الجنّة و أفضلها"], // الغُرفَةَ
      [], // بِما
      [], // صَبَروا
      [], // وَيُلَقَّونَ
      [], // فيها
      [], // تَحِيَّةً
      [] // وَسَلـٰمًا
    ],
    [ // آية 76
      [], // خـٰلِدينَ
      [], // فيها
      [], // حَسُنَت
      [], // مُستَقَرًّا
      [] // وَمُقامًا
    ],
    [ // آية 77
      [], // قُل
      [], // ما
      [], // يَعبَؤُا۟
      [], // بِكُم
      [], // رَبّى
      [], // لَولا
      ["دعاؤكم : عبادتكم له تعالى"], // دُعاؤُكُم
      [], // فَقَد
      [], // كَذَّبتُم
      [], // فَسَوفَ
      ["يكون لزاما : يكون جزاء تكذيبكم عذابا دائما مُلازما لكم"], // يَكونُ
      ["يكون لزاما : يكون جزاء تكذيبكم عذابا دائما مُلازما لكم"] // لِزامًا
    ]
];

export default meanings;