const meanings = [
  [ // سورة 26: الشعراء
[ // آية 1
      [] // طسم
    ],
    [ // آية 2
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [] // المُبينِ
    ],
    [ // آية 3
      [], // لَعَلَّكَ
      [], // بـٰخِعٌ
      [], // نَفسَكَ
      [], // أَلّا
      [], // يَكونوا
      [] // مُؤمِنينَ
    ],
    [ // آية 4
      [], // إِن
      [], // نَشَأ
      [], // نُنَزِّل
      [], // عَلَيهِم
      [], // مِنَ
      [], // السَّماءِ
      [], // ءايَةً
      [], // فَظَلَّت
      [], // أَعنـٰقُهُم
      [], // لَها
      [] // خـٰضِعينَ
    ],
    [ // آية 5
      [], // وَما
      [], // يَأتيهِم
      [], // مِن
      [], // ذِكرٍ
      [], // مِنَ
      [], // الرَّحمـٰنِ
      [], // مُحدَثٍ
      [], // إِلّا
      [], // كانوا
      [], // عَنهُ
      [] // مُعرِضينَ
    ],
    [ // آية 6
      [], // فَقَد
      [], // كَذَّبوا
      [], // فَسَيَأتيهِم
      [], // أَنبـٰؤُا۟
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 7
      [], // أَوَلَم
      [], // يَرَوا
      [], // إِلَى
      [], // الأَرضِ
      [], // كَم
      [], // أَنبَتنا
      [], // فيها
      [], // مِن
      [], // كُلِّ
      ["زوج كريم : صِنفٍ حسن كثير النّــفع"], // زَوجٍ
      ["زوج كريم : صِنفٍ حسن كثير النّــفع"] // كَريمٍ
    ],
    [ // آية 8
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 9
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 10
      [], // وَإِذ
      [], // نادىٰ
      [], // رَبُّكَ
      [], // موسىٰ
      [], // أَنِ
      [], // ائتِ
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 11
      [], // قَومَ
      [], // فِرعَونَ
      [], // أَلا
      [] // يَتَّقونَ
    ],
    [ // آية 12
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      [], // أَخافُ
      [], // أَن
      [] // يُكَذِّبونِ
    ],
    [ // آية 13
      [], // وَيَضيقُ
      [], // صَدرى
      [], // وَلا
      [], // يَنطَلِقُ
      [], // لِسانى
      [], // فَأَرسِل
      [], // إِلىٰ
      [] // هـٰرونَ
    ],
    [ // آية 14
      [], // وَلَهُم
      [], // عَلَىَّ
      [], // ذَنبٌ
      [], // فَأَخافُ
      [], // أَن
      [] // يَقتُلونِ
    ],
    [ // آية 15
      [], // قالَ
      [], // كَلّا
      [], // فَاذهَبا
      [], // بِـٔايـٰتِنا
      [], // إِنّا
      [], // مَعَكُم
      [] // مُستَمِعونَ
    ],
    [ // آية 16
      [], // فَأتِيا
      [], // فِرعَونَ
      [], // فَقولا
      [], // إِنّا
      [], // رَسولُ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 17
      [], // أَن
      [], // أَرسِل
      [], // مَعَنا
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 18
      [], // قالَ
      [], // أَلَم
      [], // نُرَبِّكَ
      [], // فينا
      [], // وَليدًا
      [], // وَلَبِثتَ
      [], // فينا
      [], // مِن
      [], // عُمُرِكَ
      [] // سِنينَ
    ],
    [ // آية 19
      [], // وَفَعَلتَ
      [], // فَعلَتَكَ
      [], // الَّتى
      [], // فَعَلتَ
      [], // وَأَنتَ
      [], // مِنَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 20
      [], // قالَ
      [], // فَعَلتُها
      [], // إِذًا
      [], // وَأَنا۠
      [], // مِنَ
      ["الضّالين : المخطئين لا المتعمّدين"] // الضّالّينَ
    ],
    [ // آية 21
      [], // فَفَرَرتُ
      [], // مِنكُم
      [], // لَمّا
      [], // خِفتُكُم
      [], // فَوَهَبَ
      [], // لى
      [], // رَبّى
      [], // حُكمًا
      [], // وَجَعَلَنى
      [], // مِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 22
      [], // وَتِلكَ
      [], // نِعمَةٌ
      [], // تَمُنُّها
      [], // عَلَىَّ
      [], // أَن
      [], // عَبَّدتَ
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 23
      [], // قالَ
      [], // فِرعَونُ
      [], // وَما
      [], // رَبُّ
      [] // العـٰلَمينَ
    ],
    [ // آية 24
      [], // قالَ
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // إِن
      [], // كُنتُم
      [] // موقِنينَ
    ],
    [ // آية 25
      [], // قالَ
      [], // لِمَن
      [], // حَولَهُ
      [], // أَلا
      [] // تَستَمِعونَ
    ],
    [ // آية 26
      [], // قالَ
      [], // رَبُّكُم
      [], // وَرَبُّ
      [], // ءابائِكُمُ
      [] // الأَوَّلينَ
    ],
    [ // آية 27
      [], // قالَ
      [], // إِنَّ
      [], // رَسولَكُمُ
      [], // الَّذى
      [], // أُرسِلَ
      [], // إِلَيكُم
      [] // لَمَجنونٌ
    ],
    [ // آية 28
      [], // قالَ
      [], // رَبُّ
      [], // المَشرِقِ
      [], // وَالمَغرِبِ
      [], // وَما
      [], // بَينَهُما
      [], // إِن
      [], // كُنتُم
      [] // تَعقِلونَ
    ],
    [ // آية 29
      [], // قالَ
      [], // لَئِنِ
      [], // اتَّخَذتَ
      [], // إِلـٰهًا
      [], // غَيرى
      [], // لَأَجعَلَنَّكَ
      [], // مِنَ
      [] // المَسجونينَ
    ],
    [ // آية 30
      [], // قالَ
      [], // أَوَلَو
      [], // جِئتُكَ
      [], // بِشَىءٍ
      [] // مُبينٍ
    ],
    [ // آية 31
      [], // قالَ
      [], // فَأتِ
      [], // بِهِ
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 32
      [], // فَأَلقىٰ
      [], // عَصاهُ
      [], // فَإِذا
      [], // هِىَ
      [], // ثُعبانٌ
      [] // مُبينٌ
    ],
    [ // آية 33
      [], // وَنَزَعَ
      [], // يَدَهُ
      [], // فَإِذا
      [], // هِىَ
      [], // بَيضاءُ
      [] // لِلنّـٰظِرينَ
    ],
    [ // آية 34
      [], // قالَ
      [], // لِلمَلَإِ
      [], // حَولَهُ
      [], // إِنَّ
      [], // هـٰذا
      [], // لَسـٰحِرٌ
      [] // عَليمٌ
    ],
    [ // آية 35
      [], // يُريدُ
      [], // أَن
      [], // يُخرِجَكُم
      [], // مِن
      [], // أَرضِكُم
      [], // بِسِحرِهِ
      [], // فَماذا
      [] // تَأمُرونَ
    ],
    [ // آية 36
      [], // قالوا
      [], // أَرجِه
      [], // وَأَخاهُ
      [], // وَابعَث
      [], // فِى
      [], // المَدائِنِ
      [] // حـٰشِرينَ
    ],
    [ // آية 37
      [], // يَأتوكَ
      [], // بِكُلِّ
      [], // سَحّارٍ
      [] // عَليمٍ
    ],
    [ // آية 38
      [], // فَجُمِعَ
      [], // السَّحَرَةُ
      [], // لِميقـٰتِ
      [], // يَومٍ
      [] // مَعلومٍ
    ],
    [ // آية 39
      [], // وَقيلَ
      [], // لِلنّاسِ
      ["هل أنتم مجتمعون : حثّ على الإجتماع و استعجالٌ له"], // هَل
      ["هل أنتم مجتمعون : حثّ على الإجتماع و استعجالٌ له"], // أَنتُم
      ["هل أنتم مجتمعون : حثّ على الإجتماع و استعجالٌ له"] // مُجتَمِعونَ
    ],
    [ // آية 40
      [], // لَعَلَّنا
      [], // نَتَّبِعُ
      [], // السَّحَرَةَ
      [], // إِن
      [], // كانوا
      [], // هُمُ
      [] // الغـٰلِبينَ
    ],
    [ // آية 41
      [], // فَلَمّا
      [], // جاءَ
      [], // السَّحَرَةُ
      [], // قالوا
      [], // لِفِرعَونَ
      [], // أَئِنَّ
      [], // لَنا
      [], // لَأَجرًا
      [], // إِن
      [], // كُنّا
      [], // نَحنُ
      [] // الغـٰلِبينَ
    ],
    [ // آية 42
      [], // قالَ
      [], // نَعَم
      [], // وَإِنَّكُم
      [], // إِذًا
      [], // لَمِنَ
      [] // المُقَرَّبينَ
    ],
    [ // آية 43
      [], // قالَ
      [], // لَهُم
      [], // موسىٰ
      [], // أَلقوا
      [], // ما
      [], // أَنتُم
      [] // مُلقونَ
    ],
    [ // آية 44
      [], // فَأَلقَوا
      [], // حِبالَهُم
      [], // وَعِصِيَّهُم
      [], // وَقالوا
      ["بعزّة فرعون : بقوّته و عظمته"], // بِعِزَّةِ
      ["بعزّة فرعون : بقوّته و عظمته"], // فِرعَونَ
      [], // إِنّا
      [], // لَنَحنُ
      [] // الغـٰلِبونَ
    ],
    [ // آية 45
      [], // فَأَلقىٰ
      [], // موسىٰ
      [], // عَصاهُ
      [], // فَإِذا
      [], // هِىَ
      ["تلقف : تبتلِع بسرعة"], // تَلقَفُ
      ["ما يأفكون : ما يقلبونه عن وجهه بالتـّمْـويه"], // ما
      ["ما يأفكون : ما يقلبونه عن وجهه بالتـّمْـويه"] // يَأفِكونَ
    ],
    [ // آية 46
      [], // فَأُلقِىَ
      [], // السَّحَرَةُ
      [] // سـٰجِدينَ
    ],
    [ // آية 47
      [], // قالوا
      [], // ءامَنّا
      [], // بِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 48
      [], // رَبِّ
      [], // موسىٰ
      [] // وَهـٰرونَ
    ],
    [ // آية 49
      [], // قالَ
      [], // ءامَنتُم
      [], // لَهُ
      [], // قَبلَ
      [], // أَن
      [], // ءاذَنَ
      [], // لَكُم
      [], // إِنَّهُ
      [], // لَكَبيرُكُمُ
      [], // الَّذى
      [], // عَلَّمَكُمُ
      [], // السِّحرَ
      [], // فَلَسَوفَ
      [], // تَعلَمونَ
      [], // لَأُقَطِّعَنَّ
      [], // أَيدِيَكُم
      [], // وَأَرجُلَكُم
      [], // مِن
      [], // خِلـٰفٍ
      [], // وَلَأُصَلِّبَنَّكُم
      [] // أَجمَعينَ
    ],
    [ // آية 50
      [], // قالوا
      [], // لا
      [], // ضَيرَ
      [], // إِنّا
      [], // إِلىٰ
      [], // رَبِّنا
      [] // مُنقَلِبونَ
    ],
    [ // آية 51
      [], // إِنّا
      [], // نَطمَعُ
      [], // أَن
      [], // يَغفِرَ
      [], // لَنا
      [], // رَبُّنا
      [], // خَطـٰيـٰنا
      [], // أَن
      [], // كُنّا
      [], // أَوَّلَ
      [] // المُؤمِنينَ
    ],
    [ // آية 52
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // أَن
      [], // أَسرِ
      [], // بِعِبادى
      [], // إِنَّكُم
      [] // مُتَّبَعونَ
    ],
    [ // آية 53
      [], // فَأَرسَلَ
      [], // فِرعَونُ
      [], // فِى
      [], // المَدائِنِ
      [] // حـٰشِرينَ
    ],
    [ // آية 54
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      ["لشرذمة : لطائفة قليلة بالنّسبة إلينا"], // لَشِرذِمَةٌ
      [] // قَليلونَ
    ],
    [ // آية 55
      [], // وَإِنَّهُم
      [], // لَنا
      [] // لَغائِظونَ
    ],
    [ // آية 56
      [], // وَإِنّا
      [], // لَجَميعٌ
      [] // حـٰذِرونَ
    ],
    [ // آية 57
      [], // فَأَخرَجنـٰهُم
      [], // مِن
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 58
      [], // وَكُنوزٍ
      [], // وَمَقامٍ
      [] // كَريمٍ
    ],
    [ // آية 59
      [], // كَذٰلِكَ
      [], // وَأَورَثنـٰها
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 60
      [], // فَأَتبَعوهُم
      ["مشرقين : داخلين في وقت الشّروق"] // مُشرِقينَ
    ],
    [ // آية 61
      [], // فَلَمّا
      [], // تَرٰءَا
      [], // الجَمعانِ
      [], // قالَ
      [], // أَصحـٰبُ
      [], // موسىٰ
      [], // إِنّا
      [] // لَمُدرَكونَ
    ],
    [ // آية 62
      [], // قالَ
      [], // كَلّا
      [], // إِنَّ
      [], // مَعِىَ
      [], // رَبّى
      [] // سَيَهدينِ
    ],
    [ // آية 63
      [], // فَأَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // أَنِ
      [], // اضرِب
      [], // بِعَصاكَ
      [], // البَحرَ
      [], // فَانفَلَقَ
      [], // فَكانَ
      [], // كُلُّ
      ["فرق : قطعة من البحر مُرتقعة"], // فِرقٍ
      ["كالطّود العظيم : كالجبل المُنطاد في السماء"], // كَالطَّودِ
      ["كالطّود العظيم : كالجبل المُنطاد في السماء"] // العَظيمِ
    ],
    [ // آية 64
      [], // وَأَزلَفنا
      [], // ثَمَّ
      [] // الـٔاخَرينَ
    ],
    [ // آية 65
      [], // وَأَنجَينا
      [], // موسىٰ
      [], // وَمَن
      [], // مَعَهُ
      [] // أَجمَعينَ
    ],
    [ // آية 66
      [], // ثُمَّ
      [], // أَغرَقنَا
      [] // الـٔاخَرينَ
    ],
    [ // آية 67
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 68
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 69
      [], // وَاتلُ
      [], // عَلَيهِم
      [], // نَبَأَ
      [] // إِبرٰهيمَ
    ],
    [ // آية 70
      [], // إِذ
      [], // قالَ
      [], // لِأَبيهِ
      [], // وَقَومِهِ
      [], // ما
      [] // تَعبُدونَ
    ],
    [ // آية 71
      [], // قالوا
      [], // نَعبُدُ
      [], // أَصنامًا
      [], // فَنَظَلُّ
      [], // لَها
      [] // عـٰكِفينَ
    ],
    [ // آية 72
      [], // قالَ
      [], // هَل
      [], // يَسمَعونَكُم
      [], // إِذ
      [] // تَدعونَ
    ],
    [ // آية 73
      [], // أَو
      [], // يَنفَعونَكُم
      [], // أَو
      [] // يَضُرّونَ
    ],
    [ // آية 74
      [], // قالوا
      [], // بَل
      [], // وَجَدنا
      [], // ءاباءَنا
      [], // كَذٰلِكَ
      [] // يَفعَلونَ
    ],
    [ // آية 75
      [], // قالَ
      [], // أَفَرَءَيتُم
      [], // ما
      [], // كُنتُم
      [] // تَعبُدونَ
    ],
    [ // آية 76
      [], // أَنتُم
      [], // وَءاباؤُكُمُ
      [] // الأَقدَمونَ
    ],
    [ // آية 77
      [], // فَإِنَّهُم
      [], // عَدُوٌّ
      [], // لى
      [], // إِلّا
      [], // رَبَّ
      [] // العـٰلَمينَ
    ],
    [ // آية 78
      [], // الَّذى
      [], // خَلَقَنى
      [], // فَهُوَ
      [] // يَهدينِ
    ],
    [ // آية 79
      [], // وَالَّذى
      [], // هُوَ
      [], // يُطعِمُنى
      [] // وَيَسقينِ
    ],
    [ // آية 80
      [], // وَإِذا
      [], // مَرِضتُ
      [], // فَهُوَ
      [] // يَشفينِ
    ],
    [ // آية 81
      [], // وَالَّذى
      [], // يُميتُنى
      [], // ثُمَّ
      [] // يُحيينِ
    ],
    [ // آية 82
      [], // وَالَّذى
      [], // أَطمَعُ
      [], // أَن
      [], // يَغفِرَ
      [], // لى
      [], // خَطيـَٔتى
      [], // يَومَ
      [] // الدّينِ
    ],
    [ // آية 83
      [], // رَبِّ
      [], // هَب
      [], // لى
      [], // حُكمًا
      [], // وَأَلحِقنى
      [] // بِالصّـٰلِحينَ
    ],
    [ // آية 84
      [], // وَاجعَل
      [], // لى
      ["لسان صدق : ثناءً حسنا و ذكرا جميلا"], // لِسانَ
      ["لسان صدق : ثناءً حسنا و ذكرا جميلا"], // صِدقٍ
      [], // فِى
      [] // الـٔاخِرينَ
    ],
    [ // آية 85
      [], // وَاجعَلنى
      [], // مِن
      [], // وَرَثَةِ
      [], // جَنَّةِ
      [] // النَّعيمِ
    ],
    [ // آية 86
      [], // وَاغفِر
      [], // لِأَبى
      [], // إِنَّهُ
      [], // كانَ
      [], // مِنَ
      [] // الضّالّينَ
    ],
    [ // آية 87
      [], // وَلا
      [], // تُخزِنى
      [], // يَومَ
      [] // يُبعَثونَ
    ],
    [ // آية 88
      [], // يَومَ
      [], // لا
      [], // يَنفَعُ
      [], // مالٌ
      [], // وَلا
      [] // بَنونَ
    ],
    [ // آية 89
      [], // إِلّا
      [], // مَن
      [], // أَتَى
      [], // اللَّهَ
      ["بقلب سليم : بريء من مرض النفاق و الكفر"], // بِقَلبٍ
      ["بقلب سليم : بريء من مرض النفاق و الكفر"] // سَليمٍ
    ],
    [ // آية 90
      [], // وَأُزلِفَتِ
      [], // الجَنَّةُ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 91
      [], // وَبُرِّزَتِ
      [], // الجَحيمُ
      ["للغاوين : الضّالين عن طريق الحقّ"] // لِلغاوينَ
    ],
    [ // آية 92
      [], // وَقيلَ
      [], // لَهُم
      [], // أَينَ
      [], // ما
      [], // كُنتُم
      [] // تَعبُدونَ
    ],
    [ // آية 93
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // هَل
      [], // يَنصُرونَكُم
      [], // أَو
      [] // يَنتَصِرونَ
    ],
    [ // آية 94
      ["فكبكبوا : فأُلقي الأصنام على وجوههم مرارا"], // فَكُبكِبوا
      [], // فيها
      [], // هُم
      [] // وَالغاوۥنَ
    ],
    [ // آية 95
      [], // وَجُنودُ
      [], // إِبليسَ
      [] // أَجمَعونَ
    ],
    [ // آية 96
      [], // قالوا
      [], // وَهُم
      [], // فيها
      [] // يَختَصِمونَ
    ],
    [ // آية 97
      [], // تَاللَّهِ
      [], // إِن
      [], // كُنّا
      [], // لَفى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 98
      [], // إِذ
      [], // نُسَوّيكُم
      [], // بِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 99
      [], // وَما
      [], // أَضَلَّنا
      [], // إِلَّا
      [] // المُجرِمونَ
    ],
    [ // آية 100
      [], // فَما
      [], // لَنا
      [], // مِن
      [] // شـٰفِعينَ
    ],
    [ // آية 101
      [], // وَلا
      [], // صَديقٍ
      ["حميم : قريب أو شفيق يهتمّ بأمرنا"] // حَميمٍ
    ],
    [ // آية 102
      [], // فَلَو
      [], // أَنَّ
      [], // لَنا
      ["كرّة : رجعة إلى الدنيا"], // كَرَّةً
      [], // فَنَكونَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 103
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 104
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 105
      [], // كَذَّبَت
      [], // قَومُ
      [], // نوحٍ
      [] // المُرسَلينَ
    ],
    [ // آية 106
      [], // إِذ
      [], // قالَ
      [], // لَهُم
      [], // أَخوهُم
      [], // نوحٌ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 107
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 108
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 109
      [], // وَما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 110
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 111
      [], // قالوا
      [], // أَنُؤمِنُ
      [], // لَكَ
      [], // وَاتَّبَعَكَ
      [] // الأَرذَلونَ
    ],
    [ // آية 112
      [], // قالَ
      [], // وَما
      [], // عِلمى
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 113
      [], // إِن
      [], // حِسابُهُم
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبّى
      [], // لَو
      [] // تَشعُرونَ
    ],
    [ // آية 114
      [], // وَما
      [], // أَنا۠
      [], // بِطارِدِ
      [] // المُؤمِنينَ
    ],
    [ // آية 115
      [], // إِن
      [], // أَنا۠
      [], // إِلّا
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 116
      [], // قالوا
      [], // لَئِن
      [], // لَم
      [], // تَنتَهِ
      [], // يـٰنوحُ
      [], // لَتَكونَنَّ
      [], // مِنَ
      [] // المَرجومينَ
    ],
    [ // آية 117
      [], // قالَ
      [], // رَبِّ
      [], // إِنَّ
      [], // قَومى
      [] // كَذَّبونِ
    ],
    [ // آية 118
      ["فافتح : فاحكم"], // فَافتَح
      [], // بَينى
      [], // وَبَينَهُم
      [], // فَتحًا
      [], // وَنَجِّنى
      [], // وَمَن
      [], // مَعِىَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 119
      [], // فَأَنجَينـٰهُ
      [], // وَمَن
      [], // مَعَهُ
      [], // فِى
      [], // الفُلكِ
      ["المشحون : المملوء بالناس و الدوابّ و المتاع"] // المَشحونِ
    ],
    [ // آية 120
      [], // ثُمَّ
      [], // أَغرَقنا
      [], // بَعدُ
      [] // الباقينَ
    ],
    [ // آية 121
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 122
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 123
      [], // كَذَّبَت
      [], // عادٌ
      [] // المُرسَلينَ
    ],
    [ // آية 124
      [], // إِذ
      [], // قالَ
      [], // لَهُم
      [], // أَخوهُم
      [], // هودٌ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 125
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 126
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 127
      [], // وَما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 128
      [], // أَتَبنونَ
      [], // بِكُلِّ
      ["ريع : طريق . أو مكان مرتفع"], // ريعٍ
      [], // ءايَةً
      ["تعبثون : ببنائها . أو بمن يمرّ بها"] // تَعبَثونَ
    ],
    [ // آية 129
      [], // وَتَتَّخِذونَ
      ["مصانع : حصونا أو قصورا أو حِياضا للماء"], // مَصانِعَ
      [], // لَعَلَّكُم
      [] // تَخلُدونَ
    ],
    [ // آية 130
      [], // وَإِذا
      [], // بَطَشتُم
      [], // بَطَشتُم
      [] // جَبّارينَ
    ],
    [ // آية 131
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 132
      [], // وَاتَّقُوا
      [], // الَّذى
      ["أمدّكم : أنعم عليكم"], // أَمَدَّكُم
      [], // بِما
      [] // تَعلَمونَ
    ],
    [ // آية 133
      [], // أَمَدَّكُم
      [], // بِأَنعـٰمٍ
      [] // وَبَنينَ
    ],
    [ // آية 134
      [], // وَجَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 135
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 136
      [], // قالوا
      [], // سَواءٌ
      [], // عَلَينا
      [], // أَوَعَظتَ
      [], // أَم
      [], // لَم
      [], // تَكُن
      [], // مِنَ
      [] // الوٰعِظينَ
    ],
    [ // آية 137
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      ["خلُق الأولين : عادتهم في اعتقاد أن لا بعث"], // خُلُقُ
      ["خلُق الأولين : عادتهم في اعتقاد أن لا بعث"] // الأَوَّلينَ
    ],
    [ // آية 138
      [], // وَما
      [], // نَحنُ
      [] // بِمُعَذَّبينَ
    ],
    [ // آية 139
      [], // فَكَذَّبوهُ
      [], // فَأَهلَكنـٰهُم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 140
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 141
      [], // كَذَّبَت
      [], // ثَمودُ
      [] // المُرسَلينَ
    ],
    [ // آية 142
      [], // إِذ
      [], // قالَ
      [], // لَهُم
      [], // أَخوهُم
      [], // صـٰلِحٌ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 143
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 144
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 145
      [], // وَما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 146
      [], // أَتُترَكونَ
      [], // فى
      [], // ما
      [], // هـٰهُنا
      [] // ءامِنينَ
    ],
    [ // آية 147
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 148
      [], // وَزُروعٍ
      [], // وَنَخلٍ
      ["طلعها : ثمرُها الذي يؤول إليه الطّـلْـع"], // طَلعُها
      ["هضيم : رُطب نضيج أو متدلّ لكثرته"] // هَضيمٌ
    ],
    [ // آية 149
      [], // وَتَنحِتونَ
      [], // مِنَ
      [], // الجِبالِ
      [], // بُيوتًا
      [] // فـٰرِهينَ
    ],
    [ // آية 150
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 151
      [], // وَلا
      [], // تُطيعوا
      [], // أَمرَ
      [] // المُسرِفينَ
    ],
    [ // آية 152
      [], // الَّذينَ
      [], // يُفسِدونَ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [] // يُصلِحونَ
    ],
    [ // آية 153
      [], // قالوا
      [], // إِنَّما
      [], // أَنتَ
      ["من المسحّرين : المغلوب على عقولهم بكثرة السّحر"], // مِنَ
      ["من المسحّرين : المغلوب على عقولهم بكثرة السّحر"] // المُسَحَّرينَ
    ],
    [ // آية 154
      [], // ما
      [], // أَنتَ
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُنا
      [], // فَأتِ
      [], // بِـٔايَةٍ
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 155
      [], // قالَ
      [], // هـٰذِهِ
      [], // ناقَةٌ
      ["لها شرب : نصيب مشروب من الماء"], // لَها
      ["لها شرب : نصيب مشروب من الماء"], // شِربٌ
      [], // وَلَكُم
      [], // شِربُ
      [], // يَومٍ
      [] // مَعلومٍ
    ],
    [ // آية 156
      [], // وَلا
      [], // تَمَسّوها
      [], // بِسوءٍ
      [], // فَيَأخُذَكُم
      [], // عَذابُ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 157
      [], // فَعَقَروها
      [], // فَأَصبَحوا
      [] // نـٰدِمينَ
    ],
    [ // آية 158
      [], // فَأَخَذَهُمُ
      [], // العَذابُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 159
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 160
      [], // كَذَّبَت
      [], // قَومُ
      [], // لوطٍ
      [] // المُرسَلينَ
    ],
    [ // آية 161
      [], // إِذ
      [], // قالَ
      [], // لَهُم
      [], // أَخوهُم
      [], // لوطٌ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 162
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 163
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 164
      [], // وَما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 165
      [], // أَتَأتونَ
      [], // الذُّكرانَ
      [], // مِنَ
      [] // العـٰلَمينَ
    ],
    [ // آية 166
      [], // وَتَذَرونَ
      [], // ما
      [], // خَلَقَ
      [], // لَكُم
      [], // رَبُّكُم
      [], // مِن
      [], // أَزوٰجِكُم
      [], // بَل
      [], // أَنتُم
      ["قوم عادون : متجاوزون الحدّ في المعاصي"], // قَومٌ
      ["قوم عادون : متجاوزون الحدّ في المعاصي"] // عادونَ
    ],
    [ // آية 167
      [], // قالوا
      [], // لَئِن
      [], // لَم
      [], // تَنتَهِ
      [], // يـٰلوطُ
      [], // لَتَكونَنَّ
      [], // مِنَ
      [] // المُخرَجينَ
    ],
    [ // آية 168
      [], // قالَ
      [], // إِنّى
      [], // لِعَمَلِكُم
      ["من القالين : من المبغضين أشدّ البغض"], // مِنَ
      ["من القالين : من المبغضين أشدّ البغض"] // القالينَ
    ],
    [ // آية 169
      [], // رَبِّ
      [], // نَجِّنى
      [], // وَأَهلى
      [], // مِمّا
      [] // يَعمَلونَ
    ],
    [ // آية 170
      [], // فَنَجَّينـٰهُ
      [], // وَأَهلَهُ
      [] // أَجمَعينَ
    ],
    [ // آية 171
      [], // إِلّا
      [], // عَجوزًا
      [], // فِى
      [] // الغـٰبِرينَ
    ],
    [ // آية 172
      [], // ثُمَّ
      [], // دَمَّرنَا
      [] // الـٔاخَرينَ
    ],
    [ // آية 173
      [], // وَأَمطَرنا
      [], // عَلَيهِم
      ["مطرا : حجارة من سجيل مُهلكة"], // مَطَرًا
      [], // فَساءَ
      [], // مَطَرُ
      [] // المُنذَرينَ
    ],
    [ // آية 174
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 175
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 176
      [], // كَذَّبَ
      [], // أَصحـٰبُ
      [], // لـَٔيكَةِ
      [] // المُرسَلينَ
    ],
    [ // آية 177
      [], // إِذ
      [], // قالَ
      [], // لَهُم
      [], // شُعَيبٌ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 178
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 179
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 180
      [], // وَما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلىٰ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 181
      [], // أَوفُوا
      [], // الكَيلَ
      [], // وَلا
      [], // تَكونوا
      ["من المخسرين : من النّاقصين للحقوق بالتطفيف"], // مِنَ
      ["من المخسرين : من النّاقصين للحقوق بالتطفيف"] // المُخسِرينَ
    ],
    [ // آية 182
      [], // وَزِنوا
      [], // بِالقِسطاسِ
      [] // المُستَقيمِ
    ],
    [ // آية 183
      [], // وَلا
      [], // تَبخَسُوا
      [], // النّاسَ
      [], // أَشياءَهُم
      [], // وَلا
      [], // تَعثَوا
      [], // فِى
      [], // الأَرضِ
      [] // مُفسِدينَ
    ],
    [ // آية 184
      [], // وَاتَّقُوا
      [], // الَّذى
      [], // خَلَقَكُم
      [], // وَالجِبِلَّةَ
      [] // الأَوَّلينَ
    ],
    [ // آية 185
      [], // قالوا
      [], // إِنَّما
      [], // أَنتَ
      [], // مِنَ
      ["المسحّرين : المغلوبة عقولهم بكثرة السّحر"] // المُسَحَّرينَ
    ],
    [ // آية 186
      [], // وَما
      [], // أَنتَ
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُنا
      [], // وَإِن
      [], // نَظُنُّكَ
      [], // لَمِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 187
      [], // فَأَسقِط
      [], // عَلَينا
      ["كسفا : قطَعَ عذاب"], // كِسَفًا
      [], // مِنَ
      [], // السَّماءِ
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 188
      [], // قالَ
      [], // رَبّى
      [], // أَعلَمُ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 189
      [], // فَكَذَّبوهُ
      [], // فَأَخَذَهُم
      [], // عَذابُ
      [], // يَومِ
      ["الظّلة : سحابة أظلّــتهم ثم أمطرتهم نارًا"], // الظُّلَّةِ
      [], // إِنَّهُ
      [], // كانَ
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 190
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // وَما
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُؤمِنينَ
    ],
    [ // آية 191
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 192
      [], // وَإِنَّهُ
      [], // لَتَنزيلُ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 193
      [], // نَزَلَ
      [], // بِهِ
      [], // الرّوحُ
      [] // الأَمينُ
    ],
    [ // آية 194
      [], // عَلىٰ
      [], // قَلبِكَ
      [], // لِتَكونَ
      [], // مِنَ
      [] // المُنذِرينَ
    ],
    [ // آية 195
      [], // بِلِسانٍ
      [], // عَرَبِىٍّ
      [] // مُبينٍ
    ],
    [ // آية 196
      [], // وَإِنَّهُ
      [], // لَفى
      ["زبر الأولين : كتب الرّسل السابقين"], // زُبُرِ
      ["زبر الأولين : كتب الرّسل السابقين"] // الأَوَّلينَ
    ],
    [ // آية 197
      [], // أَوَلَم
      [], // يَكُن
      [], // لَهُم
      [], // ءايَةً
      [], // أَن
      [], // يَعلَمَهُ
      [], // عُلَمـٰؤُا۟
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 198
      [], // وَلَو
      [], // نَزَّلنـٰهُ
      [], // عَلىٰ
      [], // بَعضِ
      [] // الأَعجَمينَ
    ],
    [ // آية 199
      [], // فَقَرَأَهُ
      [], // عَلَيهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // مُؤمِنينَ
    ],
    [ // آية 200
      [], // كَذٰلِكَ
      [], // سَلَكنـٰهُ
      [], // فى
      [], // قُلوبِ
      [] // المُجرِمينَ
    ],
    [ // آية 201
      [], // لا
      [], // يُؤمِنونَ
      [], // بِهِ
      [], // حَتّىٰ
      [], // يَرَوُا
      [], // العَذابَ
      [] // الأَليمَ
    ],
    [ // آية 202
      [], // فَيَأتِيَهُم
      ["بغتة : فجأة"], // بَغتَةً
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 203
      [], // فَيَقولوا
      ["هل نحن منظرون : ممهلون لِنؤمن ؟ كلاّ"], // هَل
      ["هل نحن منظرون : ممهلون لِنؤمن ؟ كلاّ"], // نَحنُ
      ["هل نحن منظرون : ممهلون لِنؤمن ؟ كلاّ"] // مُنظَرونَ
    ],
    [ // آية 204
      [], // أَفَبِعَذابِنا
      [] // يَستَعجِلونَ
    ],
    [ // آية 205
      [], // أَفَرَءَيتَ
      [], // إِن
      [], // مَتَّعنـٰهُم
      [] // سِنينَ
    ],
    [ // آية 206
      [], // ثُمَّ
      [], // جاءَهُم
      [], // ما
      [], // كانوا
      [] // يوعَدونَ
    ],
    [ // آية 207
      ["ما أغنى عنهم : أي شيء أغنى عنهم – لم يُغنِ"], // ما
      ["ما أغنى عنهم : أي شيء أغنى عنهم – لم يُغنِ"], // أَغنىٰ
      ["ما أغنى عنهم : أي شيء أغنى عنهم – لم يُغنِ"], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يُمَتَّعونَ
    ],
    [ // آية 208
      [], // وَما
      [], // أَهلَكنا
      [], // مِن
      [], // قَريَةٍ
      [], // إِلّا
      [], // لَها
      [] // مُنذِرونَ
    ],
    [ // آية 209
      [], // ذِكرىٰ
      [], // وَما
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 210
      [], // وَما
      [], // تَنَزَّلَت
      [], // بِهِ
      [] // الشَّيـٰطينُ
    ],
    [ // آية 211
      [], // وَما
      [], // يَنبَغى
      [], // لَهُم
      [], // وَما
      [] // يَستَطيعونَ
    ],
    [ // آية 212
      [], // إِنَّهُم
      [], // عَنِ
      [], // السَّمعِ
      [] // لَمَعزولونَ
    ],
    [ // آية 213
      [], // فَلا
      [], // تَدعُ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // فَتَكونَ
      [], // مِنَ
      [] // المُعَذَّبينَ
    ],
    [ // آية 214
      [], // وَأَنذِر
      [], // عَشيرَتَكَ
      [] // الأَقرَبينَ
    ],
    [ // آية 215
      [], // وَاخفِض
      [], // جَناحَكَ
      [], // لِمَنِ
      [], // اتَّبَعَكَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 216
      [], // فَإِن
      [], // عَصَوكَ
      [], // فَقُل
      [], // إِنّى
      [], // بَرىءٌ
      [], // مِمّا
      [] // تَعمَلونَ
    ],
    [ // آية 217
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // العَزيزِ
      [] // الرَّحيمِ
    ],
    [ // آية 218
      [], // الَّذى
      [], // يَرىٰكَ
      [], // حينَ
      [] // تَقومُ
    ],
    [ // آية 219
      [], // وَتَقَلُّبَكَ
      [], // فِى
      [] // السّـٰجِدينَ
    ],
    [ // آية 220
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 221
      [], // هَل
      [], // أُنَبِّئُكُم
      [], // عَلىٰ
      [], // مَن
      [], // تَنَزَّلُ
      [] // الشَّيـٰطينُ
    ],
    [ // آية 222
      [], // تَنَزَّلُ
      [], // عَلىٰ
      [], // كُلِّ
      ["أفاك أثيم : كثير الكذب و الإثم كالكهنة"], // أَفّاكٍ
      ["أفاك أثيم : كثير الكذب و الإثم كالكهنة"] // أَثيمٍ
    ],
    [ // آية 223
      [], // يُلقونَ
      [], // السَّمعَ
      [], // وَأَكثَرُهُم
      [] // كـٰذِبونَ
    ],
    [ // آية 224
      [], // وَالشُّعَراءُ
      [], // يَتَّبِعُهُمُ
      [] // الغاوۥنَ
    ],
    [ // آية 225
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّهُم
      [], // فى
      [], // كُلِّ
      [], // وادٍ
      ["يهيمون : يخوضون و يذهبون كل مذهب"] // يَهيمونَ
    ],
    [ // آية 226
      [], // وَأَنَّهُم
      [], // يَقولونَ
      [], // ما
      [], // لا
      [] // يَفعَلونَ
    ],
    [ // آية 227
      [], // إِلَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // وَذَكَرُوا
      [], // اللَّهَ
      [], // كَثيرًا
      [], // وَانتَصَروا
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // ظُلِموا
      [], // وَسَيَعلَمُ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // أَىَّ
      [], // مُنقَلَبٍ
      [] // يَنقَلِبونَ
    ]
  ]
];

export default meanings;