const meanings = [
  [ // سورة 27: النمل
[ // آية 1
      [], // طس
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // القُرءانِ
      [], // وَكِتابٍ
      [] // مُبينٍ
    ],
    [ // آية 2
      ["هدًى : هادٍ من الضّلالة"], // هُدًى
      [], // وَبُشرىٰ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 3
      [], // الَّذينَ
      [], // يُقيمونَ
      [], // الصَّلوٰةَ
      [], // وَيُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [], // هُم
      [] // يوقِنونَ
    ],
    [ // آية 4
      [], // إِنَّ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // زَيَّنّا
      [], // لَهُم
      [], // أَعمـٰلَهُم
      ["فهم يعمهون : يعمون عن الرّشد أو يتحيّرون"], // فَهُم
      ["فهم يعمهون : يعمون عن الرّشد أو يتحيّرون"] // يَعمَهونَ
    ],
    [ // آية 5
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // لَهُم
      [], // سوءُ
      [], // العَذابِ
      [], // وَهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // هُمُ
      [] // الأَخسَرونَ
    ],
    [ // آية 6
      [], // وَإِنَّكَ
      [], // لَتُلَقَّى
      [], // القُرءانَ
      [], // مِن
      [], // لَدُن
      [], // حَكيمٍ
      [] // عَليمٍ
    ],
    [ // آية 7
      [], // إِذ
      [], // قالَ
      [], // موسىٰ
      [], // لِأَهلِهِ
      [], // إِنّى
      [], // ءانَستُ
      [], // نارًا
      [], // سَـٔاتيكُم
      [], // مِنها
      [], // بِخَبَرٍ
      [], // أَو
      [], // ءاتيكُم
      ["بشهاب قبس : بشُعلة نار ساطعة مقبوسة من أصلها"], // بِشِهابٍ
      ["بشهاب قبس : بشُعلة نار ساطعة مقبوسة من أصلها"], // قَبَسٍ
      [], // لَعَلَّكُم
      ["تصطلون : تستدفئون بها من البرد"] // تَصطَلونَ
    ],
    [ // آية 8
      [], // فَلَمّا
      [], // جاءَها
      [], // نودِىَ
      [], // أَن
      ["بُورك : قدّس و طُهّرَ و زيد خيرا"], // بورِكَ
      [], // مَن
      [], // فِى
      [], // النّارِ
      [], // وَمَن
      [], // حَولَها
      [], // وَسُبحـٰنَ
      [], // اللَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 9
      [], // يـٰموسىٰ
      [], // إِنَّهُ
      [], // أَنَا
      [], // اللَّهُ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 10
      [], // وَأَلقِ
      [], // عَصاكَ
      [], // فَلَمّا
      [], // رَءاها
      [], // تَهتَزُّ
      ["كأنّها جانّ : حيّة خفيفة في سرعة حركتها"], // كَأَنَّها
      ["كأنّها جانّ : حيّة خفيفة في سرعة حركتها"], // جانٌّ
      [], // وَلّىٰ
      [], // مُدبِرًا
      [], // وَلَم
      [], // يُعَقِّب
      [], // يـٰموسىٰ
      [], // لا
      [], // تَخَف
      [], // إِنّى
      [], // لا
      [], // يَخافُ
      [], // لَدَىَّ
      [] // المُرسَلونَ
    ],
    [ // آية 11
      [], // إِلّا
      [], // مَن
      [], // ظَلَمَ
      [], // ثُمَّ
      [], // بَدَّلَ
      [], // حُسنًا
      [], // بَعدَ
      [], // سوءٍ
      [], // فَإِنّى
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 12
      [], // وَأَدخِل
      [], // يَدَكَ
      [], // فى
      [], // جَيبِكَ
      [], // تَخرُج
      ["بيضاء : نيّرة يغلب نورها نور الشمس"], // بَيضاءَ
      [], // مِن
      ["غير سوء : غير داء برص و نحوه"], // غَيرِ
      ["غير سوء : غير داء برص و نحوه"], // سوءٍ
      [], // فى
      [], // تِسعِ
      [], // ءايـٰتٍ
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَقَومِهِ
      [], // إِنَّهُم
      [], // كانوا
      [], // قَومًا
      [] // فـٰسِقينَ
    ],
    [ // آية 13
      [], // فَلَمّا
      [], // جاءَتهُم
      [], // ءايـٰتُنا
      ["مبصرة : واضحة بيّـنة هادية"], // مُبصِرَةً
      [], // قالوا
      [], // هـٰذا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 14
      [], // وَجَحَدوا
      [], // بِها
      [], // وَاستَيقَنَتها
      [], // أَنفُسُهُم
      [], // ظُلمًا
      [], // وَعُلُوًّا
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُفسِدينَ
    ],
    [ // آية 15
      [], // وَلَقَد
      [], // ءاتَينا
      [], // داوۥدَ
      [], // وَسُلَيمـٰنَ
      [], // عِلمًا
      [], // وَقالَا
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // فَضَّلَنا
      [], // عَلىٰ
      [], // كَثيرٍ
      [], // مِن
      [], // عِبادِهِ
      [] // المُؤمِنينَ
    ],
    [ // آية 16
      [], // وَوَرِثَ
      [], // سُلَيمـٰنُ
      [], // داوۥدَ
      [], // وَقالَ
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // عُلِّمنا
      ["منطِق الطّير : فهم أغراضه كلّها من أصواته"], // مَنطِقَ
      ["منطِق الطّير : فهم أغراضه كلّها من أصواته"], // الطَّيرِ
      [], // وَأوتينا
      [], // مِن
      [], // كُلِّ
      [], // شَىءٍ
      [], // إِنَّ
      [], // هـٰذا
      [], // لَهُوَ
      [], // الفَضلُ
      [] // المُبينُ
    ],
    [ // آية 17
      [], // وَحُشِرَ
      [], // لِسُلَيمـٰنَ
      [], // جُنودُهُ
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // وَالطَّيرِ
      ["فهم يوزعون : يوقف أوائلهم لتلحقهم أواخرهم"], // فَهُم
      ["فهم يوزعون : يوقف أوائلهم لتلحقهم أواخرهم"] // يوزَعونَ
    ],
    [ // آية 18
      [], // حَتّىٰ
      [], // إِذا
      [], // أَتَوا
      [], // عَلىٰ
      [], // وادِ
      [], // النَّملِ
      [], // قالَت
      [], // نَملَةٌ
      [], // يـٰأَيُّهَا
      [], // النَّملُ
      [], // ادخُلوا
      [], // مَسـٰكِنَكُم
      [], // لا
      [], // يَحطِمَنَّكُم
      [], // سُلَيمـٰنُ
      [], // وَجُنودُهُ
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 19
      [], // فَتَبَسَّمَ
      [], // ضاحِكًا
      [], // مِن
      [], // قَولِها
      [], // وَقالَ
      [], // رَبِّ
      [], // أَوزِعنى
      [], // أَن
      [], // أَشكُرَ
      [], // نِعمَتَكَ
      [], // الَّتى
      [], // أَنعَمتَ
      [], // عَلَىَّ
      [], // وَعَلىٰ
      [], // وٰلِدَىَّ
      [], // وَأَن
      [], // أَعمَلَ
      [], // صـٰلِحًا
      [], // تَرضىٰهُ
      [], // وَأَدخِلنى
      [], // بِرَحمَتِكَ
      [], // فى
      [], // عِبادِكَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 20
      [], // وَتَفَقَّدَ
      [], // الطَّيرَ
      [], // فَقالَ
      [], // ما
      [], // لِىَ
      [], // لا
      [], // أَرَى
      [], // الهُدهُدَ
      [], // أَم
      [], // كانَ
      [], // مِنَ
      [] // الغائِبينَ
    ],
    [ // آية 21
      [], // لَأُعَذِّبَنَّهُ
      [], // عَذابًا
      [], // شَديدًا
      [], // أَو
      [], // لَأَا۟ذبَحَنَّهُ
      [], // أَو
      [], // لَيَأتِيَنّى
      [], // بِسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 22
      [], // فَمَكَثَ
      [], // غَيرَ
      [], // بَعيدٍ
      [], // فَقالَ
      [], // أَحَطتُ
      [], // بِما
      [], // لَم
      [], // تُحِط
      [], // بِهِ
      [], // وَجِئتُكَ
      [], // مِن
      [], // سَبَإٍ
      [], // بِنَبَإٍ
      [] // يَقينٍ
    ],
    [ // آية 23
      [], // إِنّى
      [], // وَجَدتُ
      [], // امرَأَةً
      [], // تَملِكُهُم
      [], // وَأوتِيَت
      [], // مِن
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَلَها
      [], // عَرشٌ
      [] // عَظيمٌ
    ],
    [ // آية 24
      [], // وَجَدتُها
      [], // وَقَومَها
      [], // يَسجُدونَ
      [], // لِلشَّمسِ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَزَيَّنَ
      [], // لَهُمُ
      [], // الشَّيطـٰنُ
      [], // أَعمـٰلَهُم
      [], // فَصَدَّهُم
      [], // عَنِ
      [], // السَّبيلِ
      [], // فَهُم
      [], // لا
      [] // يَهتَدونَ
    ],
    [ // آية 25
      [], // أَلّا
      [], // يَسجُدوا
      [], // لِلَّهِ
      [], // الَّذى
      ["يُخرج الخبء : يُظهر المخبوء المستور أيّا كان"], // يُخرِجُ
      ["يُخرج الخبء : يُظهر المخبوء المستور أيّا كان"], // الخَبءَ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَيَعلَمُ
      [], // ما
      [], // تُخفونَ
      [], // وَما
      [] // تُعلِنونَ
    ],
    [ // آية 26
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // رَبُّ
      [], // العَرشِ
      [] // العَظيمِ
    ],
    [ // آية 27
      [], // قالَ
      [], // سَنَنظُرُ
      [], // أَصَدَقتَ
      [], // أَم
      [], // كُنتَ
      [], // مِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 28
      [], // اذهَب
      [], // بِكِتـٰبى
      [], // هـٰذا
      [], // فَأَلقِه
      [], // إِلَيهِم
      [], // ثُمَّ
      [], // تَوَلَّ
      [], // عَنهُم
      [], // فَانظُر
      [], // ماذا
      [] // يَرجِعونَ
    ],
    [ // آية 29
      [], // قالَت
      [], // يـٰأَيُّهَا
      [], // المَلَؤُا۟
      [], // إِنّى
      [], // أُلقِىَ
      [], // إِلَىَّ
      [], // كِتـٰبٌ
      [] // كَريمٌ
    ],
    [ // آية 30
      [], // إِنَّهُ
      [], // مِن
      [], // سُلَيمـٰنَ
      [], // وَإِنَّهُ
      [], // بِسمِ
      [], // اللَّهِ
      [], // الرَّحمـٰنِ
      [] // الرَّحيمِ
    ],
    [ // آية 31
      [], // أَلّا
      [], // تَعلوا
      [], // عَلَىَّ
      [], // وَأتونى
      ["مُسلمين : مؤمنين . أو مُنقادين مستسلمين"] // مُسلِمينَ
    ],
    [ // آية 32
      [], // قالَت
      [], // يـٰأَيُّهَا
      [], // المَلَؤُا۟
      [], // أَفتونى
      [], // فى
      [], // أَمرى
      [], // ما
      [], // كُنتُ
      [], // قاطِعَةً
      [], // أَمرًا
      [], // حَتّىٰ
      ["تشهدونِ : تحضرون . أو تشيروا عليّ"] // تَشهَدونِ
    ],
    [ // آية 33
      [], // قالوا
      [], // نَحنُ
      [], // أُولوا
      [], // قُوَّةٍ
      [], // وَأُولوا
      [], // بَأسٍ
      [], // شَديدٍ
      [], // وَالأَمرُ
      [], // إِلَيكِ
      [], // فَانظُرى
      [], // ماذا
      [] // تَأمُرينَ
    ],
    [ // آية 34
      [], // قالَت
      [], // إِنَّ
      [], // المُلوكَ
      [], // إِذا
      [], // دَخَلوا
      [], // قَريَةً
      [], // أَفسَدوها
      [], // وَجَعَلوا
      [], // أَعِزَّةَ
      [], // أَهلِها
      [], // أَذِلَّةً
      [], // وَكَذٰلِكَ
      [] // يَفعَلونَ
    ],
    [ // آية 35
      [], // وَإِنّى
      [], // مُرسِلَةٌ
      [], // إِلَيهِم
      [], // بِهَدِيَّةٍ
      [], // فَناظِرَةٌ
      [], // بِمَ
      [], // يَرجِعُ
      [] // المُرسَلونَ
    ],
    [ // آية 36
      [], // فَلَمّا
      [], // جاءَ
      [], // سُلَيمـٰنَ
      [], // قالَ
      [], // أَتُمِدّونَنِ
      [], // بِمالٍ
      [], // فَما
      [], // ءاتىٰنِۦَ
      [], // اللَّهُ
      [], // خَيرٌ
      [], // مِمّا
      [], // ءاتىٰكُم
      [], // بَل
      [], // أَنتُم
      [], // بِهَدِيَّتِكُم
      [] // تَفرَحونَ
    ],
    [ // آية 37
      [], // ارجِع
      [], // إِلَيهِم
      [], // فَلَنَأتِيَنَّهُم
      [], // بِجُنودٍ
      ["لا قِبَل لهم بها : لا طاقة لهم بمقاومتها"], // لا
      ["لا قِبَل لهم بها : لا طاقة لهم بمقاومتها"], // قِبَلَ
      ["لا قِبَل لهم بها : لا طاقة لهم بمقاومتها"], // لَهُم
      ["لا قِبَل لهم بها : لا طاقة لهم بمقاومتها"], // بِها
      [], // وَلَنُخرِجَنَّهُم
      [], // مِنها
      [], // أَذِلَّةً
      [], // وَهُم
      [] // صـٰغِرونَ
    ],
    [ // آية 38
      [], // قالَ
      [], // يـٰأَيُّهَا
      [], // المَلَؤُا۟
      [], // أَيُّكُم
      [], // يَأتينى
      [], // بِعَرشِها
      [], // قَبلَ
      [], // أَن
      [], // يَأتونى
      [] // مُسلِمينَ
    ],
    [ // آية 39
      [], // قالَ
      [], // عِفريتٌ
      [], // مِنَ
      [], // الجِنِّ
      [], // أَنا۠
      [], // ءاتيكَ
      [], // بِهِ
      [], // قَبلَ
      [], // أَن
      [], // تَقومَ
      [], // مِن
      [], // مَقامِكَ
      [], // وَإِنّى
      [], // عَلَيهِ
      [], // لَقَوِىٌّ
      [] // أَمينٌ
    ],
    [ // آية 40
      [], // قالَ
      [], // الَّذى
      [], // عِندَهُ
      [], // عِلمٌ
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // أَنا۠
      [], // ءاتيكَ
      [], // بِهِ
      [], // قَبلَ
      [], // أَن
      [], // يَرتَدَّ
      [], // إِلَيكَ
      ["طرْفك : نظرك . أو جفن عينك بعد فتحه"], // طَرفُكَ
      [], // فَلَمّا
      [], // رَءاهُ
      [], // مُستَقِرًّا
      [], // عِندَهُ
      [], // قالَ
      [], // هـٰذا
      [], // مِن
      [], // فَضلِ
      [], // رَبّى
      [], // لِيَبلُوَنى
      [], // ءَأَشكُرُ
      [], // أَم
      [], // أَكفُرُ
      [], // وَمَن
      [], // شَكَرَ
      [], // فَإِنَّما
      [], // يَشكُرُ
      [], // لِنَفسِهِ
      [], // وَمَن
      [], // كَفَرَ
      [], // فَإِنَّ
      [], // رَبّى
      [], // غَنِىٌّ
      [] // كَريمٌ
    ],
    [ // آية 41
      [], // قالَ
      ["نكّروا : غيّروا"], // نَكِّروا
      [], // لَها
      [], // عَرشَها
      [], // نَنظُر
      [], // أَتَهتَدى
      [], // أَم
      [], // تَكونُ
      [], // مِنَ
      [], // الَّذينَ
      [], // لا
      [] // يَهتَدونَ
    ],
    [ // آية 42
      [], // فَلَمّا
      [], // جاءَت
      [], // قيلَ
      [], // أَهـٰكَذا
      [], // عَرشُكِ
      [], // قالَت
      [], // كَأَنَّهُ
      [], // هُوَ
      [], // وَأوتينَا
      [], // العِلمَ
      [], // مِن
      [], // قَبلِها
      [], // وَكُنّا
      [] // مُسلِمينَ
    ],
    [ // آية 43
      [], // وَصَدَّها
      [], // ما
      [], // كانَت
      [], // تَعبُدُ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // إِنَّها
      [], // كانَت
      [], // مِن
      [], // قَومٍ
      [] // كـٰفِرينَ
    ],
    [ // آية 44
      [], // قيلَ
      [], // لَهَا
      [], // ادخُلِى
      [], // الصَّرحَ
      [], // فَلَمّا
      [], // رَأَتهُ
      ["حسبته لُجّة : ظنّـتـه ماءً غزيرا"], // حَسِبَتهُ
      ["حسبته لُجّة : ظنّـتـه ماءً غزيرا"], // لُجَّةً
      [], // وَكَشَفَت
      [], // عَن
      [], // ساقَيها
      [], // قالَ
      [], // إِنَّهُ
      ["صرح ممرّد : مُمَـلّس مُسوّى"], // صَرحٌ
      ["صرح ممرّد : مُمَـلّس مُسوّى"], // مُمَرَّدٌ
      ["من قوارير : زجاج شفّاف"], // مِن
      ["من قوارير : زجاج شفّاف"], // قَواريرَ
      [], // قالَت
      [], // رَبِّ
      [], // إِنّى
      [], // ظَلَمتُ
      [], // نَفسى
      [], // وَأَسلَمتُ
      [], // مَعَ
      [], // سُلَيمـٰنَ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 45
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // إِلىٰ
      [], // ثَمودَ
      [], // أَخاهُم
      [], // صـٰلِحًا
      [], // أَنِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // فَإِذا
      [], // هُم
      [], // فَريقانِ
      [] // يَختَصِمونَ
    ],
    [ // آية 46
      [], // قالَ
      [], // يـٰقَومِ
      [], // لِمَ
      [], // تَستَعجِلونَ
      [], // بِالسَّيِّئَةِ
      [], // قَبلَ
      [], // الحَسَنَةِ
      [], // لَولا
      [], // تَستَغفِرونَ
      [], // اللَّهَ
      [], // لَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 47
      [], // قالُوا
      ["اطّيّرنا : تشاءمنا حيث أصبنا بالشّداد"], // اطَّيَّرنا
      [], // بِكَ
      [], // وَبِمَن
      [], // مَعَكَ
      [], // قالَ
      [], // طـٰئِرُكُم
      [], // عِندَ
      [], // اللَّهِ
      [], // بَل
      [], // أَنتُم
      ["قوم تُفتنون : يفتنكم الشّيطان بوسوسته"], // قَومٌ
      ["قوم تُفتنون : يفتنكم الشّيطان بوسوسته"] // تُفتَنونَ
    ],
    [ // آية 48
      [], // وَكانَ
      [], // فِى
      [], // المَدينَةِ
      ["تسعة رهط : أشخاص من الرّؤساء مع كلّ رهط"], // تِسعَةُ
      ["تسعة رهط : أشخاص من الرّؤساء مع كلّ رهط"], // رَهطٍ
      [], // يُفسِدونَ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [] // يُصلِحونَ
    ],
    [ // آية 49
      [], // قالوا
      ["تقاسموا بالله : تحالفوا بالله . أو احلِفوا به"], // تَقاسَموا
      ["تقاسموا بالله : تحالفوا بالله . أو احلِفوا به"], // بِاللَّهِ
      [], // لَنُبَيِّتَنَّهُ
      [], // وَأَهلَهُ
      [], // ثُمَّ
      [], // لَنَقولَنَّ
      [], // لِوَلِيِّهِ
      [], // ما
      [], // شَهِدنا
      ["مهْلِك أهله : هلاكهم"], // مَهلِكَ
      ["مهْلِك أهله : هلاكهم"], // أَهلِهِ
      [], // وَإِنّا
      [] // لَصـٰدِقونَ
    ],
    [ // آية 50
      [], // وَمَكَروا
      [], // مَكرًا
      [], // وَمَكَرنا
      [], // مَكرًا
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 51
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // مَكرِهِم
      [], // أَنّا
      [], // دَمَّرنـٰهُم
      [], // وَقَومَهُم
      [] // أَجمَعينَ
    ],
    [ // آية 52
      [], // فَتِلكَ
      [], // بُيوتُهُم
      ["خاوية : خالية خربَة أو ساقطة متهدّمة"], // خاوِيَةً
      [], // بِما
      [], // ظَلَموا
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 53
      [], // وَأَنجَينَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَكانوا
      [] // يَتَّقونَ
    ],
    [ // آية 54
      [], // وَلوطًا
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // أَتَأتونَ
      [], // الفـٰحِشَةَ
      [], // وَأَنتُم
      [] // تُبصِرونَ
    ],
    [ // آية 55
      [], // أَئِنَّكُم
      [], // لَتَأتونَ
      [], // الرِّجالَ
      [], // شَهوَةً
      [], // مِن
      [], // دونِ
      [], // النِّساءِ
      [], // بَل
      [], // أَنتُم
      [], // قَومٌ
      [] // تَجهَلونَ
    ],
    [ // آية 56
      [], // فَما
      [], // كانَ
      [], // جَوابَ
      [], // قَومِهِ
      [], // إِلّا
      [], // أَن
      [], // قالوا
      [], // أَخرِجوا
      [], // ءالَ
      [], // لوطٍ
      [], // مِن
      [], // قَريَتِكُم
      [], // إِنَّهُم
      [], // أُناسٌ
      ["يتطهّرون : يزعمون التـّـنـزّه عمّا نفعل"] // يَتَطَهَّرونَ
    ],
    [ // آية 57
      [], // فَأَنجَينـٰهُ
      [], // وَأَهلَهُ
      [], // إِلَّا
      [], // امرَأَتَهُ
      [], // قَدَّرنـٰها
      [], // مِنَ
      [] // الغـٰبِرينَ
    ],
    [ // آية 58
      [], // وَأَمطَرنا
      [], // عَلَيهِم
      ["مطرا : حجارة من السّماء مُهلِكَة"], // مَطَرًا
      [], // فَساءَ
      [], // مَطَرُ
      [] // المُنذَرينَ
    ],
    [ // آية 59
      [], // قُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // وَسَلـٰمٌ
      [], // عَلىٰ
      [], // عِبادِهِ
      [], // الَّذينَ
      [], // اصطَفىٰ
      [], // ءاللَّهُ
      [], // خَيرٌ
      [], // أَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 60
      [], // أَمَّن
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَأَنزَلَ
      [], // لَكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَنبَتنا
      [], // بِهِ
      ["حدائق ذات بهجة : بساتين ذات حُسن و رونق"], // حَدائِقَ
      ["حدائق ذات بهجة : بساتين ذات حُسن و رونق"], // ذاتَ
      ["حدائق ذات بهجة : بساتين ذات حُسن و رونق"], // بَهجَةٍ
      [], // ما
      [], // كانَ
      [], // لَكُم
      [], // أَن
      [], // تُنبِتوا
      [], // شَجَرَها
      [], // أَءِلـٰهٌ
      [], // مَعَ
      [], // اللَّهِ
      [], // بَل
      [], // هُم
      ["قوم يعدِلون : ينحرفون عن الحقّ إلى الباطل"], // قَومٌ
      ["قوم يعدِلون : ينحرفون عن الحقّ إلى الباطل"] // يَعدِلونَ
    ],
    [ // آية 61
      [], // أَمَّن
      [], // جَعَلَ
      ["الأرض قرارا : مستقرّا بالدّحو و التـّسوية"], // الأَرضَ
      ["الأرض قرارا : مستقرّا بالدّحو و التـّسوية"], // قَرارًا
      [], // وَجَعَلَ
      [], // خِلـٰلَها
      [], // أَنهـٰرًا
      [], // وَجَعَلَ
      [], // لَها
      [], // رَوٰسِىَ
      [], // وَجَعَلَ
      [], // بَينَ
      [], // البَحرَينِ
      ["حاجزا : فاصلا يمنع اختلاطهما"], // حاجِزًا
      [], // أَءِلـٰهٌ
      [], // مَعَ
      [], // اللَّهِ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 62
      [], // أَمَّن
      [], // يُجيبُ
      [], // المُضطَرَّ
      [], // إِذا
      [], // دَعاهُ
      [], // وَيَكشِفُ
      [], // السّوءَ
      [], // وَيَجعَلُكُم
      [], // خُلَفاءَ
      [], // الأَرضِ
      [], // أَءِلـٰهٌ
      [], // مَعَ
      [], // اللَّهِ
      [], // قَليلًا
      [], // ما
      [] // تَذَكَّرونَ
    ],
    [ // آية 63
      [], // أَمَّن
      [], // يَهديكُم
      [], // فى
      [], // ظُلُمـٰتِ
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // وَمَن
      [], // يُرسِلُ
      [], // الرِّيـٰحَ
      [], // بُشرًا
      [], // بَينَ
      [], // يَدَى
      ["رحمته : المطر الذي به تـَحـْيَى الأرض"], // رَحمَتِهِ
      [], // أَءِلـٰهٌ
      [], // مَعَ
      [], // اللَّهِ
      [], // تَعـٰلَى
      [], // اللَّهُ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 64
      [], // أَمَّن
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // وَمَن
      [], // يَرزُقُكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // أَءِلـٰهٌ
      [], // مَعَ
      [], // اللَّهِ
      [], // قُل
      [], // هاتوا
      [], // بُرهـٰنَكُم
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 65
      [], // قُل
      [], // لا
      [], // يَعلَمُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // الغَيبَ
      [], // إِلَّا
      [], // اللَّهُ
      [], // وَما
      [], // يَشعُرونَ
      [], // أَيّانَ
      [] // يُبعَثونَ
    ],
    [ // آية 66
      [], // بَلِ
      [], // ادّٰرَكَ
      [], // عِلمُهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // بَل
      [], // هُم
      [], // فى
      [], // شَكٍّ
      [], // مِنها
      [], // بَل
      [], // هُم
      [], // مِنها
      [] // عَمونَ
    ],
    [ // آية 67
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَءِذا
      [], // كُنّا
      [], // تُرٰبًا
      [], // وَءاباؤُنا
      [], // أَئِنّا
      [] // لَمُخرَجونَ
    ],
    [ // آية 68
      [], // لَقَد
      [], // وُعِدنا
      [], // هـٰذا
      [], // نَحنُ
      [], // وَءاباؤُنا
      [], // مِن
      [], // قَبلُ
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 69
      [], // قُل
      [], // سيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَانظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُجرِمينَ
    ],
    [ // آية 70
      [], // وَلا
      [], // تَحزَن
      [], // عَلَيهِم
      [], // وَلا
      [], // تَكُن
      [], // فى
      ["ضيق : حرج و ضيق صدر"], // ضَيقٍ
      [], // مِمّا
      [] // يَمكُرونَ
    ],
    [ // آية 71
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 72
      [], // قُل
      [], // عَسىٰ
      [], // أَن
      [], // يَكونَ
      ["ردِف لكم : لحقكم و وصل إليكم"], // رَدِفَ
      ["ردِف لكم : لحقكم و وصل إليكم"], // لَكُم
      [], // بَعضُ
      [], // الَّذى
      [] // تَستَعجِلونَ
    ],
    [ // آية 73
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَذو
      [], // فَضلٍ
      [], // عَلَى
      [], // النّاسِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَشكُرونَ
    ],
    [ // آية 74
      [], // وَإِنَّ
      [], // رَبَّكَ
      [], // لَيَعلَمُ
      ["ما تكنّ صدورهم : ما تُخفي و تستر من الأسرار"], // ما
      ["ما تكنّ صدورهم : ما تُخفي و تستر من الأسرار"], // تُكِنُّ
      ["ما تكنّ صدورهم : ما تُخفي و تستر من الأسرار"], // صُدورُهُم
      [], // وَما
      [] // يُعلِنونَ
    ],
    [ // آية 75
      [], // وَما
      [], // مِن
      ["غائبة : شيء يغيب و يخفى عن الخلق"], // غائِبَةٍ
      [], // فِى
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [] // مُبينٍ
    ],
    [ // آية 76
      [], // إِنَّ
      [], // هـٰذَا
      [], // القُرءانَ
      [], // يَقُصُّ
      [], // عَلىٰ
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // أَكثَرَ
      [], // الَّذى
      [], // هُم
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 77
      [], // وَإِنَّهُ
      [], // لَهُدًى
      [], // وَرَحمَةٌ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 78
      [], // إِنَّ
      [], // رَبَّكَ
      [], // يَقضى
      [], // بَينَهُم
      [], // بِحُكمِهِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // العَليمُ
    ],
    [ // آية 79
      [], // فَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // إِنَّكَ
      [], // عَلَى
      [], // الحَقِّ
      [] // المُبينِ
    ],
    [ // آية 80
      [], // إِنَّكَ
      [], // لا
      [], // تُسمِعُ
      [], // المَوتىٰ
      [], // وَلا
      [], // تُسمِعُ
      [], // الصُّمَّ
      [], // الدُّعاءَ
      [], // إِذا
      [], // وَلَّوا
      [] // مُدبِرينَ
    ],
    [ // آية 81
      [], // وَما
      [], // أَنتَ
      [], // بِهـٰدِى
      [], // العُمىِ
      [], // عَن
      [], // ضَلـٰلَتِهِم
      [], // إِن
      [], // تُسمِعُ
      [], // إِلّا
      [], // مَن
      [], // يُؤمِنُ
      [], // بِـٔايـٰتِنا
      [], // فَهُم
      [] // مُسلِمونَ
    ],
    [ // آية 82
      [], // وَإِذا
      [], // وَقَعَ
      [], // القَولُ
      [], // عَلَيهِم
      [], // أَخرَجنا
      [], // لَهُم
      ["دابّة : هي من أشراط السّاعة الكبرى"], // دابَّةً
      [], // مِنَ
      [], // الأَرضِ
      [], // تُكَلِّمُهُم
      [], // أَنَّ
      [], // النّاسَ
      [], // كانوا
      [], // بِـٔايـٰتِنا
      [], // لا
      [] // يوقِنونَ
    ],
    [ // آية 83
      [], // وَيَومَ
      [], // نَحشُرُ
      [], // مِن
      [], // كُلِّ
      [], // أُمَّةٍ
      ["فوجا : جماعة و زمرة"], // فَوجًا
      [], // مِمَّن
      [], // يُكَذِّبُ
      [], // بِـٔايـٰتِنا
      ["فهم يوزعون : يُوقف أوائلُهم لتلحقهم أواخرهم ثمّ يُساقون جميعا"], // فَهُم
      ["فهم يوزعون : يُوقف أوائلُهم لتلحقهم أواخرهم ثمّ يُساقون جميعا"] // يوزَعونَ
    ],
    [ // آية 84
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءو
      [], // قالَ
      [], // أَكَذَّبتُم
      [], // بِـٔايـٰتى
      [], // وَلَم
      [], // تُحيطوا
      [], // بِها
      [], // عِلمًا
      [], // أَمّاذا
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 85
      [], // وَوَقَعَ
      [], // القَولُ
      [], // عَلَيهِم
      [], // بِما
      [], // ظَلَموا
      [], // فَهُم
      [], // لا
      [] // يَنطِقونَ
    ],
    [ // آية 86
      [], // أَلَم
      [], // يَرَوا
      [], // أَنّا
      [], // جَعَلنَا
      [], // الَّيلَ
      [], // لِيَسكُنوا
      [], // فيهِ
      [], // وَالنَّهارَ
      [], // مُبصِرًا
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 87
      [], // وَيَومَ
      [], // يُنفَخُ
      [], // فِى
      [], // الصّورِ
      ["ففزع : خاف خوفا يستتبع الموت"], // فَفَزِعَ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // إِلّا
      [], // مَن
      [], // شاءَ
      [], // اللَّهُ
      [], // وَكُلٌّ
      [], // أَتَوهُ
      [] // دٰخِرينَ
    ],
    [ // آية 88
      [], // وَتَرَى
      [], // الجِبالَ
      [], // تَحسَبُها
      [], // جامِدَةً
      [], // وَهِىَ
      [], // تَمُرُّ
      [], // مَرَّ
      [], // السَّحابِ
      [], // صُنعَ
      [], // اللَّهِ
      [], // الَّذى
      [], // أَتقَنَ
      [], // كُلَّ
      [], // شَىءٍ
      [], // إِنَّهُ
      [], // خَبيرٌ
      [], // بِما
      [] // تَفعَلونَ
    ],
    [ // آية 89
      [], // مَن
      [], // جاءَ
      [], // بِالحَسَنَةِ
      [], // فَلَهُ
      [], // خَيرٌ
      [], // مِنها
      [], // وَهُم
      [], // مِن
      [], // فَزَعٍ
      [], // يَومَئِذٍ
      [] // ءامِنونَ
    ],
    [ // آية 90
      [], // وَمَن
      [], // جاءَ
      [], // بِالسَّيِّئَةِ
      [], // فَكُبَّت
      [], // وُجوهُهُم
      [], // فِى
      [], // النّارِ
      [], // هَل
      [], // تُجزَونَ
      [], // إِلّا
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 91
      [], // إِنَّما
      [], // أُمِرتُ
      [], // أَن
      [], // أَعبُدَ
      [], // رَبَّ
      [], // هـٰذِهِ
      [], // البَلدَةِ
      [], // الَّذى
      [], // حَرَّمَها
      [], // وَلَهُ
      [], // كُلُّ
      [], // شَىءٍ
      [], // وَأُمِرتُ
      [], // أَن
      [], // أَكونَ
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 92
      [], // وَأَن
      [], // أَتلُوَا۟
      [], // القُرءانَ
      [], // فَمَنِ
      [], // اهتَدىٰ
      [], // فَإِنَّما
      [], // يَهتَدى
      [], // لِنَفسِهِ
      [], // وَمَن
      [], // ضَلَّ
      [], // فَقُل
      [], // إِنَّما
      [], // أَنا۠
      [], // مِنَ
      [] // المُنذِرينَ
    ],
    [ // آية 93
      [], // وَقُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // سَيُريكُم
      [], // ءايـٰتِهِ
      [], // فَتَعرِفونَها
      [], // وَما
      [], // رَبُّكَ
      [], // بِغـٰفِلٍ
      [], // عَمّا
      [] // تَعمَلونَ
    ]
  ]
];

export default meanings;