const meanings = [
[ // آية 1
      [] // طسم
    ],
    [ // آية 2
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [] // المُبينِ
    ],
    [ // آية 3
      [], // نَتلوا
      [], // عَلَيكَ
      [], // مِن
      [], // نَبَإِ
      [], // موسىٰ
      [], // وَفِرعَونَ
      [], // بِالحَقِّ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 4
      [], // إِنَّ
      [], // فِرعَونَ
      [], // عَلا
      [], // فِى
      [], // الأَرضِ
      [], // وَجَعَلَ
      [], // أَهلَها
      [], // شِيَعًا
      [], // يَستَضعِفُ
      [], // طائِفَةً
      [], // مِنهُم
      [], // يُذَبِّحُ
      [], // أَبناءَهُم
      [], // وَيَستَحيۦ
      [], // نِساءَهُم
      [], // إِنَّهُ
      [], // كانَ
      [], // مِنَ
      [] // المُفسِدينَ
    ],
    [ // آية 5
      [], // وَنُريدُ
      [], // أَن
      [], // نَمُنَّ
      [], // عَلَى
      [], // الَّذينَ
      [], // استُضعِفوا
      [], // فِى
      [], // الأَرضِ
      [], // وَنَجعَلَهُم
      [], // أَئِمَّةً
      [], // وَنَجعَلَهُمُ
      [] // الوٰرِثينَ
    ],
    [ // آية 6
      [], // وَنُمَكِّنَ
      [], // لَهُم
      [], // فِى
      [], // الأَرضِ
      [], // وَنُرِىَ
      [], // فِرعَونَ
      [], // وَهـٰمـٰنَ
      [], // وَجُنودَهُما
      [], // مِنهُم
      [], // ما
      [], // كانوا
      ["يحذرون : يخافون من ذهاب مُلكهمْ"] // يَحذَرونَ
    ],
    [ // آية 7
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // أُمِّ
      [], // موسىٰ
      [], // أَن
      [], // أَرضِعيهِ
      [], // فَإِذا
      [], // خِفتِ
      [], // عَلَيهِ
      [], // فَأَلقيهِ
      [], // فِى
      [], // اليَمِّ
      [], // وَلا
      [], // تَخافى
      [], // وَلا
      [], // تَحزَنى
      [], // إِنّا
      [], // رادّوهُ
      [], // إِلَيكِ
      [], // وَجاعِلوهُ
      [], // مِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 8
      [], // فَالتَقَطَهُ
      [], // ءالُ
      [], // فِرعَونَ
      [], // لِيَكونَ
      [], // لَهُم
      [], // عَدُوًّا
      [], // وَحَزَنًا
      [], // إِنَّ
      [], // فِرعَونَ
      [], // وَهـٰمـٰنَ
      [], // وَجُنودَهُما
      [], // كانوا
      [] // خـٰطِـٔينَ
    ],
    [ // آية 9
      [], // وَقالَتِ
      [], // امرَأَتُ
      [], // فِرعَونَ
      [], // قُرَّتُ
      [], // عَينٍ
      [], // لى
      [], // وَلَكَ
      [], // لا
      [], // تَقتُلوهُ
      [], // عَسىٰ
      [], // أَن
      [], // يَنفَعَنا
      [], // أَو
      [], // نَتَّخِذَهُ
      [], // وَلَدًا
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 10
      [], // وَأَصبَحَ
      [], // فُؤادُ
      [], // أُمِّ
      [], // موسىٰ
      [], // فـٰرِغًا
      [], // إِن
      [], // كادَت
      [], // لَتُبدى
      [], // بِهِ
      [], // لَولا
      [], // أَن
      ["رَبَطنا : بالعصمة و الصبر و التّثبيت"], // رَبَطنا
      [], // عَلىٰ
      [], // قَلبِها
      [], // لِتَكونَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 11
      [], // وَقالَت
      [], // لِأُختِهِ
      ["قصّيه : اتّبعي أثره و تعرّفي خبره"], // قُصّيهِ
      [], // فَبَصُرَت
      [], // بِهِ
      ["عن جُنُب : عن بُعْد أو عن مكان بعيد"], // عَن
      ["عن جُنُب : عن بُعْد أو عن مكان بعيد"], // جُنُبٍ
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 12
      [], // وَحَرَّمنا
      [], // عَلَيهِ
      [], // المَراضِعَ
      [], // مِن
      [], // قَبلُ
      [], // فَقالَت
      [], // هَل
      [], // أَدُلُّكُم
      [], // عَلىٰ
      [], // أَهلِ
      [], // بَيتٍ
      ["يكفلونه لكم : يقومون بتربيته لأجلكم"], // يَكفُلونَهُ
      ["يكفلونه لكم : يقومون بتربيته لأجلكم"], // لَكُم
      [], // وَهُم
      [], // لَهُ
      [] // نـٰصِحونَ
    ],
    [ // آية 13
      [], // فَرَدَدنـٰهُ
      [], // إِلىٰ
      [], // أُمِّهِ
      [], // كَى
      ["تقرّ عينها : تـُـسرّ و تـَفرح بولدها"], // تَقَرَّ
      ["تقرّ عينها : تـُـسرّ و تـَفرح بولدها"], // عَينُها
      [], // وَلا
      [], // تَحزَنَ
      [], // وَلِتَعلَمَ
      [], // أَنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 14
      [], // وَلَمّا
      ["بلغ أشدّه : قوّة بدنه و نهاية نموّه"], // بَلَغَ
      ["بلغ أشدّه : قوّة بدنه و نهاية نموّه"], // أَشُدَّهُ
      [], // وَاستَوىٰ
      [], // ءاتَينـٰهُ
      [], // حُكمًا
      [], // وَعِلمًا
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 15
      [], // وَدَخَلَ
      [], // المَدينَةَ
      [], // عَلىٰ
      [], // حينِ
      [], // غَفلَةٍ
      [], // مِن
      [], // أَهلِها
      [], // فَوَجَدَ
      [], // فيها
      [], // رَجُلَينِ
      [], // يَقتَتِلانِ
      [], // هـٰذا
      [], // مِن
      [], // شيعَتِهِ
      [], // وَهـٰذا
      [], // مِن
      [], // عَدُوِّهِ
      [], // فَاستَغـٰثَهُ
      [], // الَّذى
      [], // مِن
      [], // شيعَتِهِ
      [], // عَلَى
      [], // الَّذى
      [], // مِن
      [], // عَدُوِّهِ
      ["فوكزه موسى : ضربه في صدره بجُمْع كفّه"], // فَوَكَزَهُ
      ["فوكزه موسى : ضربه في صدره بجُمْع كفّه"], // موسىٰ
      [], // فَقَضىٰ
      [], // عَلَيهِ
      [], // قالَ
      [], // هـٰذا
      [], // مِن
      [], // عَمَلِ
      [], // الشَّيطـٰنِ
      [], // إِنَّهُ
      [], // عَدُوٌّ
      [], // مُضِلٌّ
      [] // مُبينٌ
    ],
    [ // آية 16
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      [], // ظَلَمتُ
      [], // نَفسى
      [], // فَاغفِر
      [], // لى
      [], // فَغَفَرَ
      [], // لَهُ
      [], // إِنَّهُ
      [], // هُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 17
      [], // قالَ
      [], // رَبِّ
      [], // بِما
      [], // أَنعَمتَ
      [], // عَلَىَّ
      [], // فَلَن
      [], // أَكونَ
      ["ظهيرا للمجرمين : مُعينا لهم"], // ظَهيرًا
      ["ظهيرا للمجرمين : مُعينا لهم"] // لِلمُجرِمينَ
    ],
    [ // آية 18
      [], // فَأَصبَحَ
      [], // فِى
      [], // المَدينَةِ
      [], // خائِفًا
      ["يترقّب : يتوقّع المكروه"], // يَتَرَقَّبُ
      [], // فَإِذَا
      [], // الَّذِى
      [], // استَنصَرَهُ
      [], // بِالأَمسِ
      ["يستصرخه : يستغيثه منْ بُعْد"], // يَستَصرِخُهُ
      [], // قالَ
      [], // لَهُ
      [], // موسىٰ
      [], // إِنَّكَ
      [], // لَغَوِىٌّ
      [] // مُبينٌ
    ],
    [ // آية 19
      [], // فَلَمّا
      [], // أَن
      [], // أَرادَ
      [], // أَن
      ["يبطش : يأخذ يقوّة و عُنف"], // يَبطِشَ
      [], // بِالَّذى
      [], // هُوَ
      [], // عَدُوٌّ
      [], // لَهُما
      [], // قالَ
      [], // يـٰموسىٰ
      [], // أَتُريدُ
      [], // أَن
      [], // تَقتُلَنى
      [], // كَما
      [], // قَتَلتَ
      [], // نَفسًا
      [], // بِالأَمسِ
      [], // إِن
      [], // تُريدُ
      [], // إِلّا
      [], // أَن
      [], // تَكونَ
      [], // جَبّارًا
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // تُريدُ
      [], // أَن
      [], // تَكونَ
      [], // مِنَ
      [] // المُصلِحينَ
    ],
    [ // آية 20
      [], // وَجاءَ
      [], // رَجُلٌ
      [], // مِن
      [], // أَقصَا
      [], // المَدينَةِ
      ["يسعى : يُسْرع في المشي"], // يَسعىٰ
      [], // قالَ
      [], // يـٰموسىٰ
      ["إن الملأ : وُجُوهَ القوم و كُـبَـراءَهم"], // إِنَّ
      ["إن الملأ : وُجُوهَ القوم و كُـبَـراءَهم"], // المَلَأَ
      ["يأتمرون بك : يتشاورون في شأنك"], // يَأتَمِرونَ
      ["يأتمرون بك : يتشاورون في شأنك"], // بِكَ
      [], // لِيَقتُلوكَ
      [], // فَاخرُج
      [], // إِنّى
      [], // لَكَ
      [], // مِنَ
      [] // النّـٰصِحينَ
    ],
    [ // آية 21
      [], // فَخَرَجَ
      [], // مِنها
      [], // خائِفًا
      [], // يَتَرَقَّبُ
      [], // قالَ
      [], // رَبِّ
      [], // نَجِّنى
      [], // مِنَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 22
      [], // وَلَمّا
      [], // تَوَجَّهَ
      ["تلقاء مدين : جهتِها و نحْوها (قرية شعيب)"], // تِلقاءَ
      ["تلقاء مدين : جهتِها و نحْوها (قرية شعيب)"], // مَديَنَ
      [], // قالَ
      [], // عَسىٰ
      [], // رَبّى
      [], // أَن
      [], // يَهدِيَنى
      ["سواء السّبيل : الطريق الوسط الذي فيه النّجاة"], // سَواءَ
      ["سواء السّبيل : الطريق الوسط الذي فيه النّجاة"] // السَّبيلِ
    ],
    [ // آية 23
      [], // وَلَمّا
      [], // وَرَدَ
      [], // ماءَ
      [], // مَديَنَ
      [], // وَجَدَ
      [], // عَلَيهِ
      ["أمّة من النّاس : جماعة كثيرة منهم"], // أُمَّةً
      ["أمّة من النّاس : جماعة كثيرة منهم"], // مِنَ
      ["أمّة من النّاس : جماعة كثيرة منهم"], // النّاسِ
      [], // يَسقونَ
      [], // وَوَجَدَ
      [], // مِن
      [], // دونِهِمُ
      [], // امرَأَتَينِ
      ["تذودان : تمنعان أغنامهما عن الماء"], // تَذودانِ
      [], // قالَ
      [], // ما
      [], // خَطبُكُما
      [], // قالَتا
      [], // لا
      [], // نَسقى
      [], // حَتّىٰ
      [], // يُصدِرَ
      [], // الرِّعاءُ
      [], // وَأَبونا
      [], // شَيخٌ
      [] // كَبيرٌ
    ],
    [ // آية 24
      [], // فَسَقىٰ
      [], // لَهُما
      [], // ثُمَّ
      [], // تَوَلّىٰ
      [], // إِلَى
      [], // الظِّلِّ
      [], // فَقالَ
      [], // رَبِّ
      [], // إِنّى
      [], // لِما
      [], // أَنزَلتَ
      [], // إِلَىَّ
      [], // مِن
      [], // خَيرٍ
      [] // فَقيرٌ
    ],
    [ // آية 25
      [], // فَجاءَتهُ
      [], // إِحدىٰهُما
      [], // تَمشى
      [], // عَلَى
      [], // استِحياءٍ
      [], // قالَت
      [], // إِنَّ
      [], // أَبى
      [], // يَدعوكَ
      [], // لِيَجزِيَكَ
      [], // أَجرَ
      [], // ما
      [], // سَقَيتَ
      [], // لَنا
      [], // فَلَمّا
      [], // جاءَهُ
      [], // وَقَصَّ
      [], // عَلَيهِ
      [], // القَصَصَ
      [], // قالَ
      [], // لا
      [], // تَخَف
      [], // نَجَوتَ
      [], // مِنَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 26
      [], // قالَت
      [], // إِحدىٰهُما
      [], // يـٰأَبَتِ
      [], // استَـٔجِرهُ
      [], // إِنَّ
      [], // خَيرَ
      [], // مَنِ
      [], // استَـٔجَرتَ
      [], // القَوِىُّ
      [] // الأَمينُ
    ],
    [ // آية 27
      [], // قالَ
      [], // إِنّى
      [], // أُريدُ
      [], // أَن
      [], // أُنكِحَكَ
      [], // إِحدَى
      [], // ابنَتَىَّ
      [], // هـٰتَينِ
      [], // عَلىٰ
      [], // أَن
      [], // تَأجُرَنى
      [], // ثَمـٰنِىَ
      ["حِجَج : سنين"], // حِجَجٍ
      [], // فَإِن
      [], // أَتمَمتَ
      [], // عَشرًا
      [], // فَمِن
      [], // عِندِكَ
      [], // وَما
      [], // أُريدُ
      [], // أَن
      [], // أَشُقَّ
      [], // عَلَيكَ
      [], // سَتَجِدُنى
      [], // إِن
      [], // شاءَ
      [], // اللَّهُ
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 28
      [], // قالَ
      [], // ذٰلِكَ
      [], // بَينى
      [], // وَبَينَكَ
      [], // أَيَّمَا
      [], // الأَجَلَينِ
      [], // قَضَيتُ
      [], // فَلا
      [], // عُدوٰنَ
      [], // عَلَىَّ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // ما
      [], // نَقولُ
      [] // وَكيلٌ
    ],
    [ // آية 29
      [], // فَلَمّا
      [], // قَضىٰ
      [], // موسَى
      [], // الأَجَلَ
      [], // وَسارَ
      [], // بِأَهلِهِ
      [], // ءانَسَ
      [], // مِن
      [], // جانِبِ
      [], // الطّورِ
      ["نارا : هي في الواقع نورٌ ربّانيّ"], // نارًا
      [], // قالَ
      [], // لِأَهلِهِ
      [], // امكُثوا
      [], // إِنّى
      [], // ءانَستُ
      [], // نارًا
      [], // لَعَلّى
      [], // ءاتيكُم
      [], // مِنها
      [], // بِخَبَرٍ
      [], // أَو
      ["جذوة من النّار : عودٌ فيه نارٌ بلا لهب"], // جَذوَةٍ
      ["جذوة من النّار : عودٌ فيه نارٌ بلا لهب"], // مِنَ
      ["جذوة من النّار : عودٌ فيه نارٌ بلا لهب"], // النّارِ
      [], // لَعَلَّكُم
      ["تصطلون : تستدفئون بها من البرْد"] // تَصطَلونَ
    ],
    [ // آية 30
      [], // فَلَمّا
      [], // أَتىٰها
      [], // نودِىَ
      [], // مِن
      [], // شـٰطِئِ
      [], // الوادِ
      [], // الأَيمَنِ
      [], // فِى
      [], // البُقعَةِ
      [], // المُبـٰرَكَةِ
      [], // مِنَ
      [], // الشَّجَرَةِ
      [], // أَن
      [], // يـٰموسىٰ
      [], // إِنّى
      [], // أَنَا
      [], // اللَّهُ
      [], // رَبُّ
      [] // العـٰلَمينَ
    ],
    [ // آية 31
      [], // وَأَن
      [], // أَلقِ
      [], // عَصاكَ
      [], // فَلَمّا
      [], // رَءاها
      [], // تَهتَزُّ
      ["كأنّها جانّ : حيّة خفيفة في سرعة حركتها"], // كَأَنَّها
      ["كأنّها جانّ : حيّة خفيفة في سرعة حركتها"], // جانٌّ
      [], // وَلّىٰ
      [], // مُدبِرًا
      [], // وَلَم
      [], // يُعَقِّب
      [], // يـٰموسىٰ
      [], // أَقبِل
      [], // وَلا
      [], // تَخَف
      [], // إِنَّكَ
      [], // مِنَ
      [] // الـٔامِنينَ
    ],
    [ // آية 32
      [], // اسلُك
      [], // يَدَكَ
      [], // فى
      [], // جَيبِكَ
      [], // تَخرُج
      ["بيضاء : لها شعاع يغلب شعاع الشمس"], // بَيضاءَ
      [], // مِن
      ["غير سوء : غير داء بَرَص و نحوه"], // غَيرِ
      ["غير سوء : غير داء بَرَص و نحوه"], // سوءٍ
      [], // وَاضمُم
      [], // إِلَيكَ
      [], // جَناحَكَ
      [], // مِنَ
      [], // الرَّهبِ
      [], // فَذٰنِكَ
      [], // بُرهـٰنانِ
      [], // مِن
      [], // رَبِّكَ
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      [], // إِنَّهُم
      [], // كانوا
      [], // قَومًا
      [] // فـٰسِقينَ
    ],
    [ // آية 33
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      [], // قَتَلتُ
      [], // مِنهُم
      [], // نَفسًا
      [], // فَأَخافُ
      [], // أَن
      [] // يَقتُلونِ
    ],
    [ // آية 34
      [], // وَأَخى
      [], // هـٰرونُ
      [], // هُوَ
      [], // أَفصَحُ
      [], // مِنّى
      [], // لِسانًا
      [], // فَأَرسِلهُ
      [], // مَعِىَ
      ["ردْءًا : عَوْنا"], // رِدءًا
      [], // يُصَدِّقُنى
      [], // إِنّى
      [], // أَخافُ
      [], // أَن
      [] // يُكَذِّبونِ
    ],
    [ // آية 35
      [], // قالَ
      ["سنشدّ عضدك : سنقوّيك و نعينك"], // سَنَشُدُّ
      ["سنشدّ عضدك : سنقوّيك و نعينك"], // عَضُدَكَ
      [], // بِأَخيكَ
      [], // وَنَجعَلُ
      [], // لَكُما
      [], // سُلطـٰنًا
      [], // فَلا
      [], // يَصِلونَ
      [], // إِلَيكُما
      [], // بِـٔايـٰتِنا
      [], // أَنتُما
      [], // وَمَنِ
      [], // اتَّبَعَكُمَا
      [] // الغـٰلِبونَ
    ],
    [ // آية 36
      [], // فَلَمّا
      [], // جاءَهُم
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // بَيِّنـٰتٍ
      [], // قالوا
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      [], // سِحرٌ
      ["مفترى : تنسبه إلى الله كذبا"], // مُفتَرًى
      [], // وَما
      [], // سَمِعنا
      [], // بِهـٰذا
      [], // فى
      [], // ءابائِنَا
      [] // الأَوَّلينَ
    ],
    [ // آية 37
      [], // وَقالَ
      [], // موسىٰ
      [], // رَبّى
      [], // أَعلَمُ
      [], // بِمَن
      [], // جاءَ
      [], // بِالهُدىٰ
      [], // مِن
      [], // عِندِهِ
      [], // وَمَن
      [], // تَكونُ
      [], // لَهُ
      [], // عـٰقِبَةُ
      [], // الدّارِ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 38
      [], // وَقالَ
      [], // فِرعَونُ
      [], // يـٰأَيُّهَا
      [], // المَلَأُ
      [], // ما
      [], // عَلِمتُ
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرى
      [], // فَأَوقِد
      [], // لى
      [], // يـٰهـٰمـٰنُ
      [], // عَلَى
      [], // الطّينِ
      [], // فَاجعَل
      [], // لى
      ["صرحا : قصرا . أو بناءً عاليًا مكشوفا"], // صَرحًا
      [], // لَعَلّى
      [], // أَطَّلِعُ
      [], // إِلىٰ
      [], // إِلـٰهِ
      [], // موسىٰ
      [], // وَإِنّى
      [], // لَأَظُنُّهُ
      [], // مِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 39
      [], // وَاستَكبَرَ
      [], // هُوَ
      [], // وَجُنودُهُ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَظَنّوا
      [], // أَنَّهُم
      [], // إِلَينا
      [], // لا
      [] // يُرجَعونَ
    ],
    [ // آية 40
      [], // فَأَخَذنـٰهُ
      [], // وَجُنودَهُ
      [], // فَنَبَذنـٰهُم
      [], // فِى
      [], // اليَمِّ
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 41
      [], // وَجَعَلنـٰهُم
      ["أئمّة : قادة في الضلال"], // أَئِمَّةً
      [], // يَدعونَ
      [], // إِلَى
      [], // النّارِ
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // لا
      [] // يُنصَرونَ
    ],
    [ // آية 42
      [], // وَأَتبَعنـٰهُم
      [], // فى
      [], // هـٰذِهِ
      [], // الدُّنيا
      ["لعنة : طردا و إبعادًا عن الرّحمة"], // لَعنَةً
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // هُم
      ["من المقبوحين : المبعدين أو المشوّهين في الخِلـْـقـَـة"], // مِنَ
      ["من المقبوحين : المبعدين أو المشوّهين في الخِلـْـقـَـة"] // المَقبوحينَ
    ],
    [ // آية 43
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // أَهلَكنَا
      ["القرون الأولى : الأمم الماضية المكذبة"], // القُرونَ
      ["القرون الأولى : الأمم الماضية المكذبة"], // الأولىٰ
      ["بصائر للنّاس : أنوارا لقلوبهم تبْصِر بها الحقائق"], // بَصائِرَ
      ["بصائر للنّاس : أنوارا لقلوبهم تبْصِر بها الحقائق"], // لِلنّاسِ
      [], // وَهُدًى
      [], // وَرَحمَةً
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 44
      [], // وَما
      [], // كُنتَ
      [], // بِجانِبِ
      [], // الغَربِىِّ
      [], // إِذ
      ["قضينا : عهِدْنا"], // قَضَينا
      [], // إِلىٰ
      [], // موسَى
      [], // الأَمرَ
      [], // وَما
      [], // كُنتَ
      [], // مِنَ
      [] // الشّـٰهِدينَ
    ],
    [ // آية 45
      [], // وَلـٰكِنّا
      [], // أَنشَأنا
      [], // قُرونًا
      [], // فَتَطاوَلَ
      [], // عَلَيهِمُ
      [], // العُمُرُ
      [], // وَما
      [], // كُنتَ
      [], // ثاوِيًا
      [], // فى
      [], // أَهلِ
      [], // مَديَنَ
      [], // تَتلوا
      [], // عَلَيهِم
      [], // ءايـٰتِنا
      [], // وَلـٰكِنّا
      [], // كُنّا
      [] // مُرسِلينَ
    ],
    [ // آية 46
      [], // وَما
      [], // كُنتَ
      [], // بِجانِبِ
      [], // الطّورِ
      [], // إِذ
      [], // نادَينا
      [], // وَلـٰكِن
      [], // رَحمَةً
      [], // مِن
      [], // رَبِّكَ
      [], // لِتُنذِرَ
      [], // قَومًا
      [], // ما
      [], // أَتىٰهُم
      [], // مِن
      [], // نَذيرٍ
      [], // مِن
      [], // قَبلِكَ
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 47
      [], // وَلَولا
      [], // أَن
      [], // تُصيبَهُم
      [], // مُصيبَةٌ
      [], // بِما
      [], // قَدَّمَت
      [], // أَيديهِم
      [], // فَيَقولوا
      [], // رَبَّنا
      [], // لَولا
      [], // أَرسَلتَ
      [], // إِلَينا
      [], // رَسولًا
      [], // فَنَتَّبِعَ
      [], // ءايـٰتِكَ
      [], // وَنَكونَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 48
      [], // فَلَمّا
      [], // جاءَهُمُ
      [], // الحَقُّ
      [], // مِن
      [], // عِندِنا
      [], // قالوا
      [], // لَولا
      [], // أوتِىَ
      [], // مِثلَ
      [], // ما
      [], // أوتِىَ
      [], // موسىٰ
      [], // أَوَلَم
      [], // يَكفُروا
      [], // بِما
      [], // أوتِىَ
      [], // موسىٰ
      [], // مِن
      [], // قَبلُ
      [], // قالوا
      [], // سِحرانِ
      [], // تَظـٰهَرا
      [], // وَقالوا
      [], // إِنّا
      [], // بِكُلٍّ
      [] // كـٰفِرونَ
    ],
    [ // آية 49
      [], // قُل
      [], // فَأتوا
      [], // بِكِتـٰبٍ
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // هُوَ
      [], // أَهدىٰ
      [], // مِنهُما
      [], // أَتَّبِعهُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 50
      [], // فَإِن
      [], // لَم
      [], // يَستَجيبوا
      [], // لَكَ
      [], // فَاعلَم
      [], // أَنَّما
      [], // يَتَّبِعونَ
      [], // أَهواءَهُم
      [], // وَمَن
      [], // أَضَلُّ
      [], // مِمَّنِ
      [], // اتَّبَعَ
      [], // هَوىٰهُ
      [], // بِغَيرِ
      [], // هُدًى
      [], // مِنَ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 51
      [], // وَلَقَد
      ["وصّلنا لهم القول : أنزلنا القرآن عليهم مُتواصلا"], // وَصَّلنا
      ["وصّلنا لهم القول : أنزلنا القرآن عليهم مُتواصلا"], // لَهُمُ
      ["وصّلنا لهم القول : أنزلنا القرآن عليهم مُتواصلا"], // القَولَ
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 52
      [], // الَّذينَ
      [], // ءاتَينـٰهُمُ
      [], // الكِتـٰبَ
      [], // مِن
      [], // قَبلِهِ
      [], // هُم
      [], // بِهِ
      [] // يُؤمِنونَ
    ],
    [ // آية 53
      [], // وَإِذا
      [], // يُتلىٰ
      [], // عَلَيهِم
      [], // قالوا
      [], // ءامَنّا
      [], // بِهِ
      [], // إِنَّهُ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّنا
      [], // إِنّا
      [], // كُنّا
      [], // مِن
      [], // قَبلِهِ
      [] // مُسلِمينَ
    ],
    [ // آية 54
      [], // أُولـٰئِكَ
      [], // يُؤتَونَ
      [], // أَجرَهُم
      [], // مَرَّتَينِ
      [], // بِما
      [], // صَبَروا
      [], // وَيَدرَءونَ
      [], // بِالحَسَنَةِ
      [], // السَّيِّئَةَ
      [], // وَمِمّا
      [], // رَزَقنـٰهُم
      [] // يُنفِقونَ
    ],
    [ // آية 55
      [], // وَإِذا
      [], // سَمِعُوا
      ["اللّغو : السّبّ و الشّـتـْـم من الكفار"], // اللَّغوَ
      [], // أَعرَضوا
      [], // عَنهُ
      [], // وَقالوا
      [], // لَنا
      [], // أَعمـٰلُنا
      [], // وَلَكُم
      [], // أَعمـٰلُكُم
      [], // سَلـٰمٌ
      [], // عَلَيكُم
      [], // لا
      [], // نَبتَغِى
      [] // الجـٰهِلينَ
    ],
    [ // آية 56
      [], // إِنَّكَ
      [], // لا
      [], // تَهدى
      [], // مَن
      [], // أَحبَبتَ
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // يَهدى
      [], // مَن
      [], // يَشاءُ
      [], // وَهُوَ
      [], // أَعلَمُ
      [] // بِالمُهتَدينَ
    ],
    [ // آية 57
      [], // وَقالوا
      [], // إِن
      [], // نَتَّبِعِ
      [], // الهُدىٰ
      [], // مَعَكَ
      [], // نُتَخَطَّف
      [], // مِن
      [], // أَرضِنا
      [], // أَوَلَم
      [], // نُمَكِّن
      [], // لَهُم
      [], // حَرَمًا
      [], // ءامِنًا
      ["يُجْبى إليه : يُجْلب و يُحمل إليه من كلّ جهة"], // يُجبىٰ
      ["يُجْبى إليه : يُجْلب و يُحمل إليه من كلّ جهة"], // إِلَيهِ
      [], // ثَمَرٰتُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // رِزقًا
      [], // مِن
      [], // لَدُنّا
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 58
      [], // وَكَم
      [], // أَهلَكنا
      [], // مِن
      [], // قَريَةٍ
      ["بَطِرت مَعيشَتها : طغتْ و تمرّدت في أيّام حياتها"], // بَطِرَت
      ["بَطِرت مَعيشَتها : طغتْ و تمرّدت في أيّام حياتها"], // مَعيشَتَها
      [], // فَتِلكَ
      [], // مَسـٰكِنُهُم
      [], // لَم
      [], // تُسكَن
      [], // مِن
      [], // بَعدِهِم
      [], // إِلّا
      [], // قَليلًا
      [], // وَكُنّا
      [], // نَحنُ
      [] // الوٰرِثينَ
    ],
    [ // آية 59
      [], // وَما
      [], // كانَ
      [], // رَبُّكَ
      [], // مُهلِكَ
      [], // القُرىٰ
      [], // حَتّىٰ
      [], // يَبعَثَ
      [], // فى
      [], // أُمِّها
      [], // رَسولًا
      [], // يَتلوا
      [], // عَلَيهِم
      [], // ءايـٰتِنا
      [], // وَما
      [], // كُنّا
      [], // مُهلِكِى
      [], // القُرىٰ
      [], // إِلّا
      [], // وَأَهلُها
      [] // ظـٰلِمونَ
    ],
    [ // آية 60
      [], // وَما
      [], // أوتيتُم
      [], // مِن
      [], // شَىءٍ
      [], // فَمَتـٰعُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَزينَتُها
      [], // وَما
      [], // عِندَ
      [], // اللَّهِ
      [], // خَيرٌ
      [], // وَأَبقىٰ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 61
      [], // أَفَمَن
      [], // وَعَدنـٰهُ
      [], // وَعدًا
      [], // حَسَنًا
      [], // فَهُوَ
      [], // لـٰقيهِ
      [], // كَمَن
      [], // مَتَّعنـٰهُ
      [], // مَتـٰعَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // ثُمَّ
      [], // هُوَ
      [], // يَومَ
      [], // القِيـٰمَةِ
      ["من المحضرين : ممّن أحضروا للنّار"], // مِنَ
      ["من المحضرين : ممّن أحضروا للنّار"] // المُحضَرينَ
    ],
    [ // آية 62
      [], // وَيَومَ
      [], // يُناديهِم
      [], // فَيَقولُ
      [], // أَينَ
      [], // شُرَكاءِىَ
      [], // الَّذينَ
      [], // كُنتُم
      [] // تَزعُمونَ
    ],
    [ // آية 63
      [], // قالَ
      [], // الَّذينَ
      [], // حَقَّ
      [], // عَلَيهِمُ
      [], // القَولُ
      [], // رَبَّنا
      [], // هـٰؤُلاءِ
      [], // الَّذينَ
      ["أغوينا : دعَوْناهم إلى الغيّ فاتـّـبعونا"], // أَغوَينا
      [], // أَغوَينـٰهُم
      [], // كَما
      [], // غَوَينا
      [], // تَبَرَّأنا
      [], // إِلَيكَ
      [], // ما
      [], // كانوا
      [], // إِيّانا
      [] // يَعبُدونَ
    ],
    [ // آية 64
      [], // وَقيلَ
      [], // ادعوا
      [], // شُرَكاءَكُم
      [], // فَدَعَوهُم
      [], // فَلَم
      [], // يَستَجيبوا
      [], // لَهُم
      [], // وَرَأَوُا
      [], // العَذابَ
      [], // لَو
      [], // أَنَّهُم
      [], // كانوا
      [] // يَهتَدونَ
    ],
    [ // آية 65
      [], // وَيَومَ
      [], // يُناديهِم
      [], // فَيَقولُ
      [], // ماذا
      [], // أَجَبتُمُ
      [] // المُرسَلينَ
    ],
    [ // آية 66
      ["فعَمِيَتْ عليهم الأنباء : خَفِيَتْ و اشتبَهَتْ عليهم الحجج"], // فَعَمِيَت
      ["فعَمِيَتْ عليهم الأنباء : خَفِيَتْ و اشتبَهَتْ عليهم الحجج"], // عَلَيهِمُ
      ["فعَمِيَتْ عليهم الأنباء : خَفِيَتْ و اشتبَهَتْ عليهم الحجج"], // الأَنباءُ
      [], // يَومَئِذٍ
      [], // فَهُم
      [], // لا
      [] // يَتَساءَلونَ
    ],
    [ // آية 67
      [], // فَأَمّا
      [], // مَن
      [], // تابَ
      [], // وَءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // فَعَسىٰ
      [], // أَن
      [], // يَكونَ
      [], // مِنَ
      [] // المُفلِحينَ
    ],
    [ // آية 68
      [], // وَرَبُّكَ
      [], // يَخلُقُ
      [], // ما
      [], // يَشاءُ
      [], // وَيَختارُ
      [], // ما
      [], // كانَ
      [], // لَهُمُ
      ["الخيَرَة : الاختيار"], // الخِيَرَةُ
      [], // سُبحـٰنَ
      [], // اللَّهِ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 69
      [], // وَرَبُّكَ
      [], // يَعلَمُ
      ["ما تكنّ صدورهم : ما تُضمر من الباطل و العداوة"], // ما
      ["ما تكنّ صدورهم : ما تُضمر من الباطل و العداوة"], // تُكِنُّ
      ["ما تكنّ صدورهم : ما تُضمر من الباطل و العداوة"], // صُدورُهُم
      [], // وَما
      [] // يُعلِنونَ
    ],
    [ // آية 70
      [], // وَهُوَ
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // لَهُ
      [], // الحَمدُ
      [], // فِى
      [], // الأولىٰ
      [], // وَالـٔاخِرَةِ
      [], // وَلَهُ
      [], // الحُكمُ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 71
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // جَعَلَ
      [], // اللَّهُ
      [], // عَلَيكُمُ
      [], // الَّيلَ
      ["سرمدا : دائما مُطّردا"], // سَرمَدًا
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // مَن
      [], // إِلـٰهٌ
      [], // غَيرُ
      [], // اللَّهِ
      [], // يَأتيكُم
      [], // بِضِياءٍ
      [], // أَفَلا
      [] // تَسمَعونَ
    ],
    [ // آية 72
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // جَعَلَ
      [], // اللَّهُ
      [], // عَلَيكُمُ
      [], // النَّهارَ
      [], // سَرمَدًا
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // مَن
      [], // إِلـٰهٌ
      [], // غَيرُ
      [], // اللَّهِ
      [], // يَأتيكُم
      [], // بِلَيلٍ
      [], // تَسكُنونَ
      [], // فيهِ
      [], // أَفَلا
      [] // تُبصِرونَ
    ],
    [ // آية 73
      [], // وَمِن
      [], // رَحمَتِهِ
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // لِتَسكُنوا
      [], // فيهِ
      [], // وَلِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // وَلَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 74
      [], // وَيَومَ
      [], // يُناديهِم
      [], // فَيَقولُ
      [], // أَينَ
      [], // شُرَكاءِىَ
      [], // الَّذينَ
      [], // كُنتُم
      [] // تَزعُمونَ
    ],
    [ // آية 75
      [], // وَنَزَعنا
      [], // مِن
      [], // كُلِّ
      [], // أُمَّةٍ
      [], // شَهيدًا
      [], // فَقُلنا
      [], // هاتوا
      [], // بُرهـٰنَكُم
      [], // فَعَلِموا
      [], // أَنَّ
      [], // الحَقَّ
      [], // لِلَّهِ
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      ["يفترون : يختلقونه من الباطل في الدّنيا"] // يَفتَرونَ
    ],
    [ // آية 76
      [], // إِنَّ
      [], // قـٰرونَ
      [], // كانَ
      [], // مِن
      [], // قَومِ
      [], // موسىٰ
      ["فبغى عليهم : ظَلَمَهُم . أو تكبّرَ عليهم"], // فَبَغىٰ
      ["فبغى عليهم : ظَلَمَهُم . أو تكبّرَ عليهم"], // عَلَيهِم
      [], // وَءاتَينـٰهُ
      [], // مِنَ
      [], // الكُنوزِ
      [], // ما
      [], // إِنَّ
      [], // مَفاتِحَهُ
      [], // لَتَنوأُ
      [], // بِالعُصبَةِ
      [], // أُولِى
      [], // القُوَّةِ
      [], // إِذ
      [], // قالَ
      [], // لَهُ
      [], // قَومُهُ
      ["لا تفرحْ : لا تبْطَرْ و لا تأشَرْ بكُثرَةِ المال"], // لا
      ["لا تفرحْ : لا تبْطَرْ و لا تأشَرْ بكُثرَةِ المال"], // تَفرَح
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [] // الفَرِحينَ
    ],
    [ // آية 77
      [], // وَابتَغِ
      [], // فيما
      [], // ءاتىٰكَ
      [], // اللَّهُ
      [], // الدّارَ
      [], // الـٔاخِرَةَ
      [], // وَلا
      [], // تَنسَ
      [], // نَصيبَكَ
      [], // مِنَ
      [], // الدُّنيا
      [], // وَأَحسِن
      [], // كَما
      [], // أَحسَنَ
      [], // اللَّهُ
      [], // إِلَيكَ
      [], // وَلا
      [], // تَبغِ
      [], // الفَسادَ
      [], // فِى
      [], // الأَرضِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [] // المُفسِدينَ
    ],
    [ // آية 78
      [], // قالَ
      [], // إِنَّما
      [], // أوتيتُهُ
      [], // عَلىٰ
      [], // عِلمٍ
      [], // عِندى
      [], // أَوَلَم
      [], // يَعلَم
      [], // أَنَّ
      [], // اللَّهَ
      [], // قَد
      [], // أَهلَكَ
      [], // مِن
      [], // قَبلِهِ
      ["مِنَ القرون : من الأمم"], // مِنَ
      ["مِنَ القرون : من الأمم"], // القُرونِ
      [], // مَن
      [], // هُوَ
      [], // أَشَدُّ
      [], // مِنهُ
      [], // قُوَّةً
      [], // وَأَكثَرُ
      [], // جَمعًا
      [], // وَلا
      [], // يُسـَٔلُ
      [], // عَن
      [], // ذُنوبِهِمُ
      [] // المُجرِمونَ
    ],
    [ // آية 79
      [], // فَخَرَجَ
      [], // عَلىٰ
      [], // قَومِهِ
      [], // فى
      [], // زينَتِهِ
      [], // قالَ
      [], // الَّذينَ
      [], // يُريدونَ
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // يـٰلَيتَ
      [], // لَنا
      [], // مِثلَ
      [], // ما
      [], // أوتِىَ
      [], // قـٰرونُ
      [], // إِنَّهُ
      [], // لَذو
      [], // حَظٍّ
      [] // عَظيمٍ
    ],
    [ // آية 80
      [], // وَقالَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      ["ويلكم : زجْرٌ لهم عن هذا التـّـمنّي"], // وَيلَكُم
      [], // ثَوابُ
      [], // اللَّهِ
      [], // خَيرٌ
      [], // لِمَن
      [], // ءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // وَلا
      [], // يُلَقّىٰها
      [], // إِلَّا
      [] // الصّـٰبِرونَ
    ],
    [ // آية 81
      [], // فَخَسَفنا
      [], // بِهِ
      [], // وَبِدارِهِ
      [], // الأَرضَ
      [], // فَما
      [], // كانَ
      [], // لَهُ
      [], // مِن
      [], // فِئَةٍ
      [], // يَنصُرونَهُ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَما
      [], // كانَ
      [], // مِنَ
      [] // المُنتَصِرينَ
    ],
    [ // آية 82
      [], // وَأَصبَحَ
      [], // الَّذينَ
      [], // تَمَنَّوا
      [], // مَكانَهُ
      [], // بِالأَمسِ
      [], // يَقولونَ
      ["ويْكأنّ الله : ألـَـمْ تـَـرَ الله"], // وَيكَأَنَّ
      ["ويْكأنّ الله : ألـَـمْ تـَـرَ الله"], // اللَّهَ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَيَقدِرُ
      [], // لَولا
      [], // أَن
      [], // مَنَّ
      [], // اللَّهُ
      [], // عَلَينا
      [], // لَخَسَفَ
      [], // بِنا
      ["ويكَأنّه لا يفلح : ألـَـم ترَ الشأن لا يُفلح . . ."], // وَيكَأَنَّهُ
      ["ويكَأنّه لا يفلح : ألـَـم ترَ الشأن لا يُفلح . . ."], // لا
      ["ويكَأنّه لا يفلح : ألـَـم ترَ الشأن لا يُفلح . . ."], // يُفلِحُ
      [] // الكـٰفِرونَ
    ],
    [ // آية 83
      [], // تِلكَ
      [], // الدّارُ
      [], // الـٔاخِرَةُ
      [], // نَجعَلُها
      [], // لِلَّذينَ
      [], // لا
      [], // يُريدونَ
      [], // عُلُوًّا
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // فَسادًا
      [], // وَالعـٰقِبَةُ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 84
      [], // مَن
      [], // جاءَ
      [], // بِالحَسَنَةِ
      [], // فَلَهُ
      [], // خَيرٌ
      [], // مِنها
      [], // وَمَن
      [], // جاءَ
      [], // بِالسَّيِّئَةِ
      [], // فَلا
      [], // يُجزَى
      [], // الَّذينَ
      [], // عَمِلُوا
      [], // السَّيِّـٔاتِ
      [], // إِلّا
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 85
      [], // إِنَّ
      [], // الَّذى
      [], // فَرَضَ
      [], // عَلَيكَ
      [], // القُرءانَ
      [], // لَرادُّكَ
      [], // إِلىٰ
      ["معادٍ : مكّة المكرّمة ظاهرا عليها"], // مَعادٍ
      [], // قُل
      [], // رَبّى
      [], // أَعلَمُ
      [], // مَن
      [], // جاءَ
      [], // بِالهُدىٰ
      [], // وَمَن
      [], // هُوَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 86
      [], // وَما
      [], // كُنتَ
      [], // تَرجوا
      [], // أَن
      [], // يُلقىٰ
      [], // إِلَيكَ
      [], // الكِتـٰبُ
      [], // إِلّا
      [], // رَحمَةً
      [], // مِن
      [], // رَبِّكَ
      [], // فَلا
      [], // تَكونَنَّ
      [], // ظَهيرًا
      [] // لِلكـٰفِرينَ
    ],
    [ // آية 87
      [], // وَلا
      [], // يَصُدُّنَّكَ
      [], // عَن
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // بَعدَ
      [], // إِذ
      [], // أُنزِلَت
      [], // إِلَيكَ
      [], // وَادعُ
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // وَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 88
      [], // وَلا
      [], // تَدعُ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // كُلُّ
      [], // شَىءٍ
      [], // هالِكٌ
      [], // إِلّا
      [], // وَجهَهُ
      [], // لَهُ
      [], // الحُكمُ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ]
];

export default meanings;