const meanings = [
  [ // سورة 29: العنكبوت
[ // آية 1
      [] // الم
    ],
    [ // آية 2
      [], // أَحَسِبَ
      [], // النّاسُ
      [], // أَن
      [], // يُترَكوا
      [], // أَن
      [], // يَقولوا
      [], // ءامَنّا
      [], // وَهُم
      [], // لا
      [] // يُفتَنونَ
    ],
    [ // آية 3
      [], // وَلَقَد
      [], // فَتَنَّا
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَلَيَعلَمَنَّ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // صَدَقوا
      [], // وَلَيَعلَمَنَّ
      [] // الكـٰذِبينَ
    ],
    [ // آية 4
      [], // أَم
      [], // حَسِبَ
      [], // الَّذينَ
      [], // يَعمَلونَ
      [], // السَّيِّـٔاتِ
      ["أن يسبقونا : أن يُعجزونا و يفوتونا"], // أَن
      ["أن يسبقونا : أن يُعجزونا و يفوتونا"], // يَسبِقونا
      [], // ساءَ
      [], // ما
      [] // يَحكُمونَ
    ],
    [ // آية 5
      [], // مَن
      [], // كانَ
      [], // يَرجوا
      [], // لِقاءَ
      [], // اللَّهِ
      [], // فَإِنَّ
      ["أجل الله : الوقت المعيّن للبعث و الجزاء"], // أَجَلَ
      ["أجل الله : الوقت المعيّن للبعث و الجزاء"], // اللَّهِ
      [], // لَـٔاتٍ
      [], // وَهُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 6
      [], // وَمَن
      [], // جـٰهَدَ
      [], // فَإِنَّما
      [], // يُجـٰهِدُ
      [], // لِنَفسِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَغَنِىٌّ
      [], // عَنِ
      [] // العـٰلَمينَ
    ],
    [ // آية 7
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَنُكَفِّرَنَّ
      [], // عَنهُم
      [], // سَيِّـٔاتِهِم
      [], // وَلَنَجزِيَنَّهُم
      [], // أَحسَنَ
      [], // الَّذى
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 8
      [], // وَوَصَّينَا
      [], // الإِنسـٰنَ
      [], // بِوٰلِدَيهِ
      ["حسنا : برّا بهما و عطفا عليهما"], // حُسنًا
      [], // وَإِن
      [], // جـٰهَداكَ
      [], // لِتُشرِكَ
      [], // بى
      [], // ما
      [], // لَيسَ
      [], // لَكَ
      [], // بِهِ
      [], // عِلمٌ
      [], // فَلا
      [], // تُطِعهُما
      [], // إِلَىَّ
      [], // مَرجِعُكُم
      [], // فَأُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 9
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَنُدخِلَنَّهُم
      [], // فِى
      [] // الصّـٰلِحينَ
    ],
    [ // آية 10
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يَقولُ
      [], // ءامَنّا
      [], // بِاللَّهِ
      [], // فَإِذا
      [], // أوذِىَ
      [], // فِى
      [], // اللَّهِ
      [], // جَعَلَ
      ["فتنة النّاس : ما يُصيبه من أذاهم و عذابهم"], // فِتنَةَ
      ["فتنة النّاس : ما يُصيبه من أذاهم و عذابهم"], // النّاسِ
      [], // كَعَذابِ
      [], // اللَّهِ
      [], // وَلَئِن
      [], // جاءَ
      [], // نَصرٌ
      [], // مِن
      [], // رَبِّكَ
      [], // لَيَقولُنَّ
      [], // إِنّا
      [], // كُنّا
      [], // مَعَكُم
      [], // أَوَلَيسَ
      [], // اللَّهُ
      [], // بِأَعلَمَ
      [], // بِما
      [], // فى
      [], // صُدورِ
      [] // العـٰلَمينَ
    ],
    [ // آية 11
      [], // وَلَيَعلَمَنَّ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَلَيَعلَمَنَّ
      [] // المُنـٰفِقينَ
    ],
    [ // آية 12
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلَّذينَ
      [], // ءامَنُوا
      [], // اتَّبِعوا
      [], // سَبيلَنا
      [], // وَلنَحمِل
      [], // خَطـٰيـٰكُم
      [], // وَما
      [], // هُم
      [], // بِحـٰمِلينَ
      [], // مِن
      [], // خَطـٰيـٰهُم
      [], // مِن
      [], // شَىءٍ
      [], // إِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 13
      [], // وَلَيَحمِلُنَّ
      ["أثقالهم : خطاياهم الفادحة"], // أَثقالَهُم
      [], // وَأَثقالًا
      [], // مَعَ
      [], // أَثقالِهِم
      [], // وَلَيُسـَٔلُنَّ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // عَمّا
      [], // كانوا
      ["يفترون : يختلقونه من الأباطيل و الأكاذيب"] // يَفتَرونَ
    ],
    [ // آية 14
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // نوحًا
      [], // إِلىٰ
      [], // قَومِهِ
      [], // فَلَبِثَ
      [], // فيهِم
      [], // أَلفَ
      [], // سَنَةٍ
      [], // إِلّا
      [], // خَمسينَ
      [], // عامًا
      [], // فَأَخَذَهُمُ
      [], // الطّوفانُ
      [], // وَهُم
      [] // ظـٰلِمونَ
    ],
    [ // آية 15
      [], // فَأَنجَينـٰهُ
      [], // وَأَصحـٰبَ
      [], // السَّفينَةِ
      [], // وَجَعَلنـٰها
      [], // ءايَةً
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 16
      [], // وَإِبرٰهيمَ
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // وَاتَّقوهُ
      [], // ذٰلِكُم
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 17
      [], // إِنَّما
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَوثـٰنًا
      [], // وَتَخلُقونَ
      [], // إِفكًا
      [], // إِنَّ
      [], // الَّذينَ
      [], // تَعبُدونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // لا
      [], // يَملِكونَ
      [], // لَكُم
      [], // رِزقًا
      [], // فَابتَغوا
      [], // عِندَ
      [], // اللَّهِ
      [], // الرِّزقَ
      [], // وَاعبُدوهُ
      [], // وَاشكُروا
      [], // لَهُ
      [], // إِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 18
      [], // وَإِن
      [], // تُكَذِّبوا
      [], // فَقَد
      [], // كَذَّبَ
      [], // أُمَمٌ
      [], // مِن
      [], // قَبلِكُم
      [], // وَما
      [], // عَلَى
      [], // الرَّسولِ
      [], // إِلَّا
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 19
      [], // أَوَلَم
      [], // يَرَوا
      [], // كَيفَ
      [], // يُبدِئُ
      [], // اللَّهُ
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرٌ
    ],
    [ // آية 20
      [], // قُل
      [], // سيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَانظُروا
      [], // كَيفَ
      [], // بَدَأَ
      [], // الخَلقَ
      [], // ثُمَّ
      [], // اللَّهُ
      [], // يُنشِئُ
      [], // النَّشأَةَ
      [], // الـٔاخِرَةَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 21
      [], // يُعَذِّبُ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَرحَمُ
      [], // مَن
      [], // يَشاءُ
      [], // وَإِلَيهِ
      [] // تُقلَبونَ
    ],
    [ // آية 22
      [], // وَما
      [], // أَنتُم
      ["بمعجزين : فائتين من عذابه بالهرب"], // بِمُعجِزينَ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // فِى
      [], // السَّماءِ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [] // نَصيرٍ
    ],
    [ // آية 23
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَلِقائِهِ
      [], // أُولـٰئِكَ
      [], // يَئِسوا
      [], // مِن
      [], // رَحمَتى
      [], // وَأُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 24
      [], // فَما
      [], // كانَ
      [], // جَوابَ
      [], // قَومِهِ
      [], // إِلّا
      [], // أَن
      [], // قالُوا
      [], // اقتُلوهُ
      [], // أَو
      [], // حَرِّقوهُ
      [], // فَأَنجىٰهُ
      [], // اللَّهُ
      [], // مِنَ
      [], // النّارِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 25
      [], // وَقالَ
      [], // إِنَّمَا
      [], // اتَّخَذتُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَوثـٰنًا
      ["مودّة بينكم : للتوادّ و التّواصل بينكم لاجماعكم على عبادتها"], // مَوَدَّةَ
      ["مودّة بينكم : للتوادّ و التّواصل بينكم لاجماعكم على عبادتها"], // بَينِكُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // ثُمَّ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // يَكفُرُ
      [], // بَعضُكُم
      [], // بِبَعضٍ
      [], // وَيَلعَنُ
      [], // بَعضُكُم
      [], // بَعضًا
      [], // وَمَأوىٰكُمُ
      [], // النّارُ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [] // نـٰصِرينَ
    ],
    [ // آية 26
      [], // فَـٔامَنَ
      [], // لَهُ
      [], // لوطٌ
      [], // وَقالَ
      [], // إِنّى
      [], // مُهاجِرٌ
      [], // إِلىٰ
      [], // رَبّى
      [], // إِنَّهُ
      [], // هُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 27
      [], // وَوَهَبنا
      [], // لَهُ
      [], // إِسحـٰقَ
      [], // وَيَعقوبَ
      [], // وَجَعَلنا
      [], // فى
      [], // ذُرِّيَّتِهِ
      [], // النُّبُوَّةَ
      [], // وَالكِتـٰبَ
      [], // وَءاتَينـٰهُ
      [], // أَجرَهُ
      [], // فِى
      [], // الدُّنيا
      [], // وَإِنَّهُ
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // لَمِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 28
      [], // وَلوطًا
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // إِنَّكُم
      [], // لَتَأتونَ
      [], // الفـٰحِشَةَ
      [], // ما
      [], // سَبَقَكُم
      [], // بِها
      [], // مِن
      [], // أَحَدٍ
      [], // مِنَ
      [] // العـٰلَمينَ
    ],
    [ // آية 29
      [], // أَئِنَّكُم
      [], // لَتَأتونَ
      [], // الرِّجالَ
      [], // وَتَقطَعونَ
      [], // السَّبيلَ
      [], // وَتَأتونَ
      [], // فى
      ["ناديكم : مجلسكم الذي تجتمعون فيه"], // ناديكُمُ
      [], // المُنكَرَ
      [], // فَما
      [], // كانَ
      [], // جَوابَ
      [], // قَومِهِ
      [], // إِلّا
      [], // أَن
      [], // قالُوا
      [], // ائتِنا
      [], // بِعَذابِ
      [], // اللَّهِ
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 30
      [], // قالَ
      [], // رَبِّ
      [], // انصُرنى
      [], // عَلَى
      [], // القَومِ
      [] // المُفسِدينَ
    ],
    [ // آية 31
      [], // وَلَمّا
      [], // جاءَت
      [], // رُسُلُنا
      [], // إِبرٰهيمَ
      [], // بِالبُشرىٰ
      [], // قالوا
      [], // إِنّا
      [], // مُهلِكوا
      [], // أَهلِ
      [], // هـٰذِهِ
      [], // القَريَةِ
      [], // إِنَّ
      [], // أَهلَها
      [], // كانوا
      [] // ظـٰلِمينَ
    ],
    [ // آية 32
      [], // قالَ
      [], // إِنَّ
      [], // فيها
      [], // لوطًا
      [], // قالوا
      [], // نَحنُ
      [], // أَعلَمُ
      [], // بِمَن
      [], // فيها
      [], // لَنُنَجِّيَنَّهُ
      [], // وَأَهلَهُ
      [], // إِلَّا
      [], // امرَأَتَهُ
      [], // كانَت
      [], // مِنَ
      [] // الغـٰبِرينَ
    ],
    [ // آية 33
      [], // وَلَمّا
      [], // أَن
      [], // جاءَت
      [], // رُسُلُنا
      [], // لوطًا
      [], // سىءَ
      [], // بِهِم
      [], // وَضاقَ
      [], // بِهِم
      [], // ذَرعًا
      [], // وَقالوا
      [], // لا
      [], // تَخَف
      [], // وَلا
      [], // تَحزَن
      [], // إِنّا
      [], // مُنَجّوكَ
      [], // وَأَهلَكَ
      [], // إِلَّا
      [], // امرَأَتَكَ
      [], // كانَت
      [], // مِنَ
      [] // الغـٰبِرينَ
    ],
    [ // آية 34
      [], // إِنّا
      [], // مُنزِلونَ
      [], // عَلىٰ
      [], // أَهلِ
      [], // هـٰذِهِ
      [], // القَريَةِ
      ["رجزا : عذابا شديدا"], // رِجزًا
      [], // مِنَ
      [], // السَّماءِ
      [], // بِما
      [], // كانوا
      [] // يَفسُقونَ
    ],
    [ // آية 35
      [], // وَلَقَد
      [], // تَرَكنا
      [], // مِنها
      [], // ءايَةً
      [], // بَيِّنَةً
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 36
      [], // وَإِلىٰ
      [], // مَديَنَ
      [], // أَخاهُم
      [], // شُعَيبًا
      [], // فَقالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // وَارجُوا
      [], // اليَومَ
      [], // الـٔاخِرَ
      [], // وَلا
      [], // تَعثَوا
      [], // فِى
      [], // الأَرضِ
      [] // مُفسِدينَ
    ],
    [ // آية 37
      [], // فَكَذَّبوهُ
      ["فأخذتهم الرّجفة : الزلزلة الشديدة بسبب الصّيحة"], // فَأَخَذَتهُمُ
      ["فأخذتهم الرّجفة : الزلزلة الشديدة بسبب الصّيحة"], // الرَّجفَةُ
      [], // فَأَصبَحوا
      [], // فى
      [], // دارِهِم
      [] // جـٰثِمينَ
    ],
    [ // آية 38
      [], // وَعادًا
      [], // وَثَمودَا۟
      [], // وَقَد
      [], // تَبَيَّنَ
      [], // لَكُم
      [], // مِن
      [], // مَسـٰكِنِهِم
      [], // وَزَيَّنَ
      [], // لَهُمُ
      [], // الشَّيطـٰنُ
      [], // أَعمـٰلَهُم
      [], // فَصَدَّهُم
      [], // عَنِ
      [], // السَّبيلِ
      [], // وَكانوا
      [] // مُستَبصِرينَ
    ],
    [ // آية 39
      [], // وَقـٰرونَ
      [], // وَفِرعَونَ
      [], // وَهـٰمـٰنَ
      [], // وَلَقَد
      [], // جاءَهُم
      [], // موسىٰ
      [], // بِالبَيِّنـٰتِ
      [], // فَاستَكبَروا
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // كانوا
      [] // سـٰبِقينَ
    ],
    [ // آية 40
      [], // فَكُلًّا
      [], // أَخَذنا
      [], // بِذَنبِهِ
      [], // فَمِنهُم
      [], // مَن
      [], // أَرسَلنا
      [], // عَلَيهِ
      ["حاصبا : ريحا عاصفا ترميهم بالحصباء"], // حاصِبًا
      [], // وَمِنهُم
      [], // مَن
      ["أخذته الصّيحة : صوتٌ من السّماء مُهلك مُرجف"], // أَخَذَتهُ
      ["أخذته الصّيحة : صوتٌ من السّماء مُهلك مُرجف"], // الصَّيحَةُ
      [], // وَمِنهُم
      [], // مَن
      [], // خَسَفنا
      [], // بِهِ
      [], // الأَرضَ
      [], // وَمِنهُم
      [], // مَن
      [], // أَغرَقنا
      [], // وَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيَظلِمَهُم
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 41
      [], // مَثَلُ
      [], // الَّذينَ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَولِياءَ
      [], // كَمَثَلِ
      ["العنكبوت : حشرة معروفة"], // العَنكَبوتِ
      [], // اتَّخَذَت
      [], // بَيتًا
      [], // وَإِنَّ
      [], // أَوهَنَ
      [], // البُيوتِ
      [], // لَبَيتُ
      [], // العَنكَبوتِ
      [], // لَو
      [], // كانوا
      [] // يَعلَمونَ
    ],
    [ // آية 42
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // ما
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // مِن
      [], // شَىءٍ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 43
      [], // وَتِلكَ
      [], // الأَمثـٰلُ
      [], // نَضرِبُها
      [], // لِلنّاسِ
      [], // وَما
      [], // يَعقِلُها
      [], // إِلَّا
      [] // العـٰلِمونَ
    ],
    [ // آية 44
      [], // خَلَقَ
      [], // اللَّهُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 45
      [], // اتلُ
      [], // ما
      [], // أوحِىَ
      [], // إِلَيكَ
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // وَأَقِمِ
      [], // الصَّلوٰةَ
      [], // إِنَّ
      [], // الصَّلوٰةَ
      [], // تَنهىٰ
      [], // عَنِ
      [], // الفَحشاءِ
      [], // وَالمُنكَرِ
      [], // وَلَذِكرُ
      [], // اللَّهِ
      [], // أَكبَرُ
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // ما
      [] // تَصنَعونَ
    ],
    [ // آية 46
      [], // وَلا
      [], // تُجـٰدِلوا
      [], // أَهلَ
      [], // الكِتـٰبِ
      [], // إِلّا
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // إِلَّا
      [], // الَّذينَ
      [], // ظَلَموا
      [], // مِنهُم
      [], // وَقولوا
      [], // ءامَنّا
      [], // بِالَّذى
      [], // أُنزِلَ
      [], // إِلَينا
      [], // وَأُنزِلَ
      [], // إِلَيكُم
      [], // وَإِلـٰهُنا
      [], // وَإِلـٰهُكُم
      [], // وٰحِدٌ
      [], // وَنَحنُ
      [], // لَهُ
      [] // مُسلِمونَ
    ],
    [ // آية 47
      [], // وَكَذٰلِكَ
      [], // أَنزَلنا
      [], // إِلَيكَ
      [], // الكِتـٰبَ
      [], // فَالَّذينَ
      [], // ءاتَينـٰهُمُ
      [], // الكِتـٰبَ
      [], // يُؤمِنونَ
      [], // بِهِ
      [], // وَمِن
      [], // هـٰؤُلاءِ
      [], // مَن
      [], // يُؤمِنُ
      [], // بِهِ
      [], // وَما
      [], // يَجحَدُ
      [], // بِـٔايـٰتِنا
      [], // إِلَّا
      [] // الكـٰفِرونَ
    ],
    [ // آية 48
      [], // وَما
      [], // كُنتَ
      [], // تَتلوا
      [], // مِن
      [], // قَبلِهِ
      [], // مِن
      [], // كِتـٰبٍ
      [], // وَلا
      [], // تَخُطُّهُ
      [], // بِيَمينِكَ
      [], // إِذًا
      [], // لَارتابَ
      [] // المُبطِلونَ
    ],
    [ // آية 49
      [], // بَل
      [], // هُوَ
      [], // ءايـٰتٌ
      [], // بَيِّنـٰتٌ
      [], // فى
      [], // صُدورِ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // وَما
      [], // يَجحَدُ
      [], // بِـٔايـٰتِنا
      [], // إِلَّا
      [] // الظّـٰلِمونَ
    ],
    [ // آية 50
      [], // وَقالوا
      [], // لَولا
      [], // أُنزِلَ
      [], // عَلَيهِ
      [], // ءايـٰتٌ
      [], // مِن
      [], // رَبِّهِ
      [], // قُل
      [], // إِنَّمَا
      [], // الـٔايـٰتُ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَإِنَّما
      [], // أَنا۠
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 51
      [], // أَوَلَم
      [], // يَكفِهِم
      [], // أَنّا
      [], // أَنزَلنا
      [], // عَلَيكَ
      [], // الكِتـٰبَ
      [], // يُتلىٰ
      [], // عَلَيهِم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَرَحمَةً
      [], // وَذِكرىٰ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 52
      [], // قُل
      [], // كَفىٰ
      [], // بِاللَّهِ
      [], // بَينى
      [], // وَبَينَكُم
      [], // شَهيدًا
      [], // يَعلَمُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // بِالبـٰطِلِ
      [], // وَكَفَروا
      [], // بِاللَّهِ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 53
      [], // وَيَستَعجِلونَكَ
      [], // بِالعَذابِ
      [], // وَلَولا
      [], // أَجَلٌ
      [], // مُسَمًّى
      [], // لَجاءَهُمُ
      [], // العَذابُ
      [], // وَلَيَأتِيَنَّهُم
      ["بغتة : فجأة"], // بَغتَةً
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 54
      [], // يَستَعجِلونَكَ
      [], // بِالعَذابِ
      [], // وَإِنَّ
      [], // جَهَنَّمَ
      [], // لَمُحيطَةٌ
      [] // بِالكـٰفِرينَ
    ],
    [ // آية 55
      [], // يَومَ
      [], // يَغشىٰهُمُ
      [], // العَذابُ
      [], // مِن
      [], // فَوقِهِم
      [], // وَمِن
      [], // تَحتِ
      [], // أَرجُلِهِم
      [], // وَيَقولُ
      [], // ذوقوا
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 56
      [], // يـٰعِبادِىَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّ
      [], // أَرضى
      [], // وٰسِعَةٌ
      [], // فَإِيّـٰىَ
      [] // فَاعبُدونِ
    ],
    [ // آية 57
      [], // كُلُّ
      [], // نَفسٍ
      [], // ذائِقَةُ
      [], // المَوتِ
      [], // ثُمَّ
      [], // إِلَينا
      [] // تُرجَعونَ
    ],
    [ // آية 58
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَنُبَوِّئَنَّهُم
      [], // مِنَ
      [], // الجَنَّةِ
      ["غرفا : منازل رفيعة عالية"], // غُرَفًا
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // نِعمَ
      [], // أَجرُ
      [] // العـٰمِلينَ
    ],
    [ // آية 59
      [], // الَّذينَ
      [], // صَبَروا
      [], // وَعَلىٰ
      [], // رَبِّهِم
      [] // يَتَوَكَّلونَ
    ],
    [ // آية 60
      [], // وَكَأَيِّن
      [], // مِن
      [], // دابَّةٍ
      [], // لا
      [], // تَحمِلُ
      [], // رِزقَهَا
      [], // اللَّهُ
      [], // يَرزُقُها
      [], // وَإِيّاكُم
      [], // وَهُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 61
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَسَخَّرَ
      [], // الشَّمسَ
      [], // وَالقَمَرَ
      [], // لَيَقولُنَّ
      [], // اللَّهُ
      [], // فَأَنّىٰ
      [] // يُؤفَكونَ
    ],
    [ // آية 62
      [], // اللَّهُ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَيَقدِرُ
      [], // لَهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 63
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // نَزَّلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَحيا
      [], // بِهِ
      [], // الأَرضَ
      [], // مِن
      [], // بَعدِ
      [], // مَوتِها
      [], // لَيَقولُنَّ
      [], // اللَّهُ
      [], // قُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعقِلونَ
    ],
    [ // آية 64
      [], // وَما
      [], // هـٰذِهِ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // إِلّا
      [], // لَهوٌ
      [], // وَلَعِبٌ
      [], // وَإِنَّ
      [], // الدّارَ
      [], // الـٔاخِرَةَ
      [], // لَهِىَ
      [], // الحَيَوانُ
      [], // لَو
      [], // كانوا
      [] // يَعلَمونَ
    ],
    [ // آية 65
      [], // فَإِذا
      [], // رَكِبوا
      [], // فِى
      [], // الفُلكِ
      [], // دَعَوُا
      [], // اللَّهَ
      [], // مُخلِصينَ
      [], // لَهُ
      ["الدّين : العبادة و الطّاعة"], // الدّينَ
      [], // فَلَمّا
      [], // نَجّىٰهُم
      [], // إِلَى
      [], // البَرِّ
      [], // إِذا
      [], // هُم
      [] // يُشرِكونَ
    ],
    [ // آية 66
      [], // لِيَكفُروا
      [], // بِما
      [], // ءاتَينـٰهُم
      [], // وَلِيَتَمَتَّعوا
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ],
    [ // آية 67
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنّا
      [], // جَعَلنا
      [], // حَرَمًا
      [], // ءامِنًا
      [], // وَيُتَخَطَّفُ
      [], // النّاسُ
      [], // مِن
      [], // حَولِهِم
      [], // أَفَبِالبـٰطِلِ
      [], // يُؤمِنونَ
      [], // وَبِنِعمَةِ
      [], // اللَّهِ
      [] // يَكفُرونَ
    ],
    [ // آية 68
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَو
      [], // كَذَّبَ
      [], // بِالحَقِّ
      [], // لَمّا
      [], // جاءَهُ
      [], // أَلَيسَ
      [], // فى
      [], // جَهَنَّمَ
      [], // مَثوًى
      [] // لِلكـٰفِرينَ
    ],
    [ // آية 69
      [], // وَالَّذينَ
      [], // جـٰهَدوا
      [], // فينا
      [], // لَنَهدِيَنَّهُم
      [], // سُبُلَنا
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَمَعَ
      [] // المُحسِنينَ
    ]
  ]
];

export default meanings;