const meanings = [
  [ // سورة 30: الروم
[ // آية 1
      [] // الم
    ],
    [ // آية 2
      ["غُلبت الروم : قهرت فارس الرّوم"], // غُلِبَتِ
      ["غُلبت الروم : قهرت فارس الرّوم"] // الرّومُ
    ],
    [ // آية 3
      [], // فى
      ["أدْنى الأرض : أقرب أرض الرّوم إلى فارس"], // أَدنَى
      ["أدْنى الأرض : أقرب أرض الرّوم إلى فارس"], // الأَرضِ
      [], // وَهُم
      [], // مِن
      [], // بَعدِ
      ["غَلَبهم : كونهم مغلوبين"], // غَلَبِهِم
      [] // سَيَغلِبونَ
    ],
    [ // آية 4
      [], // فى
      [], // بِضعِ
      [], // سِنينَ
      [], // لِلَّهِ
      [], // الأَمرُ
      [], // مِن
      [], // قَبلُ
      [], // وَمِن
      [], // بَعدُ
      [], // وَيَومَئِذٍ
      [], // يَفرَحُ
      [] // المُؤمِنونَ
    ],
    [ // آية 5
      [], // بِنَصرِ
      [], // اللَّهِ
      [], // يَنصُرُ
      [], // مَن
      [], // يَشاءُ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 6
      [], // وَعدَ
      [], // اللَّهِ
      [], // لا
      [], // يُخلِفُ
      [], // اللَّهُ
      [], // وَعدَهُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 7
      [], // يَعلَمونَ
      [], // ظـٰهِرًا
      [], // مِنَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَهُم
      [], // عَنِ
      [], // الـٔاخِرَةِ
      [], // هُم
      [] // غـٰفِلونَ
    ],
    [ // آية 8
      [], // أَوَلَم
      [], // يَتَفَكَّروا
      [], // فى
      [], // أَنفُسِهِم
      [], // ما
      [], // خَلَقَ
      [], // اللَّهُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَأَجَلٍ
      [], // مُسَمًّى
      [], // وَإِنَّ
      [], // كَثيرًا
      [], // مِنَ
      [], // النّاسِ
      [], // بِلِقائِ
      [], // رَبِّهِم
      [] // لَكـٰفِرونَ
    ],
    [ // آية 9
      [], // أَوَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // كانوا
      [], // أَشَدَّ
      [], // مِنهُم
      [], // قُوَّةً
      [], // وَأَثارُوا
      [], // الأَرضَ
      [], // وَعَمَروها
      [], // أَكثَرَ
      [], // مِمّا
      [], // عَمَروها
      [], // وَجاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيَظلِمَهُم
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 10
      [], // ثُمَّ
      [], // كانَ
      [], // عـٰقِبَةَ
      [], // الَّذينَ
      [], // أَسـٰـُٔوا
      [], // السّوأىٰ
      [], // أَن
      [], // كَذَّبوا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَكانوا
      [], // بِها
      [] // يَستَهزِءونَ
    ],
    [ // آية 11
      [], // اللَّهُ
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // ثُمَّ
      [], // إِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 12
      [], // وَيَومَ
      [], // تَقومُ
      [], // السّاعَةُ
      ["يُبلسُ المجرمون : تنقطع حجّتهم . أو يَيْأسون"], // يُبلِسُ
      ["يُبلسُ المجرمون : تنقطع حجّتهم . أو يَيْأسون"] // المُجرِمونَ
    ],
    [ // آية 13
      [], // وَلَم
      [], // يَكُن
      [], // لَهُم
      [], // مِن
      [], // شُرَكائِهِم
      [], // شُفَعـٰؤُا۟
      [], // وَكانوا
      [], // بِشُرَكائِهِم
      [] // كـٰفِرينَ
    ],
    [ // آية 14
      [], // وَيَومَ
      [], // تَقومُ
      [], // السّاعَةُ
      [], // يَومَئِذٍ
      [] // يَتَفَرَّقونَ
    ],
    [ // آية 15
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فَهُم
      [], // فى
      [], // رَوضَةٍ
      ["يُحبرون : يُسرّون . أو يُكْرَمون"] // يُحبَرونَ
    ],
    [ // آية 16
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَكَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَلِقائِ
      [], // الـٔاخِرَةِ
      [], // فَأُولـٰئِكَ
      [], // فِى
      [], // العَذابِ
      [] // مُحضَرونَ
    ],
    [ // آية 17
      [], // فَسُبحـٰنَ
      [], // اللَّهِ
      [], // حينَ
      [], // تُمسونَ
      [], // وَحينَ
      [] // تُصبِحونَ
    ],
    [ // آية 18
      [], // وَلَهُ
      [], // الحَمدُ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَعَشِيًّا
      [], // وَحينَ
      [] // تُظهِرونَ
    ],
    [ // آية 19
      [], // يُخرِجُ
      [], // الحَىَّ
      [], // مِنَ
      [], // المَيِّتِ
      [], // وَيُخرِجُ
      [], // المَيِّتَ
      [], // مِنَ
      [], // الحَىِّ
      [], // وَيُحىِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // وَكَذٰلِكَ
      [] // تُخرَجونَ
    ],
    [ // آية 20
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // أَن
      [], // خَلَقَكُم
      [], // مِن
      [], // تُرابٍ
      [], // ثُمَّ
      [], // إِذا
      [], // أَنتُم
      [], // بَشَرٌ
      ["تنتشرون : تتصرفون في شؤون معايشِكم"] // تَنتَشِرونَ
    ],
    [ // آية 21
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // أَن
      [], // خَلَقَ
      [], // لَكُم
      [], // مِن
      [], // أَنفُسِكُم
      [], // أَزوٰجًا
      ["لتسكنوا إليها : لِتميلوا إليها و تألفوها"], // لِتَسكُنوا
      ["لتسكنوا إليها : لِتميلوا إليها و تألفوها"], // إِلَيها
      [], // وَجَعَلَ
      [], // بَينَكُم
      [], // مَوَدَّةً
      [], // وَرَحمَةً
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 22
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // خَلقُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَاختِلـٰفُ
      [], // أَلسِنَتِكُم
      [], // وَأَلوٰنِكُم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [] // لِلعـٰلِمينَ
    ],
    [ // آية 23
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // مَنامُكُم
      [], // بِالَّيلِ
      [], // وَالنَّهارِ
      [], // وَابتِغاؤُكُم
      [], // مِن
      [], // فَضلِهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَسمَعونَ
    ],
    [ // آية 24
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // يُريكُمُ
      [], // البَرقَ
      [], // خَوفًا
      [], // وَطَمَعًا
      [], // وَيُنَزِّلُ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَيُحيۦ
      [], // بِهِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 25
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // أَن
      [], // تَقومَ
      [], // السَّماءُ
      [], // وَالأَرضُ
      [], // بِأَمرِهِ
      [], // ثُمَّ
      [], // إِذا
      [], // دَعاكُم
      [], // دَعوَةً
      [], // مِنَ
      [], // الأَرضِ
      [], // إِذا
      [], // أَنتُم
      [] // تَخرُجونَ
    ],
    [ // آية 26
      [], // وَلَهُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // كُلٌّ
      [], // لَهُ
      [] // قـٰنِتونَ
    ],
    [ // آية 27
      [], // وَهُوَ
      [], // الَّذى
      [], // يَبدَؤُا۟
      [], // الخَلقَ
      [], // ثُمَّ
      [], // يُعيدُهُ
      [], // وَهُوَ
      [], // أَهوَنُ
      [], // عَلَيهِ
      [], // وَلَهُ
      [], // المَثَلُ
      [], // الأَعلىٰ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 28
      [], // ضَرَبَ
      [], // لَكُم
      [], // مَثَلًا
      [], // مِن
      [], // أَنفُسِكُم
      [], // هَل
      [], // لَكُم
      [], // مِن
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // مِن
      [], // شُرَكاءَ
      [], // فى
      [], // ما
      [], // رَزَقنـٰكُم
      [], // فَأَنتُم
      [], // فيهِ
      [], // سَواءٌ
      [], // تَخافونَهُم
      [], // كَخيفَتِكُم
      [], // أَنفُسَكُم
      [], // كَذٰلِكَ
      [], // نُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 29
      [], // بَلِ
      [], // اتَّبَعَ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // أَهواءَهُم
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // فَمَن
      [], // يَهدى
      [], // مَن
      [], // أَضَلَّ
      [], // اللَّهُ
      [], // وَما
      [], // لَهُم
      [], // مِن
      [] // نـٰصِرينَ
    ],
    [ // آية 30
      ["فأقم وجهك : قوّمْهُ و عدّلْهُ"], // فَأَقِم
      ["فأقم وجهك : قوّمْهُ و عدّلْهُ"], // وَجهَكَ
      ["للدّين : دين التوحيد و الإسلام"], // لِلدّينِ
      ["حنيفا : مائلا إليه مُستقيما عليه"], // حَنيفًا
      [], // فِطرَتَ
      [], // اللَّهِ
      [], // الَّتى
      ["فطَر النّاس عليها : جبَلهم و طَبَعهم عليها"], // فَطَرَ
      ["فطَر النّاس عليها : جبَلهم و طَبَعهم عليها"], // النّاسَ
      ["فطَر النّاس عليها : جبَلهم و طَبَعهم عليها"], // عَلَيها
      [], // لا
      [], // تَبديلَ
      [], // لِخَلقِ
      [], // اللَّهِ
      ["ذلك الدّين القيّم : المُستقيم الذي لا عِوَج فيه"], // ذٰلِكَ
      ["ذلك الدّين القيّم : المُستقيم الذي لا عِوَج فيه"], // الدّينُ
      ["ذلك الدّين القيّم : المُستقيم الذي لا عِوَج فيه"], // القَيِّمُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 31
      [], // مُنيبينَ
      [], // إِلَيهِ
      [], // وَاتَّقوهُ
      [], // وَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَلا
      [], // تَكونوا
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 32
      [], // مِنَ
      [], // الَّذينَ
      [], // فَرَّقوا
      [], // دينَهُم
      [], // وَكانوا
      [], // شِيَعًا
      [], // كُلُّ
      [], // حِزبٍ
      [], // بِما
      [], // لَدَيهِم
      [] // فَرِحونَ
    ],
    [ // آية 33
      [], // وَإِذا
      [], // مَسَّ
      [], // النّاسَ
      [], // ضُرٌّ
      [], // دَعَوا
      [], // رَبَّهُم
      [], // مُنيبينَ
      [], // إِلَيهِ
      [], // ثُمَّ
      [], // إِذا
      [], // أَذاقَهُم
      [], // مِنهُ
      [], // رَحمَةً
      [], // إِذا
      [], // فَريقٌ
      [], // مِنهُم
      [], // بِرَبِّهِم
      [] // يُشرِكونَ
    ],
    [ // آية 34
      [], // لِيَكفُروا
      [], // بِما
      [], // ءاتَينـٰهُم
      [], // فَتَمَتَّعوا
      [], // فَسَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 35
      [], // أَم
      [], // أَنزَلنا
      [], // عَلَيهِم
      [], // سُلطـٰنًا
      [], // فَهُوَ
      [], // يَتَكَلَّمُ
      [], // بِما
      [], // كانوا
      [], // بِهِ
      [] // يُشرِكونَ
    ],
    [ // آية 36
      [], // وَإِذا
      [], // أَذَقنَا
      [], // النّاسَ
      [], // رَحمَةً
      ["فرحوا بها : بَطِروا و أشِروا"], // فَرِحوا
      ["فرحوا بها : بَطِروا و أشِروا"], // بِها
      [], // وَإِن
      [], // تُصِبهُم
      [], // سَيِّئَةٌ
      [], // بِما
      [], // قَدَّمَت
      [], // أَيديهِم
      [], // إِذا
      ["هم يقنطون : ييْأسون من رحمة الله تعالى"], // هُم
      ["هم يقنطون : ييْأسون من رحمة الله تعالى"] // يَقنَطونَ
    ],
    [ // آية 37
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيَقدِرُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 38
      [], // فَـٔاتِ
      [], // ذَا
      [], // القُربىٰ
      [], // حَقَّهُ
      [], // وَالمِسكينَ
      [], // وَابنَ
      [], // السَّبيلِ
      [], // ذٰلِكَ
      [], // خَيرٌ
      [], // لِلَّذينَ
      [], // يُريدونَ
      [], // وَجهَ
      [], // اللَّهِ
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 39
      [], // وَما
      [], // ءاتَيتُم
      [], // مِن
      ["ربًا : هو الرّبا المُحرّم المعروف"], // رِبًا
      [], // لِيَربُوَا۟
      [], // فى
      [], // أَموٰلِ
      [], // النّاسِ
      [], // فَلا
      [], // يَربوا
      [], // عِندَ
      [], // اللَّهِ
      [], // وَما
      [], // ءاتَيتُم
      [], // مِن
      [], // زَكوٰةٍ
      [], // تُريدونَ
      [], // وَجهَ
      [], // اللَّهِ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      ["المضعفون : ذوو الأضعاف من الحسنات"] // المُضعِفونَ
    ],
    [ // آية 40
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // ثُمَّ
      [], // رَزَقَكُم
      [], // ثُمَّ
      [], // يُميتُكُم
      [], // ثُمَّ
      [], // يُحييكُم
      [], // هَل
      [], // مِن
      [], // شُرَكائِكُم
      [], // مَن
      [], // يَفعَلُ
      [], // مِن
      [], // ذٰلِكُم
      [], // مِن
      [], // شَىءٍ
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 41
      [], // ظَهَرَ
      [], // الفَسادُ
      [], // فِى
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // بِما
      [], // كَسَبَت
      [], // أَيدِى
      [], // النّاسِ
      [], // لِيُذيقَهُم
      [], // بَعضَ
      [], // الَّذى
      [], // عَمِلوا
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 42
      [], // قُل
      [], // سيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَانظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلُ
      [], // كانَ
      [], // أَكثَرُهُم
      [] // مُشرِكينَ
    ],
    [ // آية 43
      [], // فَأَقِم
      [], // وَجهَكَ
      ["للدّين القيّم : المستقيم (دين الفطرة)"], // لِلدّينِ
      ["للدّين القيّم : المستقيم (دين الفطرة)"], // القَيِّمِ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِىَ
      [], // يَومٌ
      [], // لا
      [], // مَرَدَّ
      [], // لَهُ
      [], // مِنَ
      [], // اللَّهِ
      [], // يَومَئِذٍ
      [] // يَصَّدَّعونَ
    ],
    [ // آية 44
      [], // مَن
      [], // كَفَرَ
      [], // فَعَلَيهِ
      [], // كُفرُهُ
      [], // وَمَن
      [], // عَمِلَ
      [], // صـٰلِحًا
      [], // فَلِأَنفُسِهِم
      ["يمهدُون : يُوطِّـئون مواطن النّعيم"] // يَمهَدونَ
    ],
    [ // آية 45
      [], // لِيَجزِىَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // مِن
      [], // فَضلِهِ
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // الكـٰفِرينَ
    ],
    [ // آية 46
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // أَن
      [], // يُرسِلَ
      [], // الرِّياحَ
      [], // مُبَشِّرٰتٍ
      [], // وَلِيُذيقَكُم
      [], // مِن
      [], // رَحمَتِهِ
      [], // وَلِتَجرِىَ
      [], // الفُلكُ
      [], // بِأَمرِهِ
      [], // وَلِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // وَلَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 47
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // رُسُلًا
      [], // إِلىٰ
      [], // قَومِهِم
      [], // فَجاءوهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَانتَقَمنا
      [], // مِنَ
      [], // الَّذينَ
      [], // أَجرَموا
      [], // وَكانَ
      [], // حَقًّا
      [], // عَلَينا
      [], // نَصرُ
      [] // المُؤمِنينَ
    ],
    [ // آية 48
      [], // اللَّهُ
      [], // الَّذى
      [], // يُرسِلُ
      [], // الرِّيـٰحَ
      [], // فَتُثيرُ
      [], // سَحابًا
      [], // فَيَبسُطُهُ
      [], // فِى
      [], // السَّماءِ
      [], // كَيفَ
      [], // يَشاءُ
      [], // وَيَجعَلُهُ
      [], // كِسَفًا
      [], // فَتَرَى
      [], // الوَدقَ
      [], // يَخرُجُ
      [], // مِن
      [], // خِلـٰلِهِ
      [], // فَإِذا
      [], // أَصابَ
      [], // بِهِ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // إِذا
      [], // هُم
      [] // يَستَبشِرونَ
    ],
    [ // آية 49
      [], // وَإِن
      [], // كانوا
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يُنَزَّلَ
      [], // عَلَيهِم
      [], // مِن
      [], // قَبلِهِ
      ["لَمبلسين : آيسين من نزوله"] // لَمُبلِسينَ
    ],
    [ // آية 50
      [], // فَانظُر
      [], // إِلىٰ
      [], // ءاثـٰرِ
      [], // رَحمَتِ
      [], // اللَّهِ
      [], // كَيفَ
      [], // يُحىِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // لَمُحىِ
      [], // المَوتىٰ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 51
      [], // وَلَئِن
      [], // أَرسَلنا
      [], // ريحًا
      ["فرأوهُ مُصفرّا : فرَأوُا النّبات مُصفرّا بعد الخُضرة"], // فَرَأَوهُ
      ["فرأوهُ مُصفرّا : فرَأوُا النّبات مُصفرّا بعد الخُضرة"], // مُصفَرًّا
      [], // لَظَلّوا
      [], // مِن
      [], // بَعدِهِ
      [] // يَكفُرونَ
    ],
    [ // آية 52
      [], // فَإِنَّكَ
      [], // لا
      [], // تُسمِعُ
      [], // المَوتىٰ
      [], // وَلا
      [], // تُسمِعُ
      [], // الصُّمَّ
      [], // الدُّعاءَ
      [], // إِذا
      [], // وَلَّوا
      [] // مُدبِرينَ
    ],
    [ // آية 53
      [], // وَما
      [], // أَنتَ
      [], // بِهـٰدِ
      [], // العُمىِ
      [], // عَن
      [], // ضَلـٰلَتِهِم
      [], // إِن
      [], // تُسمِعُ
      [], // إِلّا
      [], // مَن
      [], // يُؤمِنُ
      [], // بِـٔايـٰتِنا
      [], // فَهُم
      [] // مُسلِمونَ
    ],
    [ // آية 54
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // مِن
      [], // ضَعفٍ
      [], // ثُمَّ
      [], // جَعَلَ
      [], // مِن
      [], // بَعدِ
      [], // ضَعفٍ
      [], // قُوَّةً
      [], // ثُمَّ
      [], // جَعَلَ
      [], // مِن
      [], // بَعدِ
      [], // قُوَّةٍ
      [], // ضَعفًا
      [], // وَشَيبَةً
      [], // يَخلُقُ
      [], // ما
      [], // يَشاءُ
      [], // وَهُوَ
      [], // العَليمُ
      [] // القَديرُ
    ],
    [ // آية 55
      [], // وَيَومَ
      [], // تَقومُ
      [], // السّاعَةُ
      [], // يُقسِمُ
      [], // المُجرِمونَ
      [], // ما
      [], // لَبِثوا
      [], // غَيرَ
      [], // ساعَةٍ
      [], // كَذٰلِكَ
      [], // كانوا
      [] // يُؤفَكونَ
    ],
    [ // آية 56
      [], // وَقالَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // وَالإيمـٰنَ
      [], // لَقَد
      [], // لَبِثتُم
      [], // فى
      [], // كِتـٰبِ
      [], // اللَّهِ
      [], // إِلىٰ
      [], // يَومِ
      [], // البَعثِ
      [], // فَهـٰذا
      [], // يَومُ
      [], // البَعثِ
      [], // وَلـٰكِنَّكُم
      [], // كُنتُم
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 57
      [], // فَيَومَئِذٍ
      [], // لا
      [], // يَنفَعُ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // مَعذِرَتُهُم
      [], // وَلا
      [], // هُم
      [] // يُستَعتَبونَ
    ],
    [ // آية 58
      [], // وَلَقَد
      [], // ضَرَبنا
      [], // لِلنّاسِ
      [], // فى
      [], // هـٰذَا
      [], // القُرءانِ
      [], // مِن
      [], // كُلِّ
      [], // مَثَلٍ
      [], // وَلَئِن
      [], // جِئتَهُم
      [], // بِـٔايَةٍ
      [], // لَيَقولَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [] // مُبطِلونَ
    ],
    [ // آية 59
      [], // كَذٰلِكَ
      [], // يَطبَعُ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // قُلوبِ
      [], // الَّذينَ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 60
      [], // فَاصبِر
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَلا
      [], // يَستَخِفَّنَّكَ
      [], // الَّذينَ
      [], // لا
      [] // يوقِنونَ
    ]
  ]
];

export default meanings;