const meanings = [
[ // آية 1
      [] // الم
    ],
    [ // آية 2
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // الكِتـٰبِ
      [] // الحَكيمِ
    ],
    [ // آية 3
      [], // هُدًى
      [], // وَرَحمَةً
      [] // لِلمُحسِنينَ
    ],
    [ // آية 4
      [], // الَّذينَ
      [], // يُقيمونَ
      [], // الصَّلوٰةَ
      [], // وَيُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [], // هُم
      [] // يوقِنونَ
    ],
    [ // آية 5
      [], // أُولـٰئِكَ
      [], // عَلىٰ
      [], // هُدًى
      [], // مِن
      [], // رَبِّهِم
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 6
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يَشتَرى
      ["لَهْو الحديث : الباطل المُلهي عن الخير و العبادة"], // لَهوَ
      ["لَهْو الحديث : الباطل المُلهي عن الخير و العبادة"], // الحَديثِ
      [], // لِيُضِلَّ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // وَيَتَّخِذَها
      [], // هُزُوًا
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 7
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِ
      [], // ءايـٰتُنا
      ["ولّى مُستكبرا : أعرضَ مُتكبّرا عن تدبّرها"], // وَلّىٰ
      ["ولّى مُستكبرا : أعرضَ مُتكبّرا عن تدبّرها"], // مُستَكبِرًا
      [], // كَأَن
      [], // لَم
      [], // يَسمَعها
      [], // كَأَنَّ
      [], // فى
      [], // أُذُنَيهِ
      ["وقْرا : صممًا مانعًا من السّماع"], // وَقرًا
      [], // فَبَشِّرهُ
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 8
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // جَنّـٰتُ
      [] // النَّعيمِ
    ],
    [ // آية 9
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقًّا
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 10
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      ["بغير عَمَد : بغير دعائم و أساطينَ تُقيمُها"], // بِغَيرِ
      ["بغير عَمَد : بغير دعائم و أساطينَ تُقيمُها"], // عَمَدٍ
      [], // تَرَونَها
      [], // وَأَلقىٰ
      [], // فِى
      [], // الأَرضِ
      [], // رَوٰسِىَ
      ["أن تميد بكم : لِئلاّ تضطرب بكم"], // أَن
      ["أن تميد بكم : لِئلاّ تضطرب بكم"], // تَميدَ
      ["أن تميد بكم : لِئلاّ تضطرب بكم"], // بِكُم
      [], // وَبَثَّ
      [], // فيها
      [], // مِن
      [], // كُلِّ
      [], // دابَّةٍ
      [], // وَأَنزَلنا
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَنبَتنا
      [], // فيها
      [], // مِن
      [], // كُلِّ
      ["زوج كريم : صِـنـْــفٍ حسنٍ كثير المنفعة"], // زَوجٍ
      ["زوج كريم : صِـنـْــفٍ حسنٍ كثير المنفعة"] // كَريمٍ
    ],
    [ // آية 11
      [], // هـٰذا
      [], // خَلقُ
      [], // اللَّهِ
      [], // فَأَرونى
      [], // ماذا
      [], // خَلَقَ
      [], // الَّذينَ
      [], // مِن
      [], // دونِهِ
      [], // بَلِ
      [], // الظّـٰلِمونَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 12
      [], // وَلَقَد
      [], // ءاتَينا
      [], // لُقمـٰنَ
      ["الحكمة : العقل و الفهم و الفطنة و إصابة القول"], // الحِكمَةَ
      [], // أَنِ
      [], // اشكُر
      [], // لِلَّهِ
      [], // وَمَن
      [], // يَشكُر
      [], // فَإِنَّما
      [], // يَشكُرُ
      [], // لِنَفسِهِ
      [], // وَمَن
      [], // كَفَرَ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَنِىٌّ
      [] // حَميدٌ
    ],
    [ // آية 13
      [], // وَإِذ
      [], // قالَ
      [], // لُقمـٰنُ
      [], // لِابنِهِ
      [], // وَهُوَ
      [], // يَعِظُهُ
      [], // يـٰبُنَىَّ
      [], // لا
      [], // تُشرِك
      [], // بِاللَّهِ
      [], // إِنَّ
      [], // الشِّركَ
      [], // لَظُلمٌ
      [] // عَظيمٌ
    ],
    [ // آية 14
      [], // وَوَصَّينَا
      [], // الإِنسـٰنَ
      [], // بِوٰلِدَيهِ
      [], // حَمَلَتهُ
      [], // أُمُّهُ
      ["وهْنا : ضعفا"], // وَهنًا
      [], // عَلىٰ
      [], // وَهنٍ
      [], // وَفِصـٰلُهُ
      [], // فى
      [], // عامَينِ
      [], // أَنِ
      [], // اشكُر
      [], // لى
      [], // وَلِوٰلِدَيكَ
      [], // إِلَىَّ
      [] // المَصيرُ
    ],
    [ // آية 15
      [], // وَإِن
      [], // جـٰهَداكَ
      [], // عَلىٰ
      [], // أَن
      [], // تُشرِكَ
      [], // بى
      [], // ما
      [], // لَيسَ
      [], // لَكَ
      [], // بِهِ
      [], // عِلمٌ
      [], // فَلا
      [], // تُطِعهُما
      [], // وَصاحِبهُما
      [], // فِى
      [], // الدُّنيا
      [], // مَعروفًا
      [], // وَاتَّبِع
      [], // سَبيلَ
      [], // مَن
      [], // أَنابَ
      [], // إِلَىَّ
      [], // ثُمَّ
      [], // إِلَىَّ
      [], // مَرجِعُكُم
      [], // فَأُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 16
      [], // يـٰبُنَىَّ
      [], // إِنَّها
      [], // إِن
      [], // تَكُ
      [], // مِثقالَ
      [], // حَبَّةٍ
      [], // مِن
      [], // خَردَلٍ
      [], // فَتَكُن
      [], // فى
      [], // صَخرَةٍ
      [], // أَو
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // أَو
      [], // فِى
      [], // الأَرضِ
      [], // يَأتِ
      [], // بِهَا
      [], // اللَّهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَطيفٌ
      [] // خَبيرٌ
    ],
    [ // آية 17
      [], // يـٰبُنَىَّ
      [], // أَقِمِ
      [], // الصَّلوٰةَ
      [], // وَأمُر
      [], // بِالمَعروفِ
      [], // وَانهَ
      [], // عَنِ
      [], // المُنكَرِ
      [], // وَاصبِر
      [], // عَلىٰ
      [], // ما
      [], // أَصابَكَ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // مِن
      [], // عَزمِ
      [] // الأُمورِ
    ],
    [ // آية 18
      [], // وَلا
      [], // تُصَعِّر
      [], // خَدَّكَ
      [], // لِلنّاسِ
      [], // وَلا
      [], // تَمشِ
      [], // فِى
      [], // الأَرضِ
      ["مرَحا : فَرَحا و بَطَرًا و خُيلاء"], // مَرَحًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [], // كُلَّ
      ["مُختال فخور : مُتكبّرٍ، مُباهٍ متطاول بمناقبه"], // مُختالٍ
      ["مُختال فخور : مُتكبّرٍ، مُباهٍ متطاول بمناقبه"] // فَخورٍ
    ],
    [ // آية 19
      [], // وَاقصِد
      [], // فى
      [], // مَشيِكَ
      [], // وَاغضُض
      [], // مِن
      [], // صَوتِكَ
      [], // إِنَّ
      [], // أَنكَرَ
      [], // الأَصوٰتِ
      [], // لَصَوتُ
      [] // الحَميرِ
    ],
    [ // آية 20
      [], // أَلَم
      [], // تَرَوا
      [], // أَنَّ
      [], // اللَّهَ
      ["سخّر لكم : لِمنافعكم و مصالحكم"], // سَخَّرَ
      ["سخّر لكم : لِمنافعكم و مصالحكم"], // لَكُم
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَأَسبَغَ
      [], // عَلَيكُم
      [], // نِعَمَهُ
      [], // ظـٰهِرَةً
      [], // وَباطِنَةً
      [], // وَمِنَ
      [], // النّاسِ
      [], // مَن
      [], // يُجـٰدِلُ
      [], // فِى
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // وَلا
      [], // هُدًى
      [], // وَلا
      [], // كِتـٰبٍ
      [] // مُنيرٍ
    ],
    [ // آية 21
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُمُ
      [], // اتَّبِعوا
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // قالوا
      [], // بَل
      [], // نَتَّبِعُ
      [], // ما
      [], // وَجَدنا
      [], // عَلَيهِ
      [], // ءاباءَنا
      [], // أَوَلَو
      [], // كانَ
      [], // الشَّيطـٰنُ
      [], // يَدعوهُم
      [], // إِلىٰ
      [], // عَذابِ
      [] // السَّعيرِ
    ],
    [ // آية 22
      [], // وَمَن
      [], // يُسلِم
      [], // وَجهَهُ
      [], // إِلَى
      [], // اللَّهِ
      [], // وَهُوَ
      [], // مُحسِنٌ
      [], // فَقَدِ
      ["استمسك : تمسّك و تعلـّـقَ و اعتصمَ"], // استَمسَكَ
      ["بالعروة الوُثقى : بالعهد الأوثق الذي لا نقْضَ له"], // بِالعُروَةِ
      ["بالعروة الوُثقى : بالعهد الأوثق الذي لا نقْضَ له"], // الوُثقىٰ
      [], // وَإِلَى
      [], // اللَّهِ
      [], // عـٰقِبَةُ
      [] // الأُمورِ
    ],
    [ // آية 23
      [], // وَمَن
      [], // كَفَرَ
      [], // فَلا
      [], // يَحزُنكَ
      [], // كُفرُهُ
      [], // إِلَينا
      [], // مَرجِعُهُم
      [], // فَنُنَبِّئُهُم
      [], // بِما
      [], // عَمِلوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 24
      [], // نُمَتِّعُهُم
      [], // قَليلًا
      [], // ثُمَّ
      [], // نَضطَرُّهُم
      [], // إِلىٰ
      ["عذاب غليظ : شديد ثقيل (عذاب النّار)"], // عَذابٍ
      ["عذاب غليظ : شديد ثقيل (عذاب النّار)"] // غَليظٍ
    ],
    [ // آية 25
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // لَيَقولُنَّ
      [], // اللَّهُ
      [], // قُلِ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 26
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الغَنِىُّ
      [] // الحَميدُ
    ],
    [ // آية 27
      [], // وَلَو
      [], // أَنَّما
      [], // فِى
      [], // الأَرضِ
      [], // مِن
      [], // شَجَرَةٍ
      [], // أَقلـٰمٌ
      [], // وَالبَحرُ
      ["يمدّه : يَزيده و يَنْصَبُّ إليه"], // يَمُدُّهُ
      [], // مِن
      [], // بَعدِهِ
      ["سبعة أبحُر : مملوءةٍ ماءً"], // سَبعَةُ
      ["سبعة أبحُر : مملوءةٍ ماءً"], // أَبحُرٍ
      ["ما نفدت : ما فرغَتْ و ما فَنِيتْ"], // ما
      ["ما نفدت : ما فرغَتْ و ما فَنِيتْ"], // نَفِدَت
      [], // كَلِمـٰتُ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 28
      [], // ما
      [], // خَلقُكُم
      [], // وَلا
      [], // بَعثُكُم
      [], // إِلّا
      [], // كَنَفسٍ
      [], // وٰحِدَةٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // بَصيرٌ
    ],
    [ // آية 29
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      ["يولج : يُدْخِل"], // يولِجُ
      [], // الَّيلَ
      [], // فِى
      [], // النَّهارِ
      [], // وَيولِجُ
      [], // النَّهارَ
      [], // فِى
      [], // الَّيلِ
      [], // وَسَخَّرَ
      [], // الشَّمسَ
      [], // وَالقَمَرَ
      [], // كُلٌّ
      [], // يَجرى
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 30
      [], // ذٰلِكَ
      [], // بِأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الحَقُّ
      [], // وَأَنَّ
      [], // ما
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // البـٰطِلُ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // العَلِىُّ
      [] // الكَبيرُ
    ],
    [ // آية 31
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // الفُلكَ
      [], // تَجرى
      [], // فِى
      [], // البَحرِ
      [], // بِنِعمَتِ
      [], // اللَّهِ
      [], // لِيُرِيَكُم
      [], // مِن
      [], // ءايـٰتِهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِكُلِّ
      [], // صَبّارٍ
      [] // شَكورٍ
    ],
    [ // آية 32
      [], // وَإِذا
      ["غَشِيهم موْجٌ : علاهم و غطّاهم"], // غَشِيَهُم
      ["غَشِيهم موْجٌ : علاهم و غطّاهم"], // مَوجٌ
      [], // كَالظُّلَلِ
      [], // دَعَوُا
      [], // اللَّهَ
      [], // مُخلِصينَ
      [], // لَهُ
      [], // الدّينَ
      [], // فَلَمّا
      [], // نَجّىٰهُم
      [], // إِلَى
      [], // البَرِّ
      ["فمِنهم مُقتصد : موفٍ بعهده . شاكر لله"], // فَمِنهُم
      ["فمِنهم مُقتصد : موفٍ بعهده . شاكر لله"], // مُقتَصِدٌ
      [], // وَما
      [], // يَجحَدُ
      [], // بِـٔايـٰتِنا
      [], // إِلّا
      [], // كُلُّ
      [], // خَتّارٍ
      [] // كَفورٍ
    ],
    [ // آية 33
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // اتَّقوا
      [], // رَبَّكُم
      [], // وَاخشَوا
      [], // يَومًا
      [], // لا
      [], // يَجزى
      [], // والِدٌ
      [], // عَن
      [], // وَلَدِهِ
      [], // وَلا
      [], // مَولودٌ
      [], // هُوَ
      [], // جازٍ
      [], // عَن
      [], // والِدِهِ
      [], // شَيـًٔا
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // فَلا
      [], // تَغُرَّنَّكُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // وَلا
      [], // يَغُرَّنَّكُم
      [], // بِاللَّهِ
      ["الغَرور : ما يغرّ و يخدع من شيطان و غيره"] // الغَرورُ
    ],
    [ // آية 34
      [], // إِنَّ
      [], // اللَّهَ
      [], // عِندَهُ
      [], // عِلمُ
      [], // السّاعَةِ
      [], // وَيُنَزِّلُ
      [], // الغَيثَ
      [], // وَيَعلَمُ
      [], // ما
      [], // فِى
      [], // الأَرحامِ
      [], // وَما
      [], // تَدرى
      [], // نَفسٌ
      [], // ماذا
      [], // تَكسِبُ
      [], // غَدًا
      [], // وَما
      [], // تَدرى
      [], // نَفسٌ
      [], // بِأَىِّ
      [], // أَرضٍ
      [], // تَموتُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [] // خَبيرٌ
    ]
];

export default meanings;