const meanings = [
[ // آية 1
      [] // الم
    ],
    [ // آية 2
      [], // تَنزيلُ
      [], // الكِتـٰبِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 3
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰهُ
      [], // بَل
      [], // هُوَ
      [], // الحَقُّ
      [], // مِن
      [], // رَبِّكَ
      [], // لِتُنذِرَ
      [], // قَومًا
      [], // ما
      [], // أَتىٰهُم
      [], // مِن
      [], // نَذيرٍ
      [], // مِن
      [], // قَبلِكَ
      [], // لَعَلَّهُم
      [] // يَهتَدونَ
    ],
    [ // آية 4
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // ثُمَّ
      ["استوى على العرش : استواءً يليق بكماله و جلاله تعالى"], // استَوىٰ
      ["استوى على العرش : استواءً يليق بكماله و جلاله تعالى"], // عَلَى
      ["استوى على العرش : استواءً يليق بكماله و جلاله تعالى"], // العَرشِ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // دونِهِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [], // شَفيعٍ
      [], // أَفَلا
      [] // تَتَذَكَّرونَ
    ],
    [ // آية 5
      [], // يُدَبِّرُ
      [], // الأَمرَ
      [], // مِنَ
      [], // السَّماءِ
      [], // إِلَى
      [], // الأَرضِ
      [], // ثُمَّ
      ["يعرُج إليه : يصعد الأمر و يرتفع إليه بعد تدبيره"], // يَعرُجُ
      ["يعرُج إليه : يصعد الأمر و يرتفع إليه بعد تدبيره"], // إِلَيهِ
      [], // فى
      [], // يَومٍ
      [], // كانَ
      [], // مِقدارُهُ
      [], // أَلفَ
      [], // سَنَةٍ
      [], // مِمّا
      [] // تَعُدّونَ
    ],
    [ // آية 6
      [], // ذٰلِكَ
      [], // عـٰلِمُ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 7
      [], // الَّذى
      [], // أَحسَنَ
      [], // كُلَّ
      [], // شَىءٍ
      [], // خَلَقَهُ
      [], // وَبَدَأَ
      [], // خَلقَ
      [], // الإِنسـٰنِ
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 8
      [], // ثُمَّ
      [], // جَعَلَ
      [], // نَسلَهُ
      [], // مِن
      [], // سُلـٰلَةٍ
      [], // مِن
      ["ماءٍ مهين : منيّ ضعيف حقير"], // ماءٍ
      ["ماءٍ مهين : منيّ ضعيف حقير"] // مَهينٍ
    ],
    [ // آية 9
      [], // ثُمَّ
      [], // سَوّىٰهُ
      [], // وَنَفَخَ
      [], // فيهِ
      [], // مِن
      [], // روحِهِ
      [], // وَجَعَلَ
      [], // لَكُمُ
      [], // السَّمعَ
      [], // وَالأَبصـٰرَ
      [], // وَالأَفـِٔدَةَ
      [], // قَليلًا
      [], // ما
      [] // تَشكُرونَ
    ],
    [ // آية 10
      [], // وَقالوا
      [], // أَءِذا
      [], // ضَلَلنا
      [], // فِى
      [], // الأَرضِ
      [], // أَءِنّا
      [], // لَفى
      [], // خَلقٍ
      [], // جَديدٍ
      [], // بَل
      [], // هُم
      [], // بِلِقاءِ
      [], // رَبِّهِم
      [] // كـٰفِرونَ
    ],
    [ // آية 11
      [], // قُل
      [], // يَتَوَفّىٰكُم
      [], // مَلَكُ
      [], // المَوتِ
      [], // الَّذى
      [], // وُكِّلَ
      [], // بِكُم
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّكُم
      [] // تُرجَعونَ
    ],
    [ // آية 12
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذِ
      [], // المُجرِمونَ
      ["ناكِسوا رءوسهم : مُطْرقُها خِزياً و حياءً و ندماً"], // ناكِسوا
      ["ناكِسوا رءوسهم : مُطْرقُها خِزياً و حياءً و ندماً"], // رُءوسِهِم
      [], // عِندَ
      [], // رَبِّهِم
      [], // رَبَّنا
      [], // أَبصَرنا
      [], // وَسَمِعنا
      [], // فَارجِعنا
      [], // نَعمَل
      [], // صـٰلِحًا
      [], // إِنّا
      [] // موقِنونَ
    ],
    [ // آية 13
      [], // وَلَو
      [], // شِئنا
      [], // لَـٔاتَينا
      [], // كُلَّ
      [], // نَفسٍ
      [], // هُدىٰها
      [], // وَلـٰكِن
      ["حقّ القول : ثبت و تحقّق و نفذ القضاء"], // حَقَّ
      ["حقّ القول : ثبت و تحقّق و نفذ القضاء"], // القَولُ
      [], // مِنّى
      [], // لَأَملَأَنَّ
      [], // جَهَنَّمَ
      [], // مِنَ
      [], // الجِنَّةِ
      [], // وَالنّاسِ
      [] // أَجمَعينَ
    ],
    [ // آية 14
      [], // فَذوقوا
      [], // بِما
      [], // نَسيتُم
      [], // لِقاءَ
      [], // يَومِكُم
      [], // هـٰذا
      [], // إِنّا
      [], // نَسينـٰكُم
      [], // وَذوقوا
      [], // عَذابَ
      [], // الخُلدِ
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 15
      [], // إِنَّما
      [], // يُؤمِنُ
      [], // بِـٔايـٰتِنَا
      [], // الَّذينَ
      [], // إِذا
      [], // ذُكِّروا
      [], // بِها
      [], // خَرّوا
      [], // سُجَّدًا
      [], // وَسَبَّحوا
      [], // بِحَمدِ
      [], // رَبِّهِم
      [], // وَهُم
      [], // لا
      [] // يَستَكبِرونَ
    ],
    [ // آية 16
      ["تتجافى جنوبهم : ترتفع و تتنحّى للعبادة"], // تَتَجافىٰ
      ["تتجافى جنوبهم : ترتفع و تتنحّى للعبادة"], // جُنوبُهُم
      ["عن المضاجع : الفُرُش التي يُضطجع عليها"], // عَنِ
      ["عن المضاجع : الفُرُش التي يُضطجع عليها"], // المَضاجِعِ
      [], // يَدعونَ
      [], // رَبَّهُم
      [], // خَوفًا
      [], // وَطَمَعًا
      [], // وَمِمّا
      [], // رَزَقنـٰهُم
      [] // يُنفِقونَ
    ],
    [ // آية 17
      [], // فَلا
      [], // تَعلَمُ
      [], // نَفسٌ
      [], // ما
      [], // أُخفِىَ
      [], // لَهُم
      ["من قرّة أعين : من موجـِــبات المسرّة و الفرح"], // مِن
      ["من قرّة أعين : من موجـِــبات المسرّة و الفرح"], // قُرَّةِ
      ["من قرّة أعين : من موجـِــبات المسرّة و الفرح"], // أَعيُنٍ
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 18
      [], // أَفَمَن
      [], // كانَ
      [], // مُؤمِنًا
      [], // كَمَن
      [], // كانَ
      [], // فاسِقًا
      [], // لا
      [] // يَستَوۥنَ
    ],
    [ // آية 19
      [], // أَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فَلَهُم
      [], // جَنّـٰتُ
      [], // المَأوىٰ
      [], // نُزُلًا
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 20
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // فَسَقوا
      [], // فَمَأوىٰهُمُ
      [], // النّارُ
      [], // كُلَّما
      [], // أَرادوا
      [], // أَن
      [], // يَخرُجوا
      [], // مِنها
      [], // أُعيدوا
      [], // فيها
      [], // وَقيلَ
      [], // لَهُم
      [], // ذوقوا
      [], // عَذابَ
      [], // النّارِ
      [], // الَّذى
      [], // كُنتُم
      [], // بِهِ
      [] // تُكَذِّبونَ
    ],
    [ // آية 21
      [], // وَلَنُذيقَنَّهُم
      [], // مِنَ
      [], // العَذابِ
      [], // الأَدنىٰ
      [], // دونَ
      [], // العَذابِ
      [], // الأَكبَرِ
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 22
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّن
      [], // ذُكِّرَ
      [], // بِـٔايـٰتِ
      [], // رَبِّهِ
      [], // ثُمَّ
      [], // أَعرَضَ
      [], // عَنها
      [], // إِنّا
      [], // مِنَ
      [], // المُجرِمينَ
      [] // مُنتَقِمونَ
    ],
    [ // آية 23
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // فَلا
      [], // تَكُن
      [], // فى
      [], // مِريَةٍ
      ["من لقائه : تلقّيه إياه بالرّضا و القبول"], // مِن
      ["من لقائه : تلقّيه إياه بالرّضا و القبول"], // لِقائِهِ
      [], // وَجَعَلنـٰهُ
      [], // هُدًى
      [], // لِبَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 24
      [], // وَجَعَلنا
      [], // مِنهُم
      [], // أَئِمَّةً
      [], // يَهدونَ
      [], // بِأَمرِنا
      [], // لَمّا
      [], // صَبَروا
      [], // وَكانوا
      [], // بِـٔايـٰتِنا
      [] // يوقِنونَ
    ],
    [ // آية 25
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // يَفصِلُ
      [], // بَينَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // فيما
      [], // كانوا
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 26
      [], // أَوَلَم
      [], // يَهدِ
      [], // لَهُم
      [], // كَم
      [], // أَهلَكنا
      [], // مِن
      [], // قَبلِهِم
      [], // مِنَ
      ["القرون : الأمم الخالية"], // القُرونِ
      [], // يَمشونَ
      [], // فى
      [], // مَسـٰكِنِهِم
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // أَفَلا
      [] // يَسمَعونَ
    ],
    [ // آية 27
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنّا
      [], // نَسوقُ
      [], // الماءَ
      [], // إِلَى
      ["الأرض الجُرز : اليابسة الجرداء التي قُطِعَ نباتها"], // الأَرضِ
      ["الأرض الجُرز : اليابسة الجرداء التي قُطِعَ نباتها"], // الجُرُزِ
      [], // فَنُخرِجُ
      [], // بِهِ
      [], // زَرعًا
      [], // تَأكُلُ
      [], // مِنهُ
      [], // أَنعـٰمُهُم
      [], // وَأَنفُسُهُم
      [], // أَفَلا
      [] // يُبصِرونَ
    ],
    [ // آية 28
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الفَتحُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 29
      [], // قُل
      [], // يَومَ
      [], // الفَتحِ
      [], // لا
      [], // يَنفَعُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إيمـٰنُهُم
      [], // وَلا
      [], // هُم
      ["يُنظَرون : يُمهَلون ليُؤمنوا"] // يُنظَرونَ
    ],
    [ // آية 30
      [], // فَأَعرِض
      [], // عَنهُم
      [], // وَانتَظِر
      [], // إِنَّهُم
      [] // مُنتَظِرونَ
    ]
];

export default meanings;