const meanings = [
[ // آية 1
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      ["اتّقِ الله : دُمْ على تقواه أو ازدد منها"], // اتَّقِ
      ["اتّقِ الله : دُمْ على تقواه أو ازدد منها"], // اللَّهَ
      [], // وَلا
      [], // تُطِعِ
      [], // الكـٰفِرينَ
      [], // وَالمُنـٰفِقينَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 2
      [], // وَاتَّبِع
      [], // ما
      [], // يوحىٰ
      [], // إِلَيكَ
      [], // مِن
      [], // رَبِّكَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرًا
    ],
    [ // آية 3
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // وَكيلًا
    ],
    [ // آية 4
      [], // ما
      [], // جَعَلَ
      [], // اللَّهُ
      [], // لِرَجُلٍ
      [], // مِن
      [], // قَلبَينِ
      [], // فى
      [], // جَوفِهِ
      [], // وَما
      [], // جَعَلَ
      [], // أَزوٰجَكُمُ
      [], // الّـٰـٔى
      [], // تُظـٰهِرونَ
      [], // مِنهُنَّ
      [], // أُمَّهـٰتِكُم
      [], // وَما
      [], // جَعَلَ
      ["أدعياءكم : من تتبنّونهم من أبناء غيركم"], // أَدعِياءَكُم
      [], // أَبناءَكُم
      [], // ذٰلِكُم
      [], // قَولُكُم
      [], // بِأَفوٰهِكُم
      [], // وَاللَّهُ
      [], // يَقولُ
      [], // الحَقَّ
      [], // وَهُوَ
      [], // يَهدِى
      [] // السَّبيلَ
    ],
    [ // آية 5
      [], // ادعوهُم
      [], // لِـٔابائِهِم
      [], // هُوَ
      ["أقْسط : أعدل"], // أَقسَطُ
      [], // عِندَ
      [], // اللَّهِ
      [], // فَإِن
      [], // لَم
      [], // تَعلَموا
      [], // ءاباءَهُم
      [], // فَإِخوٰنُكُم
      [], // فِى
      [], // الدّينِ
      [], // وَمَوٰليكُم
      [], // وَلَيسَ
      [], // عَلَيكُم
      [], // جُناحٌ
      [], // فيما
      [], // أَخطَأتُم
      [], // بِهِ
      [], // وَلـٰكِن
      [], // ما
      [], // تَعَمَّدَت
      [], // قُلوبُكُم
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 6
      [], // النَّبِىُّ
      ["أولى بالمؤمنين : أرأف بهم ، و أنفع لهم"], // أَولىٰ
      ["أولى بالمؤمنين : أرأف بهم ، و أنفع لهم"], // بِالمُؤمِنينَ
      [], // مِن
      [], // أَنفُسِهِم
      [], // وَأَزوٰجُهُ
      [], // أُمَّهـٰتُهُم
      [], // وَأُولُوا
      [], // الأَرحامِ
      [], // بَعضُهُم
      [], // أَولىٰ
      [], // بِبَعضٍ
      [], // فى
      [], // كِتـٰبِ
      [], // اللَّهِ
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // وَالمُهـٰجِرينَ
      [], // إِلّا
      [], // أَن
      [], // تَفعَلوا
      [], // إِلىٰ
      [], // أَولِيائِكُم
      [], // مَعروفًا
      [], // كانَ
      [], // ذٰلِكَ
      [], // فِى
      [], // الكِتـٰبِ
      [] // مَسطورًا
    ],
    [ // آية 7
      [], // وَإِذ
      [], // أَخَذنا
      [], // مِنَ
      [], // النَّبِيّـۧنَ
      [], // ميثـٰقَهُم
      [], // وَمِنكَ
      [], // وَمِن
      [], // نوحٍ
      [], // وَإِبرٰهيمَ
      [], // وَموسىٰ
      [], // وَعيسَى
      [], // ابنِ
      [], // مَريَمَ
      [], // وَأَخَذنا
      [], // مِنهُم
      [], // ميثـٰقًا
      [] // غَليظًا
    ],
    [ // آية 8
      [], // لِيَسـَٔلَ
      [], // الصّـٰدِقينَ
      [], // عَن
      [], // صِدقِهِم
      [], // وَأَعَدَّ
      [], // لِلكـٰفِرينَ
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 9
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اذكُروا
      [], // نِعمَةَ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // إِذ
      ["جاءتكم جنود : الأحزاب يوم الخندق سنة خمس"], // جاءَتكُم
      ["جاءتكم جنود : الأحزاب يوم الخندق سنة خمس"], // جُنودٌ
      [], // فَأَرسَلنا
      [], // عَلَيهِم
      [], // ريحًا
      [], // وَجُنودًا
      [], // لَم
      [], // تَرَوها
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرًا
    ],
    [ // آية 10
      [], // إِذ
      [], // جاءوكُم
      [], // مِن
      [], // فَوقِكُم
      [], // وَمِن
      [], // أَسفَلَ
      [], // مِنكُم
      [], // وَإِذ
      [], // زاغَتِ
      [], // الأَبصـٰرُ
      [], // وَبَلَغَتِ
      [], // القُلوبُ
      [], // الحَناجِرَ
      [], // وَتَظُنّونَ
      [], // بِاللَّهِ
      [] // الظُّنونا۠
    ],
    [ // آية 11
      [], // هُنالِكَ
      [], // ابتُلِىَ
      [], // المُؤمِنونَ
      [], // وَزُلزِلوا
      [], // زِلزالًا
      [] // شَديدًا
    ],
    [ // آية 12
      [], // وَإِذ
      [], // يَقولُ
      [], // المُنـٰفِقونَ
      [], // وَالَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // ما
      [], // وَعَدَنَا
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // إِلّا
      ["غرورا : قولا باطلا . أو خداعا"] // غُرورًا
    ],
    [ // آية 13
      [], // وَإِذ
      [], // قالَت
      [], // طائِفَةٌ
      [], // مِنهُم
      [], // يـٰأَهلَ
      ["يثرب : اسم المدينة المنوّرة قديما"], // يَثرِبَ
      [], // لا
      [], // مُقامَ
      [], // لَكُم
      [], // فَارجِعوا
      [], // وَيَستَـٔذِنُ
      [], // فَريقٌ
      [], // مِنهُمُ
      [], // النَّبِىَّ
      [], // يَقولونَ
      ["إن بيوتنا عورة : قاصية يخشى عليها العدوّ"], // إِنَّ
      ["إن بيوتنا عورة : قاصية يخشى عليها العدوّ"], // بُيوتَنا
      ["إن بيوتنا عورة : قاصية يخشى عليها العدوّ"], // عَورَةٌ
      [], // وَما
      [], // هِىَ
      [], // بِعَورَةٍ
      [], // إِن
      [], // يُريدونَ
      [], // إِلّا
      ["فِرارًا : هرَبا من القتال مع المؤمنين"] // فِرارًا
    ],
    [ // آية 14
      [], // وَلَو
      [], // دُخِلَت
      [], // عَلَيهِم
      ["من أقطارها : نواحيها و جوانبهاد"], // مِن
      ["من أقطارها : نواحيها و جوانبهاد"], // أَقطارِها
      [], // ثُمَّ
      [], // سُئِلُوا
      [], // الفِتنَةَ
      [], // لَـٔاتَوها
      [], // وَما
      [], // تَلَبَّثوا
      [], // بِها
      [], // إِلّا
      [] // يَسيرًا
    ],
    [ // آية 15
      [], // وَلَقَد
      [], // كانوا
      [], // عـٰهَدُوا
      [], // اللَّهَ
      [], // مِن
      [], // قَبلُ
      [], // لا
      [], // يُوَلّونَ
      [], // الأَدبـٰرَ
      [], // وَكانَ
      [], // عَهدُ
      [], // اللَّهِ
      [] // مَسـٔولًا
    ],
    [ // آية 16
      [], // قُل
      [], // لَن
      [], // يَنفَعَكُمُ
      [], // الفِرارُ
      [], // إِن
      [], // فَرَرتُم
      [], // مِنَ
      [], // المَوتِ
      [], // أَوِ
      [], // القَتلِ
      [], // وَإِذًا
      [], // لا
      [], // تُمَتَّعونَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 17
      [], // قُل
      [], // مَن
      [], // ذَا
      [], // الَّذى
      ["يعصِمكم من الله : يمنعكم من قَدَره تعالى"], // يَعصِمُكُم
      ["يعصِمكم من الله : يمنعكم من قَدَره تعالى"], // مِنَ
      ["يعصِمكم من الله : يمنعكم من قَدَره تعالى"], // اللَّهِ
      [], // إِن
      [], // أَرادَ
      [], // بِكُم
      [], // سوءًا
      [], // أَو
      [], // أَرادَ
      [], // بِكُم
      [], // رَحمَةً
      [], // وَلا
      [], // يَجِدونَ
      [], // لَهُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 18
      [], // قَد
      [], // يَعلَمُ
      [], // اللَّهُ
      ["المعوّقين منكم : المُثَبّطين منكم عن الرّسول صلى الله عليه و سلم"], // المُعَوِّقينَ
      ["المعوّقين منكم : المُثَبّطين منكم عن الرّسول صلى الله عليه و سلم"], // مِنكُم
      [], // وَالقائِلينَ
      [], // لِإِخوٰنِهِم
      ["هلمّ إلينا : أقبـِـلوا أو قرّبوا أنفسكم إلينا"], // هَلُمَّ
      ["هلمّ إلينا : أقبـِـلوا أو قرّبوا أنفسكم إلينا"], // إِلَينا
      [], // وَلا
      [], // يَأتونَ
      ["البأس : الحرب و القتال"], // البَأسَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 19
      ["أشحّةً عليكم : بُخلاء عليكم بكلّ ما ينفعكم"], // أَشِحَّةً
      ["أشحّةً عليكم : بُخلاء عليكم بكلّ ما ينفعكم"], // عَلَيكُم
      [], // فَإِذا
      [], // جاءَ
      [], // الخَوفُ
      [], // رَأَيتَهُم
      [], // يَنظُرونَ
      [], // إِلَيكَ
      [], // تَدورُ
      [], // أَعيُنُهُم
      [], // كَالَّذى
      ["يُغشى عليه من الموت : تُصيبه الغشية من سكراته"], // يُغشىٰ
      ["يُغشى عليه من الموت : تُصيبه الغشية من سكراته"], // عَلَيهِ
      ["يُغشى عليه من الموت : تُصيبه الغشية من سكراته"], // مِنَ
      ["يُغشى عليه من الموت : تُصيبه الغشية من سكراته"], // المَوتِ
      [], // فَإِذا
      [], // ذَهَبَ
      [], // الخَوفُ
      [], // سَلَقوكُم
      ["بألسنة حدادٍ : ذربة سليطة قاطعة كالحديد"], // بِأَلسِنَةٍ
      ["بألسنة حدادٍ : ذربة سليطة قاطعة كالحديد"], // حِدادٍ
      ["أشحّة على الخير : بُخلاء حريصين على المال و الغنيمة"], // أَشِحَّةً
      ["أشحّة على الخير : بُخلاء حريصين على المال و الغنيمة"], // عَلَى
      ["أشحّة على الخير : بُخلاء حريصين على المال و الغنيمة"], // الخَيرِ
      [], // أُولـٰئِكَ
      [], // لَم
      [], // يُؤمِنوا
      ["فأحبط الله : كأبطل الله"], // فَأَحبَطَ
      ["فأحبط الله : كأبطل الله"], // اللَّهُ
      [], // أَعمـٰلَهُم
      [], // وَكانَ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرًا
    ],
    [ // آية 20
      [], // يَحسَبونَ
      [], // الأَحزابَ
      [], // لَم
      [], // يَذهَبوا
      [], // وَإِن
      [], // يَأتِ
      [], // الأَحزابُ
      [], // يَوَدّوا
      [], // لَو
      [], // أَنَّهُم
      [], // بادونَ
      [], // فِى
      [], // الأَعرابِ
      [], // يَسـَٔلونَ
      [], // عَن
      [], // أَنبائِكُم
      [], // وَلَو
      [], // كانوا
      [], // فيكُم
      [], // ما
      [], // قـٰتَلوا
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 21
      [], // لَقَد
      [], // كانَ
      [], // لَكُم
      [], // فى
      [], // رَسولِ
      [], // اللَّهِ
      ["أُسوة حسنة : قُدْوة صالحة في كلّ الأمور"], // أُسوَةٌ
      ["أُسوة حسنة : قُدْوة صالحة في كلّ الأمور"], // حَسَنَةٌ
      [], // لِمَن
      [], // كانَ
      [], // يَرجُوا
      [], // اللَّهَ
      [], // وَاليَومَ
      [], // الـٔاخِرَ
      [], // وَذَكَرَ
      [], // اللَّهَ
      [] // كَثيرًا
    ],
    [ // آية 22
      [], // وَلَمّا
      [], // رَءَا
      [], // المُؤمِنونَ
      [], // الأَحزابَ
      [], // قالوا
      [], // هـٰذا
      [], // ما
      [], // وَعَدَنَا
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // وَصَدَقَ
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // وَما
      [], // زادَهُم
      [], // إِلّا
      [], // إيمـٰنًا
      [] // وَتَسليمًا
    ],
    [ // آية 23
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // رِجالٌ
      [], // صَدَقوا
      [], // ما
      [], // عـٰهَدُوا
      [], // اللَّهَ
      [], // عَلَيهِ
      [], // فَمِنهُم
      [], // مَن
      ["قضى نحبه : وفيّ بنـَذره . أو مات شهيدا"], // قَضىٰ
      ["قضى نحبه : وفيّ بنـَذره . أو مات شهيدا"], // نَحبَهُ
      [], // وَمِنهُم
      [], // مَن
      [], // يَنتَظِرُ
      [], // وَما
      [], // بَدَّلوا
      [] // تَبديلًا
    ],
    [ // آية 24
      [], // لِيَجزِىَ
      [], // اللَّهُ
      [], // الصّـٰدِقينَ
      [], // بِصِدقِهِم
      [], // وَيُعَذِّبَ
      [], // المُنـٰفِقينَ
      [], // إِن
      [], // شاءَ
      [], // أَو
      [], // يَتوبَ
      [], // عَلَيهِم
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 25
      [], // وَرَدَّ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِغَيظِهِم
      [], // لَم
      [], // يَنالوا
      [], // خَيرًا
      [], // وَكَفَى
      [], // اللَّهُ
      [], // المُؤمِنينَ
      [], // القِتالَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // قَوِيًّا
      [] // عَزيزًا
    ],
    [ // آية 26
      [], // وَأَنزَلَ
      [], // الَّذينَ
      [], // ظـٰهَروهُم
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // مِن
      ["صياصيهم : حصونهم و معاقلهم"], // صَياصيهِم
      [], // وَقَذَفَ
      [], // فى
      [], // قُلوبِهِمُ
      ["الرّعب : الخوف الشّديد"], // الرُّعبَ
      [], // فَريقًا
      [], // تَقتُلونَ
      [], // وَتَأسِرونَ
      [] // فَريقًا
    ],
    [ // آية 27
      [], // وَأَورَثَكُم
      [], // أَرضَهُم
      [], // وَدِيـٰرَهُم
      [], // وَأَموٰلَهُم
      [], // وَأَرضًا
      [], // لَم
      [], // تَطَـٔوها
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرًا
    ],
    [ // آية 28
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // قُل
      [], // لِأَزوٰجِكَ
      [], // إِن
      [], // كُنتُنَّ
      [], // تُرِدنَ
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // وَزينَتَها
      [], // فَتَعالَينَ
      ["أمتّعكنّ : أعطكنّ مُتعة الطّلاق"], // أُمَتِّعكُنَّ
      [], // وَأُسَرِّحكُنَّ
      ["سراحا جميلا : طلاقا حسنا لا ضِرار فيه"], // سَراحًا
      ["سراحا جميلا : طلاقا حسنا لا ضِرار فيه"] // جَميلًا
    ],
    [ // آية 29
      [], // وَإِن
      [], // كُنتُنَّ
      [], // تُرِدنَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَالدّارَ
      [], // الـٔاخِرَةَ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // أَعَدَّ
      [], // لِلمُحسِنـٰتِ
      [], // مِنكُنَّ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 30
      [], // يـٰنِساءَ
      [], // النَّبِىِّ
      [], // مَن
      [], // يَأتِ
      [], // مِنكُنَّ
      [], // بِفـٰحِشَةٍ
      [], // مُبَيِّنَةٍ
      [], // يُضـٰعَف
      [], // لَهَا
      [], // العَذابُ
      [], // ضِعفَينِ
      [], // وَكانَ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرًا
    ],
    [ // آية 31
      [], // وَمَن
      [], // يَقنُت
      [], // مِنكُنَّ
      [], // لِلَّهِ
      [], // وَرَسولِهِ
      [], // وَتَعمَل
      [], // صـٰلِحًا
      [], // نُؤتِها
      [], // أَجرَها
      [], // مَرَّتَينِ
      [], // وَأَعتَدنا
      [], // لَها
      [], // رِزقًا
      [] // كَريمًا
    ],
    [ // آية 32
      [], // يـٰنِساءَ
      [], // النَّبِىِّ
      [], // لَستُنَّ
      [], // كَأَحَدٍ
      [], // مِنَ
      [], // النِّساءِ
      [], // إِنِ
      [], // اتَّقَيتُنَّ
      ["فلا تخضعن بالقول : لا تلنّ القول و لا ترقّـقـنه للرّجال"], // فَلا
      ["فلا تخضعن بالقول : لا تلنّ القول و لا ترقّـقـنه للرّجال"], // تَخضَعنَ
      ["فلا تخضعن بالقول : لا تلنّ القول و لا ترقّـقـنه للرّجال"], // بِالقَولِ
      [], // فَيَطمَعَ
      [], // الَّذى
      [], // فى
      [], // قَلبِهِ
      [], // مَرَضٌ
      [], // وَقُلنَ
      [], // قَولًا
      [] // مَعروفًا
    ],
    [ // آية 33
      [], // وَقَرنَ
      [], // فى
      [], // بُيوتِكُنَّ
      [], // وَلا
      [], // تَبَرَّجنَ
      [], // تَبَرُّجَ
      [], // الجـٰهِلِيَّةِ
      [], // الأولىٰ
      [], // وَأَقِمنَ
      [], // الصَّلوٰةَ
      [], // وَءاتينَ
      [], // الزَّكوٰةَ
      [], // وَأَطِعنَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // إِنَّما
      [], // يُريدُ
      [], // اللَّهُ
      [], // لِيُذهِبَ
      [], // عَنكُمُ
      [], // الرِّجسَ
      [], // أَهلَ
      [], // البَيتِ
      [], // وَيُطَهِّرَكُم
      [] // تَطهيرًا
    ],
    [ // آية 34
      [], // وَاذكُرنَ
      [], // ما
      [], // يُتلىٰ
      [], // فى
      [], // بُيوتِكُنَّ
      [], // مِن
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // وَالحِكمَةِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // لَطيفًا
      [] // خَبيرًا
    ],
    [ // آية 35
      [], // إِنَّ
      [], // المُسلِمينَ
      [], // وَالمُسلِمـٰتِ
      [], // وَالمُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // وَالقـٰنِتينَ
      [], // وَالقـٰنِتـٰتِ
      [], // وَالصّـٰدِقينَ
      [], // وَالصّـٰدِقـٰتِ
      [], // وَالصّـٰبِرينَ
      [], // وَالصّـٰبِرٰتِ
      [], // وَالخـٰشِعينَ
      [], // وَالخـٰشِعـٰتِ
      [], // وَالمُتَصَدِّقينَ
      [], // وَالمُتَصَدِّقـٰتِ
      [], // وَالصّـٰئِمينَ
      [], // وَالصّـٰئِمـٰتِ
      [], // وَالحـٰفِظينَ
      [], // فُروجَهُم
      [], // وَالحـٰفِظـٰتِ
      [], // وَالذّٰكِرينَ
      [], // اللَّهَ
      [], // كَثيرًا
      [], // وَالذّٰكِرٰتِ
      [], // أَعَدَّ
      [], // اللَّهُ
      [], // لَهُم
      [], // مَغفِرَةً
      [], // وَأَجرًا
      [] // عَظيمًا
    ],
    [ // آية 36
      [], // وَما
      [], // كانَ
      [], // لِمُؤمِنٍ
      [], // وَلا
      [], // مُؤمِنَةٍ
      [], // إِذا
      [], // قَضَى
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // أَمرًا
      [], // أَن
      [], // يَكونَ
      [], // لَهُمُ
      [], // الخِيَرَةُ
      [], // مِن
      [], // أَمرِهِم
      [], // وَمَن
      [], // يَعصِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // فَقَد
      [], // ضَلَّ
      [], // ضَلـٰلًا
      [] // مُبينًا
    ],
    [ // آية 37
      [], // وَإِذ
      [], // تَقولُ
      [], // لِلَّذى
      [], // أَنعَمَ
      [], // اللَّهُ
      [], // عَلَيهِ
      [], // وَأَنعَمتَ
      [], // عَلَيهِ
      [], // أَمسِك
      [], // عَلَيكَ
      [], // زَوجَكَ
      [], // وَاتَّقِ
      [], // اللَّهَ
      [], // وَتُخفى
      [], // فى
      [], // نَفسِكَ
      [], // مَا
      [], // اللَّهُ
      [], // مُبديهِ
      [], // وَتَخشَى
      [], // النّاسَ
      [], // وَاللَّهُ
      [], // أَحَقُّ
      [], // أَن
      [], // تَخشىٰهُ
      [], // فَلَمّا
      [], // قَضىٰ
      [], // زَيدٌ
      [], // مِنها
      ["وطرا : حاجته المهمّة ، كناية عن الطّلاق"], // وَطَرًا
      [], // زَوَّجنـٰكَها
      [], // لِكَى
      [], // لا
      [], // يَكونَ
      [], // عَلَى
      [], // المُؤمِنينَ
      [], // حَرَجٌ
      [], // فى
      [], // أَزوٰجِ
      ["أدعيائهم : من تبنّوهم (قبل نسخ التّبنّي)"], // أَدعِيائِهِم
      [], // إِذا
      [], // قَضَوا
      [], // مِنهُنَّ
      [], // وَطَرًا
      [], // وَكانَ
      [], // أَمرُ
      [], // اللَّهِ
      [] // مَفعولًا
    ],
    [ // آية 38
      [], // ما
      [], // كانَ
      [], // عَلَى
      [], // النَّبِىِّ
      [], // مِن
      [], // حَرَجٍ
      [], // فيما
      ["فرض الله له : قسَمَ له أو قدّر أو أحلّ له"], // فَرَضَ
      ["فرض الله له : قسَمَ له أو قدّر أو أحلّ له"], // اللَّهُ
      ["فرض الله له : قسَمَ له أو قدّر أو أحلّ له"], // لَهُ
      [], // سُنَّةَ
      [], // اللَّهِ
      [], // فِى
      [], // الَّذينَ
      ["خلوْا من قبل : مضوْا من قبلك من الأنبياء"], // خَلَوا
      ["خلوْا من قبل : مضوْا من قبلك من الأنبياء"], // مِن
      ["خلوْا من قبل : مضوْا من قبلك من الأنبياء"], // قَبلُ
      [], // وَكانَ
      [], // أَمرُ
      [], // اللَّهِ
      ["قدَرا مقدورا : مُرادا أزلاً . أو قضاءً مقضيّا"], // قَدَرًا
      ["قدَرا مقدورا : مُرادا أزلاً . أو قضاءً مقضيّا"] // مَقدورًا
    ],
    [ // آية 39
      [], // الَّذينَ
      [], // يُبَلِّغونَ
      [], // رِسـٰلـٰتِ
      [], // اللَّهِ
      [], // وَيَخشَونَهُ
      [], // وَلا
      [], // يَخشَونَ
      [], // أَحَدًا
      [], // إِلَّا
      [], // اللَّهَ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // حَسيبًا
    ],
    [ // آية 40
      [], // ما
      [], // كانَ
      [], // مُحَمَّدٌ
      [], // أَبا
      [], // أَحَدٍ
      [], // مِن
      [], // رِجالِكُم
      [], // وَلـٰكِن
      [], // رَسولَ
      [], // اللَّهِ
      [], // وَخاتَمَ
      [], // النَّبِيّـۧنَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمًا
    ],
    [ // آية 41
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اذكُرُوا
      [], // اللَّهَ
      [], // ذِكرًا
      [] // كَثيرًا
    ],
    [ // آية 42
      [], // وَسَبِّحوهُ
      [], // بُكرَةً
      [] // وَأَصيلًا
    ],
    [ // آية 43
      [], // هُوَ
      [], // الَّذى
      [], // يُصَلّى
      [], // عَلَيكُم
      [], // وَمَلـٰئِكَتُهُ
      [], // لِيُخرِجَكُم
      [], // مِنَ
      [], // الظُّلُمـٰتِ
      [], // إِلَى
      [], // النّورِ
      [], // وَكانَ
      [], // بِالمُؤمِنينَ
      [] // رَحيمًا
    ],
    [ // آية 44
      [], // تَحِيَّتُهُم
      [], // يَومَ
      [], // يَلقَونَهُ
      [], // سَلـٰمٌ
      [], // وَأَعَدَّ
      [], // لَهُم
      [], // أَجرًا
      [] // كَريمًا
    ],
    [ // آية 45
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // إِنّا
      [], // أَرسَلنـٰكَ
      [], // شـٰهِدًا
      [], // وَمُبَشِّرًا
      [] // وَنَذيرًا
    ],
    [ // آية 46
      [], // وَداعِيًا
      [], // إِلَى
      [], // اللَّهِ
      [], // بِإِذنِهِ
      [], // وَسِراجًا
      [] // مُنيرًا
    ],
    [ // آية 47
      [], // وَبَشِّرِ
      [], // المُؤمِنينَ
      [], // بِأَنَّ
      [], // لَهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // فَضلًا
      [] // كَبيرًا
    ],
    [ // آية 48
      [], // وَلا
      [], // تُطِعِ
      [], // الكـٰفِرينَ
      [], // وَالمُنـٰفِقينَ
      [], // وَدَع
      [], // أَذىٰهُم
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // وَكيلًا
    ],
    [ // آية 49
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // نَكَحتُمُ
      [], // المُؤمِنـٰتِ
      [], // ثُمَّ
      [], // طَلَّقتُموهُنَّ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // تَمَسّوهُنَّ
      [], // فَما
      [], // لَكُم
      [], // عَلَيهِنَّ
      [], // مِن
      [], // عِدَّةٍ
      [], // تَعتَدّونَها
      [], // فَمَتِّعوهُنَّ
      [], // وَسَرِّحوهُنَّ
      ["سراحا جميلا : عاريا عن أذى و منع واجب"], // سَراحًا
      ["سراحا جميلا : عاريا عن أذى و منع واجب"] // جَميلًا
    ],
    [ // آية 50
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // إِنّا
      [], // أَحلَلنا
      [], // لَكَ
      [], // أَزوٰجَكَ
      [], // الّـٰتى
      [], // ءاتَيتَ
      [], // أُجورَهُنَّ
      [], // وَما
      [], // مَلَكَت
      [], // يَمينُكَ
      [], // مِمّا
      ["أفاء الله عليك : رجعه إليك من الغنيمة"], // أَفاءَ
      ["أفاء الله عليك : رجعه إليك من الغنيمة"], // اللَّهُ
      ["أفاء الله عليك : رجعه إليك من الغنيمة"], // عَلَيكَ
      [], // وَبَناتِ
      [], // عَمِّكَ
      [], // وَبَناتِ
      [], // عَمّـٰتِكَ
      [], // وَبَناتِ
      [], // خالِكَ
      [], // وَبَناتِ
      [], // خـٰلـٰتِكَ
      [], // الّـٰتى
      [], // هاجَرنَ
      [], // مَعَكَ
      [], // وَامرَأَةً
      [], // مُؤمِنَةً
      [], // إِن
      [], // وَهَبَت
      [], // نَفسَها
      [], // لِلنَّبِىِّ
      [], // إِن
      [], // أَرادَ
      [], // النَّبِىُّ
      [], // أَن
      [], // يَستَنكِحَها
      [], // خالِصَةً
      [], // لَكَ
      [], // مِن
      [], // دونِ
      [], // المُؤمِنينَ
      [], // قَد
      [], // عَلِمنا
      [], // ما
      [], // فَرَضنا
      [], // عَلَيهِم
      [], // فى
      [], // أَزوٰجِهِم
      [], // وَما
      [], // مَلَكَت
      [], // أَيمـٰنُهُم
      [], // لِكَيلا
      [], // يَكونَ
      [], // عَلَيكَ
      [], // حَرَجٌ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 51
      [], // تُرجى
      [], // مَن
      [], // تَشاءُ
      [], // مِنهُنَّ
      [], // وَتُـٔوى
      [], // إِلَيكَ
      [], // مَن
      [], // تَشاءُ
      [], // وَمَنِ
      [], // ابتَغَيتَ
      [], // مِمَّن
      [], // عَزَلتَ
      [], // فَلا
      [], // جُناحَ
      [], // عَلَيكَ
      ["ذلك أدنى أن تقرّ أعينهنّ : التفويض إلى مشيئتك أقرب إلى سرورهنّ لعلمهنّ أنّه بحُكم الله"], // ذٰلِكَ
      ["ذلك أدنى أن تقرّ أعينهنّ : التفويض إلى مشيئتك أقرب إلى سرورهنّ لعلمهنّ أنّه بحُكم الله"], // أَدنىٰ
      ["ذلك أدنى أن تقرّ أعينهنّ : التفويض إلى مشيئتك أقرب إلى سرورهنّ لعلمهنّ أنّه بحُكم الله"], // أَن
      ["ذلك أدنى أن تقرّ أعينهنّ : التفويض إلى مشيئتك أقرب إلى سرورهنّ لعلمهنّ أنّه بحُكم الله"], // تَقَرَّ
      ["ذلك أدنى أن تقرّ أعينهنّ : التفويض إلى مشيئتك أقرب إلى سرورهنّ لعلمهنّ أنّه بحُكم الله"], // أَعيُنُهُنَّ
      [], // وَلا
      [], // يَحزَنَّ
      [], // وَيَرضَينَ
      [], // بِما
      [], // ءاتَيتَهُنَّ
      [], // كُلُّهُنَّ
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // ما
      [], // فى
      [], // قُلوبِكُم
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَليمًا
    ],
    [ // آية 52
      [], // لا
      [], // يَحِلُّ
      [], // لَكَ
      [], // النِّساءُ
      [], // مِن
      [], // بَعدُ
      [], // وَلا
      [], // أَن
      [], // تَبَدَّلَ
      [], // بِهِنَّ
      [], // مِن
      [], // أَزوٰجٍ
      [], // وَلَو
      [], // أَعجَبَكَ
      [], // حُسنُهُنَّ
      [], // إِلّا
      [], // ما
      [], // مَلَكَت
      [], // يَمينُكَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // رَقيبًا
    ],
    [ // آية 53
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَدخُلوا
      [], // بُيوتَ
      [], // النَّبِىِّ
      [], // إِلّا
      [], // أَن
      [], // يُؤذَنَ
      [], // لَكُم
      [], // إِلىٰ
      [], // طَعامٍ
      [], // غَيرَ
      [], // نـٰظِرينَ
      [], // إِنىٰهُ
      [], // وَلـٰكِن
      [], // إِذا
      [], // دُعيتُم
      [], // فَادخُلوا
      [], // فَإِذا
      [], // طَعِمتُم
      ["فانتشروا : فتفرّقوا و لا تمكُثوا عنده"], // فَانتَشِروا
      [], // وَلا
      [], // مُستَـٔنِسينَ
      [], // لِحَديثٍ
      [], // إِنَّ
      [], // ذٰلِكُم
      [], // كانَ
      [], // يُؤذِى
      [], // النَّبِىَّ
      [], // فَيَستَحيۦ
      [], // مِنكُم
      [], // وَاللَّهُ
      [], // لا
      [], // يَستَحيۦ
      [], // مِنَ
      [], // الحَقِّ
      [], // وَإِذا
      [], // سَأَلتُموهُنَّ
      [], // مَتـٰعًا
      [], // فَسـَٔلوهُنَّ
      [], // مِن
      [], // وَراءِ
      [], // حِجابٍ
      [], // ذٰلِكُم
      [], // أَطهَرُ
      [], // لِقُلوبِكُم
      [], // وَقُلوبِهِنَّ
      [], // وَما
      [], // كانَ
      [], // لَكُم
      [], // أَن
      [], // تُؤذوا
      [], // رَسولَ
      [], // اللَّهِ
      [], // وَلا
      [], // أَن
      [], // تَنكِحوا
      [], // أَزوٰجَهُ
      [], // مِن
      [], // بَعدِهِ
      [], // أَبَدًا
      [], // إِنَّ
      [], // ذٰلِكُم
      [], // كانَ
      [], // عِندَ
      [], // اللَّهِ
      [] // عَظيمًا
    ],
    [ // آية 54
      [], // إِن
      [], // تُبدوا
      [], // شَيـًٔا
      [], // أَو
      [], // تُخفوهُ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمًا
    ],
    [ // آية 55
      [], // لا
      [], // جُناحَ
      [], // عَلَيهِنَّ
      [], // فى
      [], // ءابائِهِنَّ
      [], // وَلا
      [], // أَبنائِهِنَّ
      [], // وَلا
      [], // إِخوٰنِهِنَّ
      [], // وَلا
      [], // أَبناءِ
      [], // إِخوٰنِهِنَّ
      [], // وَلا
      [], // أَبناءِ
      [], // أَخَوٰتِهِنَّ
      [], // وَلا
      [], // نِسائِهِنَّ
      [], // وَلا
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُهُنَّ
      [], // وَاتَّقينَ
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدًا
    ],
    [ // آية 56
      [], // إِنَّ
      [], // اللَّهَ
      [], // وَمَلـٰئِكَتَهُ
      [], // يُصَلّونَ
      [], // عَلَى
      [], // النَّبِىِّ
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // صَلّوا
      [], // عَلَيهِ
      [], // وَسَلِّموا
      [] // تَسليمًا
    ],
    [ // آية 57
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُؤذونَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // لَعَنَهُمُ
      [], // اللَّهُ
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَأَعَدَّ
      [], // لَهُم
      [], // عَذابًا
      [] // مُهينًا
    ],
    [ // آية 58
      [], // وَالَّذينَ
      [], // يُؤذونَ
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // بِغَيرِ
      [], // مَا
      [], // اكتَسَبوا
      [], // فَقَدِ
      [], // احتَمَلوا
      [], // بُهتـٰنًا
      [], // وَإِثمًا
      [] // مُبينًا
    ],
    [ // آية 59
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // قُل
      [], // لِأَزوٰجِكَ
      [], // وَبَناتِكَ
      [], // وَنِساءِ
      [], // المُؤمِنينَ
      ["يُدنين عليهنّ : يُرخين و يُـسْدِلن عليهن"], // يُدنينَ
      ["يُدنين عليهنّ : يُرخين و يُـسْدِلن عليهن"], // عَلَيهِنَّ
      [], // مِن
      [], // جَلـٰبيبِهِنَّ
      [], // ذٰلِكَ
      [], // أَدنىٰ
      [], // أَن
      [], // يُعرَفنَ
      [], // فَلا
      [], // يُؤذَينَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 60
      [], // لَئِن
      [], // لَم
      [], // يَنتَهِ
      [], // المُنـٰفِقونَ
      [], // وَالَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // وَالمُرجِفونَ
      [], // فِى
      [], // المَدينَةِ
      ["لَنُغرينّك بهم : لنسلّطنّك عليهم"], // لَنُغرِيَنَّكَ
      ["لَنُغرينّك بهم : لنسلّطنّك عليهم"], // بِهِم
      [], // ثُمَّ
      [], // لا
      [], // يُجاوِرونَكَ
      [], // فيها
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 61
      [], // مَلعونينَ
      [], // أَينَما
      [], // ثُقِفوا
      [], // أُخِذوا
      [], // وَقُتِّلوا
      [] // تَقتيلًا
    ],
    [ // آية 62
      [], // سُنَّةَ
      [], // اللَّهِ
      [], // فِى
      [], // الَّذينَ
      [], // خَلَوا
      [], // مِن
      [], // قَبلُ
      [], // وَلَن
      [], // تَجِدَ
      [], // لِسُنَّةِ
      [], // اللَّهِ
      [] // تَبديلًا
    ],
    [ // آية 63
      [], // يَسـَٔلُكَ
      [], // النّاسُ
      [], // عَنِ
      [], // السّاعَةِ
      [], // قُل
      [], // إِنَّما
      [], // عِلمُها
      [], // عِندَ
      [], // اللَّهِ
      [], // وَما
      [], // يُدريكَ
      [], // لَعَلَّ
      [], // السّاعَةَ
      [], // تَكونُ
      [] // قَريبًا
    ],
    [ // آية 64
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَعَنَ
      [], // الكـٰفِرينَ
      [], // وَأَعَدَّ
      [], // لَهُم
      [] // سَعيرًا
    ],
    [ // آية 65
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // لا
      [], // يَجِدونَ
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 66
      [], // يَومَ
      [], // تُقَلَّبُ
      [], // وُجوهُهُم
      [], // فِى
      [], // النّارِ
      [], // يَقولونَ
      [], // يـٰلَيتَنا
      [], // أَطَعنَا
      [], // اللَّهَ
      [], // وَأَطَعنَا
      [] // الرَّسولا۠
    ],
    [ // آية 67
      [], // وَقالوا
      [], // رَبَّنا
      [], // إِنّا
      [], // أَطَعنا
      [], // سادَتَنا
      [], // وَكُبَراءَنا
      [], // فَأَضَلّونَا
      [] // السَّبيلا۠
    ],
    [ // آية 68
      [], // رَبَّنا
      [], // ءاتِهِم
      ["ضعفين : مِثلين"], // ضِعفَينِ
      [], // مِنَ
      [], // العَذابِ
      [], // وَالعَنهُم
      [], // لَعنًا
      [] // كَبيرًا
    ],
    [ // آية 69
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَكونوا
      [], // كَالَّذينَ
      [], // ءاذَوا
      [], // موسىٰ
      [], // فَبَرَّأَهُ
      [], // اللَّهُ
      [], // مِمّا
      [], // قالوا
      [], // وَكانَ
      [], // عِندَ
      [], // اللَّهِ
      [] // وَجيهًا
    ],
    [ // آية 70
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اتَّقُوا
      [], // اللَّهَ
      [], // وَقولوا
      ["قولا سديدا : صوابا . أو صدقا. أو قاصدا إلى الحقّ"], // قَولًا
      ["قولا سديدا : صوابا . أو صدقا. أو قاصدا إلى الحقّ"] // سَديدًا
    ],
    [ // آية 71
      [], // يُصلِح
      [], // لَكُم
      [], // أَعمـٰلَكُم
      [], // وَيَغفِر
      [], // لَكُم
      [], // ذُنوبَكُم
      [], // وَمَن
      [], // يُطِعِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // فَقَد
      [], // فازَ
      [], // فَوزًا
      [] // عَظيمًا
    ],
    [ // آية 72
      [], // إِنّا
      ["عرضنا الأمانة : التّكاليف من أوامر و نواهٍ"], // عَرَضنَا
      ["عرضنا الأمانة : التّكاليف من أوامر و نواهٍ"], // الأَمانَةَ
      [], // عَلَى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَالجِبالِ
      ["فأبين : امتنعنَ"], // فَأَبَينَ
      [], // أَن
      [], // يَحمِلنَها
      [], // وَأَشفَقنَ
      [], // مِنها
      [], // وَحَمَلَهَا
      [], // الإِنسـٰنُ
      [], // إِنَّهُ
      [], // كانَ
      [], // ظَلومًا
      [] // جَهولًا
    ],
    [ // آية 73
      [], // لِيُعَذِّبَ
      [], // اللَّهُ
      [], // المُنـٰفِقينَ
      [], // وَالمُنـٰفِقـٰتِ
      [], // وَالمُشرِكينَ
      [], // وَالمُشرِكـٰتِ
      [], // وَيَتوبَ
      [], // اللَّهُ
      [], // عَلَى
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ]
];

export default meanings;