const meanings = [
[ // آية 1
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَلَهُ
      [], // الحَمدُ
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // وَهُوَ
      [], // الحَكيمُ
      [] // الخَبيرُ
    ],
    [ // آية 2
      [], // يَعلَمُ
      [], // ما
      [], // يَلِجُ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // يَخرُجُ
      [], // مِنها
      [], // وَما
      [], // يَنزِلُ
      [], // مِنَ
      [], // السَّماءِ
      [], // وَما
      [], // يَعرُجُ
      [], // فيها
      [], // وَهُوَ
      [], // الرَّحيمُ
      [] // الغَفورُ
    ],
    [ // آية 3
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لا
      [], // تَأتينَا
      [], // السّاعَةُ
      [], // قُل
      [], // بَلىٰ
      [], // وَرَبّى
      [], // لَتَأتِيَنَّكُم
      [], // عـٰلِمِ
      [], // الغَيبِ
      ["لا يعزب عنه : لا يغيب عنه و لا يخفى عليه"], // لا
      ["لا يعزب عنه : لا يغيب عنه و لا يخفى عليه"], // يَعزُبُ
      ["لا يعزب عنه : لا يغيب عنه و لا يخفى عليه"], // عَنهُ
      [], // مِثقالُ
      [], // ذَرَّةٍ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَلا
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // أَصغَرُ
      [], // مِن
      [], // ذٰلِكَ
      [], // وَلا
      [], // أَكبَرُ
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [] // مُبينٍ
    ],
    [ // آية 4
      [], // لِيَجزِىَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَرِزقٌ
      [] // كَريمٌ
    ],
    [ // آية 5
      [], // وَالَّذينَ
      [], // سَعَو
      [], // فى
      [], // ءايـٰتِنا
      [], // مُعـٰجِزينَ
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      ["من رجز : أشدّ العذاب و أسرئه"], // مِن
      ["من رجز : أشدّ العذاب و أسرئه"], // رِجزٍ
      [] // أَليمٌ
    ],
    [ // آية 6
      [], // وَيَرَى
      [], // الَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // الَّذى
      [], // أُنزِلَ
      [], // إِلَيكَ
      [], // مِن
      [], // رَبِّكَ
      [], // هُوَ
      [], // الحَقَّ
      [], // وَيَهدى
      [], // إِلىٰ
      [], // صِرٰطِ
      [], // العَزيزِ
      [] // الحَميدِ
    ],
    [ // آية 7
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // هَل
      [], // نَدُلُّكُم
      [], // عَلىٰ
      [], // رَجُلٍ
      [], // يُنَبِّئُكُم
      [], // إِذا
      [], // مُزِّقتُم
      [], // كُلَّ
      [], // مُمَزَّقٍ
      [], // إِنَّكُم
      [], // لَفى
      [], // خَلقٍ
      [] // جَديدٍ
    ],
    [ // آية 8
      [], // أَفتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَم
      [], // بِهِ
      [], // جِنَّةٌ
      [], // بَلِ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // فِى
      [], // العَذابِ
      [], // وَالضَّلـٰلِ
      [] // البَعيدِ
    ],
    [ // آية 9
      [], // أَفَلَم
      [], // يَرَوا
      [], // إِلىٰ
      [], // ما
      [], // بَينَ
      [], // أَيديهِم
      [], // وَما
      [], // خَلفَهُم
      [], // مِنَ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // إِن
      [], // نَشَأ
      ["نخسف بهم الأرض : نغيّب بهم الأرض كقارون"], // نَخسِف
      ["نخسف بهم الأرض : نغيّب بهم الأرض كقارون"], // بِهِمُ
      ["نخسف بهم الأرض : نغيّب بهم الأرض كقارون"], // الأَرضَ
      [], // أَو
      [], // نُسقِط
      [], // عَلَيهِم
      ["كسَفا من السّماء : قطعا منها كأصحاب الأيكة"], // كِسَفًا
      ["كسَفا من السّماء : قطعا منها كأصحاب الأيكة"], // مِنَ
      ["كسَفا من السّماء : قطعا منها كأصحاب الأيكة"], // السَّماءِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايَةً
      [], // لِكُلِّ
      [], // عَبدٍ
      ["منيب : راجـِع إلى ربّه بالتـّوبة و الطاعة"] // مُنيبٍ
    ],
    [ // آية 10
      [], // وَلَقَد
      [], // ءاتَينا
      [], // داوۥدَ
      [], // مِنّا
      [], // فَضلًا
      [], // يـٰجِبالُ
      [], // أَوِّبى
      [], // مَعَهُ
      [], // وَالطَّيرَ
      [], // وَأَلَنّا
      [], // لَهُ
      [] // الحَديدَ
    ],
    [ // آية 11
      [], // أَنِ
      [], // اعمَل
      [], // سـٰبِغـٰتٍ
      [], // وَقَدِّر
      [], // فِى
      [], // السَّردِ
      [], // وَاعمَلوا
      [], // صـٰلِحًا
      [], // إِنّى
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 12
      [], // وَلِسُلَيمـٰنَ
      [], // الرّيحَ
      ["غّدوّها شهر : جَرْيها بالغداة مسيرة شهر"], // غُدُوُّها
      ["غّدوّها شهر : جَرْيها بالغداة مسيرة شهر"], // شَهرٌ
      [], // وَرَواحُها
      [], // شَهرٌ
      [], // وَأَسَلنا
      [], // لَهُ
      ["عين القِطر : عين النّحاس فَـنَـبَع ذائبا كالماء"], // عَينَ
      ["عين القِطر : عين النّحاس فَـنَـبَع ذائبا كالماء"], // القِطرِ
      [], // وَمِنَ
      [], // الجِنِّ
      [], // مَن
      [], // يَعمَلُ
      [], // بَينَ
      [], // يَدَيهِ
      [], // بِإِذنِ
      [], // رَبِّهِ
      [], // وَمَن
      ["يزغ منهم : يَمِلْ و يَعْدِلْ منهم"], // يَزِغ
      ["يزغ منهم : يَمِلْ و يَعْدِلْ منهم"], // مِنهُم
      [], // عَن
      [], // أَمرِنا
      [], // نُذِقهُ
      [], // مِن
      [], // عَذابِ
      [] // السَّعيرِ
    ],
    [ // آية 13
      [], // يَعمَلونَ
      [], // لَهُ
      [], // ما
      [], // يَشاءُ
      [], // مِن
      [], // مَحـٰريبَ
      [], // وَتَمـٰثيلَ
      [], // وَجِفانٍ
      [], // كَالجَوابِ
      [], // وَقُدورٍ
      [], // راسِيـٰتٍ
      [], // اعمَلوا
      [], // ءالَ
      [], // داوۥدَ
      [], // شُكرًا
      [], // وَقَليلٌ
      [], // مِن
      [], // عِبادِىَ
      [] // الشَّكورُ
    ],
    [ // آية 14
      [], // فَلَمّا
      [], // قَضَينا
      [], // عَلَيهِ
      [], // المَوتَ
      [], // ما
      [], // دَلَّهُم
      [], // عَلىٰ
      [], // مَوتِهِ
      [], // إِلّا
      ["دابّة الأرض : الأرضة التي تأكل الخشب"], // دابَّةُ
      ["دابّة الأرض : الأرضة التي تأكل الخشب"], // الأَرضِ
      ["تأكل منسأته : تـَـأْرضُ عصَاه"], // تَأكُلُ
      ["تأكل منسأته : تـَـأْرضُ عصَاه"], // مِنسَأَتَهُ
      [], // فَلَمّا
      [], // خَرَّ
      [], // تَبَيَّنَتِ
      [], // الجِنُّ
      [], // أَن
      [], // لَو
      [], // كانوا
      [], // يَعلَمونَ
      [], // الغَيبَ
      [], // ما
      [], // لَبِثوا
      [], // فِى
      [], // العَذابِ
      [] // المُهينِ
    ],
    [ // آية 15
      [], // لَقَد
      [], // كانَ
      [], // لِسَبَإٍ
      [], // فى
      [], // مَسكَنِهِم
      [], // ءايَةٌ
      [], // جَنَّتانِ
      [], // عَن
      [], // يَمينٍ
      [], // وَشِمالٍ
      [], // كُلوا
      [], // مِن
      [], // رِزقِ
      [], // رَبِّكُم
      [], // وَاشكُروا
      [], // لَهُ
      ["بلدة طيّبة : زكيّة مُستـَـلَذة"], // بَلدَةٌ
      ["بلدة طيّبة : زكيّة مُستـَـلَذة"], // طَيِّبَةٌ
      [], // وَرَبٌّ
      [] // غَفورٌ
    ],
    [ // آية 16
      ["فأعرضوا : عن الشّكر أو كذبوا أنبياءهم"], // فَأَعرَضوا
      [], // فَأَرسَلنا
      [], // عَلَيهِم
      ["سيل العرم : سيل السّــدّ . أو المطر الشّديد"], // سَيلَ
      ["سيل العرم : سيل السّــدّ . أو المطر الشّديد"], // العَرِمِ
      [], // وَبَدَّلنـٰهُم
      [], // بِجَنَّتَيهِم
      [], // جَنَّتَينِ
      [], // ذَواتَى
      ["أكل خمطٍ : ثمرٍ مرّ حامض بشع"], // أُكُلٍ
      ["أكل خمطٍ : ثمرٍ مرّ حامض بشع"], // خَمطٍ
      [], // وَأَثلٍ
      [], // وَشَىءٍ
      [], // مِن
      ["سِدْر : الضّالِ أو شجرة النّبق"], // سِدرٍ
      [] // قَليلٍ
    ],
    [ // آية 17
      [], // ذٰلِكَ
      [], // جَزَينـٰهُم
      [], // بِما
      [], // كَفَروا
      [], // وَهَل
      [], // نُجـٰزى
      [], // إِلَّا
      [] // الكَفورَ
    ],
    [ // آية 18
      [], // وَجَعَلنا
      [], // بَينَهُم
      [], // وَبَينَ
      ["القرى : قرى الشام"], // القُرَى
      [], // الَّتى
      [], // بـٰرَكنا
      [], // فيها
      [], // قُرًى
      [], // ظـٰهِرَةً
      [], // وَقَدَّرنا
      [], // فيهَا
      [], // السَّيرَ
      [], // سيروا
      [], // فيها
      [], // لَيالِىَ
      [], // وَأَيّامًا
      [] // ءامِنينَ
    ],
    [ // آية 19
      [], // فَقالوا
      [], // رَبَّنا
      [], // بـٰعِد
      [], // بَينَ
      [], // أَسفارِنا
      [], // وَظَلَموا
      [], // أَنفُسَهُم
      [], // فَجَعَلنـٰهُم
      [], // أَحاديثَ
      [], // وَمَزَّقنـٰهُم
      [], // كُلَّ
      [], // مُمَزَّقٍ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِكُلِّ
      [], // صَبّارٍ
      [] // شَكورٍ
    ],
    [ // آية 20
      [], // وَلَقَد
      ["صدّق عليهم : حقّق عليهم"], // صَدَّقَ
      ["صدّق عليهم : حقّق عليهم"], // عَلَيهِم
      [], // إِبليسُ
      [], // ظَنَّهُ
      [], // فَاتَّبَعوهُ
      [], // إِلّا
      [], // فَريقًا
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 21
      [], // وَما
      [], // كانَ
      [], // لَهُ
      [], // عَلَيهِم
      [], // مِن
      [], // سُلطـٰنٍ
      [], // إِلّا
      [], // لِنَعلَمَ
      [], // مَن
      [], // يُؤمِنُ
      [], // بِالـٔاخِرَةِ
      [], // مِمَّن
      [], // هُوَ
      [], // مِنها
      [], // فى
      [], // شَكٍّ
      [], // وَرَبُّكَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // حَفيظٌ
    ],
    [ // آية 22
      [], // قُلِ
      [], // ادعُوا
      [], // الَّذينَ
      [], // زَعَمتُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // لا
      [], // يَملِكونَ
      [], // مِثقالَ
      [], // ذَرَّةٍ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَلا
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // لَهُم
      [], // فيهِما
      [], // مِن
      [], // شِركٍ
      [], // وَما
      [], // لَهُ
      [], // مِنهُم
      [], // مِن
      ["ظهيرٍ : مُعين على الخلق و التـّـدبير"] // ظَهيرٍ
    ],
    [ // آية 23
      [], // وَلا
      [], // تَنفَعُ
      [], // الشَّفـٰعَةُ
      [], // عِندَهُ
      [], // إِلّا
      [], // لِمَن
      [], // أَذِنَ
      [], // لَهُ
      [], // حَتّىٰ
      [], // إِذا
      [], // فُزِّعَ
      [], // عَن
      [], // قُلوبِهِم
      [], // قالوا
      [], // ماذا
      [], // قالَ
      [], // رَبُّكُم
      [], // قالُوا
      [], // الحَقَّ
      [], // وَهُوَ
      [], // العَلِىُّ
      [] // الكَبيرُ
    ],
    [ // آية 24
      [], // قُل
      [], // مَن
      [], // يَرزُقُكُم
      [], // مِنَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // قُلِ
      [], // اللَّهُ
      [], // وَإِنّا
      [], // أَو
      [], // إِيّاكُم
      [], // لَعَلىٰ
      [], // هُدًى
      [], // أَو
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 25
      [], // قُل
      [], // لا
      [], // تُسـَٔلونَ
      [], // عَمّا
      ["أجرمنا : اكتسبنا من الزّلات"], // أَجرَمنا
      [], // وَلا
      [], // نُسـَٔلُ
      [], // عَمّا
      [] // تَعمَلونَ
    ],
    [ // آية 26
      [], // قُل
      [], // يَجمَعُ
      [], // بَينَنا
      [], // رَبُّنا
      [], // ثُمَّ
      ["يفتح بيننا : يقضي و يحكم بيننا"], // يَفتَحُ
      ["يفتح بيننا : يقضي و يحكم بيننا"], // بَينَنا
      [], // بِالحَقِّ
      [], // وَهُوَ
      [], // الفَتّاحُ
      [] // العَليمُ
    ],
    [ // آية 27
      [], // قُل
      [], // أَرونِىَ
      [], // الَّذينَ
      [], // أَلحَقتُم
      [], // بِهِ
      [], // شُرَكاءَ
      [], // كَلّا
      [], // بَل
      [], // هُوَ
      [], // اللَّهُ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 28
      [], // وَما
      [], // أَرسَلنـٰكَ
      [], // إِلّا
      ["كافّة للنّاس : إلى النّاس جميعا"], // كافَّةً
      ["كافّة للنّاس : إلى النّاس جميعا"], // لِلنّاسِ
      [], // بَشيرًا
      [], // وَنَذيرًا
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 29
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 30
      [], // قُل
      [], // لَكُم
      [], // ميعادُ
      [], // يَومٍ
      [], // لا
      [], // تَستَـٔخِرونَ
      [], // عَنهُ
      [], // ساعَةً
      [], // وَلا
      [] // تَستَقدِمونَ
    ],
    [ // آية 31
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَن
      [], // نُؤمِنَ
      [], // بِهـٰذَا
      [], // القُرءانِ
      [], // وَلا
      [], // بِالَّذى
      [], // بَينَ
      [], // يَدَيهِ
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذِ
      [], // الظّـٰلِمونَ
      ["مَوْقوفون : محبوسُون في موقف الحساب"], // مَوقوفونَ
      [], // عِندَ
      [], // رَبِّهِم
      [], // يَرجِعُ
      [], // بَعضُهُم
      [], // إِلىٰ
      [], // بَعضٍ
      [], // القَولَ
      [], // يَقولُ
      [], // الَّذينَ
      [], // استُضعِفوا
      [], // لِلَّذينَ
      [], // استَكبَروا
      [], // لَولا
      [], // أَنتُم
      [], // لَكُنّا
      [] // مُؤمِنينَ
    ],
    [ // آية 32
      [], // قالَ
      [], // الَّذينَ
      [], // استَكبَروا
      [], // لِلَّذينَ
      [], // استُضعِفوا
      [], // أَنَحنُ
      [], // صَدَدنـٰكُم
      [], // عَنِ
      [], // الهُدىٰ
      [], // بَعدَ
      [], // إِذ
      [], // جاءَكُم
      [], // بَل
      [], // كُنتُم
      [] // مُجرِمينَ
    ],
    [ // آية 33
      [], // وَقالَ
      [], // الَّذينَ
      [], // استُضعِفوا
      [], // لِلَّذينَ
      [], // استَكبَروا
      [], // بَل
      [], // مَكرُ
      [], // الَّيلِ
      [], // وَالنَّهارِ
      [], // إِذ
      [], // تَأمُرونَنا
      [], // أَن
      [], // نَكفُرَ
      [], // بِاللَّهِ
      [], // وَنَجعَلَ
      [], // لَهُ
      ["أندادا : أمثالا من مخلوقاته نعبُدُها"], // أَندادًا
      [], // وَأَسَرُّوا
      [], // النَّدامَةَ
      [], // لَمّا
      [], // رَأَوُا
      [], // العَذابَ
      [], // وَجَعَلنَا
      [], // الأَغلـٰلَ
      [], // فى
      [], // أَعناقِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // هَل
      [], // يُجزَونَ
      [], // إِلّا
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 34
      [], // وَما
      [], // أَرسَلنا
      [], // فى
      [], // قَريَةٍ
      [], // مِن
      [], // نَذيرٍ
      [], // إِلّا
      [], // قالَ
      [], // مُترَفوها
      [], // إِنّا
      [], // بِما
      [], // أُرسِلتُم
      [], // بِهِ
      [] // كـٰفِرونَ
    ],
    [ // آية 35
      [], // وَقالوا
      [], // نَحنُ
      [], // أَكثَرُ
      [], // أَموٰلًا
      [], // وَأَولـٰدًا
      [], // وَما
      [], // نَحنُ
      [] // بِمُعَذَّبينَ
    ],
    [ // آية 36
      [], // قُل
      [], // إِنَّ
      [], // رَبّى
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيَقدِرُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 37
      [], // وَما
      [], // أَموٰلُكُم
      [], // وَلا
      [], // أَولـٰدُكُم
      [], // بِالَّتى
      [], // تُقَرِّبُكُم
      [], // عِندَنا
      ["زلفَى : تقريبا"], // زُلفىٰ
      [], // إِلّا
      [], // مَن
      [], // ءامَنَ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // فَأُولـٰئِكَ
      ["لهم جزاء الضّعف : لهم الثواب المضاعف"], // لَهُم
      ["لهم جزاء الضّعف : لهم الثواب المضاعف"], // جَزاءُ
      ["لهم جزاء الضّعف : لهم الثواب المضاعف"], // الضِّعفِ
      [], // بِما
      [], // عَمِلوا
      [], // وَهُم
      [], // فِى
      [], // الغُرُفـٰتِ
      [] // ءامِنونَ
    ],
    [ // آية 38
      [], // وَالَّذينَ
      [], // يَسعَونَ
      [], // فى
      [], // ءايـٰتِنا
      [], // مُعـٰجِزينَ
      [], // أُولـٰئِكَ
      [], // فِى
      [], // العَذابِ
      ["مُحضرون : تُحضرهم الزبانية إلى جهنّم"] // مُحضَرونَ
    ],
    [ // آية 39
      [], // قُل
      [], // إِنَّ
      [], // رَبّى
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَيَقدِرُ
      [], // لَهُ
      [], // وَما
      [], // أَنفَقتُم
      [], // مِن
      [], // شَىءٍ
      [], // فَهُوَ
      [], // يُخلِفُهُ
      [], // وَهُوَ
      [], // خَيرُ
      [] // الرّٰزِقينَ
    ],
    [ // آية 40
      [], // وَيَومَ
      [], // يَحشُرُهُم
      [], // جَميعًا
      [], // ثُمَّ
      [], // يَقولُ
      [], // لِلمَلـٰئِكَةِ
      [], // أَهـٰؤُلاءِ
      [], // إِيّاكُم
      [], // كانوا
      [] // يَعبُدونَ
    ],
    [ // آية 41
      [], // قالوا
      [], // سُبحـٰنَكَ
      [], // أَنتَ
      [], // وَلِيُّنا
      [], // مِن
      [], // دونِهِم
      [], // بَل
      [], // كانوا
      [], // يَعبُدونَ
      [], // الجِنَّ
      [], // أَكثَرُهُم
      [], // بِهِم
      [] // مُؤمِنونَ
    ],
    [ // آية 42
      [], // فَاليَومَ
      [], // لا
      [], // يَملِكُ
      [], // بَعضُكُم
      [], // لِبَعضٍ
      [], // نَفعًا
      [], // وَلا
      [], // ضَرًّا
      [], // وَنَقولُ
      [], // لِلَّذينَ
      [], // ظَلَموا
      [], // ذوقوا
      [], // عَذابَ
      [], // النّارِ
      [], // الَّتى
      [], // كُنتُم
      [], // بِها
      [] // تُكَذِّبونَ
    ],
    [ // آية 43
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // بَيِّنـٰتٍ
      [], // قالوا
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      [], // رَجُلٌ
      [], // يُريدُ
      [], // أَن
      [], // يَصُدَّكُم
      [], // عَمّا
      [], // كانَ
      [], // يَعبُدُ
      [], // ءاباؤُكُم
      [], // وَقالوا
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      ["إفك مفترى : كذِب مُختلق"], // إِفكٌ
      ["إفك مفترى : كذِب مُختلق"], // مُفتَرًى
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلحَقِّ
      [], // لَمّا
      [], // جاءَهُم
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 44
      [], // وَما
      [], // ءاتَينـٰهُم
      [], // مِن
      [], // كُتُبٍ
      [], // يَدرُسونَها
      [], // وَما
      [], // أَرسَلنا
      [], // إِلَيهِم
      [], // قَبلَكَ
      [], // مِن
      [] // نَذيرٍ
    ],
    [ // آية 45
      [], // وَكَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَما
      [], // بَلَغوا
      [], // مِعشارَ
      [], // ما
      [], // ءاتَينـٰهُم
      [], // فَكَذَّبوا
      [], // رُسُلى
      [], // فَكَيفَ
      [], // كانَ
      [] // نَكيرِ
    ],
    [ // آية 46
      [], // قُل
      [], // إِنَّما
      [], // أَعِظُكُم
      [], // بِوٰحِدَةٍ
      [], // أَن
      [], // تَقوموا
      [], // لِلَّهِ
      [], // مَثنىٰ
      [], // وَفُرٰدىٰ
      [], // ثُمَّ
      [], // تَتَفَكَّروا
      [], // ما
      [], // بِصاحِبِكُم
      [], // مِن
      [], // جِنَّةٍ
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // نَذيرٌ
      [], // لَكُم
      [], // بَينَ
      [], // يَدَى
      [], // عَذابٍ
      [] // شَديدٍ
    ],
    [ // آية 47
      [], // قُل
      [], // ما
      [], // سَأَلتُكُم
      [], // مِن
      [], // أَجرٍ
      [], // فَهُوَ
      [], // لَكُم
      [], // إِن
      [], // أَجرِىَ
      [], // إِلّا
      [], // عَلَى
      [], // اللَّهِ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدٌ
    ],
    [ // آية 48
      [], // قُل
      [], // إِنَّ
      [], // رَبّى
      ["يقذف بالحقّ : يرمي به الباطل فيدمغه"], // يَقذِفُ
      ["يقذف بالحقّ : يرمي به الباطل فيدمغه"], // بِالحَقِّ
      [], // عَلّـٰمُ
      [] // الغُيوبِ
    ],
    [ // آية 49
      [], // قُل
      [], // جاءَ
      [], // الحَقُّ
      [], // وَما
      [], // يُبدِئُ
      [], // البـٰطِلُ
      [], // وَما
      [] // يُعيدُ
    ],
    [ // آية 50
      [], // قُل
      [], // إِن
      [], // ضَلَلتُ
      [], // فَإِنَّما
      [], // أَضِلُّ
      [], // عَلىٰ
      [], // نَفسى
      [], // وَإِنِ
      [], // اهتَدَيتُ
      [], // فَبِما
      [], // يوحى
      [], // إِلَىَّ
      [], // رَبّى
      [], // إِنَّهُ
      [], // سَميعٌ
      [] // قَريبٌ
    ],
    [ // آية 51
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذ
      ["فزعوا : خافوا عند الموت أو البعث"], // فَزِعوا
      ["فلا فوْت : فلا مهرَبَ و لا نجاة من العذاب"], // فَلا
      ["فلا فوْت : فلا مهرَبَ و لا نجاة من العذاب"], // فَوتَ
      [], // وَأُخِذوا
      [], // مِن
      ["مكان قريب : موقف الحساب"], // مَكانٍ
      ["مكان قريب : موقف الحساب"] // قَريبٍ
    ],
    [ // آية 52
      [], // وَقالوا
      [], // ءامَنّا
      [], // بِهِ
      [], // وَأَنّىٰ
      [], // لَهُمُ
      [], // التَّناوُشُ
      [], // مِن
      ["مكان بعيد : هو الآخرة"], // مَكانٍ
      ["مكان بعيد : هو الآخرة"] // بَعيدٍ
    ],
    [ // آية 53
      [], // وَقَد
      [], // كَفَروا
      [], // بِهِ
      [], // مِن
      [], // قَبلُ
      [], // وَيَقذِفونَ
      [], // بِالغَيبِ
      [], // مِن
      [], // مَكانٍ
      [] // بَعيدٍ
    ],
    [ // آية 54
      [], // وَحيلَ
      [], // بَينَهُم
      [], // وَبَينَ
      [], // ما
      [], // يَشتَهونَ
      [], // كَما
      [], // فُعِلَ
      ["بأشياعهم : بأمثالهم من الكفّار"], // بِأَشياعِهِم
      [], // مِن
      [], // قَبلُ
      [], // إِنَّهُم
      [], // كانوا
      [], // فى
      [], // شَكٍّ
      ["مُريب : موقع في الرّيبة و القلق"] // مُريبٍ
    ]
];

export default meanings;