const meanings = [
  [ // سورة 35: فاطر
[ // آية 1
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // فاطِرِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // جاعِلِ
      [], // المَلـٰئِكَةِ
      [], // رُسُلًا
      [], // أُولى
      [], // أَجنِحَةٍ
      [], // مَثنىٰ
      [], // وَثُلـٰثَ
      [], // وَرُبـٰعَ
      [], // يَزيدُ
      [], // فِى
      [], // الخَلقِ
      [], // ما
      [], // يَشاءُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 2
      ["ما يفتح الله : ما يُرسل الله"], // ما
      ["ما يفتح الله : ما يُرسل الله"], // يَفتَحِ
      ["ما يفتح الله : ما يُرسل الله"], // اللَّهُ
      [], // لِلنّاسِ
      [], // مِن
      [], // رَحمَةٍ
      [], // فَلا
      [], // مُمسِكَ
      [], // لَها
      [], // وَما
      [], // يُمسِك
      [], // فَلا
      [], // مُرسِلَ
      [], // لَهُ
      [], // مِن
      [], // بَعدِهِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 3
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // اذكُروا
      [], // نِعمَتَ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // هَل
      [], // مِن
      [], // خـٰلِقٍ
      [], // غَيرُ
      [], // اللَّهِ
      [], // يَرزُقُكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَأَنّىٰ
      [] // تُؤفَكونَ
    ],
    [ // آية 4
      [], // وَإِن
      [], // يُكَذِّبوكَ
      [], // فَقَد
      [], // كُذِّبَت
      [], // رُسُلٌ
      [], // مِن
      [], // قَبلِكَ
      [], // وَإِلَى
      [], // اللَّهِ
      [], // تُرجَعُ
      [] // الأُمورُ
    ],
    [ // آية 5
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // فَلا
      [], // تَغُرَّنَّكُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // وَلا
      [], // يَغُرَّنَّكُم
      [], // بِاللَّهِ
      [] // الغَرورُ
    ],
    [ // آية 6
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      [], // لَكُم
      [], // عَدُوٌّ
      [], // فَاتَّخِذوهُ
      [], // عَدُوًّا
      [], // إِنَّما
      [], // يَدعوا
      [], // حِزبَهُ
      [], // لِيَكونوا
      [], // مِن
      [], // أَصحـٰبِ
      [] // السَّعيرِ
    ],
    [ // آية 7
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَهُم
      [], // عَذابٌ
      [], // شَديدٌ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَأَجرٌ
      [] // كَبيرٌ
    ],
    [ // آية 8
      [], // أَفَمَن
      [], // زُيِّنَ
      [], // لَهُ
      [], // سوءُ
      [], // عَمَلِهِ
      [], // فَرَءاهُ
      [], // حَسَنًا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // يُضِلُّ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَهدى
      [], // مَن
      [], // يَشاءُ
      [], // فَلا
      [], // تَذهَب
      [], // نَفسُكَ
      [], // عَلَيهِم
      [], // حَسَرٰتٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [], // بِما
      [] // يَصنَعونَ
    ],
    [ // آية 9
      [], // وَاللَّهُ
      [], // الَّذى
      [], // أَرسَلَ
      [], // الرِّيـٰحَ
      ["فتثير سحابا : تحرّكه و تهيّجه"], // فَتُثيرُ
      ["فتثير سحابا : تحرّكه و تهيّجه"], // سَحابًا
      [], // فَسُقنـٰهُ
      [], // إِلىٰ
      [], // بَلَدٍ
      [], // مَيِّتٍ
      [], // فَأَحيَينا
      [], // بِهِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // كَذٰلِكَ
      [] // النُّشورُ
    ],
    [ // آية 10
      [], // مَن
      [], // كانَ
      ["يريد العزّة : الشّرف و المنعة"], // يُريدُ
      ["يريد العزّة : الشّرف و المنعة"], // العِزَّةَ
      [], // فَلِلَّهِ
      [], // العِزَّةُ
      [], // جَميعًا
      [], // إِلَيهِ
      [], // يَصعَدُ
      ["الكلِم الطيّب : كلمة و التوحيد و جيمع عبادات اللّسان"], // الكَلِمُ
      ["الكلِم الطيّب : كلمة و التوحيد و جيمع عبادات اللّسان"], // الطَّيِّبُ
      [], // وَالعَمَلُ
      [], // الصّـٰلِحُ
      [], // يَرفَعُهُ
      [], // وَالَّذينَ
      [], // يَمكُرونَ
      [], // السَّيِّـٔاتِ
      [], // لَهُم
      [], // عَذابٌ
      [], // شَديدٌ
      [], // وَمَكرُ
      [], // أُولـٰئِكَ
      [], // هُوَ
      ["يبور : يفسد و يبطل"] // يَبورُ
    ],
    [ // آية 11
      [], // وَاللَّهُ
      [], // خَلَقَكُم
      [], // مِن
      [], // تُرابٍ
      [], // ثُمَّ
      [], // مِن
      [], // نُطفَةٍ
      [], // ثُمَّ
      [], // جَعَلَكُم
      [], // أَزوٰجًا
      [], // وَما
      [], // تَحمِلُ
      [], // مِن
      [], // أُنثىٰ
      [], // وَلا
      [], // تَضَعُ
      [], // إِلّا
      [], // بِعِلمِهِ
      [], // وَما
      [], // يُعَمَّرُ
      [], // مِن
      [], // مُعَمَّرٍ
      [], // وَلا
      [], // يُنقَصُ
      [], // مِن
      [], // عُمُرِهِ
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرٌ
    ],
    [ // آية 12
      [], // وَما
      [], // يَستَوِى
      [], // البَحرانِ
      [], // هـٰذا
      ["عذبٌ فرات : طيّب حُلو شديد العذوبة"], // عَذبٌ
      ["عذبٌ فرات : طيّب حُلو شديد العذوبة"], // فُراتٌ
      ["سائغ شرابه : مريء سهلٌ انحداره"], // سائِغٌ
      ["سائغ شرابه : مريء سهلٌ انحداره"], // شَرابُهُ
      [], // وَهـٰذا
      ["ملح أجاج : شديد الملوحة أو المرارة"], // مِلحٌ
      ["ملح أجاج : شديد الملوحة أو المرارة"], // أُجاجٌ
      [], // وَمِن
      [], // كُلٍّ
      [], // تَأكُلونَ
      [], // لَحمًا
      [], // طَرِيًّا
      [], // وَتَستَخرِجونَ
      ["حلية : اللؤلؤ و المرجان من الملح"], // حِليَةً
      [], // تَلبَسونَها
      [], // وَتَرَى
      [], // الفُلكَ
      [], // فيهِ
      [], // مَواخِرَ
      [], // لِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // وَلَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 13
      ["يولج : يُدْخل"], // يولِجُ
      [], // الَّيلَ
      [], // فِى
      [], // النَّهارِ
      [], // وَيولِجُ
      [], // النَّهارَ
      [], // فِى
      [], // الَّيلِ
      [], // وَسَخَّرَ
      [], // الشَّمسَ
      [], // وَالقَمَرَ
      [], // كُلٌّ
      [], // يَجرى
      ["لأجل مسمّى : مقدّر لفنائهما (يوم القيامة)"], // لِأَجَلٍ
      ["لأجل مسمّى : مقدّر لفنائهما (يوم القيامة)"], // مُسَمًّى
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      [], // لَهُ
      [], // المُلكُ
      [], // وَالَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // ما
      [], // يَملِكونَ
      [], // مِن
      ["قطمير : هو القشرة الرقيقة على النّواة"] // قِطميرٍ
    ],
    [ // آية 14
      [], // إِن
      [], // تَدعوهُم
      [], // لا
      [], // يَسمَعوا
      [], // دُعاءَكُم
      [], // وَلَو
      [], // سَمِعوا
      [], // مَا
      [], // استَجابوا
      [], // لَكُم
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // يَكفُرونَ
      [], // بِشِركِكُم
      [], // وَلا
      [], // يُنَبِّئُكَ
      [], // مِثلُ
      [] // خَبيرٍ
    ],
    [ // آية 15
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // أَنتُمُ
      [], // الفُقَراءُ
      [], // إِلَى
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // هُوَ
      [], // الغَنِىُّ
      [] // الحَميدُ
    ],
    [ // آية 16
      [], // إِن
      [], // يَشَأ
      [], // يُذهِبكُم
      [], // وَيَأتِ
      [], // بِخَلقٍ
      [] // جَديدٍ
    ],
    [ // آية 17
      [], // وَما
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // بِعَزيزٍ
    ],
    [ // آية 18
      [], // وَلا
      [], // تَزِرُ
      [], // وازِرَةٌ
      [], // وِزرَ
      [], // أُخرىٰ
      [], // وَإِن
      [], // تَدعُ
      [], // مُثقَلَةٌ
      [], // إِلىٰ
      ["حِملها : ذوبها التي أثقلتها"], // حِملِها
      [], // لا
      [], // يُحمَل
      [], // مِنهُ
      [], // شَىءٌ
      [], // وَلَو
      [], // كانَ
      [], // ذا
      [], // قُربىٰ
      [], // إِنَّما
      [], // تُنذِرُ
      [], // الَّذينَ
      [], // يَخشَونَ
      [], // رَبَّهُم
      [], // بِالغَيبِ
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // وَمَن
      ["تزكّى : تطهّر من الكفر و المعاصي"], // تَزَكّىٰ
      [], // فَإِنَّما
      [], // يَتَزَكّىٰ
      [], // لِنَفسِهِ
      [], // وَإِلَى
      [], // اللَّهِ
      [] // المَصيرُ
    ],
    [ // آية 19
      [], // وَما
      [], // يَستَوِى
      [], // الأَعمىٰ
      [] // وَالبَصيرُ
    ],
    [ // آية 20
      [], // وَلَا
      [], // الظُّلُمـٰتُ
      [], // وَلَا
      [] // النّورُ
    ],
    [ // آية 21
      [], // وَلَا
      [], // الظِّلُّ
      [], // وَلَا
      ["الحَرُور : شدّة الحرّ ليلا كالسّموم"] // الحَرورُ
    ],
    [ // آية 22
      [], // وَما
      [], // يَستَوِى
      [], // الأَحياءُ
      [], // وَلَا
      [], // الأَموٰتُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُسمِعُ
      [], // مَن
      [], // يَشاءُ
      [], // وَما
      [], // أَنتَ
      [], // بِمُسمِعٍ
      [], // مَن
      [], // فِى
      [] // القُبورِ
    ],
    [ // آية 23
      [], // إِن
      [], // أَنتَ
      [], // إِلّا
      [] // نَذيرٌ
    ],
    [ // آية 24
      [], // إِنّا
      [], // أَرسَلنـٰكَ
      [], // بِالحَقِّ
      [], // بَشيرًا
      [], // وَنَذيرًا
      [], // وَإِن
      [], // مِن
      [], // أُمَّةٍ
      [], // إِلّا
      [], // خَلا
      [], // فيها
      [] // نَذيرٌ
    ],
    [ // آية 25
      [], // وَإِن
      [], // يُكَذِّبوكَ
      [], // فَقَد
      [], // كَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // جاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // وَبِالزُّبُرِ
      [], // وَبِالكِتـٰبِ
      [] // المُنيرِ
    ],
    [ // آية 26
      [], // ثُمَّ
      [], // أَخَذتُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فَكَيفَ
      [], // كانَ
      [] // نَكيرِ
    ],
    [ // آية 27
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَخرَجنا
      [], // بِهِ
      [], // ثَمَرٰتٍ
      [], // مُختَلِفًا
      [], // أَلوٰنُها
      [], // وَمِنَ
      [], // الجِبالِ
      [], // جُدَدٌ
      [], // بيضٌ
      [], // وَحُمرٌ
      [], // مُختَلِفٌ
      [], // أَلوٰنُها
      [], // وَغَرابيبُ
      [] // سودٌ
    ],
    [ // آية 28
      [], // وَمِنَ
      [], // النّاسِ
      [], // وَالدَّوابِّ
      [], // وَالأَنعـٰمِ
      [], // مُختَلِفٌ
      [], // أَلوٰنُهُ
      [], // كَذٰلِكَ
      [], // إِنَّما
      [], // يَخشَى
      [], // اللَّهَ
      [], // مِن
      [], // عِبادِهِ
      [], // العُلَمـٰؤُا۟
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [] // غَفورٌ
    ],
    [ // آية 29
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَتلونَ
      [], // كِتـٰبَ
      [], // اللَّهِ
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // وَأَنفَقوا
      [], // مِمّا
      [], // رَزَقنـٰهُم
      [], // سِرًّا
      [], // وَعَلانِيَةً
      [], // يَرجونَ
      [], // تِجـٰرَةً
      ["لن تبور : لم تكسُدَ و تفسُدَ  ، أوَ لن تهلِك"], // لَن
      ["لن تبور : لم تكسُدَ و تفسُدَ  ، أوَ لن تهلِك"] // تَبورَ
    ],
    [ // آية 30
      [], // لِيُوَفِّيَهُم
      [], // أُجورَهُم
      [], // وَيَزيدَهُم
      [], // مِن
      [], // فَضلِهِ
      [], // إِنَّهُ
      [], // غَفورٌ
      [] // شَكورٌ
    ],
    [ // آية 31
      [], // وَالَّذى
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // هُوَ
      [], // الحَقُّ
      [], // مُصَدِّقًا
      [], // لِما
      [], // بَينَ
      [], // يَدَيهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِعِبادِهِ
      [], // لَخَبيرٌ
      [] // بَصيرٌ
    ],
    [ // آية 32
      [], // ثُمَّ
      [], // أَورَثنَا
      [], // الكِتـٰبَ
      [], // الَّذينَ
      [], // اصطَفَينا
      [], // مِن
      [], // عِبادِنا
      [], // فَمِنهُم
      [], // ظالِمٌ
      [], // لِنَفسِهِ
      [], // وَمِنهُم
      ["مقتصد : استوت حسناته و سيّـئاته"], // مُقتَصِدٌ
      [], // وَمِنهُم
      [], // سابِقٌ
      [], // بِالخَيرٰتِ
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَضلُ
      [] // الكَبيرُ
    ],
    [ // آية 33
      [], // جَنّـٰتُ
      [], // عَدنٍ
      [], // يَدخُلونَها
      [], // يُحَلَّونَ
      [], // فيها
      [], // مِن
      [], // أَساوِرَ
      [], // مِن
      [], // ذَهَبٍ
      [], // وَلُؤلُؤًا
      [], // وَلِباسُهُم
      [], // فيها
      [] // حَريرٌ
    ],
    [ // آية 34
      [], // وَقالُوا
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // أَذهَبَ
      [], // عَنَّا
      ["الحَزن : كلّ ما يُحزن و يَغمّ"], // الحَزَنَ
      [], // إِنَّ
      [], // رَبَّنا
      [], // لَغَفورٌ
      [] // شَكورٌ
    ],
    [ // آية 35
      [], // الَّذى
      [], // أَحَلَّنا
      ["دار المُقامة : دار الإقامة الدّائمة (الجنّة)"], // دارَ
      ["دار المُقامة : دار الإقامة الدّائمة (الجنّة)"], // المُقامَةِ
      [], // مِن
      [], // فَضلِهِ
      [], // لا
      [], // يَمَسُّنا
      [], // فيها
      ["نَصَبٌ : تعب و مشقّة"], // نَصَبٌ
      [], // وَلا
      [], // يَمَسُّنا
      [], // فيها
      ["لغوبٌ : إعياء من التعب و فتور"] // لُغوبٌ
    ],
    [ // آية 36
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // لَهُم
      [], // نارُ
      [], // جَهَنَّمَ
      [], // لا
      [], // يُقضىٰ
      [], // عَلَيهِم
      [], // فَيَموتوا
      [], // وَلا
      [], // يُخَفَّفُ
      [], // عَنهُم
      [], // مِن
      [], // عَذابِها
      [], // كَذٰلِكَ
      [], // نَجزى
      [], // كُلَّ
      [] // كَفورٍ
    ],
    [ // آية 37
      [], // وَهُم
      [], // يَصطَرِخونَ
      [], // فيها
      [], // رَبَّنا
      [], // أَخرِجنا
      [], // نَعمَل
      [], // صـٰلِحًا
      [], // غَيرَ
      [], // الَّذى
      [], // كُنّا
      [], // نَعمَلُ
      [], // أَوَلَم
      [], // نُعَمِّركُم
      [], // ما
      [], // يَتَذَكَّرُ
      [], // فيهِ
      [], // مَن
      [], // تَذَكَّرَ
      [], // وَجاءَكُمُ
      [], // النَّذيرُ
      [], // فَذوقوا
      [], // فَما
      [], // لِلظّـٰلِمينَ
      [], // مِن
      [] // نَصيرٍ
    ],
    [ // آية 38
      [], // إِنَّ
      [], // اللَّهَ
      [], // عـٰلِمُ
      [], // غَيبِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 39
      [], // هُوَ
      [], // الَّذى
      [], // جَعَلَكُم
      [], // خَلـٰئِفَ
      [], // فِى
      [], // الأَرضِ
      [], // فَمَن
      [], // كَفَرَ
      [], // فَعَلَيهِ
      [], // كُفرُهُ
      [], // وَلا
      [], // يَزيدُ
      [], // الكـٰفِرينَ
      [], // كُفرُهُم
      [], // عِندَ
      [], // رَبِّهِم
      [], // إِلّا
      ["مقتا : أشدّ البغض و الغضب و الاحتقار"], // مَقتًا
      [], // وَلا
      [], // يَزيدُ
      [], // الكـٰفِرينَ
      [], // كُفرُهُم
      [], // إِلّا
      [] // خَسارًا
    ],
    [ // آية 40
      [], // قُل
      [], // أَرَءَيتُم
      [], // شُرَكاءَكُمُ
      [], // الَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَرونى
      [], // ماذا
      [], // خَلَقوا
      [], // مِنَ
      [], // الأَرضِ
      [], // أَم
      [], // لَهُم
      [], // شِركٌ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // أَم
      [], // ءاتَينـٰهُم
      [], // كِتـٰبًا
      [], // فَهُم
      [], // عَلىٰ
      [], // بَيِّنَتٍ
      [], // مِنهُ
      [], // بَل
      [], // إِن
      [], // يَعِدُ
      [], // الظّـٰلِمونَ
      [], // بَعضُهُم
      [], // بَعضًا
      [], // إِلّا
      ["غرورا : باطلا . أو خداعا"] // غُرورًا
    ],
    [ // آية 41
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُمسِكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // أَن
      [], // تَزولا
      [], // وَلَئِن
      [], // زالَتا
      [], // إِن
      [], // أَمسَكَهُما
      [], // مِن
      [], // أَحَدٍ
      [], // مِن
      [], // بَعدِهِ
      [], // إِنَّهُ
      [], // كانَ
      [], // حَليمًا
      [] // غَفورًا
    ],
    [ // آية 42
      [], // وَأَقسَموا
      [], // بِاللَّهِ
      [], // جَهدَ
      [], // أَيمـٰنِهِم
      [], // لَئِن
      [], // جاءَهُم
      [], // نَذيرٌ
      [], // لَيَكونُنَّ
      [], // أَهدىٰ
      [], // مِن
      [], // إِحدَى
      [], // الأُمَمِ
      [], // فَلَمّا
      [], // جاءَهُم
      [], // نَذيرٌ
      [], // ما
      [], // زادَهُم
      [], // إِلّا
      ["نفورا : تباعدا عن الحقّ و فرارا منه"] // نُفورًا
    ],
    [ // آية 43
      [], // استِكبارًا
      [], // فِى
      [], // الأَرضِ
      [], // وَمَكرَ
      [], // السَّيِّئِ
      [], // وَلا
      [], // يَحيقُ
      [], // المَكرُ
      [], // السَّيِّئُ
      [], // إِلّا
      [], // بِأَهلِهِ
      ["فهل ينظرون : فما ينتظرون"], // فَهَل
      ["فهل ينظرون : فما ينتظرون"], // يَنظُرونَ
      [], // إِلّا
      [], // سُنَّتَ
      [], // الأَوَّلينَ
      [], // فَلَن
      [], // تَجِدَ
      [], // لِسُنَّتِ
      [], // اللَّهِ
      [], // تَبديلًا
      [], // وَلَن
      [], // تَجِدَ
      [], // لِسُنَّتِ
      [], // اللَّهِ
      [] // تَحويلًا
    ],
    [ // آية 44
      [], // أَوَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَكانوا
      [], // أَشَدَّ
      [], // مِنهُم
      [], // قُوَّةً
      [], // وَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيُعجِزَهُ
      [], // مِن
      [], // شَىءٍ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَلا
      [], // فِى
      [], // الأَرضِ
      [], // إِنَّهُ
      [], // كانَ
      [], // عَليمًا
      [] // قَديرًا
    ],
    [ // آية 45
      [], // وَلَو
      [], // يُؤاخِذُ
      [], // اللَّهُ
      [], // النّاسَ
      [], // بِما
      [], // كَسَبوا
      [], // ما
      [], // تَرَكَ
      [], // عَلىٰ
      [], // ظَهرِها
      [], // مِن
      [], // دابَّةٍ
      [], // وَلـٰكِن
      [], // يُؤَخِّرُهُم
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // فَإِذا
      [], // جاءَ
      [], // أَجَلُهُم
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِعِبادِهِ
      [] // بَصيرًا
    ]
  ]
];

export default meanings;