const meanings = [
  [ // سورة 36: يس
[ // آية 1
      [] // يس
    ],
    [ // آية 2
      [], // وَالقُرءانِ
      [] // الحَكيمِ
    ],
    [ // آية 3
      [], // إِنَّكَ
      [], // لَمِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 4
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 5
      [], // تَنزيلَ
      [], // العَزيزِ
      [] // الرَّحيمِ
    ],
    [ // آية 6
      [], // لِتُنذِرَ
      [], // قَومًا
      [], // ما
      [], // أُنذِرَ
      [], // ءاباؤُهُم
      [], // فَهُم
      [] // غـٰفِلونَ
    ],
    [ // آية 7
      ["لقد حقّ القول : و اللهِ لقد ثبت ووجب العقاب"], // لَقَد
      ["لقد حقّ القول : و اللهِ لقد ثبت ووجب العقاب"], // حَقَّ
      ["لقد حقّ القول : و اللهِ لقد ثبت ووجب العقاب"], // القَولُ
      [], // عَلىٰ
      [], // أَكثَرِهِم
      [], // فَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 8
      [], // إِنّا
      [], // جَعَلنا
      [], // فى
      [], // أَعنـٰقِهِم
      [], // أَغلـٰلًا
      [], // فَهِىَ
      [], // إِلَى
      [], // الأَذقانِ
      ["فهم مقمحون : رافعوا الرّءوس غاضّوا الأبصار"], // فَهُم
      ["فهم مقمحون : رافعوا الرّءوس غاضّوا الأبصار"] // مُقمَحونَ
    ],
    [ // آية 9
      [], // وَجَعَلنا
      [], // مِن
      [], // بَينِ
      [], // أَيديهِم
      ["سدّا : حاجزا و مانِعا"], // سَدًّا
      [], // وَمِن
      [], // خَلفِهِم
      [], // سَدًّا
      [], // فَأَغشَينـٰهُم
      [], // فَهُم
      [], // لا
      [] // يُبصِرونَ
    ],
    [ // آية 10
      [], // وَسَواءٌ
      [], // عَلَيهِم
      [], // ءَأَنذَرتَهُم
      [], // أَم
      [], // لَم
      [], // تُنذِرهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 11
      [], // إِنَّما
      [], // تُنذِرُ
      [], // مَنِ
      [], // اتَّبَعَ
      [], // الذِّكرَ
      [], // وَخَشِىَ
      [], // الرَّحمـٰنَ
      [], // بِالغَيبِ
      [], // فَبَشِّرهُ
      [], // بِمَغفِرَةٍ
      [], // وَأَجرٍ
      [] // كَريمٍ
    ],
    [ // آية 12
      [], // إِنّا
      [], // نَحنُ
      [], // نُحىِ
      [], // المَوتىٰ
      [], // وَنَكتُبُ
      [], // ما
      [], // قَدَّموا
      [], // وَءاثـٰرَهُم
      [], // وَكُلَّ
      [], // شَىءٍ
      [], // أَحصَينـٰهُ
      [], // فى
      ["إمام مبين : أصل بيّن (اللوح المحفوظ)"], // إِمامٍ
      ["إمام مبين : أصل بيّن (اللوح المحفوظ)"] // مُبينٍ
    ],
    [ // آية 13
      [], // وَاضرِب
      [], // لَهُم
      [], // مَثَلًا
      [], // أَصحـٰبَ
      ["القرية : أنطاكية"], // القَريَةِ
      [], // إِذ
      [], // جاءَهَا
      [] // المُرسَلونَ
    ],
    [ // آية 14
      [], // إِذ
      [], // أَرسَلنا
      [], // إِلَيهِمُ
      [], // اثنَينِ
      [], // فَكَذَّبوهُما
      ["فعززنا بثالث : فقوّيناهما و شددناهما به"], // فَعَزَّزنا
      ["فعززنا بثالث : فقوّيناهما و شددناهما به"], // بِثالِثٍ
      [], // فَقالوا
      [], // إِنّا
      [], // إِلَيكُم
      [] // مُرسَلونَ
    ],
    [ // آية 15
      [], // قالوا
      [], // ما
      [], // أَنتُم
      [], // إِلّا
      [], // بَشَرٌ
      [], // مِثلُنا
      [], // وَما
      [], // أَنزَلَ
      [], // الرَّحمـٰنُ
      [], // مِن
      [], // شَىءٍ
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [] // تَكذِبونَ
    ],
    [ // آية 16
      [], // قالوا
      [], // رَبُّنا
      [], // يَعلَمُ
      [], // إِنّا
      [], // إِلَيكُم
      [] // لَمُرسَلونَ
    ],
    [ // آية 17
      [], // وَما
      [], // عَلَينا
      [], // إِلَّا
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 18
      [], // قالوا
      [], // إِنّا
      ["تطيّرنا بكم : تشاءمنا بكم"], // تَطَيَّرنا
      ["تطيّرنا بكم : تشاءمنا بكم"], // بِكُم
      [], // لَئِن
      [], // لَم
      [], // تَنتَهوا
      [], // لَنَرجُمَنَّكُم
      [], // وَلَيَمَسَّنَّكُم
      [], // مِنّا
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 19
      [], // قالوا
      [], // طـٰئِرُكُم
      [], // مَعَكُم
      [], // أَئِن
      [], // ذُكِّرتُم
      [], // بَل
      [], // أَنتُم
      [], // قَومٌ
      [] // مُسرِفونَ
    ],
    [ // آية 20
      [], // وَجاءَ
      [], // مِن
      [], // أَقصَا
      [], // المَدينَةِ
      [], // رَجُلٌ
      ["يسعى : يُسرع في مشيه لنصح قومه"], // يَسعىٰ
      [], // قالَ
      [], // يـٰقَومِ
      [], // اتَّبِعُوا
      [] // المُرسَلينَ
    ],
    [ // آية 21
      [], // اتَّبِعوا
      [], // مَن
      [], // لا
      [], // يَسـَٔلُكُم
      [], // أَجرًا
      [], // وَهُم
      [] // مُهتَدونَ
    ],
    [ // آية 22
      [], // وَما
      [], // لِىَ
      [], // لا
      [], // أَعبُدُ
      [], // الَّذى
      [], // فَطَرَنى
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 23
      [], // ءَأَتَّخِذُ
      [], // مِن
      [], // دونِهِ
      [], // ءالِهَةً
      [], // إِن
      [], // يُرِدنِ
      [], // الرَّحمـٰنُ
      [], // بِضُرٍّ
      [], // لا
      [], // تُغنِ
      [], // عَنّى
      [], // شَفـٰعَتُهُم
      [], // شَيـًٔا
      [], // وَلا
      [] // يُنقِذونِ
    ],
    [ // آية 24
      [], // إِنّى
      [], // إِذًا
      [], // لَفى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 25
      [], // إِنّى
      [], // ءامَنتُ
      [], // بِرَبِّكُم
      [] // فَاسمَعونِ
    ],
    [ // آية 26
      [], // قيلَ
      [], // ادخُلِ
      [], // الجَنَّةَ
      [], // قالَ
      [], // يـٰلَيتَ
      [], // قَومى
      [] // يَعلَمونَ
    ],
    [ // آية 27
      [], // بِما
      [], // غَفَرَ
      [], // لى
      [], // رَبّى
      [], // وَجَعَلَنى
      [], // مِنَ
      [] // المُكرَمينَ
    ],
    [ // آية 28
      [], // وَما
      [], // أَنزَلنا
      [], // عَلىٰ
      [], // قَومِهِ
      [], // مِن
      [], // بَعدِهِ
      [], // مِن
      [], // جُندٍ
      [], // مِنَ
      [], // السَّماءِ
      [], // وَما
      [], // كُنّا
      [] // مُنزِلينَ
    ],
    [ // آية 29
      [], // إِن
      [], // كانَت
      [], // إِلّا
      [], // صَيحَةً
      [], // وٰحِدَةً
      [], // فَإِذا
      [], // هُم
      [] // خـٰمِدونَ
    ],
    [ // آية 30
      [], // يـٰحَسرَةً
      [], // عَلَى
      [], // العِبادِ
      [], // ما
      [], // يَأتيهِم
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 31
      [], // أَلَم
      [], // يَرَوا
      ["كم أهلكنا : كثيرا أهلكنا"], // كَم
      ["كم أهلكنا : كثيرا أهلكنا"], // أَهلَكنا
      [], // قَبلَهُم
      [], // مِنَ
      ["القرون : الأمم"], // القُرونِ
      [], // أَنَّهُم
      [], // إِلَيهِم
      [], // لا
      [] // يَرجِعونَ
    ],
    [ // آية 32
      [], // وَإِن
      [], // كُلٌّ
      ["لمّا جميع : إلا مجموعون"], // لَمّا
      ["لمّا جميع : إلا مجموعون"], // جَميعٌ
      [], // لَدَينا
      ["مُحضرون : نحضرهم للحساب و الجزاء"] // مُحضَرونَ
    ],
    [ // آية 33
      [], // وَءايَةٌ
      [], // لَهُمُ
      [], // الأَرضُ
      [], // المَيتَةُ
      [], // أَحيَينـٰها
      [], // وَأَخرَجنا
      [], // مِنها
      [], // حَبًّا
      [], // فَمِنهُ
      [] // يَأكُلونَ
    ],
    [ // آية 34
      [], // وَجَعَلنا
      [], // فيها
      [], // جَنّـٰتٍ
      [], // مِن
      [], // نَخيلٍ
      [], // وَأَعنـٰبٍ
      [], // وَفَجَّرنا
      [], // فيها
      [], // مِنَ
      [] // العُيونِ
    ],
    [ // آية 35
      [], // لِيَأكُلوا
      [], // مِن
      [], // ثَمَرِهِ
      [], // وَما
      [], // عَمِلَتهُ
      [], // أَيديهِم
      [], // أَفَلا
      [] // يَشكُرونَ
    ],
    [ // آية 36
      [], // سُبحـٰنَ
      [], // الَّذى
      [], // خَلَقَ
      [], // الأَزوٰجَ
      [], // كُلَّها
      [], // مِمّا
      [], // تُنبِتُ
      [], // الأَرضُ
      [], // وَمِن
      [], // أَنفُسِهِم
      [], // وَمِمّا
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 37
      [], // وَءايَةٌ
      [], // لَهُمُ
      [], // الَّيلُ
      ["نسلخ منه النّهار : ننزع من مكانه الضّوْء"], // نَسلَخُ
      ["نسلخ منه النّهار : ننزع من مكانه الضّوْء"], // مِنهُ
      ["نسلخ منه النّهار : ننزع من مكانه الضّوْء"], // النَّهارَ
      [], // فَإِذا
      [], // هُم
      [] // مُظلِمونَ
    ],
    [ // آية 38
      [], // وَالشَّمسُ
      [], // تَجرى
      [], // لِمُستَقَرٍّ
      [], // لَها
      [], // ذٰلِكَ
      [], // تَقديرُ
      [], // العَزيزِ
      [] // العَليمِ
    ],
    [ // آية 39
      [], // وَالقَمَرَ
      [], // قَدَّرنـٰهُ
      [], // مَنازِلَ
      [], // حَتّىٰ
      [], // عادَ
      ["كالعرجون القديم : كعود  عِـذ ْق النّخلة العتيق"], // كَالعُرجونِ
      ["كالعرجون القديم : كعود  عِـذ ْق النّخلة العتيق"] // القَديمِ
    ],
    [ // آية 40
      [], // لَا
      [], // الشَّمسُ
      [], // يَنبَغى
      [], // لَها
      [], // أَن
      [], // تُدرِكَ
      [], // القَمَرَ
      [], // وَلَا
      [], // الَّيلُ
      ["سابق النّهار : سابق آية النهار (الشمس)"], // سابِقُ
      ["سابق النّهار : سابق آية النهار (الشمس)"], // النَّهارِ
      [], // وَكُلٌّ
      [], // فى
      [], // فَلَكٍ
      ["يسبحون : يسيرون بانبساط أو يدورون"] // يَسبَحونَ
    ],
    [ // آية 41
      [], // وَءايَةٌ
      [], // لَهُم
      [], // أَنّا
      [], // حَمَلنا
      ["ذرّيّتهم : أولادهم و ضعفاءَهم"], // ذُرِّيَّتَهُم
      [], // فِى
      [], // الفُلكِ
      ["المشحون : المملوءِ المُوقر"] // المَشحونِ
    ],
    [ // آية 42
      [], // وَخَلَقنا
      [], // لَهُم
      [], // مِن
      [], // مِثلِهِ
      [], // ما
      [] // يَركَبونَ
    ],
    [ // آية 43
      [], // وَإِن
      [], // نَشَأ
      [], // نُغرِقهُم
      ["فلا صريخ لهم : فلا مغيث لهم من الغَرَق"], // فَلا
      ["فلا صريخ لهم : فلا مغيث لهم من الغَرَق"], // صَريخَ
      ["فلا صريخ لهم : فلا مغيث لهم من الغَرَق"], // لَهُم
      [], // وَلا
      [], // هُم
      [] // يُنقَذونَ
    ],
    [ // آية 44
      [], // إِلّا
      [], // رَحمَةً
      [], // مِنّا
      [], // وَمَتـٰعًا
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 45
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُمُ
      [], // اتَّقوا
      [], // ما
      [], // بَينَ
      [], // أَيديكُم
      [], // وَما
      [], // خَلفَكُم
      [], // لَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 46
      [], // وَما
      [], // تَأتيهِم
      [], // مِن
      [], // ءايَةٍ
      [], // مِن
      [], // ءايـٰتِ
      [], // رَبِّهِم
      [], // إِلّا
      [], // كانوا
      [], // عَنها
      [] // مُعرِضينَ
    ],
    [ // آية 47
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُم
      [], // أَنفِقوا
      [], // مِمّا
      [], // رَزَقَكُمُ
      [], // اللَّهُ
      [], // قالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // أَنُطعِمُ
      [], // مَن
      [], // لَو
      [], // يَشاءُ
      [], // اللَّهُ
      [], // أَطعَمَهُ
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 48
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 49
      [], // ما
      [], // يَنظُرونَ
      [], // إِلّا
      [], // صَيحَةً
      [], // وٰحِدَةً
      [], // تَأخُذُهُم
      [], // وَهُم
      [] // يَخِصِّمونَ
    ],
    [ // آية 50
      [], // فَلا
      [], // يَستَطيعونَ
      [], // تَوصِيَةً
      [], // وَلا
      [], // إِلىٰ
      [], // أَهلِهِم
      [] // يَرجِعونَ
    ],
    [ // آية 51
      [], // وَنُفِخَ
      [], // فِى
      [], // الصّورِ
      [], // فَإِذا
      [], // هُم
      [], // مِنَ
      ["الأجداث : القبور . ."], // الأَجداثِ
      [], // إِلىٰ
      [], // رَبِّهِم
      ["ينسلون : يُسرعون في الخروج"] // يَنسِلونَ
    ],
    [ // آية 52
      [], // قالوا
      [], // يـٰوَيلَنا
      [], // مَن
      [], // بَعَثَنا
      [], // مِن
      [], // مَرقَدِنا
      [], // هـٰذا
      [], // ما
      [], // وَعَدَ
      [], // الرَّحمـٰنُ
      [], // وَصَدَقَ
      [] // المُرسَلونَ
    ],
    [ // آية 53
      [], // إِن
      [], // كانَت
      [], // إِلّا
      [], // صَيحَةً
      [], // وٰحِدَةً
      [], // فَإِذا
      [], // هُم
      [], // جَميعٌ
      [], // لَدَينا
      ["مُحضرون : نحضِرُهم للحساب و الجزاء"] // مُحضَرونَ
    ],
    [ // آية 54
      [], // فَاليَومَ
      [], // لا
      [], // تُظلَمُ
      [], // نَفسٌ
      [], // شَيـًٔا
      [], // وَلا
      [], // تُجزَونَ
      [], // إِلّا
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 55
      [], // إِنَّ
      [], // أَصحـٰبَ
      [], // الجَنَّةِ
      [], // اليَومَ
      [], // فى
      ["شُغُلٍ : نعيم عظيم يُلهيهمْ عمّا سواه"], // شُغُلٍ
      [] // فـٰكِهونَ
    ],
    [ // آية 56
      [], // هُم
      [], // وَأَزوٰجُهُم
      [], // فى
      [], // ظِلـٰلٍ
      [], // عَلَى
      ["الأرائك : السّرر في الحِجال (جمع حجلة محركة- بيت يزين بالثياب و الأسرّة و الستور)"], // الأَرائِكِ
      [] // مُتَّكِـٔونَ
    ],
    [ // آية 57
      [], // لَهُم
      [], // فيها
      [], // فـٰكِهَةٌ
      [], // وَلَهُم
      [], // ما
      [] // يَدَّعونَ
    ],
    [ // آية 58
      [], // سَلـٰمٌ
      [], // قَولًا
      [], // مِن
      [], // رَبٍّ
      [] // رَحيمٍ
    ],
    [ // آية 59
      [], // وَامتـٰزُوا
      [], // اليَومَ
      [], // أَيُّهَا
      [] // المُجرِمونَ
    ],
    [ // آية 60
      [], // أَلَم
      [], // أَعهَد
      [], // إِلَيكُم
      [], // يـٰبَنى
      [], // ءادَمَ
      [], // أَن
      [], // لا
      [], // تَعبُدُوا
      [], // الشَّيطـٰنَ
      [], // إِنَّهُ
      [], // لَكُم
      [], // عَدُوٌّ
      [] // مُبينٌ
    ],
    [ // آية 61
      [], // وَأَنِ
      [], // اعبُدونى
      [], // هـٰذا
      [], // صِرٰطٌ
      [] // مُستَقيمٌ
    ],
    [ // آية 62
      [], // وَلَقَد
      [], // أَضَلَّ
      [], // مِنكُم
      [], // جِبِلًّا
      [], // كَثيرًا
      [], // أَفَلَم
      [], // تَكونوا
      [] // تَعقِلونَ
    ],
    [ // آية 63
      [], // هـٰذِهِ
      [], // جَهَنَّمُ
      [], // الَّتى
      [], // كُنتُم
      [] // توعَدونَ
    ],
    [ // آية 64
      ["اصلوها : ادخلوها . أو قاسوا حرّها"], // اصلَوهَا
      [], // اليَومَ
      [], // بِما
      [], // كُنتُم
      [] // تَكفُرونَ
    ],
    [ // آية 65
      [], // اليَومَ
      [], // نَختِمُ
      [], // عَلىٰ
      [], // أَفوٰهِهِم
      [], // وَتُكَلِّمُنا
      [], // أَيديهِم
      [], // وَتَشهَدُ
      [], // أَرجُلُهُم
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 66
      [], // وَلَو
      [], // نَشاءُ
      ["لطمسنا : لصيّرناها ممسوحة لا يُرى لها شق"], // لَطَمَسنا
      [], // عَلىٰ
      [], // أَعيُنِهِم
      [], // فَاستَبَقُوا
      [], // الصِّرٰطَ
      [], // فَأَنّىٰ
      [] // يُبصِرونَ
    ],
    [ // آية 67
      [], // وَلَو
      [], // نَشاءُ
      [], // لَمَسَخنـٰهُم
      ["على مكانتهم : في مكان معاصيهمْ"], // عَلىٰ
      ["على مكانتهم : في مكان معاصيهمْ"], // مَكانَتِهِم
      [], // فَمَا
      [], // استَطـٰعوا
      [], // مُضِيًّا
      [], // وَلا
      [] // يَرجِعونَ
    ],
    [ // آية 68
      [], // وَمَن
      [], // نُعَمِّرهُ
      [], // نُنَكِّسهُ
      [], // فِى
      [], // الخَلقِ
      [], // أَفَلا
      [] // يَعقِلونَ
    ],
    [ // آية 69
      [], // وَما
      [], // عَلَّمنـٰهُ
      [], // الشِّعرَ
      [], // وَما
      [], // يَنبَغى
      [], // لَهُ
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرٌ
      [], // وَقُرءانٌ
      [] // مُبينٌ
    ],
    [ // آية 70
      [], // لِيُنذِرَ
      [], // مَن
      [], // كانَ
      [], // حَيًّا
      [], // وَيَحِقَّ
      [], // القَولُ
      [], // عَلَى
      [] // الكـٰفِرينَ
    ],
    [ // آية 71
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنّا
      [], // خَلَقنا
      [], // لَهُم
      [], // مِمّا
      [], // عَمِلَت
      [], // أَيدينا
      [], // أَنعـٰمًا
      [], // فَهُم
      [], // لَها
      [] // مـٰلِكونَ
    ],
    [ // آية 72
      [], // وَذَلَّلنـٰها
      [], // لَهُم
      [], // فَمِنها
      [], // رَكوبُهُم
      [], // وَمِنها
      [] // يَأكُلونَ
    ],
    [ // آية 73
      [], // وَلَهُم
      [], // فيها
      [], // مَنـٰفِعُ
      [], // وَمَشارِبُ
      [], // أَفَلا
      [] // يَشكُرونَ
    ],
    [ // آية 74
      [], // وَاتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ءالِهَةً
      [], // لَعَلَّهُم
      [] // يُنصَرونَ
    ],
    [ // آية 75
      [], // لا
      [], // يَستَطيعونَ
      [], // نَصرَهُم
      [], // وَهُم
      [], // لَهُم
      [], // جُندٌ
      [] // مُحضَرونَ
    ],
    [ // آية 76
      [], // فَلا
      [], // يَحزُنكَ
      [], // قَولُهُم
      [], // إِنّا
      [], // نَعلَمُ
      [], // ما
      [], // يُسِرّونَ
      [], // وَما
      [] // يُعلِنونَ
    ],
    [ // آية 77
      [], // أَوَلَم
      [], // يَرَ
      [], // الإِنسـٰنُ
      [], // أَنّا
      [], // خَلَقنـٰهُ
      [], // مِن
      [], // نُطفَةٍ
      [], // فَإِذا
      ["هو خصيم : مُبالغ في الخصومة بالباطل"], // هُوَ
      ["هو خصيم : مُبالغ في الخصومة بالباطل"], // خَصيمٌ
      [] // مُبينٌ
    ],
    [ // آية 78
      [], // وَضَرَبَ
      [], // لَنا
      [], // مَثَلًا
      [], // وَنَسِىَ
      [], // خَلقَهُ
      [], // قالَ
      [], // مَن
      [], // يُحىِ
      [], // العِظـٰمَ
      [], // وَهِىَ
      [] // رَميمٌ
    ],
    [ // آية 79
      [], // قُل
      [], // يُحييهَا
      [], // الَّذى
      [], // أَنشَأَها
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // وَهُوَ
      [], // بِكُلِّ
      [], // خَلقٍ
      [] // عَليمٌ
    ],
    [ // آية 80
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُم
      [], // مِنَ
      [], // الشَّجَرِ
      [], // الأَخضَرِ
      [], // نارًا
      [], // فَإِذا
      [], // أَنتُم
      [], // مِنهُ
      [] // توقِدونَ
    ],
    [ // آية 81
      [], // أَوَلَيسَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِقـٰدِرٍ
      [], // عَلىٰ
      [], // أَن
      [], // يَخلُقَ
      [], // مِثلَهُم
      [], // بَلىٰ
      [], // وَهُوَ
      [], // الخَلّـٰقُ
      [] // العَليمُ
    ],
    [ // آية 82
      [], // إِنَّما
      [], // أَمرُهُ
      [], // إِذا
      [], // أَرادَ
      [], // شَيـًٔا
      [], // أَن
      [], // يَقولَ
      [], // لَهُ
      [], // كُن
      [] // فَيَكونُ
    ],
    [ // آية 83
      [], // فَسُبحـٰنَ
      [], // الَّذى
      [], // بِيَدِهِ
      ["ملكوت : هو المُـلـْـك التـّـام"], // مَلَكوتُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ]
  ]
];

export default meanings;