const meanings = [
[ // آية 1
      [], // وَالصّـٰفّـٰتِ
      [] // صَفًّا
    ],
    [ // آية 2
      [], // فَالزّٰجِرٰتِ
      [] // زَجرًا
    ],
    [ // آية 3
      [], // فَالتّـٰلِيـٰتِ
      [] // ذِكرًا
    ],
    [ // آية 4
      [], // إِنَّ
      [], // إِلـٰهَكُم
      [] // لَوٰحِدٌ
    ],
    [ // آية 5
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // وَرَبُّ
      [] // المَشـٰرِقِ
    ],
    [ // آية 6
      [], // إِنّا
      [], // زَيَّنَّا
      [], // السَّماءَ
      [], // الدُّنيا
      [], // بِزينَةٍ
      [] // الكَواكِبِ
    ],
    [ // آية 7
      [], // وَحِفظًا
      [], // مِن
      [], // كُلِّ
      [], // شَيطـٰنٍ
      [] // مارِدٍ
    ],
    [ // آية 8
      [], // لا
      [], // يَسَّمَّعونَ
      [], // إِلَى
      [], // المَلَإِ
      [], // الأَعلىٰ
      [], // وَيُقذَفونَ
      [], // مِن
      [], // كُلِّ
      [] // جانِبٍ
    ],
    [ // آية 9
      ["دحورا : إبعادا و طردا"], // دُحورًا
      [], // وَلَهُم
      [], // عَذابٌ
      [] // واصِبٌ
    ],
    [ // آية 10
      [], // إِلّا
      [], // مَن
      [], // خَطِفَ
      [], // الخَطفَةَ
      [], // فَأَتبَعَهُ
      ["شهاب : ما يرى كالكوكب منقضّا من السّماء"], // شِهابٌ
      ["ثاقبٌ : مُضيءٌ . أو مُـحْـرقٌ"] // ثاقِبٌ
    ],
    [ // آية 11
      [], // فَاستَفتِهِم
      [], // أَهُم
      [], // أَشَدُّ
      [], // خَلقًا
      [], // أَم
      [], // مَن
      [], // خَلَقنا
      [], // إِنّا
      [], // خَلَقنـٰهُم
      [], // مِن
      ["طين لازب : ملتزق بَعْـضه ببَعض"], // طينٍ
      ["طين لازب : ملتزق بَعْـضه ببَعض"] // لازِبٍ
    ],
    [ // آية 12
      [], // بَل
      [], // عَجِبتَ
      [] // وَيَسخَرونَ
    ],
    [ // آية 13
      [], // وَإِذا
      [], // ذُكِّروا
      [], // لا
      [] // يَذكُرونَ
    ],
    [ // آية 14
      [], // وَإِذا
      [], // رَأَوا
      [], // ءايَةً
      [] // يَستَسخِرونَ
    ],
    [ // آية 15
      [], // وَقالوا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 16
      [], // أَءِذا
      [], // مِتنا
      [], // وَكُنّا
      [], // تُرابًا
      [], // وَعِظـٰمًا
      [], // أَءِنّا
      [] // لَمَبعوثونَ
    ],
    [ // آية 17
      [], // أَوَءاباؤُنَا
      [] // الأَوَّلونَ
    ],
    [ // آية 18
      [], // قُل
      [], // نَعَم
      [], // وَأَنتُم
      [] // دٰخِرونَ
    ],
    [ // آية 19
      [], // فَإِنَّما
      [], // هِىَ
      [], // زَجرَةٌ
      [], // وٰحِدَةٌ
      [], // فَإِذا
      [], // هُم
      [] // يَنظُرونَ
    ],
    [ // آية 20
      [], // وَقالوا
      [], // يـٰوَيلَنا
      [], // هـٰذا
      ["يوم الدّين : يوم الجَزاء و الحساب"], // يَومُ
      ["يوم الدّين : يوم الجَزاء و الحساب"] // الدّينِ
    ],
    [ // آية 21
      [], // هـٰذا
      [], // يَومُ
      [], // الفَصلِ
      [], // الَّذى
      [], // كُنتُم
      [], // بِهِ
      [] // تُكَذِّبونَ
    ],
    [ // آية 22
      [], // احشُرُوا
      [], // الَّذينَ
      [], // ظَلَموا
      [], // وَأَزوٰجَهُم
      [], // وَما
      [], // كانوا
      [] // يَعبُدونَ
    ],
    [ // آية 23
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // فَاهدوهُم
      [], // إِلىٰ
      [], // صِرٰطِ
      [] // الجَحيمِ
    ],
    [ // آية 24
      [], // وَقِفوهُم
      [], // إِنَّهُم
      [] // مَسـٔولونَ
    ],
    [ // آية 25
      [], // ما
      [], // لَكُم
      [], // لا
      [] // تَناصَرونَ
    ],
    [ // آية 26
      [], // بَل
      [], // هُمُ
      [], // اليَومَ
      [] // مُستَسلِمونَ
    ],
    [ // آية 27
      [], // وَأَقبَلَ
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [] // يَتَساءَلونَ
    ],
    [ // آية 28
      [], // قالوا
      [], // إِنَّكُم
      [], // كُنتُم
      [], // تَأتونَنا
      ["عن اليمين : من جهة الدّين فتصدّوننا عنه"], // عَنِ
      ["عن اليمين : من جهة الدّين فتصدّوننا عنه"] // اليَمينِ
    ],
    [ // آية 29
      [], // قالوا
      [], // بَل
      [], // لَم
      [], // تَكونوا
      [] // مُؤمِنينَ
    ],
    [ // آية 30
      [], // وَما
      [], // كانَ
      [], // لَنا
      [], // عَلَيكُم
      [], // مِن
      [], // سُلطـٰنٍ
      [], // بَل
      [], // كُنتُم
      [], // قَومًا
      [] // طـٰغينَ
    ],
    [ // آية 31
      ["فحقّ علينا : ثبت ووجب علينا"], // فَحَقَّ
      ["فحقّ علينا : ثبت ووجب علينا"], // عَلَينا
      [], // قَولُ
      [], // رَبِّنا
      [], // إِنّا
      [] // لَذائِقونَ
    ],
    [ // آية 32
      [], // فَأَغوَينـٰكُم
      [], // إِنّا
      [], // كُنّا
      [] // غـٰوينَ
    ],
    [ // آية 33
      [], // فَإِنَّهُم
      [], // يَومَئِذٍ
      [], // فِى
      [], // العَذابِ
      [] // مُشتَرِكونَ
    ],
    [ // آية 34
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَفعَلُ
      [] // بِالمُجرِمينَ
    ],
    [ // آية 35
      [], // إِنَّهُم
      [], // كانوا
      [], // إِذا
      [], // قيلَ
      [], // لَهُم
      [], // لا
      [], // إِلـٰهَ
      [], // إِلَّا
      [], // اللَّهُ
      [] // يَستَكبِرونَ
    ],
    [ // آية 36
      [], // وَيَقولونَ
      [], // أَئِنّا
      [], // لَتارِكوا
      [], // ءالِهَتِنا
      [], // لِشاعِرٍ
      [] // مَجنونٍ
    ],
    [ // آية 37
      [], // بَل
      [], // جاءَ
      [], // بِالحَقِّ
      [], // وَصَدَّقَ
      [] // المُرسَلينَ
    ],
    [ // آية 38
      [], // إِنَّكُم
      [], // لَذائِقُوا
      [], // العَذابِ
      [] // الأَليمِ
    ],
    [ // آية 39
      [], // وَما
      [], // تُجزَونَ
      [], // إِلّا
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 40
      [], // إِلّا
      [], // عِبادَ
      [], // اللَّهِ
      ["المخلصين : الذين أخلصهم الله لطاعته"] // المُخلَصينَ
    ],
    [ // آية 41
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // رِزقٌ
      [] // مَعلومٌ
    ],
    [ // آية 42
      [], // فَوٰكِهُ
      [], // وَهُم
      [] // مُكرَمونَ
    ],
    [ // آية 43
      [], // فى
      [], // جَنّـٰتِ
      [] // النَّعيمِ
    ],
    [ // آية 44
      [], // عَلىٰ
      [], // سُرُرٍ
      [] // مُتَقـٰبِلينَ
    ],
    [ // آية 45
      [], // يُطافُ
      [], // عَلَيهِم
      ["بكأسٍ : بخمر . أو بقدح فيه خمر"], // بِكَأسٍ
      ["مِنْ مَعين : من شراب نابع من العيون"], // مِن
      ["مِنْ مَعين : من شراب نابع من العيون"] // مَعينٍ
    ],
    [ // آية 46
      [], // بَيضاءَ
      [], // لَذَّةٍ
      [] // لِلشّـٰرِبينَ
    ],
    [ // آية 47
      [], // لا
      [], // فيها
      [], // غَولٌ
      [], // وَلا
      [], // هُم
      ["عنها يُنزفون : بسببها يسكرون و تُنزع عقولهم"], // عَنها
      ["عنها يُنزفون : بسببها يسكرون و تُنزع عقولهم"] // يُنزَفونَ
    ],
    [ // آية 48
      [], // وَعِندَهُم
      [], // قـٰصِرٰتُ
      [], // الطَّرفِ
      [] // عينٌ
    ],
    [ // آية 49
      [], // كَأَنَّهُنَّ
      ["بيْضٌ مكنونٌ : مصون مستور لم يُصبه غبار"], // بَيضٌ
      ["بيْضٌ مكنونٌ : مصون مستور لم يُصبه غبار"] // مَكنونٌ
    ],
    [ // آية 50
      [], // فَأَقبَلَ
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [] // يَتَساءَلونَ
    ],
    [ // آية 51
      [], // قالَ
      [], // قائِلٌ
      [], // مِنهُم
      [], // إِنّى
      [], // كانَ
      [], // لى
      [] // قَرينٌ
    ],
    [ // آية 52
      [], // يَقولُ
      [], // أَءِنَّكَ
      [], // لَمِنَ
      [] // المُصَدِّقينَ
    ],
    [ // آية 53
      [], // أَءِذا
      [], // مِتنا
      [], // وَكُنّا
      [], // تُرابًا
      [], // وَعِظـٰمًا
      [], // أَءِنّا
      ["لَمَدينون : لمجزيون و محاسبون ؟"] // لَمَدينونَ
    ],
    [ // آية 54
      [], // قالَ
      [], // هَل
      [], // أَنتُم
      [] // مُطَّلِعونَ
    ],
    [ // آية 55
      [], // فَاطَّلَعَ
      [], // فَرَءاهُ
      [], // فى
      ["سَوَاء الجحيم : وسطها"], // سَواءِ
      ["سَوَاء الجحيم : وسطها"] // الجَحيمِ
    ],
    [ // آية 56
      [], // قالَ
      [], // تَاللَّهِ
      ["إنْ كِدْت لترْدين : إنّك قاربت لتهلكني بالإغواء"], // إِن
      ["إنْ كِدْت لترْدين : إنّك قاربت لتهلكني بالإغواء"], // كِدتَ
      ["إنْ كِدْت لترْدين : إنّك قاربت لتهلكني بالإغواء"] // لَتُردينِ
    ],
    [ // آية 57
      [], // وَلَولا
      [], // نِعمَةُ
      [], // رَبّى
      [], // لَكُنتُ
      [], // مِنَ
      ["المُحضرين : للعذاب مثلك"] // المُحضَرينَ
    ],
    [ // آية 58
      [], // أَفَما
      [], // نَحنُ
      [] // بِمَيِّتينَ
    ],
    [ // آية 59
      [], // إِلّا
      [], // مَوتَتَنَا
      [], // الأولىٰ
      [], // وَما
      [], // نَحنُ
      [] // بِمُعَذَّبينَ
    ],
    [ // آية 60
      [], // إِنَّ
      [], // هـٰذا
      [], // لَهُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 61
      [], // لِمِثلِ
      [], // هـٰذا
      [], // فَليَعمَلِ
      [] // العـٰمِلونَ
    ],
    [ // آية 62
      [], // أَذٰلِكَ
      ["خيرٌ نُزُلا : ضيافة و تكرمة و لذة"], // خَيرٌ
      ["خيرٌ نُزُلا : ضيافة و تكرمة و لذة"], // نُزُلًا
      [], // أَم
      ["شجرة الزّقوم : شجرة من أخبث الشّجر بتهامة"], // شَجَرَةُ
      ["شجرة الزّقوم : شجرة من أخبث الشّجر بتهامة"] // الزَّقّومِ
    ],
    [ // آية 63
      [], // إِنّا
      [], // جَعَلنـٰها
      [], // فِتنَةً
      [] // لِلظّـٰلِمينَ
    ],
    [ // آية 64
      [], // إِنَّها
      [], // شَجَرَةٌ
      [], // تَخرُجُ
      [], // فى
      [], // أَصلِ
      [] // الجَحيمِ
    ],
    [ // آية 65
      [], // طَلعُها
      [], // كَأَنَّهُ
      [], // رُءوسُ
      [] // الشَّيـٰطينِ
    ],
    [ // آية 66
      [], // فَإِنَّهُم
      [], // لَـٔاكِلونَ
      [], // مِنها
      [], // فَمالِـٔونَ
      [], // مِنهَا
      [] // البُطونَ
    ],
    [ // آية 67
      [], // ثُمَّ
      [], // إِنَّ
      [], // لَهُم
      [], // عَلَيها
      ["لشَوبا : لخَـلـْـطاً و مزاجا"], // لَشَوبًا
      ["منْ حميم : ماءٍ بالغ غاية الحرارة"], // مِن
      ["منْ حميم : ماءٍ بالغ غاية الحرارة"] // حَميمٍ
    ],
    [ // آية 68
      [], // ثُمَّ
      [], // إِنَّ
      [], // مَرجِعَهُم
      [], // لَإِلَى
      [] // الجَحيمِ
    ],
    [ // آية 69
      [], // إِنَّهُم
      [], // أَلفَوا
      [], // ءاباءَهُم
      [] // ضالّينَ
    ],
    [ // آية 70
      [], // فَهُم
      [], // عَلىٰ
      [], // ءاثـٰرِهِم
      [] // يُهرَعونَ
    ],
    [ // آية 71
      [], // وَلَقَد
      [], // ضَلَّ
      [], // قَبلَهُم
      [], // أَكثَرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 72
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // فيهِم
      [] // مُنذِرينَ
    ],
    [ // آية 73
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُنذَرينَ
    ],
    [ // آية 74
      [], // إِلّا
      [], // عِبادَ
      [], // اللَّهِ
      [] // المُخلَصينَ
    ],
    [ // آية 75
      [], // وَلَقَد
      [], // نادىٰنا
      [], // نوحٌ
      [], // فَلَنِعمَ
      [] // المُجيبونَ
    ],
    [ // آية 76
      [], // وَنَجَّينـٰهُ
      [], // وَأَهلَهُ
      [], // مِنَ
      [], // الكَربِ
      [] // العَظيمِ
    ],
    [ // آية 77
      [], // وَجَعَلنا
      [], // ذُرِّيَّتَهُ
      [], // هُمُ
      [] // الباقينَ
    ],
    [ // آية 78
      [], // وَتَرَكنا
      [], // عَلَيهِ
      [], // فِى
      [] // الـٔاخِرينَ
    ],
    [ // آية 79
      [], // سَلـٰمٌ
      [], // عَلىٰ
      [], // نوحٍ
      [], // فِى
      [] // العـٰلَمينَ
    ],
    [ // آية 80
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 81
      [], // إِنَّهُ
      [], // مِن
      [], // عِبادِنَا
      [] // المُؤمِنينَ
    ],
    [ // آية 82
      [], // ثُمَّ
      [], // أَغرَقنَا
      [] // الـٔاخَرينَ
    ],
    [ // آية 83
      [], // وَإِنَّ
      [], // مِن
      [], // شيعَتِهِ
      [] // لَإِبرٰهيمَ
    ],
    [ // آية 84
      [], // إِذ
      [], // جاءَ
      [], // رَبَّهُ
      [], // بِقَلبٍ
      [] // سَليمٍ
    ],
    [ // آية 85
      [], // إِذ
      [], // قالَ
      [], // لِأَبيهِ
      [], // وَقَومِهِ
      [], // ماذا
      [] // تَعبُدونَ
    ],
    [ // آية 86
      [], // أَئِفكًا
      [], // ءالِهَةً
      [], // دونَ
      [], // اللَّهِ
      [] // تُريدونَ
    ],
    [ // آية 87
      [], // فَما
      [], // ظَنُّكُم
      [], // بِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 88
      [], // فَنَظَرَ
      [], // نَظرَةً
      [], // فِى
      [] // النُّجومِ
    ],
    [ // آية 89
      [], // فَقالَ
      [], // إِنّى
      [] // سَقيمٌ
    ],
    [ // آية 90
      [], // فَتَوَلَّوا
      [], // عَنهُ
      [] // مُدبِرينَ
    ],
    [ // آية 91
      [], // فَراغَ
      [], // إِلىٰ
      [], // ءالِهَتِهِم
      [], // فَقالَ
      [], // أَلا
      [] // تَأكُلونَ
    ],
    [ // آية 92
      [], // ما
      [], // لَكُم
      [], // لا
      [] // تَنطِقونَ
    ],
    [ // آية 93
      [], // فَراغَ
      [], // عَلَيهِم
      ["ضربا باليمين : يضربهم ضربا مُلتبسا بالقوّة"], // ضَربًا
      ["ضربا باليمين : يضربهم ضربا مُلتبسا بالقوّة"] // بِاليَمينِ
    ],
    [ // آية 94
      [], // فَأَقبَلوا
      [], // إِلَيهِ
      ["يزفّون : يسرعون في مشيهم"] // يَزِفّونَ
    ],
    [ // آية 95
      [], // قالَ
      [], // أَتَعبُدونَ
      [], // ما
      [] // تَنحِتونَ
    ],
    [ // آية 96
      [], // وَاللَّهُ
      [], // خَلَقَكُم
      [], // وَما
      [] // تَعمَلونَ
    ],
    [ // آية 97
      [], // قالُوا
      [], // ابنوا
      [], // لَهُ
      [], // بُنيـٰنًا
      [], // فَأَلقوهُ
      [], // فِى
      [] // الجَحيمِ
    ],
    [ // آية 98
      [], // فَأَرادوا
      [], // بِهِ
      [], // كَيدًا
      [], // فَجَعَلنـٰهُمُ
      [] // الأَسفَلينَ
    ],
    [ // آية 99
      [], // وَقالَ
      [], // إِنّى
      [], // ذاهِبٌ
      [], // إِلىٰ
      [], // رَبّى
      [] // سَيَهدينِ
    ],
    [ // آية 100
      [], // رَبِّ
      [], // هَب
      [], // لى
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 101
      [], // فَبَشَّرنـٰهُ
      [], // بِغُلـٰمٍ
      [] // حَليمٍ
    ],
    [ // آية 102
      [], // فَلَمّا
      [], // بَلَغَ
      [], // مَعَهُ
      [], // السَّعىَ
      [], // قالَ
      [], // يـٰبُنَىَّ
      [], // إِنّى
      [], // أَرىٰ
      [], // فِى
      [], // المَنامِ
      [], // أَنّى
      [], // أَذبَحُكَ
      [], // فَانظُر
      [], // ماذا
      [], // تَرىٰ
      [], // قالَ
      [], // يـٰأَبَتِ
      [], // افعَل
      [], // ما
      [], // تُؤمَرُ
      [], // سَتَجِدُنى
      [], // إِن
      [], // شاءَ
      [], // اللَّهُ
      [], // مِنَ
      [] // الصّـٰبِرينَ
    ],
    [ // آية 103
      [], // فَلَمّا
      ["أسلما : استسلما و انقادا لأمره تعالى"], // أَسلَما
      [], // وَتَلَّهُ
      [] // لِلجَبينِ
    ],
    [ // آية 104
      [], // وَنـٰدَينـٰهُ
      [], // أَن
      [] // يـٰإِبرٰهيمُ
    ],
    [ // آية 105
      [], // قَد
      [], // صَدَّقتَ
      [], // الرُّءيا
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 106
      [], // إِنَّ
      [], // هـٰذا
      [], // لَهُوَ
      [], // البَلـٰؤُا۟
      [] // المُبينُ
    ],
    [ // آية 107
      [], // وَفَدَينـٰهُ
      ["بذِبْح : بكبشٍ يُذبح"], // بِذِبحٍ
      [] // عَظيمٍ
    ],
    [ // آية 108
      [], // وَتَرَكنا
      [], // عَلَيهِ
      [], // فِى
      [] // الـٔاخِرينَ
    ],
    [ // آية 109
      [], // سَلـٰمٌ
      [], // عَلىٰ
      [] // إِبرٰهيمَ
    ],
    [ // آية 110
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 111
      [], // إِنَّهُ
      [], // مِن
      [], // عِبادِنَا
      [] // المُؤمِنينَ
    ],
    [ // آية 112
      [], // وَبَشَّرنـٰهُ
      [], // بِإِسحـٰقَ
      [], // نَبِيًّا
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 113
      [], // وَبـٰرَكنا
      [], // عَلَيهِ
      [], // وَعَلىٰ
      [], // إِسحـٰقَ
      [], // وَمِن
      [], // ذُرِّيَّتِهِما
      [], // مُحسِنٌ
      [], // وَظالِمٌ
      [], // لِنَفسِهِ
      [] // مُبينٌ
    ],
    [ // آية 114
      [], // وَلَقَد
      [], // مَنَنّا
      [], // عَلىٰ
      [], // موسىٰ
      [] // وَهـٰرونَ
    ],
    [ // آية 115
      [], // وَنَجَّينـٰهُما
      [], // وَقَومَهُما
      [], // مِنَ
      [], // الكَربِ
      [] // العَظيمِ
    ],
    [ // آية 116
      [], // وَنَصَرنـٰهُم
      [], // فَكانوا
      [], // هُمُ
      [] // الغـٰلِبينَ
    ],
    [ // آية 117
      [], // وَءاتَينـٰهُمَا
      [], // الكِتـٰبَ
      [] // المُستَبينَ
    ],
    [ // آية 118
      [], // وَهَدَينـٰهُمَا
      [], // الصِّرٰطَ
      [] // المُستَقيمَ
    ],
    [ // آية 119
      [], // وَتَرَكنا
      [], // عَلَيهِما
      [], // فِى
      [] // الـٔاخِرينَ
    ],
    [ // آية 120
      [], // سَلـٰمٌ
      [], // عَلىٰ
      [], // موسىٰ
      [] // وَهـٰرونَ
    ],
    [ // آية 121
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 122
      [], // إِنَّهُما
      [], // مِن
      [], // عِبادِنَا
      [] // المُؤمِنينَ
    ],
    [ // آية 123
      [], // وَإِنَّ
      [], // إِلياسَ
      [], // لَمِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 124
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // أَلا
      [] // تَتَّقونَ
    ],
    [ // آية 125
      ["أتدْعون بَعْلا : أتعبدون الصّـنم المسمّى بعلا"], // أَتَدعونَ
      ["أتدْعون بَعْلا : أتعبدون الصّـنم المسمّى بعلا"], // بَعلًا
      [], // وَتَذَرونَ
      [], // أَحسَنَ
      [] // الخـٰلِقينَ
    ],
    [ // آية 126
      [], // اللَّهَ
      [], // رَبَّكُم
      [], // وَرَبَّ
      [], // ءابائِكُمُ
      [] // الأَوَّلينَ
    ],
    [ // آية 127
      [], // فَكَذَّبوهُ
      [], // فَإِنَّهُم
      ["لمُحضرون : تُحضرهم الزّبانية في النّار"] // لَمُحضَرونَ
    ],
    [ // آية 128
      [], // إِلّا
      [], // عِبادَ
      [], // اللَّهِ
      [] // المُخلَصينَ
    ],
    [ // آية 129
      [], // وَتَرَكنا
      [], // عَلَيهِ
      [], // فِى
      [] // الـٔاخِرينَ
    ],
    [ // آية 130
      [], // سَلـٰمٌ
      [], // عَلىٰ
      [], // إِل
      [] // ياسينَ
    ],
    [ // آية 131
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 132
      [], // إِنَّهُ
      [], // مِن
      [], // عِبادِنَا
      [] // المُؤمِنينَ
    ],
    [ // آية 133
      [], // وَإِنَّ
      [], // لوطًا
      [], // لَمِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 134
      [], // إِذ
      [], // نَجَّينـٰهُ
      [], // وَأَهلَهُ
      [] // أَجمَعينَ
    ],
    [ // آية 135
      [], // إِلّا
      [], // عَجوزًا
      [], // فِى
      [] // الغـٰبِرينَ
    ],
    [ // آية 136
      [], // ثُمَّ
      [], // دَمَّرنَا
      [] // الـٔاخَرينَ
    ],
    [ // آية 137
      [], // وَإِنَّكُم
      [], // لَتَمُرّونَ
      [], // عَلَيهِم
      ["مُصبحين : داخلين في وقت الصّباح"] // مُصبِحينَ
    ],
    [ // آية 138
      [], // وَبِالَّيلِ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 139
      [], // وَإِنَّ
      [], // يونُسَ
      [], // لَمِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 140
      [], // إِذ
      ["أبق : هَرَبَ"], // أَبَقَ
      [], // إِلَى
      [], // الفُلكِ
      ["المشحون : المملوء"] // المَشحونِ
    ],
    [ // آية 141
      ["فَساهم : فقارع من في الفلك"], // فَساهَمَ
      [], // فَكانَ
      [], // مِنَ
      ["المدْحضين : المغلوبين بالقرعة"] // المُدحَضينَ
    ],
    [ // آية 142
      [], // فَالتَقَمَهُ
      [], // الحوتُ
      [], // وَهُوَ
      [] // مُليمٌ
    ],
    [ // آية 143
      [], // فَلَولا
      [], // أَنَّهُ
      [], // كانَ
      [], // مِنَ
      ["المسبّحين : الذاكرين الله كثيرا بالتسبيح"] // المُسَبِّحينَ
    ],
    [ // آية 144
      [], // لَلَبِثَ
      [], // فى
      [], // بَطنِهِ
      [], // إِلىٰ
      [], // يَومِ
      [] // يُبعَثونَ
    ],
    [ // آية 145
      [], // فَنَبَذنـٰهُ
      [], // بِالعَراءِ
      [], // وَهُوَ
      [] // سَقيمٌ
    ],
    [ // آية 146
      [], // وَأَنبَتنا
      [], // عَلَيهِ
      [], // شَجَرَةً
      [], // مِن
      ["يقطين : هو القرع المعروف و قيل غيره"] // يَقطينٍ
    ],
    [ // آية 147
      [], // وَأَرسَلنـٰهُ
      [], // إِلىٰ
      [], // مِا۟ئَةِ
      [], // أَلفٍ
      [], // أَو
      [] // يَزيدونَ
    ],
    [ // آية 148
      [], // فَـٔامَنوا
      [], // فَمَتَّعنـٰهُم
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 149
      [], // فَاستَفتِهِم
      [], // أَلِرَبِّكَ
      [], // البَناتُ
      [], // وَلَهُمُ
      [] // البَنونَ
    ],
    [ // آية 150
      [], // أَم
      [], // خَلَقنَا
      [], // المَلـٰئِكَةَ
      [], // إِنـٰثًا
      [], // وَهُم
      [] // شـٰهِدونَ
    ],
    [ // آية 151
      [], // أَلا
      [], // إِنَّهُم
      [], // مِن
      ["إفكهمْ : كذبهم على الله"], // إِفكِهِم
      [] // لَيَقولونَ
    ],
    [ // آية 152
      [], // وَلَدَ
      [], // اللَّهُ
      [], // وَإِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 153
      [], // أَصطَفَى
      [], // البَناتِ
      [], // عَلَى
      [] // البَنينَ
    ],
    [ // آية 154
      [], // ما
      [], // لَكُم
      [], // كَيفَ
      [] // تَحكُمونَ
    ],
    [ // آية 155
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 156
      [], // أَم
      [], // لَكُم
      [], // سُلطـٰنٌ
      [] // مُبينٌ
    ],
    [ // آية 157
      [], // فَأتوا
      [], // بِكِتـٰبِكُم
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 158
      [], // وَجَعَلوا
      [], // بَينَهُ
      [], // وَبَينَ
      [], // الجِنَّةِ
      [], // نَسَبًا
      [], // وَلَقَد
      [], // عَلِمَتِ
      [], // الجِنَّةُ
      ["إنّهم لمُحضرون : إنّ الكفار لمحضرون للنّار"], // إِنَّهُم
      ["إنّهم لمُحضرون : إنّ الكفار لمحضرون للنّار"] // لَمُحضَرونَ
    ],
    [ // آية 159
      [], // سُبحـٰنَ
      [], // اللَّهِ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 160
      [], // إِلّا
      [], // عِبادَ
      [], // اللَّهِ
      [] // المُخلَصينَ
    ],
    [ // آية 161
      [], // فَإِنَّكُم
      [], // وَما
      [] // تَعبُدونَ
    ],
    [ // آية 162
      [], // ما
      [], // أَنتُم
      [], // عَلَيهِ
      [] // بِفـٰتِنينَ
    ],
    [ // آية 163
      [], // إِلّا
      [], // مَن
      [], // هُوَ
      ["صَال الجحيم : داخلها أو مقاسٍ حرّها"], // صالِ
      ["صَال الجحيم : داخلها أو مقاسٍ حرّها"] // الجَحيمِ
    ],
    [ // آية 164
      [], // وَما
      [], // مِنّا
      [], // إِلّا
      [], // لَهُ
      [], // مَقامٌ
      [] // مَعلومٌ
    ],
    [ // آية 165
      [], // وَإِنّا
      [], // لَنَحنُ
      [] // الصّافّونَ
    ],
    [ // آية 166
      [], // وَإِنّا
      [], // لَنَحنُ
      ["المسبّحون : المنزّهون الله تعالى عمّا لا يليق بجلاله"] // المُسَبِّحونَ
    ],
    [ // آية 167
      [], // وَإِن
      [], // كانوا
      [] // لَيَقولونَ
    ],
    [ // آية 168
      [], // لَو
      [], // أَنَّ
      [], // عِندَنا
      [], // ذِكرًا
      [], // مِنَ
      [] // الأَوَّلينَ
    ],
    [ // آية 169
      [], // لَكُنّا
      [], // عِبادَ
      [], // اللَّهِ
      [] // المُخلَصينَ
    ],
    [ // آية 170
      [], // فَكَفَروا
      [], // بِهِ
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ],
    [ // آية 171
      [], // وَلَقَد
      [], // سَبَقَت
      [], // كَلِمَتُنا
      [], // لِعِبادِنَا
      [] // المُرسَلينَ
    ],
    [ // آية 172
      [], // إِنَّهُم
      [], // لَهُمُ
      [] // المَنصورونَ
    ],
    [ // آية 173
      [], // وَإِنَّ
      [], // جُندَنا
      [], // لَهُمُ
      [] // الغـٰلِبونَ
    ],
    [ // آية 174
      [], // فَتَوَلَّ
      [], // عَنهُم
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 175
      [], // وَأَبصِرهُم
      [], // فَسَوفَ
      [] // يُبصِرونَ
    ],
    [ // آية 176
      [], // أَفَبِعَذابِنا
      [] // يَستَعجِلونَ
    ],
    [ // آية 177
      [], // فَإِذا
      [], // نَزَلَ
      ["بساحَتهمْ : بفنائهم . و المراد : بهم"], // بِساحَتِهِم
      [], // فَساءَ
      [], // صَباحُ
      [] // المُنذَرينَ
    ],
    [ // آية 178
      [], // وَتَوَلَّ
      [], // عَنهُم
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 179
      [], // وَأَبصِر
      [], // فَسَوفَ
      [] // يُبصِرونَ
    ],
    [ // آية 180
      [], // سُبحـٰنَ
      [], // رَبِّكَ
      ["ربّ العزّة : الغلبة و القدرة و البطش"], // رَبِّ
      ["ربّ العزّة : الغلبة و القدرة و البطش"], // العِزَّةِ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 181
      [], // وَسَلـٰمٌ
      [], // عَلَى
      [] // المُرسَلينَ
    ],
    [ // آية 182
      [], // وَالحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ]
];

export default meanings;