const meanings = [
  [ // سورة 38: ص
[ // آية 1
      [], // ص
      [], // وَالقُرءانِ
      [], // ذِى
      [] // الذِّكرِ
    ],
    [ // آية 2
      [], // بَلِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فى
      ["عزة : حميّـة و تكبر عن الحقّ"], // عِزَّةٍ
      [] // وَشِقاقٍ
    ],
    [ // آية 3
      ["كم أهلكنا : كثيرة أهلكنا"], // كَم
      ["كم أهلكنا : كثيرة أهلكنا"], // أَهلَكنا
      [], // مِن
      [], // قَبلِهِم
      [], // مِن
      ["قرن : أمة"], // قَرنٍ
      ["فنادوْا : استغاثوا حين عاينوا العذاب"], // فَنادَوا
      [], // وَلاتَ
      [], // حينَ
      [] // مَناصٍ
    ],
    [ // آية 4
      [], // وَعَجِبوا
      [], // أَن
      [], // جاءَهُم
      [], // مُنذِرٌ
      [], // مِنهُم
      [], // وَقالَ
      [], // الكـٰفِرونَ
      [], // هـٰذا
      [], // سـٰحِرٌ
      [] // كَذّابٌ
    ],
    [ // آية 5
      [], // أَجَعَلَ
      [], // الـٔالِهَةَ
      [], // إِلـٰهًا
      [], // وٰحِدًا
      [], // إِنَّ
      [], // هـٰذا
      [], // لَشَىءٌ
      ["عجاب : بالغ الغاية في العَجَب"] // عُجابٌ
    ],
    [ // آية 6
      [], // وَانطَلَقَ
      ["الملأ منهم : الوجوه من كفار قريش"], // المَلَأُ
      ["الملأ منهم : الوجوه من كفار قريش"], // مِنهُم
      [], // أَنِ
      ["امشوا : سيروا على طريقتكم و دينكم"], // امشوا
      [], // وَاصبِروا
      [], // عَلىٰ
      [], // ءالِهَتِكُم
      [], // إِنَّ
      [], // هـٰذا
      [], // لَشَىءٌ
      [] // يُرادُ
    ],
    [ // آية 7
      [], // ما
      [], // سَمِعنا
      [], // بِهـٰذا
      [], // فِى
      [], // المِلَّةِ
      [], // الـٔاخِرَةِ
      [], // إِن
      [], // هـٰذا
      [], // إِلَّا
      [] // اختِلـٰقٌ
    ],
    [ // آية 8
      [], // أَءُنزِلَ
      [], // عَلَيهِ
      [], // الذِّكرُ
      [], // مِن
      [], // بَينِنا
      [], // بَل
      [], // هُم
      [], // فى
      [], // شَكٍّ
      [], // مِن
      [], // ذِكرى
      [], // بَل
      [], // لَمّا
      [], // يَذوقوا
      [] // عَذابِ
    ],
    [ // آية 9
      [], // أَم
      [], // عِندَهُم
      [], // خَزائِنُ
      [], // رَحمَةِ
      [], // رَبِّكَ
      [], // العَزيزِ
      [] // الوَهّابِ
    ],
    [ // آية 10
      [], // أَم
      [], // لَهُم
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // فَليَرتَقوا
      [], // فِى
      [] // الأَسبـٰبِ
    ],
    [ // آية 11
      ["جندٌ ما : هم ( جُنْد ) يعني الذين في عزّة وشقاق  و (ما) للتقليل والتحقير، والكلام مسوق لتحقير أمرهم رغماً لما يشعر به ظاهر كلامهم من التعزز والاعجاب بأنفسهم"], // جُندٌ
      ["جندٌ ما : هم ( جُنْد ) يعني الذين في عزّة وشقاق  و (ما) للتقليل والتحقير، والكلام مسوق لتحقير أمرهم رغماً لما يشعر به ظاهر كلامهم من التعزز والاعجاب بأنفسهم"], // ما
      ["هنالك : بمكّة يوم الفتح أو يوم بَدْر"], // هُنالِكَ
      [], // مَهزومٌ
      [], // مِنَ
      [] // الأَحزابِ
    ],
    [ // آية 12
      [], // كَذَّبَت
      [], // قَبلَهُم
      [], // قَومُ
      [], // نوحٍ
      [], // وَعادٌ
      [], // وَفِرعَونُ
      ["ذو الأوتاد : الجنود أو المباني القويتين"], // ذُو
      ["ذو الأوتاد : الجنود أو المباني القويتين"] // الأَوتادِ
    ],
    [ // آية 13
      [], // وَثَمودُ
      [], // وَقَومُ
      [], // لوطٍ
      [], // وَأَصحـٰبُ
      [], // لـَٔيكَةِ
      [], // أُولـٰئِكَ
      [] // الأَحزابُ
    ],
    [ // آية 14
      [], // إِن
      [], // كُلٌّ
      [], // إِلّا
      [], // كَذَّبَ
      [], // الرُّسُلَ
      [], // فَحَقَّ
      [] // عِقابِ
    ],
    [ // آية 15
      [], // وَما
      [], // يَنظُرُ
      [], // هـٰؤُلاءِ
      [], // إِلّا
      [], // صَيحَةً
      [], // وٰحِدَةً
      ["ما لها من فواق : مالها توقـّـف قدْر فواق ناقة ، و هو ما بين حلبتيها"], // ما
      ["ما لها من فواق : مالها توقـّـف قدْر فواق ناقة ، و هو ما بين حلبتيها"], // لَها
      ["ما لها من فواق : مالها توقـّـف قدْر فواق ناقة ، و هو ما بين حلبتيها"], // مِن
      ["ما لها من فواق : مالها توقـّـف قدْر فواق ناقة ، و هو ما بين حلبتيها"] // فَواقٍ
    ],
    [ // آية 16
      [], // وَقالوا
      [], // رَبَّنا
      [], // عَجِّل
      [], // لَنا
      [], // قِطَّنا
      [], // قَبلَ
      [], // يَومِ
      [] // الحِسابِ
    ],
    [ // آية 17
      [], // اصبِر
      [], // عَلىٰ
      [], // ما
      [], // يَقولونَ
      [], // وَاذكُر
      [], // عَبدَنا
      [], // داوۥدَ
      ["ذا الأيد : ذا القوّة في الدين و العبادة"], // ذَا
      ["ذا الأيد : ذا القوّة في الدين و العبادة"], // الأَيدِ
      [], // إِنَّهُ
      [] // أَوّابٌ
    ],
    [ // آية 18
      [], // إِنّا
      [], // سَخَّرنَا
      [], // الجِبالَ
      [], // مَعَهُ
      [], // يُسَبِّحنَ
      [], // بِالعَشِىِّ
      [] // وَالإِشراقِ
    ],
    [ // آية 19
      [], // وَالطَّيرَ
      [], // مَحشورَةً
      [], // كُلٌّ
      [], // لَهُ
      [] // أَوّابٌ
    ],
    [ // آية 20
      [], // وَشَدَدنا
      [], // مُلكَهُ
      [], // وَءاتَينـٰهُ
      [], // الحِكمَةَ
      [], // وَفَصلَ
      [] // الخِطابِ
    ],
    [ // آية 21
      [], // وَهَل
      [], // أَتىٰكَ
      [], // نَبَؤُا۟
      ["الخصم : ملكين في صورة إنسانين"], // الخَصمِ
      [], // إِذ
      ["تسوّروا المحراب : علوْ سور مصلاّه و نزلوا إليه"], // تَسَوَّرُوا
      ["تسوّروا المحراب : علوْ سور مصلاّه و نزلوا إليه"] // المِحرابَ
    ],
    [ // آية 22
      [], // إِذ
      [], // دَخَلوا
      [], // عَلىٰ
      [], // داوۥدَ
      [], // فَفَزِعَ
      [], // مِنهُم
      [], // قالوا
      [], // لا
      [], // تَخَف
      [], // خَصمانِ
      [], // بَغىٰ
      [], // بَعضُنا
      [], // عَلىٰ
      [], // بَعضٍ
      [], // فَاحكُم
      [], // بَينَنا
      [], // بِالحَقِّ
      [], // وَلا
      [], // تُشطِط
      [], // وَاهدِنا
      [], // إِلىٰ
      [], // سَواءِ
      [] // الصِّرٰطِ
    ],
    [ // آية 23
      [], // إِنَّ
      [], // هـٰذا
      [], // أَخى
      [], // لَهُ
      [], // تِسعٌ
      [], // وَتِسعونَ
      [], // نَعجَةً
      [], // وَلِىَ
      [], // نَعجَةٌ
      [], // وٰحِدَةٌ
      [], // فَقالَ
      [], // أَكفِلنيها
      [], // وَعَزَّنى
      [], // فِى
      [] // الخِطابِ
    ],
    [ // آية 24
      [], // قالَ
      [], // لَقَد
      [], // ظَلَمَكَ
      [], // بِسُؤالِ
      [], // نَعجَتِكَ
      [], // إِلىٰ
      [], // نِعاجِهِ
      [], // وَإِنَّ
      [], // كَثيرًا
      [], // مِنَ
      ["الخلطاء : الشركاء"], // الخُلَطاءِ
      [], // لَيَبغى
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // إِلَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // وَقَليلٌ
      [], // ما
      [], // هُم
      [], // وَظَنَّ
      [], // داوۥدُ
      [], // أَنَّما
      [], // فَتَنّـٰهُ
      [], // فَاستَغفَرَ
      [], // رَبَّهُ
      [], // وَخَرَّ
      [], // راكِعًا
      [] // وَأَنابَ
    ],
    [ // آية 25
      [], // فَغَفَرنا
      [], // لَهُ
      [], // ذٰلِكَ
      [], // وَإِنَّ
      [], // لَهُ
      [], // عِندَنا
      ["لَزلفى : لقـُـربَة و مكانة"], // لَزُلفىٰ
      [], // وَحُسنَ
      [] // مَـٔابٍ
    ],
    [ // آية 26
      [], // يـٰداوۥدُ
      [], // إِنّا
      [], // جَعَلنـٰكَ
      [], // خَليفَةً
      [], // فِى
      [], // الأَرضِ
      [], // فَاحكُم
      [], // بَينَ
      [], // النّاسِ
      [], // بِالحَقِّ
      [], // وَلا
      [], // تَتَّبِعِ
      [], // الهَوىٰ
      [], // فَيُضِلَّكَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَضِلّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // لَهُم
      [], // عَذابٌ
      [], // شَديدٌ
      [], // بِما
      [], // نَسوا
      [], // يَومَ
      [] // الحِسابِ
    ],
    [ // آية 27
      [], // وَما
      [], // خَلَقنَا
      [], // السَّماءَ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // بـٰطِلًا
      [], // ذٰلِكَ
      [], // ظَنُّ
      [], // الَّذينَ
      [], // كَفَروا
      ["فويل : هلاكٌ . أو وادٍ في جهنم"], // فَوَيلٌ
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // مِنَ
      [] // النّارِ
    ],
    [ // آية 28
      [], // أَم
      [], // نَجعَلُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // كَالمُفسِدينَ
      [], // فِى
      [], // الأَرضِ
      [], // أَم
      [], // نَجعَلُ
      [], // المُتَّقينَ
      [] // كَالفُجّارِ
    ],
    [ // آية 29
      [], // كِتـٰبٌ
      [], // أَنزَلنـٰهُ
      [], // إِلَيكَ
      [], // مُبـٰرَكٌ
      [], // لِيَدَّبَّروا
      [], // ءايـٰتِهِ
      [], // وَلِيَتَذَكَّرَ
      [], // أُولُوا
      [] // الأَلبـٰبِ
    ],
    [ // آية 30
      [], // وَوَهَبنا
      [], // لِداوۥدَ
      [], // سُلَيمـٰنَ
      [], // نِعمَ
      [], // العَبدُ
      [], // إِنَّهُ
      [] // أَوّابٌ
    ],
    [ // آية 31
      [], // إِذ
      [], // عُرِضَ
      [], // عَلَيهِ
      [], // بِالعَشِىِّ
      [], // الصّـٰفِنـٰتُ
      ["الجياد : السّراع السوابق في العدو"] // الجِيادُ
    ],
    [ // آية 32
      [], // فَقالَ
      [], // إِنّى
      ["أحببت حب الخير : آثرتُ حبّ الخيل"], // أَحبَبتُ
      ["أحببت حب الخير : آثرتُ حبّ الخيل"], // حُبَّ
      ["أحببت حب الخير : آثرتُ حبّ الخيل"], // الخَيرِ
      [], // عَن
      [], // ذِكرِ
      [], // رَبّى
      [], // حَتّىٰ
      ["توارت بالحجاب : غرَبَت الشمس . أو غابت الخيل عن بصره لظلمة الليل"], // تَوارَت
      ["توارت بالحجاب : غرَبَت الشمس . أو غابت الخيل عن بصره لظلمة الليل"] // بِالحِجابِ
    ],
    [ // آية 33
      [], // رُدّوها
      [], // عَلَىَّ
      [], // فَطَفِقَ
      [], // مَسحًا
      [], // بِالسّوقِ
      [] // وَالأَعناقِ
    ],
    [ // آية 34
      [], // وَلَقَد
      [], // فَتَنّا
      [], // سُلَيمـٰنَ
      [], // وَأَلقَينا
      [], // عَلىٰ
      [], // كُرسِيِّهِ
      ["جسدا : شِقّ إنسان ولِـد له"], // جَسَدًا
      [], // ثُمَّ
      ["أناب : رَجَع إلى الله تعالى بالتـّـوبة"] // أَنابَ
    ],
    [ // آية 35
      [], // قالَ
      [], // رَبِّ
      [], // اغفِر
      [], // لى
      [], // وَهَب
      [], // لى
      [], // مُلكًا
      [], // لا
      [], // يَنبَغى
      [], // لِأَحَدٍ
      [], // مِن
      [], // بَعدى
      [], // إِنَّكَ
      [], // أَنتَ
      [] // الوَهّابُ
    ],
    [ // آية 36
      [], // فَسَخَّرنا
      [], // لَهُ
      [], // الرّيحَ
      [], // تَجرى
      [], // بِأَمرِهِ
      ["رخاءً حيث أصاب : لـَــيّـنة . أو مُنقادة حيث أرَاد"], // رُخاءً
      ["رخاءً حيث أصاب : لـَــيّـنة . أو مُنقادة حيث أرَاد"], // حَيثُ
      ["رخاءً حيث أصاب : لـَــيّـنة . أو مُنقادة حيث أرَاد"] // أَصابَ
    ],
    [ // آية 37
      [], // وَالشَّيـٰطينَ
      [], // كُلَّ
      [], // بَنّاءٍ
      [] // وَغَوّاصٍ
    ],
    [ // آية 38
      [], // وَءاخَرينَ
      [], // مُقَرَّنينَ
      [], // فِى
      ["الأصفاد : الأغلال تجمع الأيدي إلى الأعناق"] // الأَصفادِ
    ],
    [ // آية 39
      [], // هـٰذا
      [], // عَطاؤُنا
      [], // فَامنُن
      [], // أَو
      [], // أَمسِك
      ["بغير حساب : غير مُحاسَبعلى شيء من الأمْـرَين"], // بِغَيرِ
      ["بغير حساب : غير مُحاسَبعلى شيء من الأمْـرَين"] // حِسابٍ
    ],
    [ // آية 40
      [], // وَإِنَّ
      [], // لَهُ
      [], // عِندَنا
      ["لزلفى : لقـُرْبا و كَرَامة"], // لَزُلفىٰ
      [], // وَحُسنَ
      [] // مَـٔابٍ
    ],
    [ // آية 41
      [], // وَاذكُر
      [], // عَبدَنا
      [], // أَيّوبَ
      [], // إِذ
      [], // نادىٰ
      [], // رَبَّهُ
      [], // أَنّى
      [], // مَسَّنِىَ
      [], // الشَّيطـٰنُ
      [], // بِنُصبٍ
      [] // وَعَذابٍ
    ],
    [ // آية 42
      ["اركض برجلك : اضربْ بها الأرض"], // اركُض
      ["اركض برجلك : اضربْ بها الأرض"], // بِرِجلِكَ
      [], // هـٰذا
      [], // مُغتَسَلٌ
      [], // بارِدٌ
      [] // وَشَرابٌ
    ],
    [ // آية 43
      [], // وَوَهَبنا
      [], // لَهُ
      [], // أَهلَهُ
      [], // وَمِثلَهُم
      [], // مَعَهُم
      [], // رَحمَةً
      [], // مِنّا
      [], // وَذِكرىٰ
      [], // لِأُولِى
      [] // الأَلبـٰبِ
    ],
    [ // آية 44
      [], // وَخُذ
      [], // بِيَدِكَ
      ["ضِغثا : قبضة من قضْبان أو عثكال النّخل بشماريخه"], // ضِغثًا
      [], // فَاضرِب
      [], // بِهِ
      [], // وَلا
      [], // تَحنَث
      [], // إِنّا
      [], // وَجَدنـٰهُ
      [], // صابِرًا
      [], // نِعمَ
      [], // العَبدُ
      [], // إِنَّهُ
      [] // أَوّابٌ
    ],
    [ // آية 45
      [], // وَاذكُر
      [], // عِبـٰدَنا
      [], // إِبرٰهيمَ
      [], // وَإِسحـٰقَ
      [], // وَيَعقوبَ
      [], // أُولِى
      [], // الأَيدى
      [] // وَالأَبصـٰرِ
    ],
    [ // آية 46
      [], // إِنّا
      [], // أَخلَصنـٰهُم
      [], // بِخالِصَةٍ
      [], // ذِكرَى
      [] // الدّارِ
    ],
    [ // آية 47
      [], // وَإِنَّهُم
      [], // عِندَنا
      [], // لَمِنَ
      [], // المُصطَفَينَ
      [] // الأَخيارِ
    ],
    [ // آية 48
      [], // وَاذكُر
      [], // إِسمـٰعيلَ
      [], // وَاليَسَعَ
      [], // وَذَا
      [], // الكِفلِ
      [], // وَكُلٌّ
      [], // مِنَ
      [] // الأَخيارِ
    ],
    [ // آية 49
      [], // هـٰذا
      [], // ذِكرٌ
      [], // وَإِنَّ
      [], // لِلمُتَّقينَ
      [], // لَحُسنَ
      [] // مَـٔابٍ
    ],
    [ // آية 50
      [], // جَنّـٰتِ
      [], // عَدنٍ
      [], // مُفَتَّحَةً
      [], // لَهُمُ
      [] // الأَبوٰبُ
    ],
    [ // آية 51
      [], // مُتَّكِـٔينَ
      [], // فيها
      [], // يَدعونَ
      [], // فيها
      [], // بِفـٰكِهَةٍ
      [], // كَثيرَةٍ
      [] // وَشَرابٍ
    ],
    [ // آية 52
      [], // وَعِندَهُم
      [], // قـٰصِرٰتُ
      [], // الطَّرفِ
      ["أتراب : مستوياتٌ في الشّباب"] // أَترابٌ
    ],
    [ // آية 53
      [], // هـٰذا
      [], // ما
      [], // توعَدونَ
      [], // لِيَومِ
      [] // الحِسابِ
    ],
    [ // آية 54
      [], // إِنَّ
      [], // هـٰذا
      [], // لَرِزقُنا
      [], // ما
      [], // لَهُ
      [], // مِن
      ["نفاد : انقطاع و فَـناءٍ"] // نَفادٍ
    ],
    [ // آية 55
      [], // هـٰذا
      [], // وَإِنَّ
      [], // لِلطّـٰغينَ
      [], // لَشَرَّ
      [] // مَـٔابٍ
    ],
    [ // آية 56
      ["جهنّم يصلونها : يَدْخلونـَـها أو يقاسونَ حَرّها"], // جَهَنَّمَ
      ["جهنّم يصلونها : يَدْخلونـَـها أو يقاسونَ حَرّها"], // يَصلَونَها
      ["فبئس المهاد : فبئس الفِـراش ، أي المستقرّ جهنّم"], // فَبِئسَ
      ["فبئس المهاد : فبئس الفِـراش ، أي المستقرّ جهنّم"] // المِهادُ
    ],
    [ // آية 57
      [], // هـٰذا
      [], // فَليَذوقوهُ
      ["حميم : ماءٌ بالغ نهاية الحرارة"], // حَميمٌ
      [] // وَغَسّاقٌ
    ],
    [ // آية 58
      [], // وَءاخَرُ
      [], // مِن
      [], // شَكلِهِ
      [] // أَزوٰجٌ
    ],
    [ // آية 59
      [], // هـٰذا
      [], // فَوجٌ
      ["مقتحم معكم : داخلٌ مَعَكم النار قـَهْرًا عنه"], // مُقتَحِمٌ
      ["مقتحم معكم : داخلٌ مَعَكم النار قـَهْرًا عنه"], // مَعَكُم
      [], // لا
      [], // مَرحَبًا
      [], // بِهِم
      [], // إِنَّهُم
      [], // صالُوا
      [] // النّارِ
    ],
    [ // آية 60
      [], // قالوا
      [], // بَل
      [], // أَنتُم
      [], // لا
      [], // مَرحَبًا
      [], // بِكُم
      [], // أَنتُم
      [], // قَدَّمتُموهُ
      [], // لَنا
      ["فبئس القرار : فبئسَ المَقرّ للجميع جَهنّم"], // فَبِئسَ
      ["فبئس القرار : فبئسَ المَقرّ للجميع جَهنّم"] // القَرارُ
    ],
    [ // آية 61
      [], // قالوا
      [], // رَبَّنا
      [], // مَن
      [], // قَدَّمَ
      [], // لَنا
      [], // هـٰذا
      [], // فَزِدهُ
      [], // عَذابًا
      [], // ضِعفًا
      [], // فِى
      [] // النّارِ
    ],
    [ // آية 62
      [], // وَقالوا
      [], // ما
      [], // لَنا
      [], // لا
      [], // نَرىٰ
      [], // رِجالًا
      [], // كُنّا
      [], // نَعُدُّهُم
      [], // مِنَ
      [] // الأَشرارِ
    ],
    [ // آية 63
      [], // أَتَّخَذنـٰهُم
      [], // سِخرِيًّا
      [], // أَم
      [], // زاغَت
      [], // عَنهُمُ
      [] // الأَبصـٰرُ
    ],
    [ // آية 64
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // لَحَقٌّ
      [], // تَخاصُمُ
      [], // أَهلِ
      [] // النّارِ
    ],
    [ // آية 65
      [], // قُل
      [], // إِنَّما
      [], // أَنا۠
      [], // مُنذِرٌ
      [], // وَما
      [], // مِن
      [], // إِلـٰهٍ
      [], // إِلَّا
      [], // اللَّهُ
      [], // الوٰحِدُ
      [] // القَهّارُ
    ],
    [ // آية 66
      [], // رَبُّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُمَا
      [], // العَزيزُ
      [] // الغَفّـٰرُ
    ],
    [ // آية 67
      [], // قُل
      [], // هُوَ
      [], // نَبَؤٌا۟
      [] // عَظيمٌ
    ],
    [ // آية 68
      [], // أَنتُم
      [], // عَنهُ
      [] // مُعرِضونَ
    ],
    [ // آية 69
      [], // ما
      [], // كانَ
      [], // لِىَ
      [], // مِن
      [], // عِلمٍ
      [], // بِالمَلَإِ
      [], // الأَعلىٰ
      ["إذ يختصمون : في شأن آدم و خَلقِهِ و خِـلافته"], // إِذ
      ["إذ يختصمون : في شأن آدم و خَلقِهِ و خِـلافته"] // يَختَصِمونَ
    ],
    [ // آية 70
      [], // إِن
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // إِلّا
      [], // أَنَّما
      [], // أَنا۠
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 71
      [], // إِذ
      [], // قالَ
      [], // رَبُّكَ
      [], // لِلمَلـٰئِكَةِ
      [], // إِنّى
      [], // خـٰلِقٌ
      [], // بَشَرًا
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 72
      [], // فَإِذا
      ["سوّيته : أتمَمْتَ خَلقـَـه بالصّورة الإنسانية"], // سَوَّيتُهُ
      [], // وَنَفَختُ
      [], // فيهِ
      [], // مِن
      [], // روحى
      [], // فَقَعوا
      [], // لَهُ
      [] // سـٰجِدينَ
    ],
    [ // آية 73
      [], // فَسَجَدَ
      [], // المَلـٰئِكَةُ
      [], // كُلُّهُم
      [] // أَجمَعونَ
    ],
    [ // آية 74
      [], // إِلّا
      [], // إِبليسَ
      [], // استَكبَرَ
      [], // وَكانَ
      [], // مِنَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 75
      [], // قالَ
      [], // يـٰإِبليسُ
      [], // ما
      [], // مَنَعَكَ
      [], // أَن
      [], // تَسجُدَ
      [], // لِما
      [], // خَلَقتُ
      [], // بِيَدَىَّ
      [], // أَستَكبَرتَ
      [], // أَم
      [], // كُنتَ
      [], // مِنَ
      ["العالين : المستحقـّـين للعلُوّ و الرّفعَة – كَلاّ"] // العالينَ
    ],
    [ // آية 76
      [], // قالَ
      [], // أَنا۠
      [], // خَيرٌ
      [], // مِنهُ
      [], // خَلَقتَنى
      [], // مِن
      [], // نارٍ
      [], // وَخَلَقتَهُ
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 77
      [], // قالَ
      [], // فَاخرُج
      [], // مِنها
      [], // فَإِنَّكَ
      ["رجيم : مطرودٌ من كلّ خيْرٍ ة كَرَامة"] // رَجيمٌ
    ],
    [ // آية 78
      [], // وَإِنَّ
      [], // عَلَيكَ
      [], // لَعنَتى
      [], // إِلىٰ
      [], // يَومِ
      [] // الدّينِ
    ],
    [ // آية 79
      [], // قالَ
      [], // رَبِّ
      [], // فَأَنظِرنى
      [], // إِلىٰ
      [], // يَومِ
      [] // يُبعَثونَ
    ],
    [ // آية 80
      [], // قالَ
      [], // فَإِنَّكَ
      [], // مِنَ
      [] // المُنظَرينَ
    ],
    [ // آية 81
      [], // إِلىٰ
      ["يوم الوقت المعلوم : وَقـْـتِ النّـفخة الأولى"], // يَومِ
      ["يوم الوقت المعلوم : وَقـْـتِ النّـفخة الأولى"], // الوَقتِ
      ["يوم الوقت المعلوم : وَقـْـتِ النّـفخة الأولى"] // المَعلومِ
    ],
    [ // آية 82
      [], // قالَ
      ["فبعزتك : فبسُـلطانك و قـَـهْرك (قـَـسَم)"], // فَبِعِزَّتِكَ
      ["لأغوينّهم : لأضلـّـنـّـهمْ بتزْيين المعاصي لهم"], // لَأُغوِيَنَّهُم
      [] // أَجمَعينَ
    ],
    [ // آية 83
      [], // إِلّا
      [], // عِبادَكَ
      [], // مِنهُمُ
      [] // المُخلَصينَ
    ],
    [ // آية 84
      [], // قالَ
      [], // فَالحَقُّ
      [], // وَالحَقَّ
      [] // أَقولُ
    ],
    [ // آية 85
      [], // لَأَملَأَنَّ
      [], // جَهَنَّمَ
      [], // مِنكَ
      [], // وَمِمَّن
      [], // تَبِعَكَ
      [], // مِنهُم
      [] // أَجمَعينَ
    ],
    [ // آية 86
      [], // قُل
      [], // ما
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // مِن
      [], // أَجرٍ
      [], // وَما
      [], // أَنا۠
      [], // مِنَ
      ["المتكلّفين : المـتـَـصَـنّعِـين المُـتقـَـوّلينَ على الله"] // المُتَكَلِّفينَ
    ],
    [ // آية 87
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرٌ
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 88
      [], // وَلَتَعلَمُنَّ
      ["نبأه : صدق أخباره"], // نَبَأَهُ
      [], // بَعدَ
      [] // حينٍ
    ]
  ]
];

export default meanings;