const meanings = [
[ // آية 1
      [], // تَنزيلُ
      [], // الكِتـٰبِ
      [], // مِنَ
      [], // اللَّهِ
      [], // العَزيزِ
      [] // الحَكيمِ
    ],
    [ // آية 2
      [], // إِنّا
      [], // أَنزَلنا
      [], // إِلَيكَ
      [], // الكِتـٰبَ
      [], // بِالحَقِّ
      [], // فَاعبُدِ
      [], // اللَّهَ
      [], // مُخلِصًا
      [], // لَهُ
      [] // الدّينَ
    ],
    [ // آية 3
      [], // أَلا
      [], // لِلَّهِ
      [], // الدّينُ
      [], // الخالِصُ
      [], // وَالَّذينَ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِهِ
      [], // أَولِياءَ
      [], // ما
      [], // نَعبُدُهُم
      [], // إِلّا
      [], // لِيُقَرِّبونا
      [], // إِلَى
      [], // اللَّهِ
      ["زلفى : تقريبا"], // زُلفىٰ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَحكُمُ
      [], // بَينَهُم
      [], // فى
      [], // ما
      [], // هُم
      [], // فيهِ
      [], // يَختَلِفونَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدى
      [], // مَن
      [], // هُوَ
      [], // كـٰذِبٌ
      [] // كَفّارٌ
    ],
    [ // آية 4
      [], // لَو
      [], // أَرادَ
      [], // اللَّهُ
      [], // أَن
      [], // يَتَّخِذَ
      [], // وَلَدًا
      [], // لَاصطَفىٰ
      [], // مِمّا
      [], // يَخلُقُ
      [], // ما
      [], // يَشاءُ
      [], // سُبحـٰنَهُ
      [], // هُوَ
      [], // اللَّهُ
      [], // الوٰحِدُ
      [] // القَهّارُ
    ],
    [ // آية 5
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // يُكَوِّرُ
      [], // الَّيلَ
      [], // عَلَى
      [], // النَّهارِ
      [], // وَيُكَوِّرُ
      [], // النَّهارَ
      [], // عَلَى
      [], // الَّيلِ
      [], // وَسَخَّرَ
      [], // الشَّمسَ
      [], // وَالقَمَرَ
      [], // كُلٌّ
      [], // يَجرى
      [], // لِأَجَلٍ
      [], // مُسَمًّى
      [], // أَلا
      [], // هُوَ
      [], // العَزيزُ
      [] // الغَفّـٰرُ
    ],
    [ // آية 6
      [], // خَلَقَكُم
      [], // مِن
      [], // نَفسٍ
      [], // وٰحِدَةٍ
      [], // ثُمَّ
      [], // جَعَلَ
      [], // مِنها
      [], // زَوجَها
      [], // وَأَنزَلَ
      [], // لَكُم
      [], // مِنَ
      [], // الأَنعـٰمِ
      [], // ثَمـٰنِيَةَ
      [], // أَزوٰجٍ
      [], // يَخلُقُكُم
      [], // فى
      [], // بُطونِ
      [], // أُمَّهـٰتِكُم
      [], // خَلقًا
      [], // مِن
      [], // بَعدِ
      [], // خَلقٍ
      [], // فى
      [], // ظُلُمـٰتٍ
      [], // ثَلـٰثٍ
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      [], // لَهُ
      [], // المُلكُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَأَنّىٰ
      [] // تُصرَفونَ
    ],
    [ // آية 7
      [], // إِن
      [], // تَكفُروا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَنِىٌّ
      [], // عَنكُم
      [], // وَلا
      [], // يَرضىٰ
      [], // لِعِبادِهِ
      [], // الكُفرَ
      [], // وَإِن
      [], // تَشكُروا
      [], // يَرضَهُ
      [], // لَكُم
      [], // وَلا
      [], // تَزِرُ
      [], // وازِرَةٌ
      [], // وِزرَ
      [], // أُخرىٰ
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّكُم
      [], // مَرجِعُكُم
      [], // فَيُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [], // تَعمَلونَ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 8
      [], // وَإِذا
      [], // مَسَّ
      [], // الإِنسـٰنَ
      [], // ضُرٌّ
      [], // دَعا
      [], // رَبَّهُ
      [], // مُنيبًا
      [], // إِلَيهِ
      [], // ثُمَّ
      [], // إِذا
      ["خَوّله نِعْمَة : أعطاه نعمة عظيمة تفضلا و إحسانا"], // خَوَّلَهُ
      ["خَوّله نِعْمَة : أعطاه نعمة عظيمة تفضلا و إحسانا"], // نِعمَةً
      [], // مِنهُ
      [], // نَسِىَ
      [], // ما
      [], // كانَ
      [], // يَدعوا
      [], // إِلَيهِ
      [], // مِن
      [], // قَبلُ
      [], // وَجَعَلَ
      [], // لِلَّهِ
      ["أندَادًا : أمثالا يَعبدها من دونه تعالى"], // أَندادًا
      [], // لِيُضِلَّ
      [], // عَن
      [], // سَبيلِهِ
      [], // قُل
      [], // تَمَتَّع
      [], // بِكُفرِكَ
      [], // قَليلًا
      [], // إِنَّكَ
      [], // مِن
      [], // أَصحـٰبِ
      [] // النّارِ
    ],
    [ // آية 9
      [], // أَمَّن
      [], // هُوَ
      [], // قـٰنِتٌ
      [], // ءاناءَ
      [], // الَّيلِ
      [], // ساجِدًا
      [], // وَقائِمًا
      [], // يَحذَرُ
      [], // الـٔاخِرَةَ
      [], // وَيَرجوا
      [], // رَحمَةَ
      [], // رَبِّهِ
      [], // قُل
      [], // هَل
      [], // يَستَوِى
      [], // الَّذينَ
      [], // يَعلَمونَ
      [], // وَالَّذينَ
      [], // لا
      [], // يَعلَمونَ
      [], // إِنَّما
      [], // يَتَذَكَّرُ
      [], // أُولُوا
      [] // الأَلبـٰبِ
    ],
    [ // آية 10
      [], // قُل
      [], // يـٰعِبادِ
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اتَّقوا
      [], // رَبَّكُم
      [], // لِلَّذينَ
      [], // أَحسَنوا
      [], // فى
      [], // هـٰذِهِ
      [], // الدُّنيا
      [], // حَسَنَةٌ
      [], // وَأَرضُ
      [], // اللَّهِ
      [], // وٰسِعَةٌ
      [], // إِنَّما
      [], // يُوَفَّى
      [], // الصّـٰبِرونَ
      [], // أَجرَهُم
      ["بغَير حِساب : بلا نهاية لما يعطي أو بتوْسعة"], // بِغَيرِ
      ["بغَير حِساب : بلا نهاية لما يعطي أو بتوْسعة"] // حِسابٍ
    ],
    [ // آية 11
      [], // قُل
      [], // إِنّى
      [], // أُمِرتُ
      [], // أَن
      [], // أَعبُدَ
      [], // اللَّهَ
      [], // مُخلِصًا
      [], // لَهُ
      [] // الدّينَ
    ],
    [ // آية 12
      [], // وَأُمِرتُ
      [], // لِأَن
      [], // أَكونَ
      [], // أَوَّلَ
      [] // المُسلِمينَ
    ],
    [ // آية 13
      [], // قُل
      [], // إِنّى
      [], // أَخافُ
      [], // إِن
      [], // عَصَيتُ
      [], // رَبّى
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 14
      [], // قُلِ
      [], // اللَّهَ
      [], // أَعبُدُ
      [], // مُخلِصًا
      [], // لَهُ
      [] // دينى
    ],
    [ // آية 15
      [], // فَاعبُدوا
      [], // ما
      [], // شِئتُم
      [], // مِن
      [], // دونِهِ
      [], // قُل
      [], // إِنَّ
      [], // الخـٰسِرينَ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // وَأَهليهِم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // أَلا
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الخُسرانُ
      [] // المُبينُ
    ],
    [ // آية 16
      [], // لَهُم
      [], // مِن
      [], // فَوقِهِم
      [], // ظُلَلٌ
      [], // مِنَ
      [], // النّارِ
      [], // وَمِن
      [], // تَحتِهِم
      [], // ظُلَلٌ
      [], // ذٰلِكَ
      [], // يُخَوِّفُ
      [], // اللَّهُ
      [], // بِهِ
      [], // عِبادَهُ
      [], // يـٰعِبادِ
      [] // فَاتَّقونِ
    ],
    [ // آية 17
      [], // وَالَّذينَ
      [], // اجتَنَبُوا
      [], // الطّـٰغوتَ
      [], // أَن
      [], // يَعبُدوها
      [], // وَأَنابوا
      [], // إِلَى
      [], // اللَّهِ
      [], // لَهُمُ
      [], // البُشرىٰ
      [], // فَبَشِّر
      [] // عِبادِ
    ],
    [ // آية 18
      [], // الَّذينَ
      [], // يَستَمِعونَ
      [], // القَولَ
      [], // فَيَتَّبِعونَ
      [], // أَحسَنَهُ
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // هَدىٰهُمُ
      [], // اللَّهُ
      [], // وَأُولـٰئِكَ
      [], // هُم
      [], // أُولُوا
      [] // الأَلبـٰبِ
    ],
    [ // آية 19
      [], // أَفَمَن
      ["حقّ عَليْه : وَجَبَ و ثبَت عليه"], // حَقَّ
      ["حقّ عَليْه : وَجَبَ و ثبَت عليه"], // عَلَيهِ
      [], // كَلِمَةُ
      [], // العَذابِ
      [], // أَفَأَنتَ
      [], // تُنقِذُ
      [], // مَن
      [], // فِى
      [] // النّارِ
    ],
    [ // آية 20
      [], // لـٰكِنِ
      [], // الَّذينَ
      [], // اتَّقَوا
      [], // رَبَّهُم
      ["لهمْ غرفٌ : منازل رفيعة عالية في الجنة"], // لَهُم
      ["لهمْ غرفٌ : منازل رفيعة عالية في الجنة"], // غُرَفٌ
      [], // مِن
      [], // فَوقِها
      [], // غُرَفٌ
      [], // مَبنِيَّةٌ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // وَعدَ
      [], // اللَّهِ
      [], // لا
      [], // يُخلِفُ
      [], // اللَّهُ
      [] // الميعادَ
    ],
    [ // آية 21
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَسَلَكَهُ
      [], // يَنـٰبيعَ
      [], // فِى
      [], // الأَرضِ
      [], // ثُمَّ
      [], // يُخرِجُ
      [], // بِهِ
      [], // زَرعًا
      [], // مُختَلِفًا
      [], // أَلوٰنُهُ
      [], // ثُمَّ
      ["يَهيج : يَيبَس في أقصى غايته"], // يَهيجُ
      [], // فَتَرىٰهُ
      [], // مُصفَرًّا
      [], // ثُمَّ
      [], // يَجعَلُهُ
      [], // حُطـٰمًا
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَذِكرىٰ
      [], // لِأُولِى
      [] // الأَلبـٰبِ
    ],
    [ // آية 22
      [], // أَفَمَن
      [], // شَرَحَ
      [], // اللَّهُ
      [], // صَدرَهُ
      [], // لِلإِسلـٰمِ
      [], // فَهُوَ
      [], // عَلىٰ
      [], // نورٍ
      [], // مِن
      [], // رَبِّهِ
      [], // فَوَيلٌ
      [], // لِلقـٰسِيَةِ
      [], // قُلوبُهُم
      [], // مِن
      [], // ذِكرِ
      [], // اللَّهِ
      [], // أُولـٰئِكَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 23
      [], // اللَّهُ
      [], // نَزَّلَ
      ["أحسَنَ الحديث : أبلغَه و أصْدقه و أوْفاه (القرآن)"], // أَحسَنَ
      ["أحسَنَ الحديث : أبلغَه و أصْدقه و أوْفاه (القرآن)"], // الحَديثِ
      [], // كِتـٰبًا
      [], // مُتَشـٰبِهًا
      [], // مَثانِىَ
      [], // تَقشَعِرُّ
      [], // مِنهُ
      [], // جُلودُ
      [], // الَّذينَ
      [], // يَخشَونَ
      [], // رَبَّهُم
      [], // ثُمَّ
      [], // تَلينُ
      [], // جُلودُهُم
      [], // وَقُلوبُهُم
      [], // إِلىٰ
      [], // ذِكرِ
      [], // اللَّهِ
      [], // ذٰلِكَ
      [], // هُدَى
      [], // اللَّهِ
      [], // يَهدى
      [], // بِهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [] // هادٍ
    ],
    [ // آية 24
      [], // أَفَمَن
      [], // يَتَّقى
      [], // بِوَجهِهِ
      [], // سوءَ
      [], // العَذابِ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَقيلَ
      [], // لِلظّـٰلِمينَ
      [], // ذوقوا
      [], // ما
      [], // كُنتُم
      [] // تَكسِبونَ
    ],
    [ // آية 25
      [], // كَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَأَتىٰهُمُ
      [], // العَذابُ
      [], // مِن
      [], // حَيثُ
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 26
      [], // فَأَذاقَهُمُ
      [], // اللَّهُ
      [], // الخِزىَ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَلَعَذابُ
      [], // الـٔاخِرَةِ
      [], // أَكبَرُ
      [], // لَو
      [], // كانوا
      [] // يَعلَمونَ
    ],
    [ // آية 27
      [], // وَلَقَد
      [], // ضَرَبنا
      [], // لِلنّاسِ
      [], // فى
      [], // هـٰذَا
      [], // القُرءانِ
      [], // مِن
      [], // كُلِّ
      [], // مَثَلٍ
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 28
      [], // قُرءانًا
      [], // عَرَبِيًّا
      [], // غَيرَ
      [], // ذى
      [], // عِوَجٍ
      [], // لَعَلَّهُم
      [] // يَتَّقونَ
    ],
    [ // آية 29
      [], // ضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // رَجُلًا
      [], // فيهِ
      [], // شُرَكاءُ
      [], // مُتَشـٰكِسونَ
      [], // وَرَجُلًا
      [], // سَلَمًا
      [], // لِرَجُلٍ
      [], // هَل
      [], // يَستَوِيانِ
      [], // مَثَلًا
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // بَل
      [], // أَكثَرُهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 30
      [], // إِنَّكَ
      [], // مَيِّتٌ
      [], // وَإِنَّهُم
      [] // مَيِّتونَ
    ],
    [ // آية 31
      [], // ثُمَّ
      [], // إِنَّكُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // عِندَ
      [], // رَبِّكُم
      [] // تَختَصِمونَ
    ],
    [ // آية 32
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّن
      [], // كَذَبَ
      [], // عَلَى
      [], // اللَّهِ
      [], // وَكَذَّبَ
      [], // بِالصِّدقِ
      [], // إِذ
      [], // جاءَهُ
      [], // أَلَيسَ
      [], // فى
      [], // جَهَنَّمَ
      [], // مَثوًى
      [] // لِلكـٰفِرينَ
    ],
    [ // آية 33
      [], // وَالَّذى
      [], // جاءَ
      [], // بِالصِّدقِ
      [], // وَصَدَّقَ
      [], // بِهِ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // المُتَّقونَ
    ],
    [ // آية 34
      [], // لَهُم
      [], // ما
      [], // يَشاءونَ
      [], // عِندَ
      [], // رَبِّهِم
      [], // ذٰلِكَ
      [], // جَزاءُ
      [] // المُحسِنينَ
    ],
    [ // آية 35
      [], // لِيُكَفِّرَ
      [], // اللَّهُ
      [], // عَنهُم
      [], // أَسوَأَ
      [], // الَّذى
      [], // عَمِلوا
      [], // وَيَجزِيَهُم
      [], // أَجرَهُم
      [], // بِأَحسَنِ
      [], // الَّذى
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 36
      [], // أَلَيسَ
      [], // اللَّهُ
      [], // بِكافٍ
      [], // عَبدَهُ
      [], // وَيُخَوِّفونَكَ
      [], // بِالَّذينَ
      [], // مِن
      [], // دونِهِ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [] // هادٍ
    ],
    [ // آية 37
      [], // وَمَن
      [], // يَهدِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [], // مُضِلٍّ
      [], // أَلَيسَ
      [], // اللَّهُ
      [], // بِعَزيزٍ
      [], // ذِى
      [] // انتِقامٍ
    ],
    [ // آية 38
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // لَيَقولُنَّ
      [], // اللَّهُ
      [], // قُل
      [], // أَفَرَءَيتُم
      [], // ما
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // إِن
      [], // أَرادَنِىَ
      [], // اللَّهُ
      [], // بِضُرٍّ
      [], // هَل
      [], // هُنَّ
      [], // كـٰشِفـٰتُ
      [], // ضُرِّهِ
      [], // أَو
      [], // أَرادَنى
      [], // بِرَحمَةٍ
      [], // هَل
      [], // هُنَّ
      [], // مُمسِكـٰتُ
      [], // رَحمَتِهِ
      [], // قُل
      [], // حَسبِىَ
      [], // اللَّهُ
      [], // عَلَيهِ
      [], // يَتَوَكَّلُ
      [] // المُتَوَكِّلونَ
    ],
    [ // آية 39
      [], // قُل
      [], // يـٰقَومِ
      [], // اعمَلوا
      [], // عَلىٰ
      [], // مَكانَتِكُم
      [], // إِنّى
      [], // عـٰمِلٌ
      [], // فَسَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 40
      [], // مَن
      [], // يَأتيهِ
      [], // عَذابٌ
      [], // يُخزيهِ
      [], // وَيَحِلُّ
      [], // عَلَيهِ
      [], // عَذابٌ
      [] // مُقيمٌ
    ],
    [ // آية 41
      [], // إِنّا
      [], // أَنزَلنا
      [], // عَلَيكَ
      [], // الكِتـٰبَ
      [], // لِلنّاسِ
      [], // بِالحَقِّ
      [], // فَمَنِ
      [], // اهتَدىٰ
      [], // فَلِنَفسِهِ
      [], // وَمَن
      [], // ضَلَّ
      [], // فَإِنَّما
      [], // يَضِلُّ
      [], // عَلَيها
      [], // وَما
      [], // أَنتَ
      [], // عَلَيهِم
      [] // بِوَكيلٍ
    ],
    [ // آية 42
      [], // اللَّهُ
      [], // يَتَوَفَّى
      [], // الأَنفُسَ
      [], // حينَ
      [], // مَوتِها
      [], // وَالَّتى
      [], // لَم
      [], // تَمُت
      [], // فى
      [], // مَنامِها
      [], // فَيُمسِكُ
      [], // الَّتى
      [], // قَضىٰ
      [], // عَلَيهَا
      [], // المَوتَ
      [], // وَيُرسِلُ
      [], // الأُخرىٰ
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 43
      [], // أَمِ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // شُفَعاءَ
      [], // قُل
      [], // أَوَلَو
      [], // كانوا
      [], // لا
      [], // يَملِكونَ
      [], // شَيـًٔا
      [], // وَلا
      [] // يَعقِلونَ
    ],
    [ // آية 44
      [], // قُل
      [], // لِلَّهِ
      [], // الشَّفـٰعَةُ
      [], // جَميعًا
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // ثُمَّ
      [], // إِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 45
      [], // وَإِذا
      [], // ذُكِرَ
      [], // اللَّهُ
      [], // وَحدَهُ
      ["اشمأزّتْ : نـَـفَرتْ و انقبَضتْ عن التوحيد"], // اشمَأَزَّت
      [], // قُلوبُ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // وَإِذا
      [], // ذُكِرَ
      [], // الَّذينَ
      [], // مِن
      [], // دونِهِ
      [], // إِذا
      [], // هُم
      [] // يَستَبشِرونَ
    ],
    [ // آية 46
      [], // قُلِ
      [], // اللَّهُمَّ
      [], // فاطِرَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // عـٰلِمَ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // أَنتَ
      [], // تَحكُمُ
      [], // بَينَ
      [], // عِبادِكَ
      [], // فى
      [], // ما
      [], // كانوا
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 47
      [], // وَلَو
      [], // أَنَّ
      [], // لِلَّذينَ
      [], // ظَلَموا
      [], // ما
      [], // فِى
      [], // الأَرضِ
      [], // جَميعًا
      [], // وَمِثلَهُ
      [], // مَعَهُ
      [], // لَافتَدَوا
      [], // بِهِ
      [], // مِن
      [], // سوءِ
      [], // العَذابِ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَبَدا
      [], // لَهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لَم
      [], // يَكونوا
      [] // يَحتَسِبونَ
    ],
    [ // آية 48
      [], // وَبَدا
      [], // لَهُم
      [], // سَيِّـٔاتُ
      [], // ما
      [], // كَسَبوا
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 49
      [], // فَإِذا
      [], // مَسَّ
      [], // الإِنسـٰنَ
      [], // ضُرٌّ
      [], // دَعانا
      [], // ثُمَّ
      [], // إِذا
      [], // خَوَّلنـٰهُ
      [], // نِعمَةً
      [], // مِنّا
      [], // قالَ
      [], // إِنَّما
      [], // أوتيتُهُ
      [], // عَلىٰ
      [], // عِلمٍ
      [], // بَل
      [], // هِىَ
      [], // فِتنَةٌ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 50
      [], // قَد
      [], // قالَهَا
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَما
      [], // أَغنىٰ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 51
      [], // فَأَصابَهُم
      [], // سَيِّـٔاتُ
      [], // ما
      [], // كَسَبوا
      [], // وَالَّذينَ
      [], // ظَلَموا
      [], // مِن
      [], // هـٰؤُلاءِ
      [], // سَيُصيبُهُم
      [], // سَيِّـٔاتُ
      [], // ما
      [], // كَسَبوا
      [], // وَما
      [], // هُم
      ["بمعجزين : بفائتين من العَذاب بالهَرَب"] // بِمُعجِزينَ
    ],
    [ // آية 52
      [], // أَوَلَم
      [], // يَعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيَقدِرُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 53
      [], // قُل
      [], // يـٰعِبادِىَ
      [], // الَّذينَ
      ["أسْرَفوا : تجاوَزوا الحدّ في المعاصي"], // أَسرَفوا
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // لا
      [], // تَقنَطوا
      [], // مِن
      [], // رَحمَةِ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَغفِرُ
      ["الذنوب جَميعا : إلاّ الشّرك"], // الذُّنوبَ
      ["الذنوب جَميعا : إلاّ الشّرك"], // جَميعًا
      [], // إِنَّهُ
      [], // هُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 54
      [], // وَأَنيبوا
      [], // إِلىٰ
      [], // رَبِّكُم
      [], // وَأَسلِموا
      [], // لَهُ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِيَكُمُ
      [], // العَذابُ
      [], // ثُمَّ
      [], // لا
      [] // تُنصَرونَ
    ],
    [ // آية 55
      [], // وَاتَّبِعوا
      [], // أَحسَنَ
      [], // ما
      [], // أُنزِلَ
      [], // إِلَيكُم
      [], // مِن
      [], // رَبِّكُم
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِيَكُمُ
      [], // العَذابُ
      ["بَغتة : فجْـأة"], // بَغتَةً
      [], // وَأَنتُم
      [], // لا
      [] // تَشعُرونَ
    ],
    [ // آية 56
      [], // أَن
      [], // تَقولَ
      [], // نَفسٌ
      [], // يـٰحَسرَتىٰ
      [], // عَلىٰ
      [], // ما
      ["فرّطت : قصّرْت"], // فَرَّطتُ
      [], // فى
      [], // جَنبِ
      [], // اللَّهِ
      [], // وَإِن
      [], // كُنتُ
      [], // لَمِنَ
      [] // السّـٰخِرينَ
    ],
    [ // آية 57
      [], // أَو
      [], // تَقولَ
      [], // لَو
      [], // أَنَّ
      [], // اللَّهَ
      [], // هَدىٰنى
      [], // لَكُنتُ
      [], // مِنَ
      [] // المُتَّقينَ
    ],
    [ // آية 58
      [], // أَو
      [], // تَقولَ
      [], // حينَ
      [], // تَرَى
      [], // العَذابَ
      [], // لَو
      [], // أَنَّ
      [], // لى
      ["كَرّة : رَجْعة إلى الدنيا"], // كَرَّةً
      [], // فَأَكونَ
      [], // مِنَ
      [] // المُحسِنينَ
    ],
    [ // آية 59
      [], // بَلىٰ
      [], // قَد
      [], // جاءَتكَ
      [], // ءايـٰتى
      [], // فَكَذَّبتَ
      [], // بِها
      [], // وَاستَكبَرتَ
      [], // وَكُنتَ
      [], // مِنَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 60
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // تَرَى
      [], // الَّذينَ
      [], // كَذَبوا
      [], // عَلَى
      [], // اللَّهِ
      [], // وُجوهُهُم
      [], // مُسوَدَّةٌ
      [], // أَلَيسَ
      [], // فى
      [], // جَهَنَّمَ
      ["مَثوًى للمتكبّرين : مَأوًى و مُقامٌ لهم"], // مَثوًى
      ["مَثوًى للمتكبّرين : مَأوًى و مُقامٌ لهم"] // لِلمُتَكَبِّرينَ
    ],
    [ // آية 61
      [], // وَيُنَجِّى
      [], // اللَّهُ
      [], // الَّذينَ
      [], // اتَّقَوا
      ["بمفازتهمْ : بفوْزهم و ظفرهِمْ بالبغيَة"], // بِمَفازَتِهِم
      [], // لا
      [], // يَمَسُّهُمُ
      [], // السّوءُ
      [], // وَلا
      [], // هُم
      [] // يَحزَنونَ
    ],
    [ // آية 62
      [], // اللَّهُ
      [], // خـٰلِقُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // وَكيلٌ
    ],
    [ // آية 63
      [], // لَهُ
      [], // مَقاليدُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 64
      [], // قُل
      [], // أَفَغَيرَ
      [], // اللَّهِ
      [], // تَأمُرونّى
      [], // أَعبُدُ
      [], // أَيُّهَا
      [] // الجـٰهِلونَ
    ],
    [ // آية 65
      [], // وَلَقَد
      [], // أوحِىَ
      [], // إِلَيكَ
      [], // وَإِلَى
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِكَ
      [], // لَئِن
      [], // أَشرَكتَ
      [], // لَيَحبَطَنَّ
      [], // عَمَلُكَ
      [], // وَلَتَكونَنَّ
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 66
      [], // بَلِ
      [], // اللَّهَ
      [], // فَاعبُد
      [], // وَكُن
      [], // مِنَ
      [] // الشّـٰكِرينَ
    ],
    [ // آية 67
      [], // وَما
      [], // قَدَرُوا
      [], // اللَّهَ
      [], // حَقَّ
      [], // قَدرِهِ
      [], // وَالأَرضُ
      [], // جَميعًا
      ["قبْضته : مِلكه و في مَقدوره و تصرّفه"], // قَبضَتُهُ
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَالسَّمـٰوٰتُ
      [], // مَطوِيّـٰتٌ
      [], // بِيَمينِهِ
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 68
      [], // وَنُفِخَ
      [], // فِى
      ["الصّور : القرن الذي يَنفخ فيه إسرافيل"], // الصّورِ
      [], // فَصَعِقَ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // إِلّا
      [], // مَن
      [], // شاءَ
      [], // اللَّهُ
      [], // ثُمَّ
      [], // نُفِخَ
      [], // فيهِ
      [], // أُخرىٰ
      [], // فَإِذا
      [], // هُم
      [], // قِيامٌ
      [] // يَنظُرونَ
    ],
    [ // آية 69
      [], // وَأَشرَقَتِ
      [], // الأَرضُ
      [], // بِنورِ
      [], // رَبِّها
      [], // وَوُضِعَ
      [], // الكِتـٰبُ
      [], // وَجِا۟ىءَ
      [], // بِالنَّبِيّـۧنَ
      [], // وَالشُّهَداءِ
      [], // وَقُضِىَ
      [], // بَينَهُم
      [], // بِالحَقِّ
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 70
      [], // وَوُفِّيَت
      [], // كُلُّ
      [], // نَفسٍ
      [], // ما
      [], // عَمِلَت
      [], // وَهُوَ
      [], // أَعلَمُ
      [], // بِما
      [] // يَفعَلونَ
    ],
    [ // آية 71
      [], // وَسيقَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِلىٰ
      [], // جَهَنَّمَ
      ["زمرًا : جَمَاعات متفرقة متتابعة"], // زُمَرًا
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءوها
      [], // فُتِحَت
      [], // أَبوٰبُها
      [], // وَقالَ
      [], // لَهُم
      [], // خَزَنَتُها
      [], // أَلَم
      [], // يَأتِكُم
      [], // رُسُلٌ
      [], // مِنكُم
      [], // يَتلونَ
      [], // عَلَيكُم
      [], // ءايـٰتِ
      [], // رَبِّكُم
      [], // وَيُنذِرونَكُم
      [], // لِقاءَ
      [], // يَومِكُم
      [], // هـٰذا
      [], // قالوا
      [], // بَلىٰ
      [], // وَلـٰكِن
      [], // حَقَّت
      [], // كَلِمَةُ
      [], // العَذابِ
      [], // عَلَى
      [] // الكـٰفِرينَ
    ],
    [ // آية 72
      [], // قيلَ
      [], // ادخُلوا
      [], // أَبوٰبَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // فَبِئسَ
      [], // مَثوَى
      [] // المُتَكَبِّرينَ
    ],
    [ // آية 73
      [], // وَسيقَ
      [], // الَّذينَ
      [], // اتَّقَوا
      [], // رَبَّهُم
      [], // إِلَى
      [], // الجَنَّةِ
      [], // زُمَرًا
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءوها
      [], // وَفُتِحَت
      [], // أَبوٰبُها
      [], // وَقالَ
      [], // لَهُم
      [], // خَزَنَتُها
      [], // سَلـٰمٌ
      [], // عَلَيكُم
      [], // طِبتُم
      [], // فَادخُلوها
      [] // خـٰلِدينَ
    ],
    [ // آية 74
      [], // وَقالُوا
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // صَدَقَنا
      [], // وَعدَهُ
      [], // وَأَورَثَنَا
      [], // الأَرضَ
      ["نتبوأ : ننزل"], // نَتَبَوَّأُ
      [], // مِنَ
      [], // الجَنَّةِ
      [], // حَيثُ
      [], // نَشاءُ
      [], // فَنِعمَ
      [], // أَجرُ
      [] // العـٰمِلينَ
    ],
    [ // آية 75
      [], // وَتَرَى
      [], // المَلـٰئِكَةَ
      [], // حافّينَ
      [], // مِن
      [], // حَولِ
      [], // العَرشِ
      [], // يُسَبِّحونَ
      [], // بِحَمدِ
      [], // رَبِّهِم
      [], // وَقُضِىَ
      [], // بَينَهُم
      [], // بِالحَقِّ
      [], // وَقيلَ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ]
];

export default meanings;