const meanings = [
[ // آية 1
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // اتَّقوا
      [], // رَبَّكُمُ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // مِن
      [], // نَفسٍ
      [], // وٰحِدَةٍ
      [], // وَخَلَقَ
      [], // مِنها
      [], // زَوجَها
      [], // وَبَثَّ
      [], // مِنهُما
      [], // رِجالًا
      [], // كَثيرًا
      [], // وَنِساءً
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // الَّذى
      [], // تَساءَلونَ
      [], // بِهِ
      [], // وَالأَرحامَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَلَيكُم
      ["رقيباً : مُطّلعًا. أو حافظا لأعمالكم"] // رَقيبًا
    ],
    [ // آية 2
      [], // وَءاتُوا
      [], // اليَتـٰمىٰ
      [], // أَموٰلَهُم
      [], // وَلا
      [], // تَتَبَدَّلُوا
      [], // الخَبيثَ
      [], // بِالطَّيِّبِ
      [], // وَلا
      [], // تَأكُلوا
      [], // أَموٰلَهُم
      [], // إِلىٰ
      [], // أَموٰلِكُم
      [], // إِنَّهُ
      [], // كانَ
      ["حُوبًا كبيرًا : إثما أو ذنبا أو ظلما- عظيمًا"], // حوبًا
      ["حُوبًا كبيرًا : إثما أو ذنبا أو ظلما- عظيمًا"] // كَبيرًا
    ],
    [ // آية 3
      [], // وَإِن
      [], // خِفتُم
      ["ألاّ تُقسطوا : أن تعدلوا و لا تُنصفوا"], // أَلّا
      ["ألاّ تُقسطوا : أن تعدلوا و لا تُنصفوا"], // تُقسِطوا
      [], // فِى
      [], // اليَتـٰمىٰ
      [], // فَانكِحوا
      ["ما طاب لكم : ما حلّ لكم"], // ما
      ["ما طاب لكم : ما حلّ لكم"], // طابَ
      ["ما طاب لكم : ما حلّ لكم"], // لَكُم
      [], // مِنَ
      [], // النِّساءِ
      [], // مَثنىٰ
      [], // وَثُلـٰثَ
      [], // وَرُبـٰعَ
      [], // فَإِن
      [], // خِفتُم
      [], // أَلّا
      [], // تَعدِلوا
      [], // فَوٰحِدَةً
      [], // أَو
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      ["ذلك أدنى ألاّ تعولوا : ذلك أقرب إن لا تجوروا، أو أنْ لا تكثُر عيالكم"], // ذٰلِكَ
      ["ذلك أدنى ألاّ تعولوا : ذلك أقرب إن لا تجوروا، أو أنْ لا تكثُر عيالكم"], // أَدنىٰ
      ["ألاّ تعولوا : في النَّفقة و سائر الحقوق"], // أَلّا
      ["ألاّ تعولوا : في النَّفقة و سائر الحقوق"] // تَعولوا
    ],
    [ // آية 4
      [], // وَءاتُوا
      [], // النِّساءَ
      [], // صَدُقـٰتِهِنَّ
      ["نِحْلة : فريضةً أو عطيّة بطيب نفس"], // نِحلَةً
      [], // فَإِن
      [], // طِبنَ
      [], // لَكُم
      [], // عَن
      [], // شَىءٍ
      [], // مِنهُ
      [], // نَفسًا
      [], // فَكُلوهُ
      [], // هَنيـًٔا
      [] // مَريـًٔا
    ],
    [ // آية 5
      [], // وَلا
      [], // تُؤتُوا
      [], // السُّفَهاءَ
      [], // أَموٰلَكُمُ
      [], // الَّتى
      [], // جَعَلَ
      [], // اللَّهُ
      [], // لَكُم
      [], // قِيـٰمًا
      [], // وَارزُقوهُم
      [], // فيها
      [], // وَاكسوهُم
      [], // وَقولوا
      [], // لَهُم
      [], // قَولًا
      [] // مَعروفًا
    ],
    [ // آية 6
      [], // وَابتَلُوا
      [], // اليَتـٰمىٰ
      [], // حَتّىٰ
      [], // إِذا
      [], // بَلَغُوا
      [], // النِّكاحَ
      [], // فَإِن
      [], // ءانَستُم
      [], // مِنهُم
      ["رُشدا : اهتداءً لِحُسن التّصرف في الأموال"], // رُشدًا
      [], // فَادفَعوا
      [], // إِلَيهِم
      [], // أَموٰلَهُم
      [], // وَلا
      [], // تَأكُلوها
      [], // إِسرافًا
      [], // وَبِدارًا
      [], // أَن
      [], // يَكبَروا
      [], // وَمَن
      [], // كانَ
      [], // غَنِيًّا
      [], // فَليَستَعفِف
      [], // وَمَن
      [], // كانَ
      [], // فَقيرًا
      [], // فَليَأكُل
      [], // بِالمَعروفِ
      [], // فَإِذا
      [], // دَفَعتُم
      [], // إِلَيهِم
      [], // أَموٰلَهُم
      [], // فَأَشهِدوا
      [], // عَلَيهِم
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      ["حسيبًا : مُحاسبا لكم أو شهيدا"] // حَسيبًا
    ],
    [ // آية 7
      [], // لِلرِّجالِ
      [], // نَصيبٌ
      [], // مِمّا
      [], // تَرَكَ
      [], // الوٰلِدانِ
      [], // وَالأَقرَبونَ
      [], // وَلِلنِّساءِ
      [], // نَصيبٌ
      [], // مِمّا
      [], // تَرَكَ
      [], // الوٰلِدانِ
      [], // وَالأَقرَبونَ
      [], // مِمّا
      [], // قَلَّ
      [], // مِنهُ
      [], // أَو
      [], // كَثُرَ
      [], // نَصيبًا
      [] // مَفروضًا
    ],
    [ // آية 8
      [], // وَإِذا
      [], // حَضَرَ
      [], // القِسمَةَ
      [], // أُولُوا
      [], // القُربىٰ
      [], // وَاليَتـٰمىٰ
      [], // وَالمَسـٰكينُ
      [], // فَارزُقوهُم
      [], // مِنهُ
      [], // وَقولوا
      [], // لَهُم
      [], // قَولًا
      [] // مَعروفًا
    ],
    [ // آية 9
      [], // وَليَخشَ
      [], // الَّذينَ
      [], // لَو
      [], // تَرَكوا
      [], // مِن
      [], // خَلفِهِم
      [], // ذُرِّيَّةً
      [], // ضِعـٰفًا
      [], // خافوا
      [], // عَلَيهِم
      [], // فَليَتَّقُوا
      [], // اللَّهَ
      [], // وَليَقولوا
      ["قولاً سديدا : جميلاً . أو صوابًا و عدْلاً"], // قَولًا
      ["قولاً سديدا : جميلاً . أو صوابًا و عدْلاً"] // سَديدًا
    ],
    [ // آية 10
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَأكُلونَ
      [], // أَموٰلَ
      [], // اليَتـٰمىٰ
      [], // ظُلمًا
      [], // إِنَّما
      [], // يَأكُلونَ
      [], // فى
      [], // بُطونِهِم
      [], // نارًا
      [], // وَسَيَصلَونَ
      [] // سَعيرًا
    ],
    [ // آية 11
      ["يوصيكم الله : يأمركم و يفرض عليكم"], // يوصيكُمُ
      ["يوصيكم الله : يأمركم و يفرض عليكم"], // اللَّهُ
      [], // فى
      [], // أَولـٰدِكُم
      [], // لِلذَّكَرِ
      [], // مِثلُ
      [], // حَظِّ
      [], // الأُنثَيَينِ
      [], // فَإِن
      [], // كُنَّ
      [], // نِساءً
      [], // فَوقَ
      [], // اثنَتَينِ
      [], // فَلَهُنَّ
      [], // ثُلُثا
      [], // ما
      [], // تَرَكَ
      [], // وَإِن
      [], // كانَت
      [], // وٰحِدَةً
      [], // فَلَهَا
      [], // النِّصفُ
      [], // وَلِأَبَوَيهِ
      [], // لِكُلِّ
      [], // وٰحِدٍ
      [], // مِنهُمَا
      [], // السُّدُسُ
      [], // مِمّا
      [], // تَرَكَ
      [], // إِن
      [], // كانَ
      [], // لَهُ
      [], // وَلَدٌ
      [], // فَإِن
      [], // لَم
      [], // يَكُن
      [], // لَهُ
      [], // وَلَدٌ
      [], // وَوَرِثَهُ
      [], // أَبَواهُ
      [], // فَلِأُمِّهِ
      [], // الثُّلُثُ
      [], // فَإِن
      [], // كانَ
      [], // لَهُ
      [], // إِخوَةٌ
      [], // فَلِأُمِّهِ
      [], // السُّدُسُ
      [], // مِن
      [], // بَعدِ
      [], // وَصِيَّةٍ
      [], // يوصى
      [], // بِها
      [], // أَو
      [], // دَينٍ
      [], // ءاباؤُكُم
      [], // وَأَبناؤُكُم
      [], // لا
      [], // تَدرونَ
      [], // أَيُّهُم
      [], // أَقرَبُ
      [], // لَكُم
      [], // نَفعًا
      [], // فَريضَةً
      [], // مِنَ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 12
      [], // وَلَكُم
      [], // نِصفُ
      [], // ما
      [], // تَرَكَ
      [], // أَزوٰجُكُم
      [], // إِن
      [], // لَم
      [], // يَكُن
      [], // لَهُنَّ
      [], // وَلَدٌ
      [], // فَإِن
      [], // كانَ
      [], // لَهُنَّ
      [], // وَلَدٌ
      [], // فَلَكُمُ
      [], // الرُّبُعُ
      [], // مِمّا
      [], // تَرَكنَ
      [], // مِن
      [], // بَعدِ
      [], // وَصِيَّةٍ
      [], // يوصينَ
      [], // بِها
      [], // أَو
      [], // دَينٍ
      [], // وَلَهُنَّ
      [], // الرُّبُعُ
      [], // مِمّا
      [], // تَرَكتُم
      [], // إِن
      [], // لَم
      [], // يَكُن
      [], // لَكُم
      [], // وَلَدٌ
      [], // فَإِن
      [], // كانَ
      [], // لَكُم
      [], // وَلَدٌ
      [], // فَلَهُنَّ
      [], // الثُّمُنُ
      [], // مِمّا
      [], // تَرَكتُم
      [], // مِن
      [], // بَعدِ
      [], // وَصِيَّةٍ
      [], // توصونَ
      [], // بِها
      [], // أَو
      [], // دَينٍ
      [], // وَإِن
      [], // كانَ
      [], // رَجُلٌ
      [], // يورَثُ
      [], // كَلـٰلَةً
      [], // أَوِ
      [], // امرَأَةٌ
      [], // وَلَهُ
      [], // أَخٌ
      [], // أَو
      [], // أُختٌ
      [], // فَلِكُلِّ
      [], // وٰحِدٍ
      [], // مِنهُمَا
      [], // السُّدُسُ
      [], // فَإِن
      [], // كانوا
      [], // أَكثَرَ
      [], // مِن
      [], // ذٰلِكَ
      [], // فَهُم
      [], // شُرَكاءُ
      [], // فِى
      [], // الثُّلُثِ
      [], // مِن
      [], // بَعدِ
      [], // وَصِيَّةٍ
      [], // يوصىٰ
      [], // بِها
      [], // أَو
      [], // دَينٍ
      [], // غَيرَ
      [], // مُضارٍّ
      [], // وَصِيَّةً
      [], // مِنَ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَليمٌ
    ],
    [ // آية 13
      [], // تِلكَ
      ["حُدودُ الله : شرائعه و أحكامه المفروضة"], // حُدودُ
      ["حُدودُ الله : شرائعه و أحكامه المفروضة"], // اللَّهِ
      [], // وَمَن
      [], // يُطِعِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // يُدخِلهُ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَذٰلِكَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 14
      [], // وَمَن
      [], // يَعصِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَيَتَعَدَّ
      [], // حُدودَهُ
      [], // يُدخِلهُ
      [], // نارًا
      [], // خـٰلِدًا
      [], // فيها
      [], // وَلَهُ
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 15
      [], // وَالّـٰتى
      [], // يَأتينَ
      [], // الفـٰحِشَةَ
      [], // مِن
      [], // نِسائِكُم
      [], // فَاستَشهِدوا
      [], // عَلَيهِنَّ
      [], // أَربَعَةً
      [], // مِنكُم
      [], // فَإِن
      [], // شَهِدوا
      [], // فَأَمسِكوهُنَّ
      [], // فِى
      [], // البُيوتِ
      [], // حَتّىٰ
      [], // يَتَوَفّىٰهُنَّ
      [], // المَوتُ
      [], // أَو
      [], // يَجعَلَ
      [], // اللَّهُ
      [], // لَهُنَّ
      [] // سَبيلًا
    ],
    [ // آية 16
      [], // وَالَّذانِ
      [], // يَأتِيـٰنِها
      [], // مِنكُم
      [], // فَـٔاذوهُما
      [], // فَإِن
      [], // تابا
      [], // وَأَصلَحا
      [], // فَأَعرِضوا
      [], // عَنهُما
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // تَوّابًا
      [] // رَحيمًا
    ],
    [ // آية 17
      [], // إِنَّمَا
      [], // التَّوبَةُ
      [], // عَلَى
      [], // اللَّهِ
      [], // لِلَّذينَ
      [], // يَعمَلونَ
      [], // السّوءَ
      [], // بِجَهـٰلَةٍ
      [], // ثُمَّ
      [], // يَتوبونَ
      [], // مِن
      [], // قَريبٍ
      [], // فَأُولـٰئِكَ
      [], // يَتوبُ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 18
      [], // وَلَيسَتِ
      [], // التَّوبَةُ
      [], // لِلَّذينَ
      [], // يَعمَلونَ
      [], // السَّيِّـٔاتِ
      [], // حَتّىٰ
      [], // إِذا
      [], // حَضَرَ
      [], // أَحَدَهُمُ
      [], // المَوتُ
      [], // قالَ
      [], // إِنّى
      [], // تُبتُ
      [], // الـٔـٰنَ
      [], // وَلَا
      [], // الَّذينَ
      [], // يَموتونَ
      [], // وَهُم
      [], // كُفّارٌ
      [], // أُولـٰئِكَ
      [], // أَعتَدنا
      [], // لَهُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 19
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // يَحِلُّ
      [], // لَكُم
      [], // أَن
      [], // تَرِثُوا
      [], // النِّساءَ
      ["كرهًا : مكروهين لهنّ أو مكروهات عليه"], // كَرهًا
      [], // وَلا
      [], // تَعضُلوهُنَّ
      [], // لِتَذهَبوا
      [], // بِبَعضِ
      [], // ما
      [], // ءاتَيتُموهُنَّ
      [], // إِلّا
      [], // أَن
      [], // يَأتينَ
      [], // بِفـٰحِشَةٍ
      [], // مُبَيِّنَةٍ
      [], // وَعاشِروهُنَّ
      [], // بِالمَعروفِ
      [], // فَإِن
      [], // كَرِهتُموهُنَّ
      [], // فَعَسىٰ
      [], // أَن
      [], // تَكرَهوا
      [], // شَيـًٔا
      [], // وَيَجعَلَ
      [], // اللَّهُ
      [], // فيهِ
      [], // خَيرًا
      [] // كَثيرًا
    ],
    [ // آية 20
      [], // وَإِن
      [], // أَرَدتُمُ
      [], // استِبدالَ
      [], // زَوجٍ
      [], // مَكانَ
      [], // زَوجٍ
      [], // وَءاتَيتُم
      [], // إِحدىٰهُنَّ
      [], // قِنطارًا
      [], // فَلا
      [], // تَأخُذوا
      [], // مِنهُ
      [], // شَيـًٔا
      [], // أَتَأخُذونَهُ
      [], // بُهتـٰنًا
      [], // وَإِثمًا
      [] // مُبينًا
    ],
    [ // آية 21
      [], // وَكَيفَ
      [], // تَأخُذونَهُ
      [], // وَقَد
      [], // أَفضىٰ
      [], // بَعضُكُم
      [], // إِلىٰ
      [], // بَعضٍ
      [], // وَأَخَذنَ
      [], // مِنكُم
      [], // ميثـٰقًا
      [] // غَليظًا
    ],
    [ // آية 22
      [], // وَلا
      [], // تَنكِحوا
      [], // ما
      [], // نَكَحَ
      [], // ءاباؤُكُم
      [], // مِنَ
      [], // النِّساءِ
      [], // إِلّا
      [], // ما
      [], // قَد
      [], // سَلَفَ
      [], // إِنَّهُ
      [], // كانَ
      [], // فـٰحِشَةً
      [], // وَمَقتًا
      [], // وَساءَ
      [] // سَبيلًا
    ],
    [ // آية 23
      [], // حُرِّمَت
      [], // عَلَيكُم
      [], // أُمَّهـٰتُكُم
      [], // وَبَناتُكُم
      [], // وَأَخَوٰتُكُم
      [], // وَعَمّـٰتُكُم
      [], // وَخـٰلـٰتُكُم
      [], // وَبَناتُ
      [], // الأَخِ
      [], // وَبَناتُ
      [], // الأُختِ
      [], // وَأُمَّهـٰتُكُمُ
      [], // الّـٰتى
      [], // أَرضَعنَكُم
      [], // وَأَخَوٰتُكُم
      [], // مِنَ
      [], // الرَّضـٰعَةِ
      [], // وَأُمَّهـٰتُ
      [], // نِسائِكُم
      [], // وَرَبـٰئِبُكُمُ
      [], // الّـٰتى
      [], // فى
      [], // حُجورِكُم
      [], // مِن
      [], // نِسائِكُمُ
      [], // الّـٰتى
      [], // دَخَلتُم
      [], // بِهِنَّ
      [], // فَإِن
      [], // لَم
      [], // تَكونوا
      [], // دَخَلتُم
      [], // بِهِنَّ
      ["فلا جُناح عليكم : فلا إثم عليكم"], // فَلا
      ["فلا جُناح عليكم : فلا إثم عليكم"], // جُناحَ
      ["فلا جُناح عليكم : فلا إثم عليكم"], // عَلَيكُم
      [], // وَحَلـٰئِلُ
      [], // أَبنائِكُمُ
      [], // الَّذينَ
      [], // مِن
      [], // أَصلـٰبِكُم
      [], // وَأَن
      [], // تَجمَعوا
      [], // بَينَ
      [], // الأُختَينِ
      [], // إِلّا
      [], // ما
      [], // قَد
      [], // سَلَفَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 24
      [], // وَالمُحصَنـٰتُ
      [], // مِنَ
      [], // النِّساءِ
      [], // إِلّا
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // كِتـٰبَ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَأُحِلَّ
      [], // لَكُم
      [], // ما
      [], // وَراءَ
      [], // ذٰلِكُم
      [], // أَن
      [], // تَبتَغوا
      [], // بِأَموٰلِكُم
      [], // مُحصِنينَ
      [], // غَيرَ
      [], // مُسـٰفِحينَ
      [], // فَمَا
      [], // استَمتَعتُم
      [], // بِهِ
      [], // مِنهُنَّ
      [], // فَـٔاتوهُنَّ
      ["أجورهنّ : مهورهنّ"], // أُجورَهُنَّ
      [], // فَريضَةً
      [], // وَلا
      [], // جُناحَ
      [], // عَلَيكُم
      [], // فيما
      [], // تَرٰضَيتُم
      [], // بِهِ
      [], // مِن
      [], // بَعدِ
      [], // الفَريضَةِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 25
      [], // وَمَن
      [], // لَم
      [], // يَستَطِع
      [], // مِنكُم
      ["طَوْلاً : غِنًى و سعَةً"], // طَولًا
      [], // أَن
      [], // يَنكِحَ
      [], // المُحصَنـٰتِ
      [], // المُؤمِنـٰتِ
      [], // فَمِن
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // مِن
      [], // فَتَيـٰتِكُمُ
      [], // المُؤمِنـٰتِ
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [], // بِإيمـٰنِكُم
      [], // بَعضُكُم
      [], // مِن
      [], // بَعضٍ
      [], // فَانكِحوهُنَّ
      [], // بِإِذنِ
      [], // أَهلِهِنَّ
      [], // وَءاتوهُنَّ
      [], // أُجورَهُنَّ
      [], // بِالمَعروفِ
      [], // مُحصَنـٰتٍ
      [], // غَيرَ
      [], // مُسـٰفِحـٰتٍ
      [], // وَلا
      [], // مُتَّخِذٰتِ
      [], // أَخدانٍ
      [], // فَإِذا
      [], // أُحصِنَّ
      [], // فَإِن
      [], // أَتَينَ
      [], // بِفـٰحِشَةٍ
      [], // فَعَلَيهِنَّ
      [], // نِصفُ
      [], // ما
      [], // عَلَى
      [], // المُحصَنـٰتِ
      [], // مِنَ
      [], // العَذابِ
      [], // ذٰلِكَ
      [], // لِمَن
      [], // خَشِىَ
      [], // العَنَتَ
      [], // مِنكُم
      [], // وَأَن
      [], // تَصبِروا
      [], // خَيرٌ
      [], // لَكُم
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 26
      [], // يُريدُ
      [], // اللَّهُ
      [], // لِيُبَيِّنَ
      [], // لَكُم
      [], // وَيَهدِيَكُم
      [], // سُنَنَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِكُم
      [], // وَيَتوبَ
      [], // عَلَيكُم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 27
      [], // وَاللَّهُ
      [], // يُريدُ
      [], // أَن
      [], // يَتوبَ
      [], // عَلَيكُم
      [], // وَيُريدُ
      [], // الَّذينَ
      [], // يَتَّبِعونَ
      [], // الشَّهَوٰتِ
      [], // أَن
      [], // تَميلوا
      [], // مَيلًا
      [] // عَظيمًا
    ],
    [ // آية 28
      [], // يُريدُ
      [], // اللَّهُ
      [], // أَن
      [], // يُخَفِّفَ
      [], // عَنكُم
      [], // وَخُلِقَ
      [], // الإِنسـٰنُ
      [] // ضَعيفًا
    ],
    [ // آية 29
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَأكُلوا
      [], // أَموٰلَكُم
      [], // بَينَكُم
      [], // بِالبـٰطِلِ
      [], // إِلّا
      [], // أَن
      [], // تَكونَ
      [], // تِجـٰرَةً
      [], // عَن
      [], // تَراضٍ
      [], // مِنكُم
      [], // وَلا
      [], // تَقتُلوا
      [], // أَنفُسَكُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِكُم
      [] // رَحيمًا
    ],
    [ // آية 30
      [], // وَمَن
      [], // يَفعَل
      [], // ذٰلِكَ
      [], // عُدوٰنًا
      [], // وَظُلمًا
      [], // فَسَوفَ
      ["نُصليه نارًا : نُدخله إيّاها و نَحرِقُه بها"], // نُصليهِ
      ["نُصليه نارًا : نُدخله إيّاها و نَحرِقُه بها"], // نارًا
      [], // وَكانَ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرًا
    ],
    [ // آية 31
      [], // إِن
      [], // تَجتَنِبوا
      [], // كَبائِرَ
      [], // ما
      [], // تُنهَونَ
      [], // عَنهُ
      [], // نُكَفِّر
      [], // عَنكُم
      [], // سَيِّـٔاتِكُم
      [], // وَنُدخِلكُم
      ["مُدْخلاً كريمًا : مكانًا حسنًا شريفًا و هو الجنَّة"], // مُدخَلًا
      ["مُدْخلاً كريمًا : مكانًا حسنًا شريفًا و هو الجنَّة"] // كَريمًا
    ],
    [ // آية 32
      [], // وَلا
      [], // تَتَمَنَّوا
      [], // ما
      [], // فَضَّلَ
      [], // اللَّهُ
      [], // بِهِ
      [], // بَعضَكُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // لِلرِّجالِ
      [], // نَصيبٌ
      [], // مِمَّا
      [], // اكتَسَبوا
      [], // وَلِلنِّساءِ
      [], // نَصيبٌ
      [], // مِمَّا
      [], // اكتَسَبنَ
      [], // وَسـَٔلُوا
      [], // اللَّهَ
      [], // مِن
      [], // فَضلِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمًا
    ],
    [ // آية 33
      [], // وَلِكُلٍّ
      [], // جَعَلنا
      [], // مَوٰلِىَ
      [], // مِمّا
      [], // تَرَكَ
      [], // الوٰلِدانِ
      [], // وَالأَقرَبونَ
      [], // وَالَّذينَ
      [], // عَقَدَت
      [], // أَيمـٰنُكُم
      [], // فَـٔاتوهُم
      [], // نَصيبَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدًا
    ],
    [ // آية 34
      [], // الرِّجالُ
      [], // قَوّٰمونَ
      [], // عَلَى
      [], // النِّساءِ
      [], // بِما
      [], // فَضَّلَ
      [], // اللَّهُ
      [], // بَعضَهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [], // وَبِما
      [], // أَنفَقوا
      [], // مِن
      [], // أَموٰلِهِم
      [], // فَالصّـٰلِحـٰتُ
      [], // قـٰنِتـٰتٌ
      [], // حـٰفِظـٰتٌ
      [], // لِلغَيبِ
      ["بما حفظ الله : لهن من حقوقهنّ على أزواجهنّ"], // بِما
      ["بما حفظ الله : لهن من حقوقهنّ على أزواجهنّ"], // حَفِظَ
      ["بما حفظ الله : لهن من حقوقهنّ على أزواجهنّ"], // اللَّهُ
      [], // وَالّـٰتى
      [], // تَخافونَ
      ["نشوزهنّ : ترفعهنّ عن مطاوعتكم"], // نُشوزَهُنَّ
      [], // فَعِظوهُنَّ
      [], // وَاهجُروهُنَّ
      [], // فِى
      [], // المَضاجِعِ
      [], // وَاضرِبوهُنَّ
      [], // فَإِن
      [], // أَطَعنَكُم
      [], // فَلا
      [], // تَبغوا
      [], // عَلَيهِنَّ
      [], // سَبيلًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَلِيًّا
      [] // كَبيرًا
    ],
    [ // آية 35
      [], // وَإِن
      [], // خِفتُم
      [], // شِقاقَ
      [], // بَينِهِما
      [], // فَابعَثوا
      [], // حَكَمًا
      [], // مِن
      [], // أَهلِهِ
      [], // وَحَكَمًا
      [], // مِن
      [], // أَهلِها
      [], // إِن
      [], // يُريدا
      [], // إِصلـٰحًا
      [], // يُوَفِّقِ
      [], // اللَّهُ
      [], // بَينَهُما
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَليمًا
      [] // خَبيرًا
    ],
    [ // آية 36
      [], // وَاعبُدُوا
      [], // اللَّهَ
      [], // وَلا
      [], // تُشرِكوا
      [], // بِهِ
      [], // شَيـًٔا
      [], // وَبِالوٰلِدَينِ
      [], // إِحسـٰنًا
      [], // وَبِذِى
      [], // القُربىٰ
      [], // وَاليَتـٰمىٰ
      [], // وَالمَسـٰكينِ
      [], // وَالجارِ
      [], // ذِى
      [], // القُربىٰ
      [], // وَالجارِ
      [], // الجُنُبِ
      [], // وَالصّاحِبِ
      [], // بِالجَنبِ
      [], // وَابنِ
      [], // السَّبيلِ
      [], // وَما
      [], // مَلَكَت
      [], // أَيمـٰنُكُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [], // مَن
      [], // كانَ
      [], // مُختالًا
      [] // فَخورًا
    ],
    [ // آية 37
      [], // الَّذينَ
      [], // يَبخَلونَ
      [], // وَيَأمُرونَ
      [], // النّاسَ
      [], // بِالبُخلِ
      [], // وَيَكتُمونَ
      [], // ما
      [], // ءاتىٰهُمُ
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // وَأَعتَدنا
      [], // لِلكـٰفِرينَ
      [], // عَذابًا
      [] // مُهينًا
    ],
    [ // آية 38
      [], // وَالَّذينَ
      [], // يُنفِقونَ
      [], // أَموٰلَهُم
      ["رِئاء النّاس : مُراءةً لهم و سُمعة لا لِوجه الله"], // رِئاءَ
      ["رِئاء النّاس : مُراءةً لهم و سُمعة لا لِوجه الله"], // النّاسِ
      [], // وَلا
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَلا
      [], // بِاليَومِ
      [], // الـٔاخِرِ
      [], // وَمَن
      [], // يَكُنِ
      [], // الشَّيطـٰنُ
      [], // لَهُ
      [], // قَرينًا
      [], // فَساءَ
      [] // قَرينًا
    ],
    [ // آية 39
      [], // وَماذا
      [], // عَلَيهِم
      [], // لَو
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَأَنفَقوا
      [], // مِمّا
      [], // رَزَقَهُمُ
      [], // اللَّهُ
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِهِم
      [] // عَليمًا
    ],
    [ // آية 40
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَظلِمُ
      ["مثقال ذرّة : مقدار أصغر نملةٍ ، أو هباءَةٍ"], // مِثقالَ
      ["مثقال ذرّة : مقدار أصغر نملةٍ ، أو هباءَةٍ"], // ذَرَّةٍ
      [], // وَإِن
      [], // تَكُ
      [], // حَسَنَةً
      [], // يُضـٰعِفها
      [], // وَيُؤتِ
      [], // مِن
      [], // لَدُنهُ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 41
      [], // فَكَيفَ
      [], // إِذا
      [], // جِئنا
      [], // مِن
      [], // كُلِّ
      [], // أُمَّةٍ
      [], // بِشَهيدٍ
      [], // وَجِئنا
      [], // بِكَ
      [], // عَلىٰ
      [], // هـٰؤُلاءِ
      [] // شَهيدًا
    ],
    [ // آية 42
      [], // يَومَئِذٍ
      [], // يَوَدُّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَعَصَوُا
      [], // الرَّسولَ
      ["لو تُسوّى بهم الأرض : لو كانوا و الأرض سواءً فلا يُبعثون"], // لَو
      ["لو تُسوّى بهم الأرض : لو كانوا و الأرض سواءً فلا يُبعثون"], // تُسَوّىٰ
      ["لو تُسوّى بهم الأرض : لو كانوا و الأرض سواءً فلا يُبعثون"], // بِهِمُ
      ["لو تُسوّى بهم الأرض : لو كانوا و الأرض سواءً فلا يُبعثون"], // الأَرضُ
      [], // وَلا
      [], // يَكتُمونَ
      [], // اللَّهَ
      [] // حَديثًا
    ],
    [ // آية 43
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَقرَبُوا
      [], // الصَّلوٰةَ
      [], // وَأَنتُم
      [], // سُكـٰرىٰ
      [], // حَتّىٰ
      [], // تَعلَموا
      [], // ما
      [], // تَقولونَ
      [], // وَلا
      [], // جُنُبًا
      [], // إِلّا
      [], // عابِرى
      [], // سَبيلٍ
      [], // حَتّىٰ
      [], // تَغتَسِلوا
      [], // وَإِن
      [], // كُنتُم
      [], // مَرضىٰ
      [], // أَو
      [], // عَلىٰ
      [], // سَفَرٍ
      [], // أَو
      [], // جاءَ
      [], // أَحَدٌ
      [], // مِنكُم
      [], // مِنَ
      ["الغائط : مكان قضاء الحاجة (كِناية عن الحدث)"], // الغائِطِ
      [], // أَو
      [], // لـٰمَستُمُ
      [], // النِّساءَ
      [], // فَلَم
      [], // تَجِدوا
      [], // ماءً
      [], // فَتَيَمَّموا
      ["صعيدًا طيبا : تُرابًا ، أو وجه الأرض – طاهرًا"], // صَعيدًا
      ["صعيدًا طيبا : تُرابًا ، أو وجه الأرض – طاهرًا"], // طَيِّبًا
      [], // فَامسَحوا
      [], // بِوُجوهِكُم
      [], // وَأَيديكُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَفُوًّا
      [] // غَفورًا
    ],
    [ // آية 44
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // أوتوا
      [], // نَصيبًا
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // يَشتَرونَ
      [], // الضَّلـٰلَةَ
      [], // وَيُريدونَ
      [], // أَن
      [], // تَضِلُّوا
      [] // السَّبيلَ
    ],
    [ // آية 45
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [], // بِأَعدائِكُم
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [], // وَلِيًّا
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // نَصيرًا
    ],
    [ // آية 46
      [], // مِنَ
      [], // الَّذينَ
      [], // هادوا
      ["يُحرّفون الكلِم : يُغيّرونه أو يتأوّلونه بالباطل"], // يُحَرِّفونَ
      ["يُحرّفون الكلِم : يُغيّرونه أو يتأوّلونه بالباطل"], // الكَلِمَ
      [], // عَن
      [], // مَواضِعِهِ
      [], // وَيَقولونَ
      [], // سَمِعنا
      [], // وَعَصَينا
      [], // وَاسمَع
      [], // غَيرَ
      [], // مُسمَعٍ
      [], // وَرٰعِنا
      ["ليًّا بألسنتِهم : انْنحرافًا إلى جانب السّوء في القول"], // لَيًّا
      ["ليًّا بألسنتِهم : انْنحرافًا إلى جانب السّوء في القول"], // بِأَلسِنَتِهِم
      [], // وَطَعنًا
      [], // فِى
      [], // الدّينِ
      [], // وَلَو
      [], // أَنَّهُم
      [], // قالوا
      [], // سَمِعنا
      [], // وَأَطَعنا
      [], // وَاسمَع
      [], // وَانظُرنا
      [], // لَكانَ
      [], // خَيرًا
      [], // لَهُم
      [], // وَأَقوَمَ
      [], // وَلـٰكِن
      [], // لَعَنَهُمُ
      [], // اللَّهُ
      [], // بِكُفرِهِم
      [], // فَلا
      [], // يُؤمِنونَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 47
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // ءامِنوا
      [], // بِما
      [], // نَزَّلنا
      [], // مُصَدِّقًا
      [], // لِما
      [], // مَعَكُم
      [], // مِن
      [], // قَبلِ
      [], // أَن
      ["نطمس وُجُوها : نمحوها أو نترُكَهم في الضّلالة"], // نَطمِسَ
      ["نطمس وُجُوها : نمحوها أو نترُكَهم في الضّلالة"], // وُجوهًا
      [], // فَنَرُدَّها
      [], // عَلىٰ
      [], // أَدبارِها
      [], // أَو
      [], // نَلعَنَهُم
      [], // كَما
      [], // لَعَنّا
      [], // أَصحـٰبَ
      [], // السَّبتِ
      [], // وَكانَ
      [], // أَمرُ
      [], // اللَّهِ
      [] // مَفعولًا
    ],
    [ // آية 48
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَغفِرُ
      [], // أَن
      [], // يُشرَكَ
      [], // بِهِ
      [], // وَيَغفِرُ
      [], // ما
      [], // دونَ
      [], // ذٰلِكَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَمَن
      [], // يُشرِك
      [], // بِاللَّهِ
      [], // فَقَدِ
      [], // افتَرىٰ
      [], // إِثمًا
      [] // عَظيمًا
    ],
    [ // آية 49
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      ["يُزكّون أنفسهم : يمدحونها بالبراءة من الذّنوب"], // يُزَكّونَ
      ["يُزكّون أنفسهم : يمدحونها بالبراءة من الذّنوب"], // أَنفُسَهُم
      [], // بَلِ
      [], // اللَّهُ
      [], // يُزَكّى
      [], // مَن
      [], // يَشاءُ
      [], // وَلا
      [], // يُظلَمونَ
      ["فتيلاً : قدْر الخيْط الرقيق في شِقّ النواة"] // فَتيلًا
    ],
    [ // آية 50
      [], // انظُر
      [], // كَيفَ
      [], // يَفتَرونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // وَكَفىٰ
      [], // بِهِ
      [], // إِثمًا
      [] // مُبينًا
    ],
    [ // آية 51
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // أوتوا
      [], // نَصيبًا
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // يُؤمِنونَ
      [], // بِالجِبتِ
      [], // وَالطّـٰغوتِ
      [], // وَيَقولونَ
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // هـٰؤُلاءِ
      [], // أَهدىٰ
      [], // مِنَ
      [], // الَّذينَ
      [], // ءامَنوا
      [] // سَبيلًا
    ],
    [ // آية 52
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // لَعَنَهُمُ
      [], // اللَّهُ
      [], // وَمَن
      [], // يَلعَنِ
      [], // اللَّهُ
      [], // فَلَن
      [], // تَجِدَ
      [], // لَهُ
      [] // نَصيرًا
    ],
    [ // آية 53
      [], // أَم
      [], // لَهُم
      [], // نَصيبٌ
      [], // مِنَ
      [], // المُلكِ
      [], // فَإِذًا
      [], // لا
      [], // يُؤتونَ
      [], // النّاسَ
      ["نقِيرًا : قدْر النُّقرة في ظهر النّواة"] // نَقيرًا
    ],
    [ // آية 54
      [], // أَم
      [], // يَحسُدونَ
      [], // النّاسَ
      [], // عَلىٰ
      [], // ما
      [], // ءاتىٰهُمُ
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // فَقَد
      [], // ءاتَينا
      [], // ءالَ
      [], // إِبرٰهيمَ
      [], // الكِتـٰبَ
      [], // وَالحِكمَةَ
      [], // وَءاتَينـٰهُم
      [], // مُلكًا
      [] // عَظيمًا
    ],
    [ // آية 55
      [], // فَمِنهُم
      [], // مَن
      [], // ءامَنَ
      [], // بِهِ
      [], // وَمِنهُم
      [], // مَن
      [], // صَدَّ
      [], // عَنهُ
      [], // وَكَفىٰ
      [], // بِجَهَنَّمَ
      [] // سَعيرًا
    ],
    [ // آية 56
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِنا
      [], // سَوفَ
      ["نُصليهم نارًا : نُدْخِلُهم نارًا هائلةً نشْويهم فيها"], // نُصليهِم
      ["نُصليهم نارًا : نُدْخِلُهم نارًا هائلةً نشْويهم فيها"], // نارًا
      [], // كُلَّما
      ["نَضِجت جلودهم : احترقت و تهرَّت و تلاشت"], // نَضِجَت
      ["نَضِجت جلودهم : احترقت و تهرَّت و تلاشت"], // جُلودُهُم
      [], // بَدَّلنـٰهُم
      [], // جُلودًا
      [], // غَيرَها
      [], // لِيَذوقُوا
      [], // العَذابَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَزيزًا
      [] // حَكيمًا
    ],
    [ // آية 57
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // سَنُدخِلُهُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // لَهُم
      [], // فيها
      [], // أَزوٰجٌ
      [], // مُطَهَّرَةٌ
      [], // وَنُدخِلُهُم
      [], // ظِلًّا
      ["ظليلا : دائمًا لا حرّ فيه و لا قرّ"] // ظَليلًا
    ],
    [ // آية 58
      [], // إِنَّ
      [], // اللَّهَ
      [], // يَأمُرُكُم
      [], // أَن
      [], // تُؤَدُّوا
      [], // الأَمـٰنـٰتِ
      [], // إِلىٰ
      [], // أَهلِها
      [], // وَإِذا
      [], // حَكَمتُم
      [], // بَينَ
      [], // النّاسِ
      [], // أَن
      [], // تَحكُموا
      [], // بِالعَدلِ
      [], // إِنَّ
      [], // اللَّهَ
      ["نِعمّا يعِظكم به : نِعم الّذي يعِظكم به ما ذُكر"], // نِعِمّا
      ["نِعمّا يعِظكم به : نِعم الّذي يعِظكم به ما ذُكر"], // يَعِظُكُم
      ["نِعمّا يعِظكم به : نِعم الّذي يعِظكم به ما ذُكر"], // بِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // سَميعًا
      [] // بَصيرًا
    ],
    [ // آية 59
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // أَطيعُوا
      [], // اللَّهَ
      [], // وَأَطيعُوا
      [], // الرَّسولَ
      [], // وَأُولِى
      [], // الأَمرِ
      [], // مِنكُم
      [], // فَإِن
      [], // تَنـٰزَعتُم
      [], // فى
      [], // شَىءٍ
      [], // فَرُدّوهُ
      [], // إِلَى
      [], // اللَّهِ
      [], // وَالرَّسولِ
      [], // إِن
      [], // كُنتُم
      [], // تُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // ذٰلِكَ
      [], // خَيرٌ
      [], // وَأَحسَنُ
      [] // تَأويلًا
    ],
    [ // آية 60
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // يَزعُمونَ
      [], // أَنَّهُم
      [], // ءامَنوا
      [], // بِما
      [], // أُنزِلَ
      [], // إِلَيكَ
      [], // وَما
      [], // أُنزِلَ
      [], // مِن
      [], // قَبلِكَ
      [], // يُريدونَ
      [], // أَن
      [], // يَتَحاكَموا
      [], // إِلَى
      [], // الطّـٰغوتِ
      [], // وَقَد
      [], // أُمِروا
      [], // أَن
      [], // يَكفُروا
      [], // بِهِ
      [], // وَيُريدُ
      [], // الشَّيطـٰنُ
      [], // أَن
      [], // يُضِلَّهُم
      [], // ضَلـٰلًا
      [] // بَعيدًا
    ],
    [ // آية 61
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُم
      [], // تَعالَوا
      [], // إِلىٰ
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // وَإِلَى
      [], // الرَّسولِ
      [], // رَأَيتَ
      [], // المُنـٰفِقينَ
      ["يصُدّون عنك : يُعرضون عنك"], // يَصُدّونَ
      ["يصُدّون عنك : يُعرضون عنك"], // عَنكَ
      [] // صُدودًا
    ],
    [ // آية 62
      [], // فَكَيفَ
      [], // إِذا
      [], // أَصـٰبَتهُم
      [], // مُصيبَةٌ
      [], // بِما
      [], // قَدَّمَت
      [], // أَيديهِم
      [], // ثُمَّ
      [], // جاءوكَ
      [], // يَحلِفونَ
      [], // بِاللَّهِ
      [], // إِن
      [], // أَرَدنا
      [], // إِلّا
      [], // إِحسـٰنًا
      [] // وَتَوفيقًا
    ],
    [ // آية 63
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // يَعلَمُ
      [], // اللَّهُ
      [], // ما
      [], // فى
      [], // قُلوبِهِم
      [], // فَأَعرِض
      [], // عَنهُم
      [], // وَعِظهُم
      [], // وَقُل
      [], // لَهُم
      [], // فى
      [], // أَنفُسِهِم
      [], // قَولًا
      [] // بَليغًا
    ],
    [ // آية 64
      [], // وَما
      [], // أَرسَلنا
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // لِيُطاعَ
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // وَلَو
      [], // أَنَّهُم
      [], // إِذ
      [], // ظَلَموا
      [], // أَنفُسَهُم
      [], // جاءوكَ
      [], // فَاستَغفَرُوا
      [], // اللَّهَ
      [], // وَاستَغفَرَ
      [], // لَهُمُ
      [], // الرَّسولُ
      [], // لَوَجَدُوا
      [], // اللَّهَ
      [], // تَوّابًا
      [] // رَحيمًا
    ],
    [ // آية 65
      [], // فَلا
      [], // وَرَبِّكَ
      [], // لا
      [], // يُؤمِنونَ
      [], // حَتّىٰ
      [], // يُحَكِّموكَ
      [], // فيما
      ["شجر بينهم : أشكل و التبس عليهم من الأمور"], // شَجَرَ
      ["شجر بينهم : أشكل و التبس عليهم من الأمور"], // بَينَهُم
      [], // ثُمَّ
      [], // لا
      [], // يَجِدوا
      [], // فى
      [], // أَنفُسِهِم
      [], // حَرَجًا
      [], // مِمّا
      [], // قَضَيتَ
      [], // وَيُسَلِّموا
      [] // تَسليمًا
    ],
    [ // آية 66
      [], // وَلَو
      [], // أَنّا
      [], // كَتَبنا
      [], // عَلَيهِم
      [], // أَنِ
      [], // اقتُلوا
      [], // أَنفُسَكُم
      [], // أَوِ
      [], // اخرُجوا
      [], // مِن
      [], // دِيـٰرِكُم
      [], // ما
      [], // فَعَلوهُ
      [], // إِلّا
      [], // قَليلٌ
      [], // مِنهُم
      [], // وَلَو
      [], // أَنَّهُم
      [], // فَعَلوا
      [], // ما
      [], // يوعَظونَ
      [], // بِهِ
      [], // لَكانَ
      [], // خَيرًا
      [], // لَهُم
      [], // وَأَشَدَّ
      [] // تَثبيتًا
    ],
    [ // آية 67
      [], // وَإِذًا
      [], // لَـٔاتَينـٰهُم
      [], // مِن
      [], // لَدُنّا
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 68
      [], // وَلَهَدَينـٰهُم
      [], // صِرٰطًا
      [] // مُستَقيمًا
    ],
    [ // آية 69
      [], // وَمَن
      [], // يُطِعِ
      [], // اللَّهَ
      [], // وَالرَّسولَ
      [], // فَأُولـٰئِكَ
      [], // مَعَ
      [], // الَّذينَ
      [], // أَنعَمَ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // مِنَ
      [], // النَّبِيّـۧنَ
      [], // وَالصِّدّيقينَ
      [], // وَالشُّهَداءِ
      [], // وَالصّـٰلِحينَ
      [], // وَحَسُنَ
      [], // أُولـٰئِكَ
      [] // رَفيقًا
    ],
    [ // آية 70
      [], // ذٰلِكَ
      [], // الفَضلُ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // عَليمًا
    ],
    [ // آية 71
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      ["خُذوا حِذركم : خذوا سلاحكم أو تيقّظوا لعدوّكم"], // خُذوا
      ["خُذوا حِذركم : خذوا سلاحكم أو تيقّظوا لعدوّكم"], // حِذرَكُم
      ["فانفروا ثُباتٍ : اخرجوا للجهاد جماعت مُتفرّقين"], // فَانفِروا
      ["فانفروا ثُباتٍ : اخرجوا للجهاد جماعت مُتفرّقين"], // ثُباتٍ
      [], // أَوِ
      [], // انفِروا
      [] // جَميعًا
    ],
    [ // آية 72
      [], // وَإِنَّ
      [], // مِنكُم
      [], // لَمَن
      ["ليُبطِّئنّ : لتنثاقلنَّ أو لَيُثبّطنّ عن الجهاد"], // لَيُبَطِّئَنَّ
      [], // فَإِن
      [], // أَصـٰبَتكُم
      [], // مُصيبَةٌ
      [], // قالَ
      [], // قَد
      [], // أَنعَمَ
      [], // اللَّهُ
      [], // عَلَىَّ
      [], // إِذ
      [], // لَم
      [], // أَكُن
      [], // مَعَهُم
      [] // شَهيدًا
    ],
    [ // آية 73
      [], // وَلَئِن
      [], // أَصـٰبَكُم
      [], // فَضلٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // لَيَقولَنَّ
      [], // كَأَن
      [], // لَم
      [], // تَكُن
      [], // بَينَكُم
      [], // وَبَينَهُ
      [], // مَوَدَّةٌ
      [], // يـٰلَيتَنى
      [], // كُنتُ
      [], // مَعَهُم
      [], // فَأَفوزَ
      [], // فَوزًا
      [] // عَظيمًا
    ],
    [ // آية 74
      [], // فَليُقـٰتِل
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // الَّذينَ
      ["يشْرُون : يبيعون (و هم المؤمنون)"], // يَشرونَ
      [], // الحَيوٰةَ
      [], // الدُّنيا
      [], // بِالـٔاخِرَةِ
      [], // وَمَن
      [], // يُقـٰتِل
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَيُقتَل
      [], // أَو
      [], // يَغلِب
      [], // فَسَوفَ
      [], // نُؤتيهِ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 75
      [], // وَما
      [], // لَكُم
      [], // لا
      [], // تُقـٰتِلونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالمُستَضعَفينَ
      [], // مِنَ
      [], // الرِّجالِ
      [], // وَالنِّساءِ
      [], // وَالوِلدٰنِ
      [], // الَّذينَ
      [], // يَقولونَ
      [], // رَبَّنا
      [], // أَخرِجنا
      [], // مِن
      [], // هـٰذِهِ
      [], // القَريَةِ
      [], // الظّالِمِ
      [], // أَهلُها
      [], // وَاجعَل
      [], // لَنا
      [], // مِن
      [], // لَدُنكَ
      [], // وَلِيًّا
      [], // وَاجعَل
      [], // لَنا
      [], // مِن
      [], // لَدُنكَ
      [] // نَصيرًا
    ],
    [ // آية 76
      [], // الَّذينَ
      [], // ءامَنوا
      [], // يُقـٰتِلونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // يُقـٰتِلونَ
      [], // فى
      [], // سَبيلِ
      [], // الطّـٰغوتِ
      [], // فَقـٰتِلوا
      [], // أَولِياءَ
      [], // الشَّيطـٰنِ
      [], // إِنَّ
      [], // كَيدَ
      [], // الشَّيطـٰنِ
      [], // كانَ
      [] // ضَعيفًا
    ],
    [ // آية 77
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // قيلَ
      [], // لَهُم
      [], // كُفّوا
      [], // أَيدِيَكُم
      [], // وَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَءاتُوا
      [], // الزَّكوٰةَ
      [], // فَلَمّا
      [], // كُتِبَ
      [], // عَلَيهِمُ
      [], // القِتالُ
      [], // إِذا
      [], // فَريقٌ
      [], // مِنهُم
      [], // يَخشَونَ
      [], // النّاسَ
      [], // كَخَشيَةِ
      [], // اللَّهِ
      [], // أَو
      [], // أَشَدَّ
      [], // خَشيَةً
      [], // وَقالوا
      [], // رَبَّنا
      [], // لِمَ
      [], // كَتَبتَ
      [], // عَلَينَا
      [], // القِتالَ
      [], // لَولا
      [], // أَخَّرتَنا
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // قَريبٍ
      [], // قُل
      [], // مَتـٰعُ
      [], // الدُّنيا
      [], // قَليلٌ
      [], // وَالـٔاخِرَةُ
      [], // خَيرٌ
      [], // لِمَنِ
      [], // اتَّقىٰ
      [], // وَلا
      [], // تُظلَمونَ
      [] // فَتيلًا
    ],
    [ // آية 78
      [], // أَينَما
      [], // تَكونوا
      [], // يُدرِككُمُ
      [], // المَوتُ
      [], // وَلَو
      [], // كُنتُم
      [], // فى
      ["بروج : حصون و قلاع . أو قصور"], // بُروجٍ
      ["مُشيّدة : مُحكمة أو مُطوّلة مُرتفعة"], // مُشَيَّدَةٍ
      [], // وَإِن
      [], // تُصِبهُم
      [], // حَسَنَةٌ
      [], // يَقولوا
      [], // هـٰذِهِ
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // وَإِن
      [], // تُصِبهُم
      [], // سَيِّئَةٌ
      [], // يَقولوا
      [], // هـٰذِهِ
      [], // مِن
      [], // عِندِكَ
      [], // قُل
      [], // كُلٌّ
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // فَمالِ
      [], // هـٰؤُلاءِ
      [], // القَومِ
      [], // لا
      [], // يَكادونَ
      [], // يَفقَهونَ
      [] // حَديثًا
    ],
    [ // آية 79
      [], // ما
      [], // أَصابَكَ
      [], // مِن
      [], // حَسَنَةٍ
      [], // فَمِنَ
      [], // اللَّهِ
      [], // وَما
      [], // أَصابَكَ
      [], // مِن
      [], // سَيِّئَةٍ
      [], // فَمِن
      [], // نَفسِكَ
      [], // وَأَرسَلنـٰكَ
      [], // لِلنّاسِ
      [], // رَسولًا
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // شَهيدًا
    ],
    [ // آية 80
      [], // مَن
      [], // يُطِعِ
      [], // الرَّسولَ
      [], // فَقَد
      [], // أَطاعَ
      [], // اللَّهَ
      [], // وَمَن
      [], // تَوَلّىٰ
      [], // فَما
      [], // أَرسَلنـٰكَ
      [], // عَلَيهِم
      ["حفيظًا : حافظًا مُهيمنا و رقيبا"] // حَفيظًا
    ],
    [ // آية 81
      [], // وَيَقولونَ
      [], // طاعَةٌ
      [], // فَإِذا
      ["برزوا : خرجوا"], // بَرَزوا
      [], // مِن
      [], // عِندِكَ
      ["بَيّت طائفة : دبّرت بليل ، أو زوّرت و سوّت"], // بَيَّتَ
      ["بَيّت طائفة : دبّرت بليل ، أو زوّرت و سوّت"], // طائِفَةٌ
      [], // مِنهُم
      [], // غَيرَ
      [], // الَّذى
      [], // تَقولُ
      [], // وَاللَّهُ
      [], // يَكتُبُ
      [], // ما
      [], // يُبَيِّتونَ
      [], // فَأَعرِض
      [], // عَنهُم
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // وَكيلًا
    ],
    [ // آية 82
      [], // أَفَلا
      [], // يَتَدَبَّرونَ
      [], // القُرءانَ
      [], // وَلَو
      [], // كانَ
      [], // مِن
      [], // عِندِ
      [], // غَيرِ
      [], // اللَّهِ
      [], // لَوَجَدوا
      [], // فيهِ
      [], // اختِلـٰفًا
      [] // كَثيرًا
    ],
    [ // آية 83
      [], // وَإِذا
      [], // جاءَهُم
      [], // أَمرٌ
      [], // مِنَ
      [], // الأَمنِ
      [], // أَوِ
      [], // الخَوفِ
      ["أذاعوا به : أفشوه  و أشاعوه و ذلك مفسدة"], // أَذاعوا
      ["أذاعوا به : أفشوه  و أشاعوه و ذلك مفسدة"], // بِهِ
      [], // وَلَو
      [], // رَدّوهُ
      [], // إِلَى
      [], // الرَّسولِ
      [], // وَإِلىٰ
      [], // أُولِى
      [], // الأَمرِ
      [], // مِنهُم
      [], // لَعَلِمَهُ
      [], // الَّذينَ
      ["يستنبطونه : يستخرجون تدبيره ، أو عِلمه"], // يَستَنبِطونَهُ
      [], // مِنهُم
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكُم
      [], // وَرَحمَتُهُ
      [], // لَاتَّبَعتُمُ
      [], // الشَّيطـٰنَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 84
      [], // فَقـٰتِل
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // لا
      [], // تُكَلَّفُ
      [], // إِلّا
      [], // نَفسَكَ
      [], // وَحَرِّضِ
      [], // المُؤمِنينَ
      [], // عَسَى
      [], // اللَّهُ
      [], // أَن
      [], // يَكُفَّ
      [], // بَأسَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَاللَّهُ
      ["أشدُّ بأسا : أعظم قوّةً و صولةً"], // أَشَدُّ
      ["أشدُّ بأسا : أعظم قوّةً و صولةً"], // بَأسًا
      [], // وَأَشَدُّ
      [] // تَنكيلًا
    ],
    [ // آية 85
      [], // مَن
      [], // يَشفَع
      [], // شَفـٰعَةً
      [], // حَسَنَةً
      [], // يَكُن
      [], // لَهُ
      [], // نَصيبٌ
      [], // مِنها
      [], // وَمَن
      [], // يَشفَع
      [], // شَفـٰعَةً
      [], // سَيِّئَةً
      [], // يَكُن
      [], // لَهُ
      ["كِفلٌ منْها : نصيبٌ و حظٌّ من وِزْرِها"], // كِفلٌ
      ["كِفلٌ منْها : نصيبٌ و حظٌّ من وِزْرِها"], // مِنها
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // مُقيتًا
    ],
    [ // آية 86
      [], // وَإِذا
      [], // حُيّيتُم
      [], // بِتَحِيَّةٍ
      [], // فَحَيّوا
      [], // بِأَحسَنَ
      [], // مِنها
      [], // أَو
      [], // رُدّوها
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      ["حسيبًا : مُحاسبًا و مُجازيًا ، أو شهيدًا"] // حَسيبًا
    ],
    [ // آية 87
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // لَيَجمَعَنَّكُم
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // وَمَن
      [], // أَصدَقُ
      [], // مِنَ
      [], // اللَّهِ
      [] // حَديثًا
    ],
    [ // آية 88
      [], // فَما
      [], // لَكُم
      [], // فِى
      [], // المُنـٰفِقينَ
      [], // فِئَتَينِ
      [], // وَاللَّهُ
      ["أركسهم : نكَّسهم و ردّهم إلى حُكم الكُفر"], // أَركَسَهُم
      [], // بِما
      [], // كَسَبوا
      [], // أَتُريدونَ
      [], // أَن
      [], // تَهدوا
      [], // مَن
      [], // أَضَلَّ
      [], // اللَّهُ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَلَن
      [], // تَجِدَ
      [], // لَهُ
      [] // سَبيلًا
    ],
    [ // آية 89
      [], // وَدّوا
      [], // لَو
      [], // تَكفُرونَ
      [], // كَما
      [], // كَفَروا
      [], // فَتَكونونَ
      [], // سَواءً
      [], // فَلا
      [], // تَتَّخِذوا
      [], // مِنهُم
      [], // أَولِياءَ
      [], // حَتّىٰ
      [], // يُهاجِروا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَخُذوهُم
      [], // وَاقتُلوهُم
      [], // حَيثُ
      [], // وَجَدتُموهُم
      [], // وَلا
      [], // تَتَّخِذوا
      [], // مِنهُم
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 90
      [], // إِلَّا
      [], // الَّذينَ
      [], // يَصِلونَ
      [], // إِلىٰ
      [], // قَومٍ
      [], // بَينَكُم
      [], // وَبَينَهُم
      [], // ميثـٰقٌ
      [], // أَو
      [], // جاءوكُم
      ["حصِرت صدُورُهم : ضاقت و انْقبَضت"], // حَصِرَت
      ["حصِرت صدُورُهم : ضاقت و انْقبَضت"], // صُدورُهُم
      [], // أَن
      [], // يُقـٰتِلوكُم
      [], // أَو
      [], // يُقـٰتِلوا
      [], // قَومَهُم
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // لَسَلَّطَهُم
      [], // عَلَيكُم
      [], // فَلَقـٰتَلوكُم
      [], // فَإِنِ
      [], // اعتَزَلوكُم
      [], // فَلَم
      [], // يُقـٰتِلوكُم
      [], // وَأَلقَوا
      [], // إِلَيكُمُ
      ["السَّلَمَ : الاستسلام و الانقياد للصُّلح"], // السَّلَمَ
      [], // فَما
      [], // جَعَلَ
      [], // اللَّهُ
      [], // لَكُم
      [], // عَلَيهِم
      [] // سَبيلًا
    ],
    [ // آية 91
      [], // سَتَجِدونَ
      [], // ءاخَرينَ
      [], // يُريدونَ
      [], // أَن
      [], // يَأمَنوكُم
      [], // وَيَأمَنوا
      [], // قَومَهُم
      [], // كُلَّ
      [], // ما
      [], // رُدّوا
      [], // إِلَى
      [], // الفِتنَةِ
      ["أُرْكِسوا فيها : قُلِبُوا في الفتنة أشنع قلبٍ"], // أُركِسوا
      ["أُرْكِسوا فيها : قُلِبُوا في الفتنة أشنع قلبٍ"], // فيها
      [], // فَإِن
      [], // لَم
      [], // يَعتَزِلوكُم
      [], // وَيُلقوا
      [], // إِلَيكُمُ
      [], // السَّلَمَ
      [], // وَيَكُفّوا
      [], // أَيدِيَهُم
      [], // فَخُذوهُم
      [], // وَاقتُلوهُم
      [], // حَيثُ
      ["ثقِفتموهم : وجدتموهم أو تمكّنتم منهم"], // ثَقِفتُموهُم
      [], // وَأُولـٰئِكُم
      [], // جَعَلنا
      [], // لَكُم
      [], // عَلَيهِم
      [], // سُلطـٰنًا
      [] // مُبينًا
    ],
    [ // آية 92
      [], // وَما
      [], // كانَ
      [], // لِمُؤمِنٍ
      [], // أَن
      [], // يَقتُلَ
      [], // مُؤمِنًا
      [], // إِلّا
      [], // خَطَـًٔا
      [], // وَمَن
      [], // قَتَلَ
      [], // مُؤمِنًا
      [], // خَطَـًٔا
      [], // فَتَحريرُ
      [], // رَقَبَةٍ
      [], // مُؤمِنَةٍ
      [], // وَدِيَةٌ
      [], // مُسَلَّمَةٌ
      [], // إِلىٰ
      [], // أَهلِهِ
      [], // إِلّا
      [], // أَن
      [], // يَصَّدَّقوا
      [], // فَإِن
      [], // كانَ
      [], // مِن
      [], // قَومٍ
      [], // عَدُوٍّ
      [], // لَكُم
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَتَحريرُ
      [], // رَقَبَةٍ
      [], // مُؤمِنَةٍ
      [], // وَإِن
      [], // كانَ
      [], // مِن
      [], // قَومٍ
      [], // بَينَكُم
      [], // وَبَينَهُم
      [], // ميثـٰقٌ
      [], // فَدِيَةٌ
      [], // مُسَلَّمَةٌ
      [], // إِلىٰ
      [], // أَهلِهِ
      [], // وَتَحريرُ
      [], // رَقَبَةٍ
      [], // مُؤمِنَةٍ
      [], // فَمَن
      [], // لَم
      [], // يَجِد
      [], // فَصِيامُ
      [], // شَهرَينِ
      [], // مُتَتابِعَينِ
      [], // تَوبَةً
      [], // مِنَ
      [], // اللَّهِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 93
      [], // وَمَن
      [], // يَقتُل
      [], // مُؤمِنًا
      [], // مُتَعَمِّدًا
      [], // فَجَزاؤُهُ
      [], // جَهَنَّمُ
      [], // خـٰلِدًا
      [], // فيها
      [], // وَغَضِبَ
      [], // اللَّهُ
      [], // عَلَيهِ
      [], // وَلَعَنَهُ
      [], // وَأَعَدَّ
      [], // لَهُ
      [], // عَذابًا
      [] // عَظيمًا
    ],
    [ // آية 94
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      ["ضربتم : سافرتم و ذهبتم"], // ضَرَبتُم
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَتَبَيَّنوا
      [], // وَلا
      [], // تَقولوا
      [], // لِمَن
      [], // أَلقىٰ
      [], // إِلَيكُمُ
      [], // السَّلـٰمَ
      [], // لَستَ
      [], // مُؤمِنًا
      [], // تَبتَغونَ
      [], // عَرَضَ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // فَعِندَ
      [], // اللَّهِ
      [], // مَغانِمُ
      [], // كَثيرَةٌ
      [], // كَذٰلِكَ
      [], // كُنتُم
      [], // مِن
      [], // قَبلُ
      [], // فَمَنَّ
      [], // اللَّهُ
      [], // عَلَيكُم
      [], // فَتَبَيَّنوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرًا
    ],
    [ // آية 95
      [], // لا
      [], // يَستَوِى
      [], // القـٰعِدونَ
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // غَيرُ
      ["أُولِى الضَّرر : أرباب العذر المانع من الجهاد"], // أُولِى
      ["أُولِى الضَّرر : أرباب العذر المانع من الجهاد"], // الضَّرَرِ
      [], // وَالمُجـٰهِدونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // فَضَّلَ
      [], // اللَّهُ
      [], // المُجـٰهِدينَ
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // عَلَى
      [], // القـٰعِدينَ
      [], // دَرَجَةً
      [], // وَكُلًّا
      [], // وَعَدَ
      [], // اللَّهُ
      [], // الحُسنىٰ
      [], // وَفَضَّلَ
      [], // اللَّهُ
      [], // المُجـٰهِدينَ
      [], // عَلَى
      [], // القـٰعِدينَ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 96
      [], // دَرَجـٰتٍ
      [], // مِنهُ
      [], // وَمَغفِرَةً
      [], // وَرَحمَةً
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 97
      [], // إِنَّ
      [], // الَّذينَ
      [], // تَوَفّىٰهُمُ
      [], // المَلـٰئِكَةُ
      [], // ظالِمى
      [], // أَنفُسِهِم
      [], // قالوا
      [], // فيمَ
      [], // كُنتُم
      [], // قالوا
      [], // كُنّا
      [], // مُستَضعَفينَ
      [], // فِى
      [], // الأَرضِ
      [], // قالوا
      [], // أَلَم
      [], // تَكُن
      [], // أَرضُ
      [], // اللَّهِ
      [], // وٰسِعَةً
      [], // فَتُهاجِروا
      [], // فيها
      [], // فَأُولـٰئِكَ
      [], // مَأوىٰهُم
      [], // جَهَنَّمُ
      [], // وَساءَت
      [] // مَصيرًا
    ],
    [ // آية 98
      [], // إِلَّا
      [], // المُستَضعَفينَ
      [], // مِنَ
      [], // الرِّجالِ
      [], // وَالنِّساءِ
      [], // وَالوِلدٰنِ
      [], // لا
      [], // يَستَطيعونَ
      [], // حيلَةً
      [], // وَلا
      [], // يَهتَدونَ
      [] // سَبيلًا
    ],
    [ // آية 99
      [], // فَأُولـٰئِكَ
      [], // عَسَى
      [], // اللَّهُ
      [], // أَن
      [], // يَعفُوَ
      [], // عَنهُم
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَفُوًّا
      [] // غَفورًا
    ],
    [ // آية 100
      [], // وَمَن
      [], // يُهاجِر
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // يَجِد
      [], // فِى
      [], // الأَرضِ
      [], // مُرٰغَمًا
      [], // كَثيرًا
      [], // وَسَعَةً
      [], // وَمَن
      [], // يَخرُج
      [], // مِن
      [], // بَيتِهِ
      [], // مُهاجِرًا
      [], // إِلَى
      [], // اللَّهِ
      [], // وَرَسولِهِ
      [], // ثُمَّ
      [], // يُدرِكهُ
      [], // المَوتُ
      [], // فَقَد
      [], // وَقَعَ
      [], // أَجرُهُ
      [], // عَلَى
      [], // اللَّهِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 101
      [], // وَإِذا
      [], // ضَرَبتُم
      [], // فِى
      [], // الأَرضِ
      [], // فَلَيسَ
      [], // عَلَيكُم
      [], // جُناحٌ
      [], // أَن
      [], // تَقصُروا
      [], // مِنَ
      [], // الصَّلوٰةِ
      [], // إِن
      [], // خِفتُم
      [], // أَن
      ["يفتِنكم : ينالكم بمكروه"], // يَفتِنَكُمُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِنَّ
      [], // الكـٰفِرينَ
      [], // كانوا
      [], // لَكُم
      [], // عَدُوًّا
      [] // مُبينًا
    ],
    [ // آية 102
      [], // وَإِذا
      [], // كُنتَ
      [], // فيهِم
      [], // فَأَقَمتَ
      [], // لَهُمُ
      [], // الصَّلوٰةَ
      [], // فَلتَقُم
      [], // طائِفَةٌ
      [], // مِنهُم
      [], // مَعَكَ
      [], // وَليَأخُذوا
      [], // أَسلِحَتَهُم
      [], // فَإِذا
      [], // سَجَدوا
      [], // فَليَكونوا
      [], // مِن
      [], // وَرائِكُم
      [], // وَلتَأتِ
      [], // طائِفَةٌ
      [], // أُخرىٰ
      [], // لَم
      [], // يُصَلّوا
      [], // فَليُصَلّوا
      [], // مَعَكَ
      [], // وَليَأخُذوا
      ["حِذرهم : احترازَهم من عدوِّهم"], // حِذرَهُم
      [], // وَأَسلِحَتَهُم
      [], // وَدَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَو
      ["تغْفُلون : تسْهون"], // تَغفُلونَ
      [], // عَن
      [], // أَسلِحَتِكُم
      [], // وَأَمتِعَتِكُم
      [], // فَيَميلونَ
      [], // عَلَيكُم
      [], // مَيلَةً
      [], // وٰحِدَةً
      [], // وَلا
      [], // جُناحَ
      [], // عَلَيكُم
      [], // إِن
      [], // كانَ
      [], // بِكُم
      [], // أَذًى
      [], // مِن
      [], // مَطَرٍ
      [], // أَو
      [], // كُنتُم
      [], // مَرضىٰ
      [], // أَن
      [], // تَضَعوا
      [], // أَسلِحَتَكُم
      [], // وَخُذوا
      [], // حِذرَكُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // أَعَدَّ
      [], // لِلكـٰفِرينَ
      [], // عَذابًا
      [] // مُهينًا
    ],
    [ // آية 103
      [], // فَإِذا
      [], // قَضَيتُمُ
      [], // الصَّلوٰةَ
      [], // فَاذكُرُوا
      [], // اللَّهَ
      [], // قِيـٰمًا
      [], // وَقُعودًا
      [], // وَعَلىٰ
      [], // جُنوبِكُم
      [], // فَإِذَا
      [], // اطمَأنَنتُم
      [], // فَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // إِنَّ
      [], // الصَّلوٰةَ
      [], // كانَت
      [], // عَلَى
      [], // المُؤمِنينَ
      [], // كِتـٰبًا
      [] // مَوقوتًا
    ],
    [ // آية 104
      [], // وَلا
      [], // تَهِنوا
      [], // فِى
      [], // ابتِغاءِ
      [], // القَومِ
      [], // إِن
      [], // تَكونوا
      [], // تَألَمونَ
      [], // فَإِنَّهُم
      [], // يَألَمونَ
      [], // كَما
      [], // تَألَمونَ
      [], // وَتَرجونَ
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَرجونَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 105
      [], // إِنّا
      [], // أَنزَلنا
      [], // إِلَيكَ
      [], // الكِتـٰبَ
      [], // بِالحَقِّ
      [], // لِتَحكُمَ
      [], // بَينَ
      [], // النّاسِ
      [], // بِما
      [], // أَرىٰكَ
      [], // اللَّهُ
      [], // وَلا
      [], // تَكُن
      [], // لِلخائِنينَ
      ["خصيمًا : مخاصِمًا مُدافِعًا عنهم"] // خَصيمًا
    ],
    [ // آية 106
      [], // وَاستَغفِرِ
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 107
      [], // وَلا
      [], // تُجـٰدِل
      [], // عَنِ
      [], // الَّذينَ
      ["يختانون أنفسهم : يخونونها بارتكاب المعاصي"], // يَختانونَ
      ["يختانون أنفسهم : يخونونها بارتكاب المعاصي"], // أَنفُسَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [], // مَن
      [], // كانَ
      [], // خَوّانًا
      [] // أَثيمًا
    ],
    [ // آية 108
      [], // يَستَخفونَ
      [], // مِنَ
      [], // النّاسِ
      [], // وَلا
      [], // يَستَخفونَ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَهُوَ
      [], // مَعَهُم
      [], // إِذ
      ["يُبيّتون : يُدبّرون بليل"], // يُبَيِّتونَ
      [], // ما
      [], // لا
      [], // يَرضىٰ
      [], // مِنَ
      [], // القَولِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِما
      [], // يَعمَلونَ
      [] // مُحيطًا
    ],
    [ // آية 109
      [], // هـٰأَنتُم
      [], // هـٰؤُلاءِ
      [], // جـٰدَلتُم
      [], // عَنهُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // فَمَن
      [], // يُجـٰدِلُ
      [], // اللَّهَ
      [], // عَنهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // أَم
      [], // مَن
      [], // يَكونُ
      [], // عَلَيهِم
      ["وكيلاً : حافظا و مُحاميًا من بأس الله"] // وَكيلًا
    ],
    [ // آية 110
      [], // وَمَن
      [], // يَعمَل
      [], // سوءًا
      [], // أَو
      [], // يَظلِم
      [], // نَفسَهُ
      [], // ثُمَّ
      [], // يَستَغفِرِ
      [], // اللَّهَ
      [], // يَجِدِ
      [], // اللَّهَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 111
      [], // وَمَن
      [], // يَكسِب
      [], // إِثمًا
      [], // فَإِنَّما
      [], // يَكسِبُهُ
      [], // عَلىٰ
      [], // نَفسِهِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 112
      [], // وَمَن
      [], // يَكسِب
      [], // خَطيـَٔةً
      [], // أَو
      [], // إِثمًا
      [], // ثُمَّ
      [], // يَرمِ
      [], // بِهِ
      [], // بَريـًٔا
      [], // فَقَدِ
      [], // احتَمَلَ
      [], // بُهتـٰنًا
      [], // وَإِثمًا
      [] // مُبينًا
    ],
    [ // آية 113
      [], // وَلَولا
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكَ
      [], // وَرَحمَتُهُ
      [], // لَهَمَّت
      [], // طائِفَةٌ
      [], // مِنهُم
      [], // أَن
      [], // يُضِلّوكَ
      [], // وَما
      [], // يُضِلّونَ
      [], // إِلّا
      [], // أَنفُسَهُم
      [], // وَما
      [], // يَضُرّونَكَ
      [], // مِن
      [], // شَىءٍ
      [], // وَأَنزَلَ
      [], // اللَّهُ
      [], // عَلَيكَ
      [], // الكِتـٰبَ
      [], // وَالحِكمَةَ
      [], // وَعَلَّمَكَ
      [], // ما
      [], // لَم
      [], // تَكُن
      [], // تَعلَمُ
      [], // وَكانَ
      [], // فَضلُ
      [], // اللَّهِ
      [], // عَلَيكَ
      [] // عَظيمًا
    ],
    [ // آية 114
      [], // لا
      [], // خَيرَ
      [], // فى
      [], // كَثيرٍ
      [], // مِن
      [], // نَجوىٰهُم
      [], // إِلّا
      [], // مَن
      [], // أَمَرَ
      [], // بِصَدَقَةٍ
      [], // أَو
      [], // مَعروفٍ
      [], // أَو
      [], // إِصلـٰحٍ
      [], // بَينَ
      [], // النّاسِ
      [], // وَمَن
      [], // يَفعَل
      [], // ذٰلِكَ
      [], // ابتِغاءَ
      [], // مَرضاتِ
      [], // اللَّهِ
      [], // فَسَوفَ
      [], // نُؤتيهِ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 115
      [], // وَمَن
      ["يُشاقق الرّسول : يُخالفه"], // يُشاقِقِ
      ["يُشاقق الرّسول : يُخالفه"], // الرَّسولَ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // تَبَيَّنَ
      [], // لَهُ
      [], // الهُدىٰ
      [], // وَيَتَّبِع
      [], // غَيرَ
      [], // سَبيلِ
      [], // المُؤمِنينَ
      ["نُولّهِ ما تولّى : نخلّي بينه و بين ما اختاره لنفسه"], // نُوَلِّهِ
      ["نُولّهِ ما تولّى : نخلّي بينه و بين ما اختاره لنفسه"], // ما
      ["نُولّهِ ما تولّى : نخلّي بينه و بين ما اختاره لنفسه"], // تَوَلّىٰ
      [], // وَنُصلِهِ
      [], // جَهَنَّمَ
      [], // وَساءَت
      [] // مَصيرًا
    ],
    [ // آية 116
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَغفِرُ
      [], // أَن
      [], // يُشرَكَ
      [], // بِهِ
      [], // وَيَغفِرُ
      [], // ما
      [], // دونَ
      [], // ذٰلِكَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَمَن
      [], // يُشرِك
      [], // بِاللَّهِ
      [], // فَقَد
      [], // ضَلَّ
      [], // ضَلـٰلًا
      [] // بَعيدًا
    ],
    [ // آية 117
      [], // إِن
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // إِلّا
      [], // إِنـٰثًا
      [], // وَإِن
      [], // يَدعونَ
      [], // إِلّا
      [], // شَيطـٰنًا
      [] // مَريدًا
    ],
    [ // آية 118
      [], // لَعَنَهُ
      [], // اللَّهُ
      [], // وَقالَ
      [], // لَأَتَّخِذَنَّ
      [], // مِن
      [], // عِبادِكَ
      [], // نَصيبًا
      ["مفروضًا : مقطوعًا لي به"] // مَفروضًا
    ],
    [ // آية 119
      [], // وَلَأُضِلَّنَّهُم
      [], // وَلَأُمَنِّيَنَّهُم
      [], // وَلَـٔامُرَنَّهُم
      ["فليُبتِّكُنّ : فليُقطّعُنّ أو فليشقّنّ"], // فَلَيُبَتِّكُنَّ
      [], // ءاذانَ
      [], // الأَنعـٰمِ
      [], // وَلَـٔامُرَنَّهُم
      [], // فَلَيُغَيِّرُنَّ
      ["خلق الله : فطرت الله و هي دين الإسلام"], // خَلقَ
      ["خلق الله : فطرت الله و هي دين الإسلام"], // اللَّهِ
      [], // وَمَن
      [], // يَتَّخِذِ
      [], // الشَّيطـٰنَ
      [], // وَلِيًّا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // فَقَد
      [], // خَسِرَ
      [], // خُسرانًا
      [] // مُبينًا
    ],
    [ // آية 120
      [], // يَعِدُهُم
      [], // وَيُمَنّيهِم
      [], // وَما
      [], // يَعِدُهُمُ
      [], // الشَّيطـٰنُ
      [], // إِلّا
      ["غرورًا : خداعا و باطلا"] // غُرورًا
    ],
    [ // آية 121
      [], // أُولـٰئِكَ
      [], // مَأوىٰهُم
      [], // جَهَنَّمُ
      [], // وَلا
      [], // يَجِدونَ
      [], // عَنها
      ["محيصًا : محيدصا و مهربا و معدِلا"] // مَحيصًا
    ],
    [ // آية 122
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // سَنُدخِلُهُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقًّا
      [], // وَمَن
      [], // أَصدَقُ
      [], // مِنَ
      [], // اللَّهِ
      ["قيلا : قولا"] // قيلًا
    ],
    [ // آية 123
      [], // لَيسَ
      [], // بِأَمانِيِّكُم
      [], // وَلا
      [], // أَمانِىِّ
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // مَن
      [], // يَعمَل
      [], // سوءًا
      [], // يُجزَ
      [], // بِهِ
      [], // وَلا
      [], // يَجِد
      [], // لَهُ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 124
      [], // وَمَن
      [], // يَعمَل
      [], // مِنَ
      [], // الصّـٰلِحـٰتِ
      [], // مِن
      [], // ذَكَرٍ
      [], // أَو
      [], // أُنثىٰ
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَأُولـٰئِكَ
      [], // يَدخُلونَ
      [], // الجَنَّةَ
      [], // وَلا
      [], // يُظلَمونَ
      ["نقيرًا : قدْر النُقرة في ظهر النّواة"] // نَقيرًا
    ],
    [ // آية 125
      [], // وَمَن
      [], // أَحسَنُ
      [], // دينًا
      [], // مِمَّن
      ["أسلم وجهه لله : أخلص نفسه أو توجّهه و عبادته لله"], // أَسلَمَ
      ["أسلم وجهه لله : أخلص نفسه أو توجّهه و عبادته لله"], // وَجهَهُ
      ["أسلم وجهه لله : أخلص نفسه أو توجّهه و عبادته لله"], // لِلَّهِ
      [], // وَهُوَ
      [], // مُحسِنٌ
      [], // وَاتَّبَعَ
      [], // مِلَّةَ
      [], // إِبرٰهيمَ
      ["حنيفًا : مائلا عن الباطل إلى الدّين الحقّ"], // حَنيفًا
      [], // وَاتَّخَذَ
      [], // اللَّهُ
      [], // إِبرٰهيمَ
      [] // خَليلًا
    ],
    [ // آية 126
      [], // وَلِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // مُحيطًا
    ],
    [ // آية 127
      [], // وَيَستَفتونَكَ
      [], // فِى
      [], // النِّساءِ
      [], // قُلِ
      [], // اللَّهُ
      [], // يُفتيكُم
      [], // فيهِنَّ
      [], // وَما
      [], // يُتلىٰ
      [], // عَلَيكُم
      [], // فِى
      [], // الكِتـٰبِ
      [], // فى
      [], // يَتـٰمَى
      [], // النِّساءِ
      [], // الّـٰتى
      [], // لا
      [], // تُؤتونَهُنَّ
      [], // ما
      [], // كُتِبَ
      [], // لَهُنَّ
      [], // وَتَرغَبونَ
      [], // أَن
      [], // تَنكِحوهُنَّ
      [], // وَالمُستَضعَفينَ
      [], // مِنَ
      [], // الوِلدٰنِ
      [], // وَأَن
      [], // تَقوموا
      [], // لِليَتـٰمىٰ
      ["بالقسط : بالعدل في الميراث و الأموال"], // بِالقِسطِ
      [], // وَما
      [], // تَفعَلوا
      [], // مِن
      [], // خَيرٍ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِهِ
      [] // عَليمًا
    ],
    [ // آية 128
      [], // وَإِنِ
      [], // امرَأَةٌ
      [], // خافَت
      [], // مِن
      ["بعلِها : زوجِها"], // بَعلِها
      ["نشوزًا : تجافيًا عنها ظُلما"], // نُشوزًا
      [], // أَو
      [], // إِعراضًا
      [], // فَلا
      [], // جُناحَ
      [], // عَلَيهِما
      [], // أَن
      [], // يُصلِحا
      [], // بَينَهُما
      [], // صُلحًا
      [], // وَالصُّلحُ
      [], // خَيرٌ
      [], // وَأُحضِرَتِ
      [], // الأَنفُسُ
      ["الشّحّ : البُخل مع الحِرص"], // الشُّحَّ
      [], // وَإِن
      [], // تُحسِنوا
      [], // وَتَتَّقوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرًا
    ],
    [ // آية 129
      [], // وَلَن
      [], // تَستَطيعوا
      ["أن تعدِلوا : في المحبّة و ميل  القلب و المُؤانسة"], // أَن
      ["أن تعدِلوا : في المحبّة و ميل  القلب و المُؤانسة"], // تَعدِلوا
      [], // بَينَ
      [], // النِّساءِ
      [], // وَلَو
      [], // حَرَصتُم
      [], // فَلا
      [], // تَميلوا
      [], // كُلَّ
      [], // المَيلِ
      [], // فَتَذَروها
      [], // كَالمُعَلَّقَةِ
      [], // وَإِن
      [], // تُصلِحوا
      [], // وَتَتَّقوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 130
      [], // وَإِن
      [], // يَتَفَرَّقا
      [], // يُغنِ
      [], // اللَّهُ
      [], // كُلًّا
      [], // مِن
      ["سعتِه : فضلِه و غناه و رزقه"], // سَعَتِهِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // وٰسِعًا
      [] // حَكيمًا
    ],
    [ // آية 131
      [], // وَلِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَلَقَد
      [], // وَصَّينَا
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // مِن
      [], // قَبلِكُم
      [], // وَإِيّاكُم
      [], // أَنِ
      [], // اتَّقُوا
      [], // اللَّهَ
      [], // وَإِن
      [], // تَكفُروا
      [], // فَإِنَّ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَنِيًّا
      [] // حَميدًا
    ],
    [ // آية 132
      [], // وَلِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // وَكيلًا
    ],
    [ // آية 133
      [], // إِن
      [], // يَشَأ
      [], // يُذهِبكُم
      [], // أَيُّهَا
      [], // النّاسُ
      [], // وَيَأتِ
      [], // بِـٔاخَرينَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // ذٰلِكَ
      [] // قَديرًا
    ],
    [ // آية 134
      [], // مَن
      [], // كانَ
      [], // يُريدُ
      [], // ثَوابَ
      [], // الدُّنيا
      [], // فَعِندَ
      [], // اللَّهِ
      [], // ثَوابُ
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // سَميعًا
      [] // بَصيرًا
    ],
    [ // آية 135
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // كونوا
      [], // قَوّٰمينَ
      [], // بِالقِسطِ
      [], // شُهَداءَ
      [], // لِلَّهِ
      [], // وَلَو
      [], // عَلىٰ
      [], // أَنفُسِكُم
      [], // أَوِ
      [], // الوٰلِدَينِ
      [], // وَالأَقرَبينَ
      [], // إِن
      [], // يَكُن
      [], // غَنِيًّا
      [], // أَو
      [], // فَقيرًا
      [], // فَاللَّهُ
      [], // أَولىٰ
      [], // بِهِما
      [], // فَلا
      [], // تَتَّبِعُوا
      [], // الهَوىٰ
      ["أن تعدِلوا : كراهة العدول عن الحقّ"], // أَن
      ["أن تعدِلوا : كراهة العدول عن الحقّ"], // تَعدِلوا
      [], // وَإِن
      [], // تَلوۥا
      [], // أَو
      [], // تُعرِضوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرًا
    ],
    [ // آية 136
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // ءامِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَالكِتـٰبِ
      [], // الَّذى
      [], // نَزَّلَ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // وَالكِتـٰبِ
      [], // الَّذى
      [], // أَنزَلَ
      [], // مِن
      [], // قَبلُ
      [], // وَمَن
      [], // يَكفُر
      [], // بِاللَّهِ
      [], // وَمَلـٰئِكَتِهِ
      [], // وَكُتُبِهِ
      [], // وَرُسُلِهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // فَقَد
      [], // ضَلَّ
      [], // ضَلـٰلًا
      [] // بَعيدًا
    ],
    [ // آية 137
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // ثُمَّ
      [], // كَفَروا
      [], // ثُمَّ
      [], // ءامَنوا
      [], // ثُمَّ
      [], // كَفَروا
      [], // ثُمَّ
      [], // ازدادوا
      [], // كُفرًا
      [], // لَم
      [], // يَكُنِ
      [], // اللَّهُ
      [], // لِيَغفِرَ
      [], // لَهُم
      [], // وَلا
      [], // لِيَهدِيَهُم
      [] // سَبيلًا
    ],
    [ // آية 138
      [], // بَشِّرِ
      [], // المُنـٰفِقينَ
      [], // بِأَنَّ
      [], // لَهُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 139
      [], // الَّذينَ
      [], // يَتَّخِذونَ
      [], // الكـٰفِرينَ
      [], // أَولِياءَ
      [], // مِن
      [], // دونِ
      [], // المُؤمِنينَ
      [], // أَيَبتَغونَ
      [], // عِندَهُمُ
      [], // العِزَّةَ
      [], // فَإِنَّ
      [], // العِزَّةَ
      [], // لِلَّهِ
      [] // جَميعًا
    ],
    [ // آية 140
      [], // وَقَد
      [], // نَزَّلَ
      [], // عَلَيكُم
      [], // فِى
      [], // الكِتـٰبِ
      [], // أَن
      [], // إِذا
      [], // سَمِعتُم
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // يُكفَرُ
      [], // بِها
      [], // وَيُستَهزَأُ
      [], // بِها
      [], // فَلا
      [], // تَقعُدوا
      [], // مَعَهُم
      [], // حَتّىٰ
      [], // يَخوضوا
      [], // فى
      [], // حَديثٍ
      [], // غَيرِهِ
      [], // إِنَّكُم
      [], // إِذًا
      [], // مِثلُهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // جامِعُ
      [], // المُنـٰفِقينَ
      [], // وَالكـٰفِرينَ
      [], // فى
      [], // جَهَنَّمَ
      [] // جَميعًا
    ],
    [ // آية 141
      [], // الَّذينَ
      ["يتربّصون بكم : ينتظرون بكم ما يحدثُ لكم"], // يَتَرَبَّصونَ
      ["يتربّصون بكم : ينتظرون بكم ما يحدثُ لكم"], // بِكُم
      [], // فَإِن
      [], // كانَ
      [], // لَكُم
      ["فتحٌ : نصرٌ و ظفر و غنيمة"], // فَتحٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // قالوا
      [], // أَلَم
      [], // نَكُن
      [], // مَعَكُم
      [], // وَإِن
      [], // كانَ
      [], // لِلكـٰفِرينَ
      [], // نَصيبٌ
      [], // قالوا
      ["ألمْ نسْتَحْوذ عليكم : ألم نغلبكم فأبقينا عليكم"], // أَلَم
      ["ألمْ نسْتَحْوذ عليكم : ألم نغلبكم فأبقينا عليكم"], // نَستَحوِذ
      ["ألمْ نسْتَحْوذ عليكم : ألم نغلبكم فأبقينا عليكم"], // عَلَيكُم
      [], // وَنَمنَعكُم
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // فَاللَّهُ
      [], // يَحكُمُ
      [], // بَينَكُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // وَلَن
      [], // يَجعَلَ
      [], // اللَّهُ
      [], // لِلكـٰفِرينَ
      [], // عَلَى
      [], // المُؤمِنينَ
      [] // سَبيلًا
    ],
    [ // آية 142
      [], // إِنَّ
      [], // المُنـٰفِقينَ
      [], // يُخـٰدِعونَ
      [], // اللَّهَ
      [], // وَهُوَ
      [], // خـٰدِعُهُم
      [], // وَإِذا
      [], // قاموا
      [], // إِلَى
      [], // الصَّلوٰةِ
      [], // قاموا
      [], // كُسالىٰ
      [], // يُراءونَ
      [], // النّاسَ
      [], // وَلا
      [], // يَذكُرونَ
      [], // اللَّهَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 143
      ["مذبْذبين بين ذلك : مُردّدين بين الكُفر و الإيمان"], // مُذَبذَبينَ
      ["مذبْذبين بين ذلك : مُردّدين بين الكُفر و الإيمان"], // بَينَ
      ["مذبْذبين بين ذلك : مُردّدين بين الكُفر و الإيمان"], // ذٰلِكَ
      [], // لا
      [], // إِلىٰ
      [], // هـٰؤُلاءِ
      [], // وَلا
      [], // إِلىٰ
      [], // هـٰؤُلاءِ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَلَن
      [], // تَجِدَ
      [], // لَهُ
      [] // سَبيلًا
    ],
    [ // آية 144
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَتَّخِذُوا
      [], // الكـٰفِرينَ
      [], // أَولِياءَ
      [], // مِن
      [], // دونِ
      [], // المُؤمِنينَ
      [], // أَتُريدونَ
      [], // أَن
      [], // تَجعَلوا
      [], // لِلَّهِ
      [], // عَلَيكُم
      [], // سُلطـٰنًا
      [] // مُبينًا
    ],
    [ // آية 145
      [], // إِنَّ
      [], // المُنـٰفِقينَ
      [], // فِى
      ["الدّرك الأسفل : الطّبق الذي في قعر جهنّم"], // الدَّركِ
      ["الدّرك الأسفل : الطّبق الذي في قعر جهنّم"], // الأَسفَلِ
      [], // مِنَ
      [], // النّارِ
      [], // وَلَن
      [], // تَجِدَ
      [], // لَهُم
      [] // نَصيرًا
    ],
    [ // آية 146
      [], // إِلَّا
      [], // الَّذينَ
      [], // تابوا
      [], // وَأَصلَحوا
      [], // وَاعتَصَموا
      [], // بِاللَّهِ
      [], // وَأَخلَصوا
      [], // دينَهُم
      [], // لِلَّهِ
      [], // فَأُولـٰئِكَ
      [], // مَعَ
      [], // المُؤمِنينَ
      [], // وَسَوفَ
      [], // يُؤتِ
      [], // اللَّهُ
      [], // المُؤمِنينَ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 147
      [], // ما
      [], // يَفعَلُ
      [], // اللَّهُ
      [], // بِعَذابِكُم
      [], // إِن
      [], // شَكَرتُم
      [], // وَءامَنتُم
      [], // وَكانَ
      [], // اللَّهُ
      [], // شاكِرًا
      [] // عَليمًا
    ],
    [ // آية 148
      [], // لا
      [], // يُحِبُّ
      [], // اللَّهُ
      [], // الجَهرَ
      [], // بِالسّوءِ
      [], // مِنَ
      [], // القَولِ
      [], // إِلّا
      [], // مَن
      [], // ظُلِمَ
      [], // وَكانَ
      [], // اللَّهُ
      [], // سَميعًا
      [] // عَليمًا
    ],
    [ // آية 149
      [], // إِن
      [], // تُبدوا
      [], // خَيرًا
      [], // أَو
      [], // تُخفوهُ
      [], // أَو
      [], // تَعفوا
      [], // عَن
      [], // سوءٍ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَفُوًّا
      [] // قَديرًا
    ],
    [ // آية 150
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَكفُرونَ
      [], // بِاللَّهِ
      [], // وَرُسُلِهِ
      [], // وَيُريدونَ
      [], // أَن
      [], // يُفَرِّقوا
      [], // بَينَ
      [], // اللَّهِ
      [], // وَرُسُلِهِ
      [], // وَيَقولونَ
      [], // نُؤمِنُ
      [], // بِبَعضٍ
      [], // وَنَكفُرُ
      [], // بِبَعضٍ
      [], // وَيُريدونَ
      [], // أَن
      [], // يَتَّخِذوا
      [], // بَينَ
      [], // ذٰلِكَ
      [] // سَبيلًا
    ],
    [ // آية 151
      [], // أُولـٰئِكَ
      [], // هُمُ
      [], // الكـٰفِرونَ
      [], // حَقًّا
      [], // وَأَعتَدنا
      [], // لِلكـٰفِرينَ
      [], // عَذابًا
      [] // مُهينًا
    ],
    [ // آية 152
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَرُسُلِهِ
      [], // وَلَم
      [], // يُفَرِّقوا
      [], // بَينَ
      [], // أَحَدٍ
      [], // مِنهُم
      [], // أُولـٰئِكَ
      [], // سَوفَ
      [], // يُؤتيهِم
      [], // أُجورَهُم
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 153
      [], // يَسـَٔلُكَ
      [], // أَهلُ
      [], // الكِتـٰبِ
      [], // أَن
      [], // تُنَزِّلَ
      [], // عَلَيهِم
      [], // كِتـٰبًا
      [], // مِنَ
      [], // السَّماءِ
      [], // فَقَد
      [], // سَأَلوا
      [], // موسىٰ
      [], // أَكبَرَ
      [], // مِن
      [], // ذٰلِكَ
      [], // فَقالوا
      [], // أَرِنَا
      [], // اللَّهَ
      ["جهرةً : عيانًا بالبصر"], // جَهرَةً
      [], // فَأَخَذَتهُمُ
      [], // الصّـٰعِقَةُ
      [], // بِظُلمِهِم
      [], // ثُمَّ
      [], // اتَّخَذُوا
      [], // العِجلَ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // جاءَتهُمُ
      [], // البَيِّنـٰتُ
      [], // فَعَفَونا
      [], // عَن
      [], // ذٰلِكَ
      [], // وَءاتَينا
      [], // موسىٰ
      [], // سُلطـٰنًا
      [] // مُبينًا
    ],
    [ // آية 154
      [], // وَرَفَعنا
      [], // فَوقَهُمُ
      [], // الطّورَ
      [], // بِميثـٰقِهِم
      [], // وَقُلنا
      [], // لَهُمُ
      [], // ادخُلُوا
      [], // البابَ
      [], // سُجَّدًا
      [], // وَقُلنا
      [], // لَهُم
      [], // لا
      [], // تَعدوا
      [], // فِى
      [], // السَّبتِ
      [], // وَأَخَذنا
      [], // مِنهُم
      [], // ميثـٰقًا
      [] // غَليظًا
    ],
    [ // آية 155
      [], // فَبِما
      [], // نَقضِهِم
      [], // ميثـٰقَهُم
      [], // وَكُفرِهِم
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَقَتلِهِمُ
      [], // الأَنبِياءَ
      [], // بِغَيرِ
      [], // حَقٍّ
      [], // وَقَولِهِم
      ["قلوبُنا غلف : مغشّاة بأغطية خِلقية فلا تعي"], // قُلوبُنا
      ["قلوبُنا غلف : مغشّاة بأغطية خِلقية فلا تعي"], // غُلفٌ
      [], // بَل
      ["طبع الله عليها : ختم عليها فحجبها عن العِلم"], // طَبَعَ
      ["طبع الله عليها : ختم عليها فحجبها عن العِلم"], // اللَّهُ
      ["طبع الله عليها : ختم عليها فحجبها عن العِلم"], // عَلَيها
      [], // بِكُفرِهِم
      [], // فَلا
      [], // يُؤمِنونَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 156
      [], // وَبِكُفرِهِم
      [], // وَقَولِهِم
      [], // عَلىٰ
      [], // مَريَمَ
      [], // بُهتـٰنًا
      [] // عَظيمًا
    ],
    [ // آية 157
      [], // وَقَولِهِم
      [], // إِنّا
      [], // قَتَلنَا
      [], // المَسيحَ
      [], // عيسَى
      [], // ابنَ
      [], // مَريَمَ
      [], // رَسولَ
      [], // اللَّهِ
      [], // وَما
      [], // قَتَلوهُ
      [], // وَما
      [], // صَلَبوهُ
      [], // وَلـٰكِن
      ["شُبِّه لهم : أُلقِي على المقتول شبه عيسى"], // شُبِّهَ
      ["شُبِّه لهم : أُلقِي على المقتول شبه عيسى"], // لَهُم
      [], // وَإِنَّ
      [], // الَّذينَ
      [], // اختَلَفوا
      [], // فيهِ
      [], // لَفى
      [], // شَكٍّ
      [], // مِنهُ
      [], // ما
      [], // لَهُم
      [], // بِهِ
      [], // مِن
      [], // عِلمٍ
      [], // إِلَّا
      [], // اتِّباعَ
      [], // الظَّنِّ
      [], // وَما
      [], // قَتَلوهُ
      [] // يَقينًا
    ],
    [ // آية 158
      [], // بَل
      [], // رَفَعَهُ
      [], // اللَّهُ
      [], // إِلَيهِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَزيزًا
      [] // حَكيمًا
    ],
    [ // آية 159
      [], // وَإِن
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // إِلّا
      [], // لَيُؤمِنَنَّ
      [], // بِهِ
      [], // قَبلَ
      [], // مَوتِهِ
      [], // وَيَومَ
      [], // القِيـٰمَةِ
      [], // يَكونُ
      [], // عَلَيهِم
      [] // شَهيدًا
    ],
    [ // آية 160
      [], // فَبِظُلمٍ
      [], // مِنَ
      [], // الَّذينَ
      [], // هادوا
      [], // حَرَّمنا
      [], // عَلَيهِم
      [], // طَيِّبـٰتٍ
      [], // أُحِلَّت
      [], // لَهُم
      [], // وَبِصَدِّهِم
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [] // كَثيرًا
    ],
    [ // آية 161
      [], // وَأَخذِهِمُ
      [], // الرِّبوٰا۟
      [], // وَقَد
      [], // نُهوا
      [], // عَنهُ
      [], // وَأَكلِهِم
      [], // أَموٰلَ
      [], // النّاسِ
      [], // بِالبـٰطِلِ
      [], // وَأَعتَدنا
      [], // لِلكـٰفِرينَ
      [], // مِنهُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 162
      [], // لـٰكِنِ
      [], // الرّٰسِخونَ
      [], // فِى
      [], // العِلمِ
      [], // مِنهُم
      [], // وَالمُؤمِنونَ
      [], // يُؤمِنونَ
      [], // بِما
      [], // أُنزِلَ
      [], // إِلَيكَ
      [], // وَما
      [], // أُنزِلَ
      [], // مِن
      [], // قَبلِكَ
      [], // وَالمُقيمينَ
      [], // الصَّلوٰةَ
      [], // وَالمُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَالمُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // أُولـٰئِكَ
      [], // سَنُؤتيهِم
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 163
      [], // إِنّا
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // كَما
      [], // أَوحَينا
      [], // إِلىٰ
      [], // نوحٍ
      [], // وَالنَّبِيّـۧنَ
      [], // مِن
      [], // بَعدِهِ
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // إِبرٰهيمَ
      [], // وَإِسمـٰعيلَ
      [], // وَإِسحـٰقَ
      [], // وَيَعقوبَ
      [], // وَالأَسباطِ
      [], // وَعيسىٰ
      [], // وَأَيّوبَ
      [], // وَيونُسَ
      [], // وَهـٰرونَ
      [], // وَسُلَيمـٰنَ
      [], // وَءاتَينا
      [], // داوۥدَ
      [] // زَبورًا
    ],
    [ // آية 164
      [], // وَرُسُلًا
      [], // قَد
      [], // قَصَصنـٰهُم
      [], // عَلَيكَ
      [], // مِن
      [], // قَبلُ
      [], // وَرُسُلًا
      [], // لَم
      [], // نَقصُصهُم
      [], // عَلَيكَ
      [], // وَكَلَّمَ
      [], // اللَّهُ
      [], // موسىٰ
      [] // تَكليمًا
    ],
    [ // آية 165
      [], // رُسُلًا
      [], // مُبَشِّرينَ
      [], // وَمُنذِرينَ
      [], // لِئَلّا
      [], // يَكونَ
      [], // لِلنّاسِ
      [], // عَلَى
      [], // اللَّهِ
      [], // حُجَّةٌ
      [], // بَعدَ
      [], // الرُّسُلِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَزيزًا
      [] // حَكيمًا
    ],
    [ // آية 166
      [], // لـٰكِنِ
      [], // اللَّهُ
      [], // يَشهَدُ
      [], // بِما
      [], // أَنزَلَ
      [], // إِلَيكَ
      [], // أَنزَلَهُ
      [], // بِعِلمِهِ
      [], // وَالمَلـٰئِكَةُ
      [], // يَشهَدونَ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // شَهيدًا
    ],
    [ // آية 167
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَصَدّوا
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // قَد
      [], // ضَلّوا
      [], // ضَلـٰلًا
      [] // بَعيدًا
    ],
    [ // آية 168
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَظَلَموا
      [], // لَم
      [], // يَكُنِ
      [], // اللَّهُ
      [], // لِيَغفِرَ
      [], // لَهُم
      [], // وَلا
      [], // لِيَهدِيَهُم
      [] // طَريقًا
    ],
    [ // آية 169
      [], // إِلّا
      [], // طَريقَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // وَكانَ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرًا
    ],
    [ // آية 170
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // قَد
      [], // جاءَكُمُ
      [], // الرَّسولُ
      [], // بِالحَقِّ
      [], // مِن
      [], // رَبِّكُم
      [], // فَـٔامِنوا
      [], // خَيرًا
      [], // لَكُم
      [], // وَإِن
      [], // تَكفُروا
      [], // فَإِنَّ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 171
      [], // يـٰأَهلَ
      [], // الكِتـٰبِ
      [], // لا
      [], // تَغلوا
      [], // فى
      [], // دينِكُم
      [], // وَلا
      [], // تَقولوا
      [], // عَلَى
      [], // اللَّهِ
      [], // إِلَّا
      [], // الحَقَّ
      [], // إِنَّمَا
      [], // المَسيحُ
      [], // عيسَى
      [], // ابنُ
      [], // مَريَمَ
      [], // رَسولُ
      [], // اللَّهِ
      [], // وَكَلِمَتُهُ
      [], // أَلقىٰها
      [], // إِلىٰ
      [], // مَريَمَ
      [], // وَروحٌ
      [], // مِنهُ
      [], // فَـٔامِنوا
      [], // بِاللَّهِ
      [], // وَرُسُلِهِ
      [], // وَلا
      [], // تَقولوا
      [], // ثَلـٰثَةٌ
      [], // انتَهوا
      [], // خَيرًا
      [], // لَكُم
      [], // إِنَّمَا
      [], // اللَّهُ
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // سُبحـٰنَهُ
      [], // أَن
      [], // يَكونَ
      [], // لَهُ
      [], // وَلَدٌ
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // وَكيلًا
    ],
    [ // آية 172
      ["لن يستنكِف : لن يأنف و يترفّع و يستكبر"], // لَن
      ["لن يستنكِف : لن يأنف و يترفّع و يستكبر"], // يَستَنكِفَ
      [], // المَسيحُ
      [], // أَن
      [], // يَكونَ
      [], // عَبدًا
      [], // لِلَّهِ
      [], // وَلَا
      [], // المَلـٰئِكَةُ
      [], // المُقَرَّبونَ
      [], // وَمَن
      [], // يَستَنكِف
      [], // عَن
      [], // عِبادَتِهِ
      [], // وَيَستَكبِر
      [], // فَسَيَحشُرُهُم
      [], // إِلَيهِ
      [] // جَميعًا
    ],
    [ // آية 173
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فَيُوَفّيهِم
      [], // أُجورَهُم
      [], // وَيَزيدُهُم
      [], // مِن
      [], // فَضلِهِ
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // استَنكَفوا
      [], // وَاستَكبَروا
      [], // فَيُعَذِّبُهُم
      [], // عَذابًا
      [], // أَليمًا
      [], // وَلا
      [], // يَجِدونَ
      [], // لَهُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 174
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // قَد
      [], // جاءَكُم
      [], // بُرهـٰنٌ
      [], // مِن
      [], // رَبِّكُم
      [], // وَأَنزَلنا
      [], // إِلَيكُم
      ["نورا مُبينًا : هو القرآن العظيم"], // نورًا
      ["نورا مُبينًا : هو القرآن العظيم"] // مُبينًا
    ],
    [ // آية 175
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَاعتَصَموا
      [], // بِهِ
      [], // فَسَيُدخِلُهُم
      [], // فى
      [], // رَحمَةٍ
      [], // مِنهُ
      [], // وَفَضلٍ
      [], // وَيَهديهِم
      [], // إِلَيهِ
      [], // صِرٰطًا
      [] // مُستَقيمًا
    ],
    [ // آية 176
      [], // يَستَفتونَكَ
      [], // قُلِ
      [], // اللَّهُ
      [], // يُفتيكُم
      [], // فِى
      [], // الكَلـٰلَةِ
      [], // إِنِ
      [], // امرُؤٌا۟
      [], // هَلَكَ
      [], // لَيسَ
      [], // لَهُ
      [], // وَلَدٌ
      [], // وَلَهُ
      [], // أُختٌ
      [], // فَلَها
      [], // نِصفُ
      [], // ما
      [], // تَرَكَ
      [], // وَهُوَ
      [], // يَرِثُها
      [], // إِن
      [], // لَم
      [], // يَكُن
      [], // لَها
      [], // وَلَدٌ
      [], // فَإِن
      [], // كانَتَا
      [], // اثنَتَينِ
      [], // فَلَهُمَا
      [], // الثُّلُثانِ
      [], // مِمّا
      [], // تَرَكَ
      [], // وَإِن
      [], // كانوا
      [], // إِخوَةً
      [], // رِجالًا
      [], // وَنِساءً
      [], // فَلِلذَّكَرِ
      [], // مِثلُ
      [], // حَظِّ
      [], // الأُنثَيَينِ
      [], // يُبَيِّنُ
      [], // اللَّهُ
      [], // لَكُم
      [], // أَن
      [], // تَضِلّوا
      [], // وَاللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ]
];

export default meanings;