const meanings = [
  [ // سورة 40: غافر
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // تَنزيلُ
      [], // الكِتـٰبِ
      [], // مِنَ
      [], // اللَّهِ
      [], // العَزيزِ
      [] // العَليمِ
    ],
    [ // آية 3
      ["غافر الذنب : ساتر الذنب للمؤمنين"], // غافِرِ
      ["غافر الذنب : ساتر الذنب للمؤمنين"], // الذَّنبِ
      [], // وَقابِلِ
      [], // التَّوبِ
      [], // شَديدِ
      [], // العِقابِ
      [], // ذِى
      [], // الطَّولِ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // إِلَيهِ
      [] // المَصيرُ
    ],
    [ // آية 4
      [], // ما
      [], // يُجـٰدِلُ
      [], // فى
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // إِلَّا
      [], // الَّذينَ
      [], // كَفَروا
      ["فلا يغرُرْك : فلا يَخدَعك"], // فَلا
      ["فلا يغرُرْك : فلا يَخدَعك"], // يَغرُركَ
      ["تقلبهم : تنـقـّـلهُمْ سالمين غانمين فإنّه استدراج"], // تَقَلُّبُهُم
      [], // فِى
      [] // البِلـٰدِ
    ],
    [ // آية 5
      [], // كَذَّبَت
      [], // قَبلَهُم
      [], // قَومُ
      [], // نوحٍ
      [], // وَالأَحزابُ
      [], // مِن
      [], // بَعدِهِم
      [], // وَهَمَّت
      [], // كُلُّ
      [], // أُمَّةٍ
      [], // بِرَسولِهِم
      [], // لِيَأخُذوهُ
      [], // وَجـٰدَلوا
      [], // بِالبـٰطِلِ
      [], // لِيُدحِضوا
      [], // بِهِ
      [], // الحَقَّ
      [], // فَأَخَذتُهُم
      [], // فَكَيفَ
      [], // كانَ
      [] // عِقابِ
    ],
    [ // آية 6
      [], // وَكَذٰلِكَ
      [], // حَقَّت
      [], // كَلِمَتُ
      [], // رَبِّكَ
      [], // عَلَى
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَنَّهُم
      [], // أَصحـٰبُ
      [] // النّارِ
    ],
    [ // آية 7
      [], // الَّذينَ
      [], // يَحمِلونَ
      [], // العَرشَ
      [], // وَمَن
      [], // حَولَهُ
      [], // يُسَبِّحونَ
      [], // بِحَمدِ
      [], // رَبِّهِم
      [], // وَيُؤمِنونَ
      [], // بِهِ
      [], // وَيَستَغفِرونَ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // رَبَّنا
      [], // وَسِعتَ
      [], // كُلَّ
      [], // شَىءٍ
      [], // رَحمَةً
      [], // وَعِلمًا
      [], // فَاغفِر
      [], // لِلَّذينَ
      [], // تابوا
      [], // وَاتَّبَعوا
      ["سبيلك : طريق الهدى (دين الإسلام)"], // سَبيلَكَ
      [], // وَقِهِم
      [], // عَذابَ
      [] // الجَحيمِ
    ],
    [ // آية 8
      [], // رَبَّنا
      [], // وَأَدخِلهُم
      [], // جَنّـٰتِ
      [], // عَدنٍ
      [], // الَّتى
      [], // وَعَدتَهُم
      [], // وَمَن
      [], // صَلَحَ
      [], // مِن
      [], // ءابائِهِم
      [], // وَأَزوٰجِهِم
      [], // وَذُرِّيّـٰتِهِم
      [], // إِنَّكَ
      [], // أَنتَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 9
      [], // وَقِهِمُ
      [], // السَّيِّـٔاتِ
      [], // وَمَن
      [], // تَقِ
      [], // السَّيِّـٔاتِ
      [], // يَومَئِذٍ
      [], // فَقَد
      [], // رَحِمتَهُ
      [], // وَذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 10
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // يُنادَونَ
      ["لمَقت الله : لبغضه الشديد و غَضبه عليكم"], // لَمَقتُ
      ["لمَقت الله : لبغضه الشديد و غَضبه عليكم"], // اللَّهِ
      [], // أَكبَرُ
      [], // مِن
      [], // مَقتِكُم
      [], // أَنفُسَكُم
      [], // إِذ
      [], // تُدعَونَ
      [], // إِلَى
      [], // الإيمـٰنِ
      [] // فَتَكفُرونَ
    ],
    [ // آية 11
      [], // قالوا
      [], // رَبَّنا
      [], // أَمَتَّنَا
      [], // اثنَتَينِ
      [], // وَأَحيَيتَنَا
      [], // اثنَتَينِ
      [], // فَاعتَرَفنا
      [], // بِذُنوبِنا
      [], // فَهَل
      [], // إِلىٰ
      [], // خُروجٍ
      [], // مِن
      [] // سَبيلٍ
    ],
    [ // آية 12
      [], // ذٰلِكُم
      [], // بِأَنَّهُ
      [], // إِذا
      [], // دُعِىَ
      [], // اللَّهُ
      [], // وَحدَهُ
      [], // كَفَرتُم
      [], // وَإِن
      [], // يُشرَك
      [], // بِهِ
      ["تؤمنوا : تذعـنوا و تقِرّوا بالشرك"], // تُؤمِنوا
      [], // فَالحُكمُ
      [], // لِلَّهِ
      [], // العَلِىِّ
      [] // الكَبيرِ
    ],
    [ // آية 13
      [], // هُوَ
      [], // الَّذى
      [], // يُريكُم
      [], // ءايـٰتِهِ
      [], // وَيُنَزِّلُ
      [], // لَكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // رِزقًا
      [], // وَما
      [], // يَتَذَكَّرُ
      [], // إِلّا
      [], // مَن
      ["ينيب : يَرْجع إلى التـّـفكّر في الآيات"] // يُنيبُ
    ],
    [ // آية 14
      [], // فَادعُوا
      [], // اللَّهَ
      [], // مُخلِصينَ
      [], // لَهُ
      [], // الدّينَ
      [], // وَلَو
      [], // كَرِهَ
      [] // الكـٰفِرونَ
    ],
    [ // آية 15
      [], // رَفيعُ
      [], // الدَّرَجـٰتِ
      [], // ذُو
      [], // العَرشِ
      [], // يُلقِى
      [], // الرّوحَ
      [], // مِن
      [], // أَمرِهِ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // لِيُنذِرَ
      ["يوم التلاق : يوم الإجتماع في المَحشر"], // يَومَ
      ["يوم التلاق : يوم الإجتماع في المَحشر"] // التَّلاقِ
    ],
    [ // آية 16
      [], // يَومَ
      [], // هُم
      [], // بـٰرِزونَ
      [], // لا
      [], // يَخفىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // مِنهُم
      [], // شَىءٌ
      [], // لِمَنِ
      [], // المُلكُ
      [], // اليَومَ
      [], // لِلَّهِ
      [], // الوٰحِدِ
      [] // القَهّارِ
    ],
    [ // آية 17
      [], // اليَومَ
      [], // تُجزىٰ
      [], // كُلُّ
      [], // نَفسٍ
      [], // بِما
      [], // كَسَبَت
      [], // لا
      [], // ظُلمَ
      [], // اليَومَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَريعُ
      [] // الحِسابِ
    ],
    [ // آية 18
      [], // وَأَنذِرهُم
      [], // يَومَ
      [], // الـٔازِفَةِ
      [], // إِذِ
      [], // القُلوبُ
      [], // لَدَى
      ["الحناجر : التـّـراقي و الحلاقيم"], // الحَناجِرِ
      [], // كـٰظِمينَ
      [], // ما
      [], // لِلظّـٰلِمينَ
      [], // مِن
      ["حميم : قريب مُـشفـق يَهتمّ بهمْ"], // حَميمٍ
      [], // وَلا
      [], // شَفيعٍ
      [] // يُطاعُ
    ],
    [ // آية 19
      [], // يَعلَمُ
      ["خائنة الأعين : النظرة الخائنة إلى مالا يحلّ"], // خائِنَةَ
      ["خائنة الأعين : النظرة الخائنة إلى مالا يحلّ"], // الأَعيُنِ
      [], // وَما
      [], // تُخفِى
      [] // الصُّدورُ
    ],
    [ // آية 20
      [], // وَاللَّهُ
      [], // يَقضى
      [], // بِالحَقِّ
      [], // وَالَّذينَ
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // لا
      [], // يَقضونَ
      [], // بِشَىءٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // السَّميعُ
      [] // البَصيرُ
    ],
    [ // آية 21
      [], // أَوَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // كانوا
      [], // مِن
      [], // قَبلِهِم
      [], // كانوا
      [], // هُم
      [], // أَشَدَّ
      [], // مِنهُم
      [], // قُوَّةً
      [], // وَءاثارًا
      [], // فِى
      [], // الأَرضِ
      [], // فَأَخَذَهُمُ
      [], // اللَّهُ
      [], // بِذُنوبِهِم
      [], // وَما
      [], // كانَ
      [], // لَهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // مِن
      ["واق : دافع يدْفع عنهم العَذاب"] // واقٍ
    ],
    [ // آية 22
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // كانَت
      [], // تَأتيهِم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَكَفَروا
      [], // فَأَخَذَهُمُ
      [], // اللَّهُ
      [], // إِنَّهُ
      [], // قَوِىٌّ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 23
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // وَسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 24
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَهـٰمـٰنَ
      [], // وَقـٰرونَ
      [], // فَقالوا
      [], // سـٰحِرٌ
      [] // كَذّابٌ
    ],
    [ // آية 25
      [], // فَلَمّا
      [], // جاءَهُم
      [], // بِالحَقِّ
      [], // مِن
      [], // عِندِنا
      [], // قالُوا
      [], // اقتُلوا
      [], // أَبناءَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // وَاستَحيوا
      [], // نِساءَهُم
      [], // وَما
      [], // كَيدُ
      [], // الكـٰفِرينَ
      [], // إِلّا
      [], // فى
      [] // ضَلـٰلٍ
    ],
    [ // آية 26
      [], // وَقالَ
      [], // فِرعَونُ
      [], // ذَرونى
      [], // أَقتُل
      [], // موسىٰ
      [], // وَليَدعُ
      [], // رَبَّهُ
      [], // إِنّى
      [], // أَخافُ
      [], // أَن
      [], // يُبَدِّلَ
      [], // دينَكُم
      [], // أَو
      [], // أَن
      [], // يُظهِرَ
      [], // فِى
      [], // الأَرضِ
      [] // الفَسادَ
    ],
    [ // آية 27
      [], // وَقالَ
      [], // موسىٰ
      [], // إِنّى
      [], // عُذتُ
      [], // بِرَبّى
      [], // وَرَبِّكُم
      [], // مِن
      [], // كُلِّ
      [], // مُتَكَبِّرٍ
      [], // لا
      [], // يُؤمِنُ
      [], // بِيَومِ
      [] // الحِسابِ
    ],
    [ // آية 28
      [], // وَقالَ
      [], // رَجُلٌ
      [], // مُؤمِنٌ
      [], // مِن
      [], // ءالِ
      [], // فِرعَونَ
      [], // يَكتُمُ
      [], // إيمـٰنَهُ
      [], // أَتَقتُلونَ
      [], // رَجُلًا
      [], // أَن
      [], // يَقولَ
      [], // رَبِّىَ
      [], // اللَّهُ
      [], // وَقَد
      [], // جاءَكُم
      [], // بِالبَيِّنـٰتِ
      [], // مِن
      [], // رَبِّكُم
      [], // وَإِن
      [], // يَكُ
      [], // كـٰذِبًا
      [], // فَعَلَيهِ
      [], // كَذِبُهُ
      [], // وَإِن
      [], // يَكُ
      [], // صادِقًا
      [], // يُصِبكُم
      [], // بَعضُ
      [], // الَّذى
      [], // يَعِدُكُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدى
      [], // مَن
      [], // هُوَ
      [], // مُسرِفٌ
      [] // كَذّابٌ
    ],
    [ // آية 29
      [], // يـٰقَومِ
      [], // لَكُمُ
      [], // المُلكُ
      [], // اليَومَ
      [], // ظـٰهِرينَ
      [], // فِى
      [], // الأَرضِ
      [], // فَمَن
      [], // يَنصُرُنا
      [], // مِن
      ["بأس الله : عذابه و نِقمَته"], // بَأسِ
      ["بأس الله : عذابه و نِقمَته"], // اللَّهِ
      [], // إِن
      [], // جاءَنا
      [], // قالَ
      [], // فِرعَونُ
      ["ما أريكم : ما أشِـير عليكمْ"], // ما
      ["ما أريكم : ما أشِـير عليكمْ"], // أُريكُم
      [], // إِلّا
      [], // ما
      [], // أَرىٰ
      [], // وَما
      [], // أَهديكُم
      [], // إِلّا
      [], // سَبيلَ
      [] // الرَّشادِ
    ],
    [ // آية 30
      [], // وَقالَ
      [], // الَّذى
      [], // ءامَنَ
      [], // يـٰقَومِ
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // مِثلَ
      [], // يَومِ
      ["الأحزاب : الأمم الماضية المتحزّبة على الأنبياء"] // الأَحزابِ
    ],
    [ // آية 31
      [], // مِثلَ
      ["دأب قوم نوح : عَادَتهمْ في القيامة و على التـّـكذيب"], // دَأبِ
      ["دأب قوم نوح : عَادَتهمْ في القيامة و على التـّـكذيب"], // قَومِ
      ["دأب قوم نوح : عَادَتهمْ في القيامة و على التـّـكذيب"], // نوحٍ
      [], // وَعادٍ
      [], // وَثَمودَ
      [], // وَالَّذينَ
      [], // مِن
      [], // بَعدِهِم
      [], // وَمَا
      [], // اللَّهُ
      [], // يُريدُ
      [], // ظُلمًا
      [] // لِلعِبادِ
    ],
    [ // آية 32
      [], // وَيـٰقَومِ
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // يَومَ
      [] // التَّنادِ
    ],
    [ // آية 33
      [], // يَومَ
      [], // تُوَلّونَ
      [], // مُدبِرينَ
      [], // ما
      [], // لَكُم
      [], // مِنَ
      [], // اللَّهِ
      [], // مِن
      ["عاصم : مانع و دافع"], // عاصِمٍ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [] // هادٍ
    ],
    [ // آية 34
      [], // وَلَقَد
      [], // جاءَكُم
      [], // يوسُفُ
      [], // مِن
      [], // قَبلُ
      [], // بِالبَيِّنـٰتِ
      [], // فَما
      [], // زِلتُم
      [], // فى
      [], // شَكٍّ
      [], // مِمّا
      [], // جاءَكُم
      [], // بِهِ
      [], // حَتّىٰ
      [], // إِذا
      [], // هَلَكَ
      [], // قُلتُم
      [], // لَن
      [], // يَبعَثَ
      [], // اللَّهُ
      [], // مِن
      [], // بَعدِهِ
      [], // رَسولًا
      [], // كَذٰلِكَ
      [], // يُضِلُّ
      [], // اللَّهُ
      [], // مَن
      [], // هُوَ
      [], // مُسرِفٌ
      ["مرتاب : في دين الله شاكّ في وَحْدانيّـته"] // مُرتابٌ
    ],
    [ // آية 35
      [], // الَّذينَ
      [], // يُجـٰدِلونَ
      [], // فى
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // سُلطـٰنٍ
      [], // أَتىٰهُم
      [], // كَبُرَ
      [], // مَقتًا
      [], // عِندَ
      [], // اللَّهِ
      [], // وَعِندَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // كَذٰلِكَ
      [], // يَطبَعُ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // قَلبِ
      [], // مُتَكَبِّرٍ
      [] // جَبّارٍ
    ],
    [ // آية 36
      [], // وَقالَ
      [], // فِرعَونُ
      [], // يـٰهـٰمـٰنُ
      [], // ابنِ
      [], // لى
      ["صرحا : قصرًا . أو بناءً عاليا ظاهرا"], // صَرحًا
      [], // لَعَلّى
      [], // أَبلُغُ
      [] // الأَسبـٰبَ
    ],
    [ // آية 37
      [], // أَسبـٰبَ
      [], // السَّمـٰوٰتِ
      [], // فَأَطَّلِعَ
      [], // إِلىٰ
      [], // إِلـٰهِ
      [], // موسىٰ
      [], // وَإِنّى
      [], // لَأَظُنُّهُ
      [], // كـٰذِبًا
      [], // وَكَذٰلِكَ
      [], // زُيِّنَ
      [], // لِفِرعَونَ
      [], // سوءُ
      [], // عَمَلِهِ
      [], // وَصُدَّ
      [], // عَنِ
      [], // السَّبيلِ
      [], // وَما
      [], // كَيدُ
      [], // فِرعَونَ
      [], // إِلّا
      [], // فى
      [] // تَبابٍ
    ],
    [ // آية 38
      [], // وَقالَ
      [], // الَّذى
      [], // ءامَنَ
      [], // يـٰقَومِ
      [], // اتَّبِعونِ
      [], // أَهدِكُم
      [], // سَبيلَ
      [] // الرَّشادِ
    ],
    [ // آية 39
      [], // يـٰقَومِ
      [], // إِنَّما
      [], // هـٰذِهِ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // مَتـٰعٌ
      [], // وَإِنَّ
      [], // الـٔاخِرَةَ
      [], // هِىَ
      [], // دارُ
      [] // القَرارِ
    ],
    [ // آية 40
      [], // مَن
      [], // عَمِلَ
      [], // سَيِّئَةً
      [], // فَلا
      [], // يُجزىٰ
      [], // إِلّا
      [], // مِثلَها
      [], // وَمَن
      [], // عَمِلَ
      [], // صـٰلِحًا
      [], // مِن
      [], // ذَكَرٍ
      [], // أَو
      [], // أُنثىٰ
      [], // وَهُوَ
      [], // مُؤمِنٌ
      [], // فَأُولـٰئِكَ
      [], // يَدخُلونَ
      [], // الجَنَّةَ
      [], // يُرزَقونَ
      [], // فيها
      ["بغير حساب : بلا نهاية من الرزاق لِما يُعطي"], // بِغَيرِ
      ["بغير حساب : بلا نهاية من الرزاق لِما يُعطي"] // حِسابٍ
    ],
    [ // آية 41
      [], // وَيـٰقَومِ
      [], // ما
      [], // لى
      [], // أَدعوكُم
      [], // إِلَى
      [], // النَّجوٰةِ
      [], // وَتَدعونَنى
      [], // إِلَى
      [] // النّارِ
    ],
    [ // آية 42
      [], // تَدعونَنى
      [], // لِأَكفُرَ
      [], // بِاللَّهِ
      [], // وَأُشرِكَ
      [], // بِهِ
      [], // ما
      [], // لَيسَ
      [], // لى
      [], // بِهِ
      [], // عِلمٌ
      [], // وَأَنا۠
      [], // أَدعوكُم
      [], // إِلَى
      [], // العَزيزِ
      [] // الغَفّـٰرِ
    ],
    [ // آية 43
      [], // لا
      [], // جَرَمَ
      [], // أَنَّما
      [], // تَدعونَنى
      [], // إِلَيهِ
      ["ليس له دعوة : مستجابة . أو استجابة دعوة"], // لَيسَ
      ["ليس له دعوة : مستجابة . أو استجابة دعوة"], // لَهُ
      ["ليس له دعوة : مستجابة . أو استجابة دعوة"], // دَعوَةٌ
      [], // فِى
      [], // الدُّنيا
      [], // وَلا
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // وَأَنَّ
      ["مردنا إلى الله : رُجُوعنا بعد المَوت إليه تعالى للجَزاء"], // مَرَدَّنا
      ["مردنا إلى الله : رُجُوعنا بعد المَوت إليه تعالى للجَزاء"], // إِلَى
      ["مردنا إلى الله : رُجُوعنا بعد المَوت إليه تعالى للجَزاء"], // اللَّهِ
      [], // وَأَنَّ
      [], // المُسرِفينَ
      [], // هُم
      [], // أَصحـٰبُ
      [] // النّارِ
    ],
    [ // آية 44
      [], // فَسَتَذكُرونَ
      [], // ما
      [], // أَقولُ
      [], // لَكُم
      [], // وَأُفَوِّضُ
      [], // أَمرى
      [], // إِلَى
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بَصيرٌ
      [] // بِالعِبادِ
    ],
    [ // آية 45
      [], // فَوَقىٰهُ
      [], // اللَّهُ
      [], // سَيِّـٔاتِ
      [], // ما
      [], // مَكَروا
      [], // وَحاقَ
      [], // بِـٔالِ
      [], // فِرعَونَ
      [], // سوءُ
      [] // العَذابِ
    ],
    [ // آية 46
      [], // النّارُ
      [], // يُعرَضونَ
      [], // عَلَيها
      [], // غُدُوًّا
      [], // وَعَشِيًّا
      [], // وَيَومَ
      [], // تَقومُ
      [], // السّاعَةُ
      [], // أَدخِلوا
      [], // ءالَ
      [], // فِرعَونَ
      [], // أَشَدَّ
      [] // العَذابِ
    ],
    [ // آية 47
      [], // وَإِذ
      [], // يَتَحاجّونَ
      [], // فِى
      [], // النّارِ
      [], // فَيَقولُ
      [], // الضُّعَفـٰؤُا۟
      [], // لِلَّذينَ
      [], // استَكبَروا
      [], // إِنّا
      [], // كُنّا
      [], // لَكُم
      [], // تَبَعًا
      [], // فَهَل
      [], // أَنتُم
      ["مغنون عنا : دافِـعون . أو حاملون عنّا"], // مُغنونَ
      ["مغنون عنا : دافِـعون . أو حاملون عنّا"], // عَنّا
      [], // نَصيبًا
      [], // مِنَ
      [] // النّارِ
    ],
    [ // آية 48
      [], // قالَ
      [], // الَّذينَ
      [], // استَكبَروا
      [], // إِنّا
      [], // كُلٌّ
      [], // فيها
      [], // إِنَّ
      [], // اللَّهَ
      [], // قَد
      [], // حَكَمَ
      [], // بَينَ
      [] // العِبادِ
    ],
    [ // آية 49
      [], // وَقالَ
      [], // الَّذينَ
      [], // فِى
      [], // النّارِ
      [], // لِخَزَنَةِ
      [], // جَهَنَّمَ
      [], // ادعوا
      [], // رَبَّكُم
      [], // يُخَفِّف
      [], // عَنّا
      [], // يَومًا
      [], // مِنَ
      [] // العَذابِ
    ],
    [ // آية 50
      [], // قالوا
      [], // أَوَلَم
      [], // تَكُ
      [], // تَأتيكُم
      [], // رُسُلُكُم
      [], // بِالبَيِّنـٰتِ
      [], // قالوا
      [], // بَلىٰ
      [], // قالوا
      [], // فَادعوا
      [], // وَما
      [], // دُعـٰؤُا۟
      [], // الكـٰفِرينَ
      [], // إِلّا
      [], // فى
      [] // ضَلـٰلٍ
    ],
    [ // آية 51
      [], // إِنّا
      [], // لَنَنصُرُ
      [], // رُسُلَنا
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَيَومَ
      [], // يَقومُ
      [] // الأَشهـٰدُ
    ],
    [ // آية 52
      [], // يَومَ
      [], // لا
      [], // يَنفَعُ
      [], // الظّـٰلِمينَ
      ["معذرتهم : عذرهمْ أو اعتذارهم حين يعتذرون"], // مَعذِرَتُهُم
      [], // وَلَهُمُ
      [], // اللَّعنَةُ
      [], // وَلَهُم
      [], // سوءُ
      [] // الدّارِ
    ],
    [ // آية 53
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الهُدىٰ
      [], // وَأَورَثنا
      [], // بَنى
      [], // إِسرٰءيلَ
      [] // الكِتـٰبَ
    ],
    [ // آية 54
      [], // هُدًى
      [], // وَذِكرىٰ
      [], // لِأُولِى
      [] // الأَلبـٰبِ
    ],
    [ // آية 55
      [], // فَاصبِر
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَاستَغفِر
      [], // لِذَنبِكَ
      [], // وَسَبِّح
      [], // بِحَمدِ
      [], // رَبِّكَ
      [], // بِالعَشِىِّ
      [] // وَالإِبكـٰرِ
    ],
    [ // آية 56
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُجـٰدِلونَ
      [], // فى
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // بِغَيرِ
      [], // سُلطـٰنٍ
      [], // أَتىٰهُم
      [], // إِن
      [], // فى
      [], // صُدورِهِم
      [], // إِلّا
      [], // كِبرٌ
      [], // ما
      [], // هُم
      [], // بِبـٰلِغيهِ
      [], // فَاستَعِذ
      [], // بِاللَّهِ
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // البَصيرُ
    ],
    [ // آية 57
      [], // لَخَلقُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // أَكبَرُ
      [], // مِن
      [], // خَلقِ
      [], // النّاسِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 58
      [], // وَما
      [], // يَستَوِى
      [], // الأَعمىٰ
      [], // وَالبَصيرُ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // وَلَا
      [], // المُسىءُ
      [], // قَليلًا
      [], // ما
      [] // تَتَذَكَّرونَ
    ],
    [ // آية 59
      [], // إِنَّ
      [], // السّاعَةَ
      [], // لَـٔاتِيَةٌ
      [], // لا
      [], // رَيبَ
      [], // فيها
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 60
      [], // وَقالَ
      [], // رَبُّكُمُ
      [], // ادعونى
      [], // أَستَجِب
      [], // لَكُم
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَستَكبِرونَ
      [], // عَن
      [], // عِبادَتى
      [], // سَيَدخُلونَ
      [], // جَهَنَّمَ
      ["داخرين : صاغرين أذلاّء"] // داخِرينَ
    ],
    [ // آية 61
      [], // اللَّهُ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الَّيلَ
      [], // لِتَسكُنوا
      [], // فيهِ
      [], // وَالنَّهارَ
      [], // مُبصِرًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَذو
      [], // فَضلٍ
      [], // عَلَى
      [], // النّاسِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَشكُرونَ
    ],
    [ // آية 62
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      [], // خـٰلِقُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَأَنّىٰ
      [] // تُؤفَكونَ
    ],
    [ // آية 63
      [], // كَذٰلِكَ
      ["يؤفك : يُصْرَف عن التـّـوحيد الحقّ"], // يُؤفَكُ
      [], // الَّذينَ
      [], // كانوا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [] // يَجحَدونَ
    ],
    [ // آية 64
      [], // اللَّهُ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      ["الأرض قرارا : مستقرّا تعيشون فيها"], // الأَرضَ
      ["الأرض قرارا : مستقرّا تعيشون فيها"], // قَرارًا
      [], // وَالسَّماءَ
      [], // بِناءً
      [], // وَصَوَّرَكُم
      [], // فَأَحسَنَ
      [], // صُوَرَكُم
      [], // وَرَزَقَكُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      ["فتبارك الله : تعالى أو تمجّد أو كَـثـُـرَ خيره"], // فَتَبارَكَ
      ["فتبارك الله : تعالى أو تمجّد أو كَـثـُـرَ خيره"], // اللَّهُ
      [], // رَبُّ
      [] // العـٰلَمينَ
    ],
    [ // آية 65
      [], // هُوَ
      [], // الحَىُّ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَادعوهُ
      [], // مُخلِصينَ
      [], // لَهُ
      [], // الدّينَ
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 66
      [], // قُل
      [], // إِنّى
      [], // نُهيتُ
      [], // أَن
      [], // أَعبُدَ
      [], // الَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // لَمّا
      [], // جاءَنِىَ
      [], // البَيِّنـٰتُ
      [], // مِن
      [], // رَبّى
      [], // وَأُمِرتُ
      ["أنْ أسْلم : أنْ أنقاد أو أُخْلص ديني"], // أَن
      ["أنْ أسْلم : أنْ أنقاد أو أُخْلص ديني"], // أُسلِمَ
      [], // لِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 67
      [], // هُوَ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // مِن
      [], // تُرابٍ
      [], // ثُمَّ
      [], // مِن
      [], // نُطفَةٍ
      [], // ثُمَّ
      [], // مِن
      [], // عَلَقَةٍ
      [], // ثُمَّ
      [], // يُخرِجُكُم
      [], // طِفلًا
      [], // ثُمَّ
      ["لتبلغوا أشدّكُمْ : كمال عَقلكم و قوتِكمْ"], // لِتَبلُغوا
      ["لتبلغوا أشدّكُمْ : كمال عَقلكم و قوتِكمْ"], // أَشُدَّكُم
      [], // ثُمَّ
      [], // لِتَكونوا
      [], // شُيوخًا
      [], // وَمِنكُم
      [], // مَن
      [], // يُتَوَفّىٰ
      [], // مِن
      [], // قَبلُ
      [], // وَلِتَبلُغوا
      [], // أَجَلًا
      [], // مُسَمًّى
      [], // وَلَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 68
      [], // هُوَ
      [], // الَّذى
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // فَإِذا
      [], // قَضىٰ
      [], // أَمرًا
      [], // فَإِنَّما
      [], // يَقولُ
      [], // لَهُ
      [], // كُن
      [] // فَيَكونُ
    ],
    [ // آية 69
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // يُجـٰدِلونَ
      [], // فى
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // أَنّىٰ
      [] // يُصرَفونَ
    ],
    [ // آية 70
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِالكِتـٰبِ
      [], // وَبِما
      [], // أَرسَلنا
      [], // بِهِ
      [], // رُسُلَنا
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ],
    [ // آية 71
      [], // إِذِ
      [], // الأَغلـٰلُ
      [], // فى
      [], // أَعنـٰقِهِم
      [], // وَالسَّلـٰسِلُ
      [] // يُسحَبونَ
    ],
    [ // آية 72
      [], // فِى
      ["الحميم : الماء البالغ نِهاية الحرارة"], // الحَميمِ
      [], // ثُمَّ
      [], // فِى
      [], // النّارِ
      ["يُسْجرون : توقد أو تـُـملأ بهِمْ"] // يُسجَرونَ
    ],
    [ // آية 73
      [], // ثُمَّ
      [], // قيلَ
      [], // لَهُم
      [], // أَينَ
      [], // ما
      [], // كُنتُم
      [] // تُشرِكونَ
    ],
    [ // آية 74
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // قالوا
      [], // ضَلّوا
      [], // عَنّا
      [], // بَل
      [], // لَم
      [], // نَكُن
      [], // نَدعوا
      [], // مِن
      [], // قَبلُ
      [], // شَيـًٔا
      [], // كَذٰلِكَ
      [], // يُضِلُّ
      [], // اللَّهُ
      [] // الكـٰفِرينَ
    ],
    [ // آية 75
      [], // ذٰلِكُم
      [], // بِما
      [], // كُنتُم
      ["تفرحون : تـَـبْـطرونَ و تأشرون"], // تَفرَحونَ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَبِما
      [], // كُنتُم
      ["تمرحون : تتوسّعون في الفرح و البطر"] // تَمرَحونَ
    ],
    [ // آية 76
      [], // ادخُلوا
      [], // أَبوٰبَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // فَبِئسَ
      [], // مَثوَى
      [] // المُتَكَبِّرينَ
    ],
    [ // آية 77
      [], // فَاصبِر
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // فَإِمّا
      [], // نُرِيَنَّكَ
      [], // بَعضَ
      [], // الَّذى
      [], // نَعِدُهُم
      [], // أَو
      [], // نَتَوَفَّيَنَّكَ
      [], // فَإِلَينا
      [] // يُرجَعونَ
    ],
    [ // آية 78
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // رُسُلًا
      [], // مِن
      [], // قَبلِكَ
      [], // مِنهُم
      [], // مَن
      [], // قَصَصنا
      [], // عَلَيكَ
      [], // وَمِنهُم
      [], // مَن
      [], // لَم
      [], // نَقصُص
      [], // عَلَيكَ
      [], // وَما
      [], // كانَ
      [], // لِرَسولٍ
      [], // أَن
      [], // يَأتِىَ
      [], // بِـٔايَةٍ
      [], // إِلّا
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // فَإِذا
      [], // جاءَ
      [], // أَمرُ
      [], // اللَّهِ
      [], // قُضِىَ
      [], // بِالحَقِّ
      [], // وَخَسِرَ
      [], // هُنالِكَ
      [] // المُبطِلونَ
    ],
    [ // آية 79
      [], // اللَّهُ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // الأَنعـٰمَ
      [], // لِتَركَبوا
      [], // مِنها
      [], // وَمِنها
      [] // تَأكُلونَ
    ],
    [ // آية 80
      [], // وَلَكُم
      [], // فيها
      [], // مَنـٰفِعُ
      [], // وَلِتَبلُغوا
      [], // عَلَيها
      [], // حاجَةً
      [], // فى
      [], // صُدورِكُم
      [], // وَعَلَيها
      [], // وَعَلَى
      [], // الفُلكِ
      [] // تُحمَلونَ
    ],
    [ // آية 81
      [], // وَيُريكُم
      [], // ءايـٰتِهِ
      [], // فَأَىَّ
      [], // ءايـٰتِ
      [], // اللَّهِ
      [] // تُنكِرونَ
    ],
    [ // آية 82
      [], // أَفَلَم
      [], // يَسيروا
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // كانوا
      [], // أَكثَرَ
      [], // مِنهُم
      [], // وَأَشَدَّ
      [], // قُوَّةً
      [], // وَءاثارًا
      [], // فِى
      [], // الأَرضِ
      ["فما أغنى عنهم : فما دفع عنهم و ما نـَـفَعهمْ"], // فَما
      ["فما أغنى عنهم : فما دفع عنهم و ما نـَـفَعهمْ"], // أَغنىٰ
      ["فما أغنى عنهم : فما دفع عنهم و ما نـَـفَعهمْ"], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 83
      [], // فَلَمّا
      [], // جاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَرِحوا
      [], // بِما
      [], // عِندَهُم
      ["من العلم : بأمور الدنيا مستهزئين بالدين"], // مِنَ
      ["من العلم : بأمور الدنيا مستهزئين بالدين"], // العِلمِ
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 84
      [], // فَلَمّا
      ["رَأوْا بَأسنا : عاينوا شدة عذابنا في الدنيا"], // رَأَوا
      ["رَأوْا بَأسنا : عاينوا شدة عذابنا في الدنيا"], // بَأسَنا
      [], // قالوا
      [], // ءامَنّا
      [], // بِاللَّهِ
      [], // وَحدَهُ
      [], // وَكَفَرنا
      [], // بِما
      [], // كُنّا
      [], // بِهِ
      [] // مُشرِكينَ
    ],
    [ // آية 85
      [], // فَلَم
      [], // يَكُ
      [], // يَنفَعُهُم
      [], // إيمـٰنُهُم
      [], // لَمّا
      [], // رَأَوا
      [], // بَأسَنا
      [], // سُنَّتَ
      [], // اللَّهِ
      [], // الَّتى
      [], // قَد
      ["خلتْ : مَضَتْ"], // خَلَت
      [], // فى
      [], // عِبادِهِ
      [], // وَخَسِرَ
      [], // هُنالِكَ
      [] // الكـٰفِرونَ
    ]
  ]
];

export default meanings;