const meanings = [
  [ // سورة 41: فصلت
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // تَنزيلٌ
      [], // مِنَ
      [], // الرَّحمـٰنِ
      [] // الرَّحيمِ
    ],
    [ // آية 3
      [], // كِتـٰبٌ
      [], // فُصِّلَت
      [], // ءايـٰتُهُ
      [], // قُرءانًا
      [], // عَرَبِيًّا
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 4
      [], // بَشيرًا
      [], // وَنَذيرًا
      [], // فَأَعرَضَ
      [], // أَكثَرُهُم
      [], // فَهُم
      [], // لا
      [] // يَسمَعونَ
    ],
    [ // آية 5
      [], // وَقالوا
      [], // قُلوبُنا
      [], // فى
      ["أكنّة : أغطية خِلقـيّة تمنع الفَهم"], // أَكِنَّةٍ
      [], // مِمّا
      [], // تَدعونا
      [], // إِلَيهِ
      [], // وَفى
      [], // ءاذانِنا
      [], // وَقرٌ
      [], // وَمِن
      [], // بَينِنا
      [], // وَبَينِكَ
      ["حِجاب : سِتـْـرٌ غليظ يمنع التـّواصل"], // حِجابٌ
      [], // فَاعمَل
      [], // إِنَّنا
      [] // عـٰمِلونَ
    ],
    [ // آية 6
      [], // قُل
      [], // إِنَّما
      [], // أَنا۠
      [], // بَشَرٌ
      [], // مِثلُكُم
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // أَنَّما
      [], // إِلـٰهُكُم
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      ["فاستقيموا إليه : تـَوجّهوا إليه بطاعته و عبادته"], // فَاستَقيموا
      ["فاستقيموا إليه : تـَوجّهوا إليه بطاعته و عبادته"], // إِلَيهِ
      [], // وَاستَغفِروهُ
      [], // وَوَيلٌ
      [] // لِلمُشرِكينَ
    ],
    [ // آية 7
      [], // الَّذينَ
      [], // لا
      [], // يُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [], // هُم
      [] // كـٰفِرونَ
    ],
    [ // آية 8
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // أَجرٌ
      ["غير ممنون : غير مقطوع عنهم"], // غَيرُ
      ["غير ممنون : غير مقطوع عنهم"] // مَمنونٍ
    ],
    [ // آية 9
      [], // قُل
      [], // أَئِنَّكُم
      [], // لَتَكفُرونَ
      [], // بِالَّذى
      [], // خَلَقَ
      [], // الأَرضَ
      [], // فى
      [], // يَومَينِ
      [], // وَتَجعَلونَ
      [], // لَهُ
      ["أندادًا : أمْثالا مِنَ مَخـْـلوقاته تـَعبدونها"], // أَندادًا
      [], // ذٰلِكَ
      [], // رَبُّ
      [] // العـٰلَمينَ
    ],
    [ // آية 10
      [], // وَجَعَلَ
      [], // فيها
      [], // رَوٰسِىَ
      [], // مِن
      [], // فَوقِها
      [], // وَبـٰرَكَ
      [], // فيها
      [], // وَقَدَّرَ
      [], // فيها
      [], // أَقوٰتَها
      [], // فى
      [], // أَربَعَةِ
      [], // أَيّامٍ
      ["سَوَاءً : اسْتوت الأربعة اسْتِواءً (تـمّتْ)"], // سَواءً
      [] // لِلسّائِلينَ
    ],
    [ // آية 11
      [], // ثُمَّ
      ["استوى : عَمَدَ و قصَدَ قصدا سويّـا . ."], // استَوىٰ
      [], // إِلَى
      [], // السَّماءِ
      [], // وَهِىَ
      [], // دُخانٌ
      [], // فَقالَ
      [], // لَها
      [], // وَلِلأَرضِ
      ["ائتيا : افعَلا ما أمرتكما به و جيئا به"], // ائتِيا
      [], // طَوعًا
      [], // أَو
      [], // كَرهًا
      [], // قالَتا
      [], // أَتَينا
      [] // طائِعينَ
    ],
    [ // آية 12
      [], // فَقَضىٰهُنَّ
      [], // سَبعَ
      [], // سَمـٰواتٍ
      [], // فى
      [], // يَومَينِ
      [], // وَأَوحىٰ
      [], // فى
      [], // كُلِّ
      [], // سَماءٍ
      [], // أَمرَها
      [], // وَزَيَّنَّا
      [], // السَّماءَ
      [], // الدُّنيا
      [], // بِمَصـٰبيحَ
      [], // وَحِفظًا
      [], // ذٰلِكَ
      [], // تَقديرُ
      [], // العَزيزِ
      [] // العَليمِ
    ],
    [ // آية 13
      [], // فَإِن
      [], // أَعرَضوا
      [], // فَقُل
      [], // أَنذَرتُكُم
      [], // صـٰعِقَةً
      [], // مِثلَ
      [], // صـٰعِقَةِ
      [], // عادٍ
      [] // وَثَمودَ
    ],
    [ // آية 14
      [], // إِذ
      [], // جاءَتهُمُ
      [], // الرُّسُلُ
      [], // مِن
      [], // بَينِ
      [], // أَيديهِم
      [], // وَمِن
      [], // خَلفِهِم
      [], // أَلّا
      [], // تَعبُدوا
      [], // إِلَّا
      [], // اللَّهَ
      [], // قالوا
      [], // لَو
      [], // شاءَ
      [], // رَبُّنا
      [], // لَأَنزَلَ
      [], // مَلـٰئِكَةً
      [], // فَإِنّا
      [], // بِما
      [], // أُرسِلتُم
      [], // بِهِ
      [] // كـٰفِرونَ
    ],
    [ // آية 15
      [], // فَأَمّا
      [], // عادٌ
      [], // فَاستَكبَروا
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَقالوا
      [], // مَن
      [], // أَشَدُّ
      [], // مِنّا
      [], // قُوَّةً
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنَّ
      [], // اللَّهَ
      [], // الَّذى
      [], // خَلَقَهُم
      [], // هُوَ
      [], // أَشَدُّ
      [], // مِنهُم
      [], // قُوَّةً
      [], // وَكانوا
      [], // بِـٔايـٰتِنا
      [] // يَجحَدونَ
    ],
    [ // آية 16
      [], // فَأَرسَلنا
      [], // عَلَيهِم
      ["ريحا صرصرا : شديدة السّموم ، أو البَرْد، أو الصّوت"], // ريحًا
      ["ريحا صرصرا : شديدة السّموم ، أو البَرْد، أو الصّوت"], // صَرصَرًا
      [], // فى
      [], // أَيّامٍ
      [], // نَحِساتٍ
      [], // لِنُذيقَهُم
      [], // عَذابَ
      [], // الخِزىِ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَلَعَذابُ
      [], // الـٔاخِرَةِ
      [], // أَخزىٰ
      [], // وَهُم
      [], // لا
      [] // يُنصَرونَ
    ],
    [ // آية 17
      [], // وَأَمّا
      [], // ثَمودُ
      [], // فَهَدَينـٰهُم
      [], // فَاستَحَبُّوا
      [], // العَمىٰ
      [], // عَلَى
      [], // الهُدىٰ
      [], // فَأَخَذَتهُم
      [], // صـٰعِقَةُ
      ["العَذاب الهون : المهين"], // العَذابِ
      ["العَذاب الهون : المهين"], // الهونِ
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 18
      [], // وَنَجَّينَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَكانوا
      [] // يَتَّقونَ
    ],
    [ // آية 19
      [], // وَيَومَ
      [], // يُحشَرُ
      [], // أَعداءُ
      [], // اللَّهِ
      [], // إِلَى
      [], // النّارِ
      ["فهم يوزعون : يُـحـْـبَـسُ سَوَابقهم ليلحقهم تواليهم"], // فَهُم
      ["فهم يوزعون : يُـحـْـبَـسُ سَوَابقهم ليلحقهم تواليهم"] // يوزَعونَ
    ],
    [ // آية 20
      [], // حَتّىٰ
      [], // إِذا
      [], // ما
      [], // جاءوها
      [], // شَهِدَ
      [], // عَلَيهِم
      [], // سَمعُهُم
      [], // وَأَبصـٰرُهُم
      [], // وَجُلودُهُم
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 21
      [], // وَقالوا
      [], // لِجُلودِهِم
      [], // لِمَ
      [], // شَهِدتُم
      [], // عَلَينا
      [], // قالوا
      [], // أَنطَقَنَا
      [], // اللَّهُ
      [], // الَّذى
      [], // أَنطَقَ
      [], // كُلَّ
      [], // شَىءٍ
      [], // وَهُوَ
      [], // خَلَقَكُم
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 22
      [], // وَما
      [], // كُنتُم
      ["تستترون : تستخفونَ عند ارتكابكم الفواحش"], // تَستَتِرونَ
      [], // أَن
      [], // يَشهَدَ
      [], // عَلَيكُم
      [], // سَمعُكُم
      [], // وَلا
      [], // أَبصـٰرُكُم
      [], // وَلا
      [], // جُلودُكُم
      [], // وَلـٰكِن
      [], // ظَنَنتُم
      [], // أَنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَعلَمُ
      ["كثيرا مما تعملون : و  هو ما عمِلتم خِفْية"], // كَثيرًا
      ["كثيرا مما تعملون : و  هو ما عمِلتم خِفْية"], // مِمّا
      ["كثيرا مما تعملون : و  هو ما عمِلتم خِفْية"] // تَعمَلونَ
    ],
    [ // آية 23
      [], // وَذٰلِكُم
      [], // ظَنُّكُمُ
      [], // الَّذى
      [], // ظَنَنتُم
      [], // بِرَبِّكُم
      [], // أَردىٰكُم
      [], // فَأَصبَحتُم
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 24
      [], // فَإِن
      [], // يَصبِروا
      [], // فَالنّارُ
      ["مَثوًى لهمْ : مَحَلّ ثوّاء و إقامة أبديّة لهم"], // مَثوًى
      ["مَثوًى لهمْ : مَحَلّ ثوّاء و إقامة أبديّة لهم"], // لَهُم
      [], // وَإِن
      [], // يَستَعتِبوا
      [], // فَما
      [], // هُم
      ["من المعتبينَ : منَ المجَابين إلى ما طَلبوا"], // مِنَ
      ["من المعتبينَ : منَ المجَابين إلى ما طَلبوا"] // المُعتَبينَ
    ],
    [ // آية 25
      [], // وَقَيَّضنا
      [], // لَهُم
      [], // قُرَناءَ
      [], // فَزَيَّنوا
      [], // لَهُم
      [], // ما
      [], // بَينَ
      [], // أَيديهِم
      [], // وَما
      [], // خَلفَهُم
      [], // وَحَقَّ
      [], // عَلَيهِمُ
      [], // القَولُ
      [], // فى
      [], // أُمَمٍ
      [], // قَد
      [], // خَلَت
      [], // مِن
      [], // قَبلِهِم
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // إِنَّهُم
      [], // كانوا
      [] // خـٰسِرينَ
    ],
    [ // آية 26
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لا
      [], // تَسمَعوا
      [], // لِهـٰذَا
      [], // القُرءانِ
      [], // وَالغَوا
      [], // فيهِ
      [], // لَعَلَّكُم
      [] // تَغلِبونَ
    ],
    [ // آية 27
      [], // فَلَنُذيقَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // عَذابًا
      [], // شَديدًا
      [], // وَلَنَجزِيَنَّهُم
      [], // أَسوَأَ
      [], // الَّذى
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 28
      [], // ذٰلِكَ
      [], // جَزاءُ
      [], // أَعداءِ
      [], // اللَّهِ
      [], // النّارُ
      [], // لَهُم
      [], // فيها
      [], // دارُ
      [], // الخُلدِ
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [], // بِـٔايـٰتِنا
      [] // يَجحَدونَ
    ],
    [ // آية 29
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // رَبَّنا
      [], // أَرِنَا
      [], // الَّذَينِ
      [], // أَضَلّانا
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // نَجعَلهُما
      [], // تَحتَ
      [], // أَقدامِنا
      [], // لِيَكونا
      [], // مِنَ
      [] // الأَسفَلينَ
    ],
    [ // آية 30
      [], // إِنَّ
      [], // الَّذينَ
      [], // قالوا
      [], // رَبُّنَا
      [], // اللَّهُ
      [], // ثُمَّ
      [], // استَقـٰموا
      [], // تَتَنَزَّلُ
      [], // عَلَيهِمُ
      [], // المَلـٰئِكَةُ
      [], // أَلّا
      [], // تَخافوا
      [], // وَلا
      [], // تَحزَنوا
      [], // وَأَبشِروا
      [], // بِالجَنَّةِ
      [], // الَّتى
      [], // كُنتُم
      [] // توعَدونَ
    ],
    [ // آية 31
      [], // نَحنُ
      [], // أَولِياؤُكُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَفِى
      [], // الـٔاخِرَةِ
      [], // وَلَكُم
      [], // فيها
      [], // ما
      [], // تَشتَهى
      [], // أَنفُسُكُم
      [], // وَلَكُم
      [], // فيها
      ["ما تدّعون : ما تتمنّونه و تطلبونه"], // ما
      ["ما تدّعون : ما تتمنّونه و تطلبونه"] // تَدَّعونَ
    ],
    [ // آية 32
      ["نزلاً : رزقا أو ضِـيافةو تكرمة ، أو منّـا"], // نُزُلًا
      [], // مِن
      [], // غَفورٍ
      [] // رَحيمٍ
    ],
    [ // آية 33
      [], // وَمَن
      [], // أَحسَنُ
      [], // قَولًا
      [], // مِمَّن
      [], // دَعا
      [], // إِلَى
      [], // اللَّهِ
      [], // وَعَمِلَ
      [], // صـٰلِحًا
      [], // وَقالَ
      [], // إِنَّنى
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 34
      [], // وَلا
      [], // تَستَوِى
      [], // الحَسَنَةُ
      [], // وَلَا
      [], // السَّيِّئَةُ
      [], // ادفَع
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // فَإِذَا
      [], // الَّذى
      [], // بَينَكَ
      [], // وَبَينَهُ
      [], // عَدٰوَةٌ
      [], // كَأَنَّهُ
      [], // وَلِىٌّ
      [] // حَميمٌ
    ],
    [ // آية 35
      [], // وَما
      [], // يُلَقّىٰها
      [], // إِلَّا
      [], // الَّذينَ
      [], // صَبَروا
      [], // وَما
      [], // يُلَقّىٰها
      [], // إِلّا
      [], // ذو
      [], // حَظٍّ
      [] // عَظيمٍ
    ],
    [ // آية 36
      [], // وَإِمّا
      [], // يَنزَغَنَّكَ
      [], // مِنَ
      [], // الشَّيطـٰنِ
      ["نزْغٌ : وَسْوَسة . أو صارفٌ"], // نَزغٌ
      [], // فَاستَعِذ
      [], // بِاللَّهِ
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 37
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // الَّيلُ
      [], // وَالنَّهارُ
      [], // وَالشَّمسُ
      [], // وَالقَمَرُ
      [], // لا
      [], // تَسجُدوا
      [], // لِلشَّمسِ
      [], // وَلا
      [], // لِلقَمَرِ
      [], // وَاسجُدوا
      [], // لِلَّهِ
      [], // الَّذى
      [], // خَلَقَهُنَّ
      [], // إِن
      [], // كُنتُم
      [], // إِيّاهُ
      [] // تَعبُدونَ
    ],
    [ // آية 38
      [], // فَإِنِ
      [], // استَكبَروا
      [], // فَالَّذينَ
      [], // عِندَ
      [], // رَبِّكَ
      [], // يُسَبِّحونَ
      [], // لَهُ
      [], // بِالَّيلِ
      [], // وَالنَّهارِ
      [], // وَهُم
      [], // لا
      [] // يَسـَٔمونَ
    ],
    [ // آية 39
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // أَنَّكَ
      [], // تَرَى
      [], // الأَرضَ
      [], // خـٰشِعَةً
      [], // فَإِذا
      [], // أَنزَلنا
      [], // عَلَيهَا
      [], // الماءَ
      ["اهتزّت : تحرّكتْ بالنّبات"], // اهتَزَّت
      [], // وَرَبَت
      [], // إِنَّ
      [], // الَّذى
      [], // أَحياها
      [], // لَمُحىِ
      [], // المَوتىٰ
      [], // إِنَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 40
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُلحِدونَ
      [], // فى
      [], // ءايـٰتِنا
      [], // لا
      [], // يَخفَونَ
      [], // عَلَينا
      [], // أَفَمَن
      [], // يُلقىٰ
      [], // فِى
      [], // النّارِ
      [], // خَيرٌ
      [], // أَم
      [], // مَن
      [], // يَأتى
      [], // ءامِنًا
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // اعمَلوا
      [], // ما
      [], // شِئتُم
      [], // إِنَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 41
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِالذِّكرِ
      [], // لَمّا
      [], // جاءَهُم
      [], // وَإِنَّهُ
      [], // لَكِتـٰبٌ
      [] // عَزيزٌ
    ],
    [ // آية 42
      [], // لا
      [], // يَأتيهِ
      [], // البـٰطِلُ
      [], // مِن
      [], // بَينِ
      [], // يَدَيهِ
      [], // وَلا
      [], // مِن
      [], // خَلفِهِ
      [], // تَنزيلٌ
      [], // مِن
      [], // حَكيمٍ
      [] // حَميدٍ
    ],
    [ // آية 43
      [], // ما
      [], // يُقالُ
      [], // لَكَ
      [], // إِلّا
      [], // ما
      [], // قَد
      [], // قيلَ
      [], // لِلرُّسُلِ
      [], // مِن
      [], // قَبلِكَ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // لَذو
      [], // مَغفِرَةٍ
      [], // وَذو
      [], // عِقابٍ
      [] // أَليمٍ
    ],
    [ // آية 44
      [], // وَلَو
      [], // جَعَلنـٰهُ
      [], // قُرءانًا
      [], // أَعجَمِيًّا
      [], // لَقالوا
      [], // لَولا
      [], // فُصِّلَت
      [], // ءايـٰتُهُ
      [], // ءَأَعجَمِىٌّ
      [], // وَعَرَبِىٌّ
      [], // قُل
      [], // هُوَ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // هُدًى
      [], // وَشِفاءٌ
      [], // وَالَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // فى
      [], // ءاذانِهِم
      [], // وَقرٌ
      [], // وَهُوَ
      [], // عَلَيهِم
      [], // عَمًى
      [], // أُولـٰئِكَ
      [], // يُنادَونَ
      [], // مِن
      [], // مَكانٍ
      [] // بَعيدٍ
    ],
    [ // آية 45
      [], // وَلَقَد
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // فَاختُلِفَ
      [], // فيهِ
      [], // وَلَولا
      [], // كَلِمَةٌ
      [], // سَبَقَت
      [], // مِن
      [], // رَبِّكَ
      [], // لَقُضِىَ
      [], // بَينَهُم
      [], // وَإِنَّهُم
      [], // لَفى
      [], // شَكٍّ
      [], // مِنهُ
      ["مريب : مُوقِع في الرّيبة و القلق"] // مُريبٍ
    ],
    [ // آية 46
      [], // مَن
      [], // عَمِلَ
      [], // صـٰلِحًا
      [], // فَلِنَفسِهِ
      [], // وَمَن
      [], // أَساءَ
      [], // فَعَلَيها
      [], // وَما
      [], // رَبُّكَ
      [], // بِظَلّـٰمٍ
      [] // لِلعَبيدِ
    ],
    [ // آية 47
      [], // إِلَيهِ
      [], // يُرَدُّ
      [], // عِلمُ
      [], // السّاعَةِ
      [], // وَما
      [], // تَخرُجُ
      [], // مِن
      [], // ثَمَرٰتٍ
      [], // مِن
      [], // أَكمامِها
      [], // وَما
      [], // تَحمِلُ
      [], // مِن
      [], // أُنثىٰ
      [], // وَلا
      [], // تَضَعُ
      [], // إِلّا
      [], // بِعِلمِهِ
      [], // وَيَومَ
      [], // يُناديهِم
      [], // أَينَ
      [], // شُرَكاءى
      [], // قالوا
      [], // ءاذَنّـٰكَ
      [], // ما
      [], // مِنّا
      [], // مِن
      [] // شَهيدٍ
    ],
    [ // آية 48
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [], // يَدعونَ
      [], // مِن
      [], // قَبلُ
      [], // وَظَنّوا
      [], // ما
      [], // لَهُم
      [], // مِن
      ["محيص : مَهرب و مفرّ من العذاب"] // مَحيصٍ
    ],
    [ // آية 49
      [], // لا
      [], // يَسـَٔمُ
      [], // الإِنسـٰنُ
      [], // مِن
      ["دعاء الخير : طَلبه العافية و السّعَة في النّعمة"], // دُعاءِ
      ["دعاء الخير : طَلبه العافية و السّعَة في النّعمة"], // الخَيرِ
      [], // وَإِن
      [], // مَسَّهُ
      [], // الشَّرُّ
      [], // فَيَـٔوسٌ
      [] // قَنوطٌ
    ],
    [ // آية 50
      [], // وَلَئِن
      [], // أَذَقنـٰهُ
      [], // رَحمَةً
      [], // مِنّا
      [], // مِن
      [], // بَعدِ
      [], // ضَرّاءَ
      [], // مَسَّتهُ
      [], // لَيَقولَنَّ
      [], // هـٰذا
      [], // لى
      [], // وَما
      [], // أَظُنُّ
      [], // السّاعَةَ
      [], // قائِمَةً
      [], // وَلَئِن
      [], // رُجِعتُ
      [], // إِلىٰ
      [], // رَبّى
      [], // إِنَّ
      [], // لى
      [], // عِندَهُ
      [], // لَلحُسنىٰ
      [], // فَلَنُنَبِّئَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِما
      [], // عَمِلوا
      [], // وَلَنُذيقَنَّهُم
      [], // مِن
      ["عذاب غليظ : شديد لا يُـفـَـتـّـرُ عنهم"], // عَذابٍ
      ["عذاب غليظ : شديد لا يُـفـَـتـّـرُ عنهم"] // غَليظٍ
    ],
    [ // آية 51
      [], // وَإِذا
      [], // أَنعَمنا
      [], // عَلَى
      [], // الإِنسـٰنِ
      [], // أَعرَضَ
      [], // وَنَـٔا
      [], // بِجانِبِهِ
      [], // وَإِذا
      [], // مَسَّهُ
      [], // الشَّرُّ
      [], // فَذو
      ["دُعَاءٍ عريض : كثيرٍ مسْـتـَـمرّ"], // دُعاءٍ
      ["دُعَاءٍ عريض : كثيرٍ مسْـتـَـمرّ"] // عَريضٍ
    ],
    [ // آية 52
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // كانَ
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // ثُمَّ
      [], // كَفَرتُم
      [], // بِهِ
      [], // مَن
      [], // أَضَلُّ
      [], // مِمَّن
      [], // هُوَ
      [], // فى
      [], // شِقاقٍ
      [] // بَعيدٍ
    ],
    [ // آية 53
      [], // سَنُريهِم
      [], // ءايـٰتِنا
      [], // فِى
      [], // الـٔافاقِ
      [], // وَفى
      [], // أَنفُسِهِم
      [], // حَتّىٰ
      [], // يَتَبَيَّنَ
      [], // لَهُم
      [], // أَنَّهُ
      [], // الحَقُّ
      [], // أَوَلَم
      [], // يَكفِ
      [], // بِرَبِّكَ
      [], // أَنَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدٌ
    ],
    [ // آية 54
      [], // أَلا
      [], // إِنَّهُم
      [], // فى
      ["مِرْية : شكّ ٍ عَظيم"], // مِريَةٍ
      [], // مِن
      [], // لِقاءِ
      [], // رَبِّهِم
      [], // أَلا
      [], // إِنَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // مُحيطٌ
    ]
  ]
];

export default meanings;