const meanings = [
  [ // سورة 42: الشورى
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [] // عسق
    ],
    [ // آية 3
      [], // كَذٰلِكَ
      [], // يوحى
      [], // إِلَيكَ
      [], // وَإِلَى
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِكَ
      [], // اللَّهُ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 4
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَهُوَ
      [], // العَلِىُّ
      [] // العَظيمُ
    ],
    [ // آية 5
      [], // تَكادُ
      [], // السَّمـٰوٰتُ
      [], // يَتَفَطَّرنَ
      [], // مِن
      [], // فَوقِهِنَّ
      [], // وَالمَلـٰئِكَةُ
      [], // يُسَبِّحونَ
      [], // بِحَمدِ
      [], // رَبِّهِم
      [], // وَيَستَغفِرونَ
      [], // لِمَن
      [], // فِى
      [], // الأَرضِ
      [], // أَلا
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 6
      [], // وَالَّذينَ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِهِ
      ["أوْلياءَ : معْبودات يزعمون نصْرَتـَـها لهم"], // أَولِياءَ
      ["الله حفيظ عليهم : رقيبٌ على أعمالهم و مُجَازيهمْ"], // اللَّهُ
      ["الله حفيظ عليهم : رقيبٌ على أعمالهم و مُجَازيهمْ"], // حَفيظٌ
      ["الله حفيظ عليهم : رقيبٌ على أعمالهم و مُجَازيهمْ"], // عَلَيهِم
      [], // وَما
      [], // أَنتَ
      [], // عَلَيهِم
      ["بوَكيل : بمَوْكولٍ إليك أمرهمْ"] // بِوَكيلٍ
    ],
    [ // آية 7
      [], // وَكَذٰلِكَ
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // قُرءانًا
      [], // عَرَبِيًّا
      [], // لِتُنذِرَ
      ["أمّ القرى : مَكّة: أي أهلها"], // أُمَّ
      ["أمّ القرى : مَكّة: أي أهلها"], // القُرىٰ
      [], // وَمَن
      [], // حَولَها
      [], // وَتُنذِرَ
      ["يَوم الجَمع : يومَ القيامة لاجتماع الخلائق فيه"], // يَومَ
      ["يَوم الجَمع : يومَ القيامة لاجتماع الخلائق فيه"], // الجَمعِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // فَريقٌ
      [], // فِى
      [], // الجَنَّةِ
      [], // وَفَريقٌ
      [], // فِى
      [] // السَّعيرِ
    ],
    [ // آية 8
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // لَجَعَلَهُم
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // وَلـٰكِن
      [], // يُدخِلُ
      [], // مَن
      [], // يَشاءُ
      [], // فى
      [], // رَحمَتِهِ
      [], // وَالظّـٰلِمونَ
      [], // ما
      [], // لَهُم
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [] // نَصيرٍ
    ],
    [ // آية 9
      [], // أَمِ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِهِ
      [], // أَولِياءَ
      [], // فَاللَّهُ
      [], // هُوَ
      [], // الوَلِىُّ
      [], // وَهُوَ
      [], // يُحىِ
      [], // المَوتىٰ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 10
      [], // وَمَا
      [], // اختَلَفتُم
      [], // فيهِ
      [], // مِن
      [], // شَىءٍ
      [], // فَحُكمُهُ
      [], // إِلَى
      [], // اللَّهِ
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبّى
      [], // عَلَيهِ
      [], // تَوَكَّلتُ
      [], // وَإِلَيهِ
      [] // أُنيبُ
    ],
    [ // آية 11
      [], // فاطِرُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // جَعَلَ
      [], // لَكُم
      [], // مِن
      [], // أَنفُسِكُم
      [], // أَزوٰجًا
      [], // وَمِنَ
      [], // الأَنعـٰمِ
      [], // أَزوٰجًا
      ["يَذرَؤكمْ فيه : يَـذرؤكم فيه"], // يَذرَؤُكُم
      ["يَذرَؤكمْ فيه : يَـذرؤكم فيه"], // فيهِ
      [], // لَيسَ
      [], // كَمِثلِهِ
      [], // شَىءٌ
      [], // وَهُوَ
      [], // السَّميعُ
      [] // البَصيرُ
    ],
    [ // آية 12
      [], // لَهُ
      [], // مَقاليدُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يَبسُطُ
      [], // الرِّزقَ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيَقدِرُ
      [], // إِنَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 13
      [], // شَرَعَ
      [], // لَكُم
      [], // مِنَ
      [], // الدّينِ
      ["ما وصّى : ما وصّى"], // ما
      ["ما وصّى : ما وصّى"], // وَصّىٰ
      [], // بِهِ
      [], // نوحًا
      [], // وَالَّذى
      [], // أَوحَينا
      [], // إِلَيكَ
      [], // وَما
      [], // وَصَّينا
      [], // بِهِ
      [], // إِبرٰهيمَ
      [], // وَموسىٰ
      [], // وَعيسىٰ
      [], // أَن
      ["أقيموا الدّين : أقيموا الدّين"], // أَقيمُوا
      ["أقيموا الدّين : أقيموا الدّين"], // الدّينَ
      [], // وَلا
      [], // تَتَفَرَّقوا
      [], // فيهِ
      [], // كَبُرَ
      [], // عَلَى
      [], // المُشرِكينَ
      [], // ما
      [], // تَدعوهُم
      [], // إِلَيهِ
      [], // اللَّهُ
      [], // يَجتَبى
      [], // إِلَيهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَهدى
      [], // إِلَيهِ
      [], // مَن
      ["يُنيبُ : ينيب"] // يُنيبُ
    ],
    [ // آية 14
      [], // وَما
      [], // تَفَرَّقوا
      [], // إِلّا
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // جاءَهُمُ
      [], // العِلمُ
      [], // بَغيًا
      [], // بَينَهُم
      [], // وَلَولا
      [], // كَلِمَةٌ
      [], // سَبَقَت
      [], // مِن
      [], // رَبِّكَ
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // لَقُضِىَ
      [], // بَينَهُم
      [], // وَإِنَّ
      [], // الَّذينَ
      [], // أورِثُوا
      [], // الكِتـٰبَ
      [], // مِن
      [], // بَعدِهِم
      [], // لَفى
      [], // شَكٍّ
      [], // مِنهُ
      ["مُريبٍ : مريب"] // مُريبٍ
    ],
    [ // آية 15
      [], // فَلِذٰلِكَ
      [], // فَادعُ
      [], // وَاستَقِم
      [], // كَما
      [], // أُمِرتَ
      [], // وَلا
      [], // تَتَّبِع
      [], // أَهواءَهُم
      [], // وَقُل
      [], // ءامَنتُ
      [], // بِما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // مِن
      [], // كِتـٰبٍ
      [], // وَأُمِرتُ
      [], // لِأَعدِلَ
      [], // بَينَكُمُ
      [], // اللَّهُ
      [], // رَبُّنا
      [], // وَرَبُّكُم
      [], // لَنا
      [], // أَعمـٰلُنا
      [], // وَلَكُم
      [], // أَعمـٰلُكُم
      ["لا حُجّة : لا حجّة"], // لا
      ["لا حُجّة : لا حجّة"], // حُجَّةَ
      [], // بَينَنا
      [], // وَبَينَكُمُ
      [], // اللَّهُ
      [], // يَجمَعُ
      [], // بَينَنا
      [], // وَإِلَيهِ
      [] // المَصيرُ
    ],
    [ // آية 16
      [], // وَالَّذينَ
      [], // يُحاجّونَ
      [], // فِى
      [], // اللَّهِ
      [], // مِن
      [], // بَعدِ
      [], // مَا
      ["استجيب له : استجيبَ له"], // استُجيبَ
      ["استجيب له : استجيبَ له"], // لَهُ
      [], // حُجَّتُهُم
      [], // داحِضَةٌ
      [], // عِندَ
      [], // رَبِّهِم
      [], // وَعَلَيهِم
      [], // غَضَبٌ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // شَديدٌ
    ],
    [ // آية 17
      [], // اللَّهُ
      [], // الَّذى
      [], // أَنزَلَ
      [], // الكِتـٰبَ
      [], // بِالحَقِّ
      [], // وَالميزانَ
      [], // وَما
      [], // يُدريكَ
      [], // لَعَلَّ
      [], // السّاعَةَ
      [] // قَريبٌ
    ],
    [ // آية 18
      [], // يَستَعجِلُ
      [], // بِهَا
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِها
      [], // وَالَّذينَ
      [], // ءامَنوا
      ["مُشفقون منها : خائفون منها مع اعتنائهم بها"], // مُشفِقونَ
      ["مُشفقون منها : خائفون منها مع اعتنائهم بها"], // مِنها
      [], // وَيَعلَمونَ
      [], // أَنَّهَا
      [], // الحَقُّ
      [], // أَلا
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُمارونَ
      [], // فِى
      [], // السّاعَةِ
      [], // لَفى
      [], // ضَلـٰلٍ
      [] // بَعيدٍ
    ],
    [ // آية 19
      [], // اللَّهُ
      ["لطيف بعباده : بَرٌّ رفيقٌ بهم"], // لَطيفٌ
      ["لطيف بعباده : بَرٌّ رفيقٌ بهم"], // بِعِبادِهِ
      [], // يَرزُقُ
      [], // مَن
      [], // يَشاءُ
      [], // وَهُوَ
      [], // القَوِىُّ
      [] // العَزيزُ
    ],
    [ // آية 20
      [], // مَن
      [], // كانَ
      [], // يُريدُ
      [], // حَرثَ
      [], // الـٔاخِرَةِ
      [], // نَزِد
      [], // لَهُ
      [], // فى
      [], // حَرثِهِ
      [], // وَمَن
      [], // كانَ
      [], // يُريدُ
      [], // حَرثَ
      [], // الدُّنيا
      [], // نُؤتِهِ
      [], // مِنها
      [], // وَما
      [], // لَهُ
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // مِن
      [] // نَصيبٍ
    ],
    [ // آية 21
      [], // أَم
      [], // لَهُم
      [], // شُرَكـٰؤُا۟
      [], // شَرَعوا
      [], // لَهُم
      [], // مِنَ
      [], // الدّينِ
      [], // ما
      [], // لَم
      [], // يَأذَن
      [], // بِهِ
      [], // اللَّهُ
      [], // وَلَولا
      [], // كَلِمَةُ
      [], // الفَصلِ
      [], // لَقُضِىَ
      [], // بَينَهُم
      [], // وَإِنَّ
      [], // الظّـٰلِمينَ
      [], // لَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 22
      [], // تَرَى
      [], // الظّـٰلِمينَ
      [], // مُشفِقينَ
      [], // مِمّا
      [], // كَسَبوا
      [], // وَهُوَ
      [], // واقِعٌ
      [], // بِهِم
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فى
      [], // رَوضاتِ
      [], // الجَنّاتِ
      [], // لَهُم
      [], // ما
      [], // يَشاءونَ
      [], // عِندَ
      [], // رَبِّهِم
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَضلُ
      [] // الكَبيرُ
    ],
    [ // آية 23
      [], // ذٰلِكَ
      [], // الَّذى
      [], // يُبَشِّرُ
      [], // اللَّهُ
      [], // عِبادَهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // قُل
      [], // لا
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // أَجرًا
      [], // إِلَّا
      [], // المَوَدَّةَ
      [], // فِى
      [], // القُربىٰ
      [], // وَمَن
      ["يقترف حسنة : يَكـتـَـسِبْ طاعة ً"], // يَقتَرِف
      ["يقترف حسنة : يَكـتـَـسِبْ طاعة ً"], // حَسَنَةً
      [], // نَزِد
      [], // لَهُ
      [], // فيها
      [], // حُسنًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // شَكورٌ
    ],
    [ // آية 24
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // فَإِن
      [], // يَشَإِ
      [], // اللَّهُ
      [], // يَختِم
      [], // عَلىٰ
      [], // قَلبِكَ
      [], // وَيَمحُ
      [], // اللَّهُ
      [], // البـٰطِلَ
      [], // وَيُحِقُّ
      [], // الحَقَّ
      [], // بِكَلِمـٰتِهِ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 25
      [], // وَهُوَ
      [], // الَّذى
      [], // يَقبَلُ
      [], // التَّوبَةَ
      [], // عَن
      [], // عِبادِهِ
      [], // وَيَعفوا
      [], // عَنِ
      [], // السَّيِّـٔاتِ
      [], // وَيَعلَمُ
      [], // ما
      [] // تَفعَلونَ
    ],
    [ // آية 26
      [], // وَيَستَجيبُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // وَيَزيدُهُم
      [], // مِن
      [], // فَضلِهِ
      [], // وَالكـٰفِرونَ
      [], // لَهُم
      [], // عَذابٌ
      [] // شَديدٌ
    ],
    [ // آية 27
      [], // وَلَو
      [], // بَسَطَ
      [], // اللَّهُ
      [], // الرِّزقَ
      [], // لِعِبادِهِ
      ["لبَغَوْا : لـَـطغَـوْا و تجـبّـروا . أو لظلموا"], // لَبَغَوا
      [], // فِى
      [], // الأَرضِ
      [], // وَلـٰكِن
      [], // يُنَزِّلُ
      [], // بِقَدَرٍ
      [], // ما
      [], // يَشاءُ
      [], // إِنَّهُ
      [], // بِعِبادِهِ
      [], // خَبيرٌ
      [] // بَصيرٌ
    ],
    [ // آية 28
      [], // وَهُوَ
      [], // الَّذى
      [], // يُنَزِّلُ
      [], // الغَيثَ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // قَنَطوا
      [], // وَيَنشُرُ
      [], // رَحمَتَهُ
      [], // وَهُوَ
      [], // الوَلِىُّ
      [] // الحَميدُ
    ],
    [ // آية 29
      [], // وَمِن
      [], // ءايـٰتِهِ
      [], // خَلقُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      ["بَثّ فيهما : فرّق و نـَـشرَ فيهما"], // بَثَّ
      ["بَثّ فيهما : فرّق و نـَـشرَ فيهما"], // فيهِما
      [], // مِن
      [], // دابَّةٍ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // جَمعِهِم
      [], // إِذا
      [], // يَشاءُ
      [] // قَديرٌ
    ],
    [ // آية 30
      [], // وَما
      [], // أَصـٰبَكُم
      [], // مِن
      [], // مُصيبَةٍ
      [], // فَبِما
      [], // كَسَبَت
      [], // أَيديكُم
      [], // وَيَعفوا
      [], // عَن
      [] // كَثيرٍ
    ],
    [ // آية 31
      [], // وَما
      [], // أَنتُم
      ["بمُعْجزينَ : بفائتينَ من العذاب بالهرَب"], // بِمُعجِزينَ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [] // نَصيرٍ
    ],
    [ // آية 32
      [], // وَمِن
      [], // ءايـٰتِهِ
      ["الجوَار : السّـفن الجَاريَة"], // الجَوارِ
      [], // فِى
      [], // البَحرِ
      [] // كَالأَعلـٰمِ
    ],
    [ // آية 33
      [], // إِن
      [], // يَشَأ
      [], // يُسكِنِ
      [], // الرّيحَ
      ["فيظللن رَواكدَ : فيَـصِرْن ثوَابت سَوَاكن"], // فَيَظلَلنَ
      ["فيظللن رَواكدَ : فيَـصِرْن ثوَابت سَوَاكن"], // رَواكِدَ
      [], // عَلىٰ
      [], // ظَهرِهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِكُلِّ
      [], // صَبّارٍ
      [] // شَكورٍ
    ],
    [ // آية 34
      [], // أَو
      [], // يوبِقهُنَّ
      [], // بِما
      [], // كَسَبوا
      [], // وَيَعفُ
      [], // عَن
      [] // كَثيرٍ
    ],
    [ // آية 35
      [], // وَيَعلَمَ
      [], // الَّذينَ
      [], // يُجـٰدِلونَ
      [], // فى
      [], // ءايـٰتِنا
      [], // ما
      [], // لَهُم
      [], // مِن
      ["مَحيص : مَهْرَب و مَخلَصٍ من العذاب"] // مَحيصٍ
    ],
    [ // آية 36
      [], // فَما
      [], // أوتيتُم
      [], // مِن
      [], // شَىءٍ
      [], // فَمَتـٰعُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَما
      [], // عِندَ
      [], // اللَّهِ
      [], // خَيرٌ
      [], // وَأَبقىٰ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // وَعَلىٰ
      [], // رَبِّهِم
      [] // يَتَوَكَّلونَ
    ],
    [ // آية 37
      [], // وَالَّذينَ
      [], // يَجتَنِبونَ
      [], // كَبـٰئِرَ
      [], // الإِثمِ
      [], // وَالفَوٰحِشَ
      [], // وَإِذا
      [], // ما
      [], // غَضِبوا
      [], // هُم
      [] // يَغفِرونَ
    ],
    [ // آية 38
      [], // وَالَّذينَ
      [], // استَجابوا
      [], // لِرَبِّهِم
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // وَأَمرُهُم
      [], // شورىٰ
      [], // بَينَهُم
      [], // وَمِمّا
      [], // رَزَقنـٰهُم
      [] // يُنفِقونَ
    ],
    [ // آية 39
      [], // وَالَّذينَ
      [], // إِذا
      [], // أَصابَهُمُ
      [], // البَغىُ
      [], // هُم
      ["ينتصرون : ينتقمون ممّن ظلمهمْ و لا يَعْـتدون"] // يَنتَصِرونَ
    ],
    [ // آية 40
      [], // وَجَزٰؤُا۟
      [], // سَيِّئَةٍ
      [], // سَيِّئَةٌ
      [], // مِثلُها
      [], // فَمَن
      [], // عَفا
      [], // وَأَصلَحَ
      [], // فَأَجرُهُ
      [], // عَلَى
      [], // اللَّهِ
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 41
      [], // وَلَمَنِ
      [], // انتَصَرَ
      [], // بَعدَ
      [], // ظُلمِهِ
      [], // فَأُولـٰئِكَ
      [], // ما
      [], // عَلَيهِم
      [], // مِن
      [] // سَبيلٍ
    ],
    [ // آية 42
      [], // إِنَّمَا
      [], // السَّبيلُ
      [], // عَلَى
      [], // الَّذينَ
      [], // يَظلِمونَ
      [], // النّاسَ
      [], // وَيَبغونَ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 43
      [], // وَلَمَن
      [], // صَبَرَ
      [], // وَغَفَرَ
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // لَمِن
      [], // عَزمِ
      [] // الأُمورِ
    ],
    [ // آية 44
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [], // وَلِىٍّ
      [], // مِن
      [], // بَعدِهِ
      [], // وَتَرَى
      [], // الظّـٰلِمينَ
      [], // لَمّا
      [], // رَأَوُا
      [], // العَذابَ
      [], // يَقولونَ
      [], // هَل
      [], // إِلىٰ
      [], // مَرَدٍّ
      [], // مِن
      [] // سَبيلٍ
    ],
    [ // آية 45
      [], // وَتَرىٰهُم
      [], // يُعرَضونَ
      [], // عَلَيها
      [], // خـٰشِعينَ
      [], // مِنَ
      [], // الذُّلِّ
      [], // يَنظُرونَ
      [], // مِن
      [], // طَرفٍ
      [], // خَفِىٍّ
      [], // وَقالَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّ
      [], // الخـٰسِرينَ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // وَأَهليهِم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // أَلا
      [], // إِنَّ
      [], // الظّـٰلِمينَ
      [], // فى
      [], // عَذابٍ
      [] // مُقيمٍ
    ],
    [ // آية 46
      [], // وَما
      [], // كانَ
      [], // لَهُم
      [], // مِن
      [], // أَولِياءَ
      [], // يَنصُرونَهُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَمَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَما
      [], // لَهُ
      [], // مِن
      [] // سَبيلٍ
    ],
    [ // آية 47
      [], // استَجيبوا
      [], // لِرَبِّكُم
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِىَ
      [], // يَومٌ
      [], // لا
      [], // مَرَدَّ
      [], // لَهُ
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // مَلجَإٍ
      [], // يَومَئِذٍ
      [], // وَما
      [], // لَكُم
      [], // مِن
      ["نكير : إنكار لذنوبكمْ أو مُنْكر لعَذابكم"] // نَكيرٍ
    ],
    [ // آية 48
      [], // فَإِن
      [], // أَعرَضوا
      [], // فَما
      [], // أَرسَلنـٰكَ
      [], // عَلَيهِم
      [], // حَفيظًا
      [], // إِن
      [], // عَلَيكَ
      [], // إِلَّا
      [], // البَلـٰغُ
      [], // وَإِنّا
      [], // إِذا
      [], // أَذَقنَا
      [], // الإِنسـٰنَ
      [], // مِنّا
      [], // رَحمَةً
      ["فرح بها : بَطِرَ لأجْـلِها"], // فَرِحَ
      ["فرح بها : بَطِرَ لأجْـلِها"], // بِها
      [], // وَإِن
      [], // تُصِبهُم
      [], // سَيِّئَةٌ
      [], // بِما
      [], // قَدَّمَت
      [], // أَيديهِم
      [], // فَإِنَّ
      [], // الإِنسـٰنَ
      [] // كَفورٌ
    ],
    [ // آية 49
      [], // لِلَّهِ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يَخلُقُ
      [], // ما
      [], // يَشاءُ
      [], // يَهَبُ
      [], // لِمَن
      [], // يَشاءُ
      [], // إِنـٰثًا
      [], // وَيَهَبُ
      [], // لِمَن
      [], // يَشاءُ
      [] // الذُّكورَ
    ],
    [ // آية 50
      [], // أَو
      [], // يُزَوِّجُهُم
      [], // ذُكرانًا
      [], // وَإِنـٰثًا
      [], // وَيَجعَلُ
      [], // مَن
      [], // يَشاءُ
      [], // عَقيمًا
      [], // إِنَّهُ
      [], // عَليمٌ
      [] // قَديرٌ
    ],
    [ // آية 51
      [], // وَما
      [], // كانَ
      [], // لِبَشَرٍ
      [], // أَن
      [], // يُكَلِّمَهُ
      [], // اللَّهُ
      [], // إِلّا
      [], // وَحيًا
      [], // أَو
      [], // مِن
      [], // وَرائِ
      [], // حِجابٍ
      [], // أَو
      [], // يُرسِلَ
      [], // رَسولًا
      [], // فَيوحِىَ
      [], // بِإِذنِهِ
      [], // ما
      [], // يَشاءُ
      [], // إِنَّهُ
      [], // عَلِىٌّ
      [] // حَكيمٌ
    ],
    [ // آية 52
      [], // وَكَذٰلِكَ
      [], // أَوحَينا
      [], // إِلَيكَ
      ["روحا : قرآناً . أو نبُـوّة أو جبريل"], // روحًا
      [], // مِن
      [], // أَمرِنا
      [], // ما
      [], // كُنتَ
      [], // تَدرى
      [], // مَا
      [], // الكِتـٰبُ
      [], // وَلَا
      [], // الإيمـٰنُ
      [], // وَلـٰكِن
      [], // جَعَلنـٰهُ
      [], // نورًا
      [], // نَهدى
      [], // بِهِ
      [], // مَن
      [], // نَشاءُ
      [], // مِن
      [], // عِبادِنا
      [], // وَإِنَّكَ
      [], // لَتَهدى
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 53
      [], // صِرٰطِ
      [], // اللَّهِ
      [], // الَّذى
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // أَلا
      [], // إِلَى
      [], // اللَّهِ
      [], // تَصيرُ
      [] // الأُمورُ
    ]
  ]
];

export default meanings;