const meanings = [
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // وَالكِتـٰبِ
      [] // المُبينِ
    ],
    [ // آية 3
      [], // إِنّا
      [], // جَعَلنـٰهُ
      [], // قُرءٰنًا
      [], // عَرَبِيًّا
      [], // لَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 4
      [], // وَإِنَّهُ
      [], // فى
      [], // أُمِّ
      [], // الكِتـٰبِ
      [], // لَدَينا
      [], // لَعَلِىٌّ
      [] // حَكيمٌ
    ],
    [ // آية 5
      ["أفنضرب عنكم الذكر : أفنترك تذكيركم و إلزامكم الحجّة بإنزال القرآن"], // أَفَنَضرِبُ
      ["أفنضرب عنكم الذكر : أفنترك تذكيركم و إلزامكم الحجّة بإنزال القرآن"], // عَنكُمُ
      ["أفنضرب عنكم الذكر : أفنترك تذكيركم و إلزامكم الحجّة بإنزال القرآن"], // الذِّكرَ
      ["صَفحًا : إعراضا أو مُعرضين عنكم"], // صَفحًا
      [], // أَن
      [], // كُنتُم
      [], // قَومًا
      [] // مُسرِفينَ
    ],
    [ // آية 6
      [], // وَكَم
      [], // أَرسَلنا
      [], // مِن
      [], // نَبِىٍّ
      [], // فِى
      [] // الأَوَّلينَ
    ],
    [ // آية 7
      [], // وَما
      [], // يَأتيهِم
      [], // مِن
      [], // نَبِىٍّ
      [], // إِلّا
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 8
      [], // فَأَهلَكنا
      [], // أَشَدَّ
      [], // مِنهُم
      ["بطْشًا : قوة"], // بَطشًا
      [], // وَمَضىٰ
      ["مثل الأوّلين : صفتهم أو قصّـتهم العجيبة"], // مَثَلُ
      ["مثل الأوّلين : صفتهم أو قصّـتهم العجيبة"] // الأَوَّلينَ
    ],
    [ // آية 9
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // لَيَقولُنَّ
      [], // خَلَقَهُنَّ
      [], // العَزيزُ
      [] // العَليمُ
    ],
    [ // آية 10
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      ["الأرض مهدا : فِراشا ممهّدا للاستقرار عليها"], // الأَرضَ
      ["الأرض مهدا : فِراشا ممهّدا للاستقرار عليها"], // مَهدًا
      [], // وَجَعَلَ
      [], // لَكُم
      [], // فيها
      [], // سُبُلًا
      [], // لَعَلَّكُم
      [] // تَهتَدونَ
    ],
    [ // آية 11
      [], // وَالَّذى
      [], // نَزَّلَ
      [], // مِنَ
      [], // السَّماءِ
      ["ماءً بقدَر : بتقدير مُحكمٍ أو بمقدار الحاجة"], // ماءً
      ["ماءً بقدَر : بتقدير مُحكمٍ أو بمقدار الحاجة"], // بِقَدَرٍ
      ["فأنشرنا به : فأحيينا بالماء"], // فَأَنشَرنا
      ["فأنشرنا به : فأحيينا بالماء"], // بِهِ
      [], // بَلدَةً
      [], // مَيتًا
      [], // كَذٰلِكَ
      [] // تُخرَجونَ
    ],
    [ // آية 12
      [], // وَالَّذى
      [], // خَلَقَ
      [], // الأَزوٰجَ
      [], // كُلَّها
      [], // وَجَعَلَ
      [], // لَكُم
      [], // مِنَ
      [], // الفُلكِ
      [], // وَالأَنعـٰمِ
      [], // ما
      [] // تَركَبونَ
    ],
    [ // آية 13
      [], // لِتَستَوۥا
      [], // عَلىٰ
      [], // ظُهورِهِ
      [], // ثُمَّ
      [], // تَذكُروا
      [], // نِعمَةَ
      [], // رَبِّكُم
      [], // إِذَا
      [], // استَوَيتُم
      [], // عَلَيهِ
      [], // وَتَقولوا
      [], // سُبحـٰنَ
      [], // الَّذى
      ["سخّر : ذلـّـل"], // سَخَّرَ
      [], // لَنا
      [], // هـٰذا
      [], // وَما
      [], // كُنّا
      [], // لَهُ
      [] // مُقرِنينَ
    ],
    [ // آية 14
      [], // وَإِنّا
      [], // إِلىٰ
      [], // رَبِّنا
      [] // لَمُنقَلِبونَ
    ],
    [ // آية 15
      [], // وَجَعَلوا
      [], // لَهُ
      [], // مِن
      [], // عِبادِهِ
      [], // جُزءًا
      [], // إِنَّ
      [], // الإِنسـٰنَ
      [], // لَكَفورٌ
      [] // مُبينٌ
    ],
    [ // آية 16
      [], // أَمِ
      [], // اتَّخَذَ
      [], // مِمّا
      [], // يَخلُقُ
      [], // بَناتٍ
      [], // وَأَصفىٰكُم
      [] // بِالبَنينَ
    ],
    [ // آية 17
      [], // وَإِذا
      [], // بُشِّرَ
      [], // أَحَدُهُم
      [], // بِما
      [], // ضَرَبَ
      [], // لِلرَّحمـٰنِ
      ["مثلا : شِبْهاً و مُما ثِلا"], // مَثَلًا
      [], // ظَلَّ
      [], // وَجهُهُ
      [], // مُسوَدًّا
      [], // وَهُوَ
      [] // كَظيمٌ
    ],
    [ // آية 18
      [], // أَوَمَن
      [], // يُنَشَّؤُا۟
      [], // فِى
      [], // الحِليَةِ
      [], // وَهُوَ
      [], // فِى
      [], // الخِصامِ
      [], // غَيرُ
      [] // مُبينٍ
    ],
    [ // آية 19
      [], // وَجَعَلُوا
      [], // المَلـٰئِكَةَ
      [], // الَّذينَ
      [], // هُم
      [], // عِبـٰدُ
      [], // الرَّحمـٰنِ
      [], // إِنـٰثًا
      [], // أَشَهِدوا
      [], // خَلقَهُم
      [], // سَتُكتَبُ
      [], // شَهـٰدَتُهُم
      [] // وَيُسـَٔلونَ
    ],
    [ // آية 20
      [], // وَقالوا
      [], // لَو
      [], // شاءَ
      [], // الرَّحمـٰنُ
      [], // ما
      [], // عَبَدنـٰهُم
      [], // ما
      [], // لَهُم
      [], // بِذٰلِكَ
      [], // مِن
      [], // عِلمٍ
      [], // إِن
      [], // هُم
      [], // إِلّا
      [] // يَخرُصونَ
    ],
    [ // آية 21
      [], // أَم
      [], // ءاتَينـٰهُم
      [], // كِتـٰبًا
      [], // مِن
      [], // قَبلِهِ
      [], // فَهُم
      [], // بِهِ
      [] // مُستَمسِكونَ
    ],
    [ // آية 22
      [], // بَل
      [], // قالوا
      [], // إِنّا
      [], // وَجَدنا
      [], // ءاباءَنا
      ["على أمّة : على دين و طريقة تـُـؤمّ و تـُـقـْـصد"], // عَلىٰ
      ["على أمّة : على دين و طريقة تـُـؤمّ و تـُـقـْـصد"], // أُمَّةٍ
      [], // وَإِنّا
      [], // عَلىٰ
      [], // ءاثـٰرِهِم
      [] // مُهتَدونَ
    ],
    [ // آية 23
      [], // وَكَذٰلِكَ
      [], // ما
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // فى
      [], // قَريَةٍ
      [], // مِن
      [], // نَذيرٍ
      [], // إِلّا
      ["قال مُترفوها : مُـتنعّموها المنغمسون في شهواتهم"], // قالَ
      ["قال مُترفوها : مُـتنعّموها المنغمسون في شهواتهم"], // مُترَفوها
      [], // إِنّا
      [], // وَجَدنا
      [], // ءاباءَنا
      [], // عَلىٰ
      [], // أُمَّةٍ
      [], // وَإِنّا
      [], // عَلىٰ
      [], // ءاثـٰرِهِم
      [] // مُقتَدونَ
    ],
    [ // آية 24
      [], // قـٰلَ
      [], // أَوَلَو
      [], // جِئتُكُم
      [], // بِأَهدىٰ
      [], // مِمّا
      [], // وَجَدتُم
      [], // عَلَيهِ
      [], // ءاباءَكُم
      [], // قالوا
      [], // إِنّا
      [], // بِما
      [], // أُرسِلتُم
      [], // بِهِ
      [] // كـٰفِرونَ
    ],
    [ // آية 25
      [], // فَانتَقَمنا
      [], // مِنهُم
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُكَذِّبينَ
    ],
    [ // آية 26
      [], // وَإِذ
      [], // قالَ
      [], // إِبرٰهيمُ
      [], // لِأَبيهِ
      [], // وَقَومِهِ
      [], // إِنَّنى
      [], // بَراءٌ
      [], // مِمّا
      [] // تَعبُدونَ
    ],
    [ // آية 27
      [], // إِلَّا
      [], // الَّذى
      [], // فَطَرَنى
      [], // فَإِنَّهُ
      [] // سَيَهدينِ
    ],
    [ // آية 28
      [], // وَجَعَلَها
      ["كلمة باقية : كلمة التوحيد ، أو البراءة"], // كَلِمَةً
      ["كلمة باقية : كلمة التوحيد ، أو البراءة"], // باقِيَةً
      [], // فى
      [], // عَقِبِهِ
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 29
      [], // بَل
      [], // مَتَّعتُ
      [], // هـٰؤُلاءِ
      [], // وَءاباءَهُم
      [], // حَتّىٰ
      [], // جاءَهُمُ
      [], // الحَقُّ
      [], // وَرَسولٌ
      [] // مُبينٌ
    ],
    [ // آية 30
      [], // وَلَمّا
      [], // جاءَهُمُ
      [], // الحَقُّ
      [], // قالوا
      [], // هـٰذا
      [], // سِحرٌ
      [], // وَإِنّا
      [], // بِهِ
      [] // كـٰفِرونَ
    ],
    [ // آية 31
      [], // وَقالوا
      [], // لَولا
      [], // نُزِّلَ
      [], // هـٰذَا
      [], // القُرءانُ
      [], // عَلىٰ
      [], // رَجُلٍ
      ["من القريتين : من إحدى القريتين مكّة و الطائف"], // مِنَ
      ["من القريتين : من إحدى القريتين مكّة و الطائف"], // القَريَتَينِ
      [] // عَظيمٍ
    ],
    [ // آية 32
      [], // أَهُم
      [], // يَقسِمونَ
      [], // رَحمَتَ
      [], // رَبِّكَ
      [], // نَحنُ
      [], // قَسَمنا
      [], // بَينَهُم
      [], // مَعيشَتَهُم
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَرَفَعنا
      [], // بَعضَهُم
      [], // فَوقَ
      [], // بَعضٍ
      [], // دَرَجـٰتٍ
      [], // لِيَتَّخِذَ
      [], // بَعضُهُم
      [], // بَعضًا
      [], // سُخرِيًّا
      [], // وَرَحمَتُ
      [], // رَبِّكَ
      [], // خَيرٌ
      [], // مِمّا
      [] // يَجمَعونَ
    ],
    [ // آية 33
      [], // وَلَولا
      [], // أَن
      [], // يَكونَ
      [], // النّاسُ
      [], // أُمَّةً
      [], // وٰحِدَةً
      [], // لَجَعَلنا
      [], // لِمَن
      [], // يَكفُرُ
      [], // بِالرَّحمـٰنِ
      [], // لِبُيوتِهِم
      [], // سُقُفًا
      [], // مِن
      [], // فِضَّةٍ
      [], // وَمَعارِجَ
      [], // عَلَيها
      ["يظهرون : يَـصعدون و يرتقون"] // يَظهَرونَ
    ],
    [ // آية 34
      [], // وَلِبُيوتِهِم
      [], // أَبوٰبًا
      [], // وَسُرُرًا
      [], // عَلَيها
      [] // يَتَّكِـٔونَ
    ],
    [ // آية 35
      [], // وَزُخرُفًا
      [], // وَإِن
      [], // كُلُّ
      [], // ذٰلِكَ
      [], // لَمّا
      [], // مَتـٰعُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَالـٔاخِرَةُ
      [], // عِندَ
      [], // رَبِّكَ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 36
      [], // وَمَن
      [], // يَعشُ
      [], // عَن
      [], // ذِكرِ
      [], // الرَّحمـٰنِ
      ["نقيّض له : نسبّـب . أو نتِـحْ له"], // نُقَيِّض
      ["نقيّض له : نسبّـب . أو نتِـحْ له"], // لَهُ
      [], // شَيطـٰنًا
      [], // فَهُوَ
      ["له قرين : مُصاحبٌ له لا يُفارقه"], // لَهُ
      ["له قرين : مُصاحبٌ له لا يُفارقه"] // قَرينٌ
    ],
    [ // آية 37
      [], // وَإِنَّهُم
      [], // لَيَصُدّونَهُم
      [], // عَنِ
      [], // السَّبيلِ
      [], // وَيَحسَبونَ
      [], // أَنَّهُم
      [] // مُهتَدونَ
    ],
    [ // آية 38
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَنا
      [], // قالَ
      [], // يـٰلَيتَ
      [], // بَينى
      [], // وَبَينَكَ
      [], // بُعدَ
      [], // المَشرِقَينِ
      [], // فَبِئسَ
      [] // القَرينُ
    ],
    [ // آية 39
      [], // وَلَن
      [], // يَنفَعَكُمُ
      [], // اليَومَ
      [], // إِذ
      [], // ظَلَمتُم
      [], // أَنَّكُم
      [], // فِى
      [], // العَذابِ
      [] // مُشتَرِكونَ
    ],
    [ // آية 40
      [], // أَفَأَنتَ
      [], // تُسمِعُ
      [], // الصُّمَّ
      [], // أَو
      [], // تَهدِى
      [], // العُمىَ
      [], // وَمَن
      [], // كانَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 41
      [], // فَإِمّا
      [], // نَذهَبَنَّ
      [], // بِكَ
      [], // فَإِنّا
      [], // مِنهُم
      [] // مُنتَقِمونَ
    ],
    [ // آية 42
      [], // أَو
      [], // نُرِيَنَّكَ
      [], // الَّذى
      [], // وَعَدنـٰهُم
      [], // فَإِنّا
      [], // عَلَيهِم
      [] // مُقتَدِرونَ
    ],
    [ // آية 43
      [], // فَاستَمسِك
      [], // بِالَّذى
      [], // أوحِىَ
      [], // إِلَيكَ
      [], // إِنَّكَ
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 44
      [], // وَإِنَّهُ
      [], // لَذِكرٌ
      [], // لَكَ
      [], // وَلِقَومِكَ
      [], // وَسَوفَ
      [] // تُسـَٔلونَ
    ],
    [ // آية 45
      [], // وَسـَٔل
      [], // مَن
      [], // أَرسَلنا
      [], // مِن
      [], // قَبلِكَ
      [], // مِن
      [], // رُسُلِنا
      [], // أَجَعَلنا
      [], // مِن
      [], // دونِ
      [], // الرَّحمـٰنِ
      [], // ءالِهَةً
      [] // يُعبَدونَ
    ],
    [ // آية 46
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      [], // فَقالَ
      [], // إِنّى
      [], // رَسولُ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 47
      [], // فَلَمّا
      [], // جاءَهُم
      [], // بِـٔايـٰتِنا
      [], // إِذا
      [], // هُم
      [], // مِنها
      [] // يَضحَكونَ
    ],
    [ // آية 48
      [], // وَما
      [], // نُريهِم
      [], // مِن
      [], // ءايَةٍ
      [], // إِلّا
      [], // هِىَ
      [], // أَكبَرُ
      [], // مِن
      [], // أُختِها
      [], // وَأَخَذنـٰهُم
      [], // بِالعَذابِ
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 49
      [], // وَقالوا
      [], // يـٰأَيُّهَ
      [], // السّاحِرُ
      [], // ادعُ
      [], // لَنا
      [], // رَبَّكَ
      ["بما عَهِد عندك : منْ كشف العذاب عمّن اهتدى"], // بِما
      ["بما عَهِد عندك : منْ كشف العذاب عمّن اهتدى"], // عَهِدَ
      ["بما عَهِد عندك : منْ كشف العذاب عمّن اهتدى"], // عِندَكَ
      [], // إِنَّنا
      [] // لَمُهتَدونَ
    ],
    [ // آية 50
      [], // فَلَمّا
      [], // كَشَفنا
      [], // عَنهُمُ
      [], // العَذابَ
      [], // إِذا
      [], // هُم
      [] // يَنكُثونَ
    ],
    [ // آية 51
      [], // وَنادىٰ
      [], // فِرعَونُ
      [], // فى
      [], // قَومِهِ
      [], // قالَ
      [], // يـٰقَومِ
      [], // أَلَيسَ
      [], // لى
      [], // مُلكُ
      [], // مِصرَ
      [], // وَهـٰذِهِ
      [], // الأَنهـٰرُ
      [], // تَجرى
      [], // مِن
      [], // تَحتى
      [], // أَفَلا
      [] // تُبصِرونَ
    ],
    [ // آية 52
      [], // أَم
      [], // أَنا۠
      [], // خَيرٌ
      [], // مِن
      [], // هـٰذَا
      [], // الَّذى
      ["هوَ مَهين : ضعيف حقيرٌ"], // هُوَ
      ["هوَ مَهين : ضعيف حقيرٌ"], // مَهينٌ
      [], // وَلا
      [], // يَكادُ
      ["يُبين : يُفصِح الكلام لِلـُـثغَة في لسانه"] // يُبينُ
    ],
    [ // آية 53
      [], // فَلَولا
      [], // أُلقِىَ
      [], // عَلَيهِ
      [], // أَسوِرَةٌ
      [], // مِن
      [], // ذَهَبٍ
      [], // أَو
      [], // جاءَ
      [], // مَعَهُ
      [], // المَلـٰئِكَةُ
      ["مُقترنين : مقرونين به يُصدقونه"] // مُقتَرِنينَ
    ],
    [ // آية 54
      ["فاستخفّ قومه : وجدهم خفاف العقول"], // فَاستَخَفَّ
      ["فاستخفّ قومه : وجدهم خفاف العقول"], // قَومَهُ
      [], // فَأَطاعوهُ
      [], // إِنَّهُم
      [], // كانوا
      [], // قَومًا
      [] // فـٰسِقينَ
    ],
    [ // آية 55
      [], // فَلَمّا
      [], // ءاسَفونَا
      [], // انتَقَمنا
      [], // مِنهُم
      [], // فَأَغرَقنـٰهُم
      [] // أَجمَعينَ
    ],
    [ // آية 56
      [], // فَجَعَلنـٰهُم
      ["سَلَفا : قدْوَة للكفّار في استحقاق العقاب"], // سَلَفًا
      [], // وَمَثَلًا
      [] // لِلـٔاخِرينَ
    ],
    [ // آية 57
      [], // وَلَمّا
      [], // ضُرِبَ
      [], // ابنُ
      [], // مَريَمَ
      [], // مَثَلًا
      [], // إِذا
      [], // قَومُكَ
      ["منه يصدّون : من أجله يضجّون و يصيحونَ فرَحا و جَذلاً"], // مِنهُ
      ["منه يصدّون : من أجله يضجّون و يصيحونَ فرَحا و جَذلاً"] // يَصِدّونَ
    ],
    [ // آية 58
      [], // وَقالوا
      [], // ءَأـٰلِهَتُنا
      [], // خَيرٌ
      [], // أَم
      [], // هُوَ
      [], // ما
      [], // ضَرَبوهُ
      [], // لَكَ
      [], // إِلّا
      [], // جَدَلًا
      [], // بَل
      [], // هُم
      ["قوم خصِمون : لُدّ شداد الخصومة بالباطل"], // قَومٌ
      ["قوم خصِمون : لُدّ شداد الخصومة بالباطل"] // خَصِمونَ
    ],
    [ // آية 59
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // عَبدٌ
      [], // أَنعَمنا
      [], // عَلَيهِ
      [], // وَجَعَلنـٰهُ
      ["مثلا : آية و عبرة عجيبة كالمثل السّـائر"], // مَثَلًا
      [], // لِبَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 60
      [], // وَلَو
      [], // نَشاءُ
      ["لجعلنا منكم : بذلكم . أو لولـّـدْنا منكم"], // لَجَعَلنا
      ["لجعلنا منكم : بذلكم . أو لولـّـدْنا منكم"], // مِنكُم
      [], // مَلـٰئِكَةً
      [], // فِى
      [], // الأَرضِ
      [] // يَخلُفونَ
    ],
    [ // آية 61
      [], // وَإِنَّهُ
      [], // لَعِلمٌ
      [], // لِلسّاعَةِ
      ["فلا تمترنّ بها : فلا تشكّنّ في قيَامها"], // فَلا
      ["فلا تمترنّ بها : فلا تشكّنّ في قيَامها"], // تَمتَرُنَّ
      ["فلا تمترنّ بها : فلا تشكّنّ في قيَامها"], // بِها
      [], // وَاتَّبِعونِ
      [], // هـٰذا
      [], // صِرٰطٌ
      [] // مُستَقيمٌ
    ],
    [ // آية 62
      [], // وَلا
      [], // يَصُدَّنَّكُمُ
      [], // الشَّيطـٰنُ
      [], // إِنَّهُ
      [], // لَكُم
      [], // عَدُوٌّ
      [] // مُبينٌ
    ],
    [ // آية 63
      [], // وَلَمّا
      [], // جاءَ
      [], // عيسىٰ
      [], // بِالبَيِّنـٰتِ
      [], // قالَ
      [], // قَد
      [], // جِئتُكُم
      [], // بِالحِكمَةِ
      [], // وَلِأُبَيِّنَ
      [], // لَكُم
      [], // بَعضَ
      [], // الَّذى
      [], // تَختَلِفونَ
      [], // فيهِ
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [] // وَأَطيعونِ
    ],
    [ // آية 64
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // رَبّى
      [], // وَرَبُّكُم
      [], // فَاعبُدوهُ
      [], // هـٰذا
      [], // صِرٰطٌ
      [] // مُستَقيمٌ
    ],
    [ // آية 65
      [], // فَاختَلَفَ
      [], // الأَحزابُ
      [], // مِن
      [], // بَينِهِم
      [], // فَوَيلٌ
      [], // لِلَّذينَ
      [], // ظَلَموا
      [], // مِن
      [], // عَذابِ
      [], // يَومٍ
      [] // أَليمٍ
    ],
    [ // آية 66
      ["هل ينظرون : هل ينتظرون"], // هَل
      ["هل ينظرون : هل ينتظرون"], // يَنظُرونَ
      [], // إِلَّا
      [], // السّاعَةَ
      [], // أَن
      [], // تَأتِيَهُم
      [], // بَغتَةً
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 67
      ["الأخلاء : الأحباء في غير ذات الله"], // الأَخِلّاءُ
      [], // يَومَئِذٍ
      [], // بَعضُهُم
      [], // لِبَعضٍ
      [], // عَدُوٌّ
      [], // إِلَّا
      [] // المُتَّقينَ
    ],
    [ // آية 68
      [], // يـٰعِبادِ
      [], // لا
      [], // خَوفٌ
      [], // عَلَيكُمُ
      [], // اليَومَ
      [], // وَلا
      [], // أَنتُم
      [] // تَحزَنونَ
    ],
    [ // آية 69
      [], // الَّذينَ
      [], // ءامَنوا
      [], // بِـٔايـٰتِنا
      [], // وَكانوا
      [] // مُسلِمينَ
    ],
    [ // آية 70
      [], // ادخُلُوا
      [], // الجَنَّةَ
      [], // أَنتُم
      [], // وَأَزوٰجُكُم
      ["تحبَرون : تسرّون سرورا ظاهرَ الأثر"] // تُحبَرونَ
    ],
    [ // آية 71
      [], // يُطافُ
      [], // عَلَيهِم
      [], // بِصِحافٍ
      [], // مِن
      [], // ذَهَبٍ
      [], // وَأَكوابٍ
      [], // وَفيها
      [], // ما
      [], // تَشتَهيهِ
      [], // الأَنفُسُ
      [], // وَتَلَذُّ
      [], // الأَعيُنُ
      [], // وَأَنتُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 72
      [], // وَتِلكَ
      [], // الجَنَّةُ
      [], // الَّتى
      [], // أورِثتُموها
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 73
      [], // لَكُم
      [], // فيها
      [], // فـٰكِهَةٌ
      [], // كَثيرَةٌ
      [], // مِنها
      [] // تَأكُلونَ
    ],
    [ // آية 74
      [], // إِنَّ
      [], // المُجرِمينَ
      [], // فى
      [], // عَذابِ
      [], // جَهَنَّمَ
      [] // خـٰلِدونَ
    ],
    [ // آية 75
      [], // لا
      [], // يُفَتَّرُ
      [], // عَنهُم
      [], // وَهُم
      [], // فيهِ
      ["مُبلسون : ساكنون أو حزينون من شدّة اليأس"] // مُبلِسونَ
    ],
    [ // آية 76
      [], // وَما
      [], // ظَلَمنـٰهُم
      [], // وَلـٰكِن
      [], // كانوا
      [], // هُمُ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 77
      [], // وَنادَوا
      [], // يـٰمـٰلِكُ
      ["ليقضِ علينا ربّك : ليُمتـْـنا حتـّى نخلُـصَ من هذا العذاب"], // لِيَقضِ
      ["ليقضِ علينا ربّك : ليُمتـْـنا حتـّى نخلُـصَ من هذا العذاب"], // عَلَينا
      ["ليقضِ علينا ربّك : ليُمتـْـنا حتـّى نخلُـصَ من هذا العذاب"], // رَبُّكَ
      [], // قالَ
      [], // إِنَّكُم
      [] // مـٰكِثونَ
    ],
    [ // آية 78
      [], // لَقَد
      [], // جِئنـٰكُم
      [], // بِالحَقِّ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَكُم
      [], // لِلحَقِّ
      [] // كـٰرِهونَ
    ],
    [ // آية 79
      ["أمْ أبرموا أمرًا : بلْ أأحكموا كيْدا له صلى الله عليه و سلم"], // أَم
      ["أمْ أبرموا أمرًا : بلْ أأحكموا كيْدا له صلى الله عليه و سلم"], // أَبرَموا
      ["أمْ أبرموا أمرًا : بلْ أأحكموا كيْدا له صلى الله عليه و سلم"], // أَمرًا
      [], // فَإِنّا
      [] // مُبرِمونَ
    ],
    [ // آية 80
      [], // أَم
      [], // يَحسَبونَ
      [], // أَنّا
      [], // لا
      [], // نَسمَعُ
      [], // سِرَّهُم
      [], // وَنَجوىٰهُم
      [], // بَلىٰ
      [], // وَرُسُلُنا
      [], // لَدَيهِم
      [] // يَكتُبونَ
    ],
    [ // آية 81
      [], // قُل
      [], // إِن
      [], // كانَ
      [], // لِلرَّحمـٰنِ
      [], // وَلَدٌ
      [], // فَأَنا۠
      [], // أَوَّلُ
      [] // العـٰبِدينَ
    ],
    [ // آية 82
      [], // سُبحـٰنَ
      [], // رَبِّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // رَبِّ
      [], // العَرشِ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 83
      [], // فَذَرهُم
      ["يخوضوا : يدخلوا مدَاخل الباطل"], // يَخوضوا
      [], // وَيَلعَبوا
      [], // حَتّىٰ
      [], // يُلـٰقوا
      [], // يَومَهُمُ
      [], // الَّذى
      [] // يوعَدونَ
    ],
    [ // آية 84
      [], // وَهُوَ
      [], // الَّذى
      [], // فِى
      [], // السَّماءِ
      [], // إِلـٰهٌ
      [], // وَفِى
      [], // الأَرضِ
      [], // إِلـٰهٌ
      [], // وَهُوَ
      [], // الحَكيمُ
      [] // العَليمُ
    ],
    [ // آية 85
      [], // وَتَبارَكَ
      [], // الَّذى
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // وَعِندَهُ
      [], // عِلمُ
      [], // السّاعَةِ
      [], // وَإِلَيهِ
      [] // تُرجَعونَ
    ],
    [ // آية 86
      [], // وَلا
      [], // يَملِكُ
      [], // الَّذينَ
      [], // يَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // الشَّفـٰعَةَ
      [], // إِلّا
      [], // مَن
      [], // شَهِدَ
      [], // بِالحَقِّ
      [], // وَهُم
      [] // يَعلَمونَ
    ],
    [ // آية 87
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // مَن
      [], // خَلَقَهُم
      [], // لَيَقولُنَّ
      [], // اللَّهُ
      [], // فَأَنّىٰ
      [] // يُؤفَكونَ
    ],
    [ // آية 88
      [], // وَقيلِهِ
      [], // يـٰرَبِّ
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      [], // قَومٌ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 89
      ["فاصفحْ عنهم : فأعرض عنهم"], // فَاصفَح
      ["فاصفحْ عنهم : فأعرض عنهم"], // عَنهُم
      [], // وَقُل
      [], // سَلـٰمٌ
      [], // فَسَوفَ
      [] // يَعلَمونَ
    ]
];

export default meanings;