const meanings = [
  [ // سورة 44: الدخان
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // وَالكِتـٰبِ
      [] // المُبينِ
    ],
    [ // آية 3
      [], // إِنّا
      [], // أَنزَلنـٰهُ
      [], // فى
      [], // لَيلَةٍ
      [], // مُبـٰرَكَةٍ
      [], // إِنّا
      [], // كُنّا
      [] // مُنذِرينَ
    ],
    [ // آية 4
      ["فيها يُفرق : يفصّل و يُـبَـيّـن"], // فيها
      ["فيها يُفرق : يفصّل و يُـبَـيّـن"], // يُفرَقُ
      [], // كُلُّ
      [], // أَمرٍ
      [] // حَكيمٍ
    ],
    [ // آية 5
      [], // أَمرًا
      [], // مِن
      [], // عِندِنا
      [], // إِنّا
      [], // كُنّا
      [] // مُرسِلينَ
    ],
    [ // آية 6
      [], // رَحمَةً
      [], // مِن
      [], // رَبِّكَ
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 7
      [], // رَبِّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُما
      [], // إِن
      [], // كُنتُم
      [] // موقِنينَ
    ],
    [ // آية 8
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // رَبُّكُم
      [], // وَرَبُّ
      [], // ءابائِكُمُ
      [] // الأَوَّلينَ
    ],
    [ // آية 9
      [], // بَل
      [], // هُم
      [], // فى
      [], // شَكٍّ
      [] // يَلعَبونَ
    ],
    [ // آية 10
      ["فارتقبْ : انتظر بهؤلاء الشاكّين"], // فَارتَقِب
      [], // يَومَ
      [], // تَأتِى
      [], // السَّماءُ
      ["بدخان : كناية عن إصابتهم بالجَدْب و المجاعة"], // بِدُخانٍ
      [] // مُبينٍ
    ],
    [ // آية 11
      ["يغشى الناس : يشملهم و يحيط بهم"], // يَغشَى
      ["يغشى الناس : يشملهم و يحيط بهم"], // النّاسَ
      [], // هـٰذا
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 12
      [], // رَبَّنَا
      [], // اكشِف
      [], // عَنَّا
      [], // العَذابَ
      [], // إِنّا
      [] // مُؤمِنونَ
    ],
    [ // آية 13
      [], // أَنّىٰ
      [], // لَهُمُ
      [], // الذِّكرىٰ
      [], // وَقَد
      [], // جاءَهُم
      [], // رَسولٌ
      [] // مُبينٌ
    ],
    [ // آية 14
      [], // ثُمَّ
      [], // تَوَلَّوا
      [], // عَنهُ
      [], // وَقالوا
      ["مُعلّم : يعلـّـمه بشر"], // مُعَلَّمٌ
      [] // مَجنونٌ
    ],
    [ // آية 15
      [], // إِنّا
      [], // كاشِفُوا
      [], // العَذابِ
      [], // قَليلًا
      [], // إِنَّكُم
      [] // عائِدونَ
    ],
    [ // آية 16
      ["يوم نبطش : يوم نأخذ بشدّة و عنف (يوم بدر أو يوم القيامة)"], // يَومَ
      ["يوم نبطش : يوم نأخذ بشدّة و عنف (يوم بدر أو يوم القيامة)"], // نَبطِشُ
      [], // البَطشَةَ
      [], // الكُبرىٰ
      [], // إِنّا
      [] // مُنتَقِمونَ
    ],
    [ // آية 17
      [], // وَلَقَد
      [], // فَتَنّا
      [], // قَبلَهُم
      [], // قَومَ
      [], // فِرعَونَ
      [], // وَجاءَهُم
      [], // رَسولٌ
      [] // كَريمٌ
    ],
    [ // آية 18
      [], // أَن
      [], // أَدّوا
      [], // إِلَىَّ
      [], // عِبادَ
      [], // اللَّهِ
      [], // إِنّى
      [], // لَكُم
      [], // رَسولٌ
      [] // أَمينٌ
    ],
    [ // آية 19
      [], // وَأَن
      [], // لا
      [], // تَعلوا
      [], // عَلَى
      [], // اللَّهِ
      [], // إِنّى
      [], // ءاتيكُم
      [], // بِسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 20
      [], // وَإِنّى
      [], // عُذتُ
      [], // بِرَبّى
      [], // وَرَبِّكُم
      [], // أَن
      ["ترجمونِ : تؤذوني. أو تقتلوني بالحجارة"] // تَرجُمونِ
    ],
    [ // آية 21
      [], // وَإِن
      [], // لَم
      [], // تُؤمِنوا
      [], // لى
      [] // فَاعتَزِلونِ
    ],
    [ // آية 22
      [], // فَدَعا
      [], // رَبَّهُ
      [], // أَنَّ
      [], // هـٰؤُلاءِ
      [], // قَومٌ
      [] // مُجرِمونَ
    ],
    [ // آية 23
      [], // فَأَسرِ
      [], // بِعِبادى
      [], // لَيلًا
      ["إنكم متبعون : يتبعكم فرعون و جنوده"], // إِنَّكُم
      ["إنكم متبعون : يتبعكم فرعون و جنوده"] // مُتَّبَعونَ
    ],
    [ // آية 24
      [], // وَاترُكِ
      ["البحْرَ رهوا : ساكنـًـا . أو منفرجا مفتوحا"], // البَحرَ
      ["البحْرَ رهوا : ساكنـًـا . أو منفرجا مفتوحا"], // رَهوًا
      [], // إِنَّهُم
      [], // جُندٌ
      [] // مُغرَقونَ
    ],
    [ // آية 25
      [], // كَم
      [], // تَرَكوا
      [], // مِن
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 26
      [], // وَزُروعٍ
      [], // وَمَقامٍ
      [] // كَريمٍ
    ],
    [ // آية 27
      [], // وَنَعمَةٍ
      [], // كانوا
      [], // فيها
      [] // فـٰكِهينَ
    ],
    [ // آية 28
      [], // كَذٰلِكَ
      [], // وَأَورَثنـٰها
      [], // قَومًا
      [] // ءاخَرينَ
    ],
    [ // آية 29
      [], // فَما
      [], // بَكَت
      [], // عَلَيهِمُ
      [], // السَّماءُ
      [], // وَالأَرضُ
      [], // وَما
      [], // كانوا
      ["منظرين : ممهلين بالعّذاب إلى وقت آخر"] // مُنظَرينَ
    ],
    [ // آية 30
      [], // وَلَقَد
      [], // نَجَّينا
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // مِنَ
      [], // العَذابِ
      [] // المُهينِ
    ],
    [ // آية 31
      [], // مِن
      [], // فِرعَونَ
      [], // إِنَّهُ
      [], // كانَ
      [], // عالِيًا
      [], // مِنَ
      [] // المُسرِفينَ
    ],
    [ // آية 32
      [], // وَلَقَدِ
      [], // اختَرنـٰهُم
      [], // عَلىٰ
      [], // عِلمٍ
      [], // عَلَى
      [] // العـٰلَمينَ
    ],
    [ // آية 33
      [], // وَءاتَينـٰهُم
      [], // مِنَ
      [], // الـٔايـٰتِ
      [], // ما
      [], // فيهِ
      [], // بَلـٰؤٌا۟
      [] // مُبينٌ
    ],
    [ // آية 34
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      [] // لَيَقولونَ
    ],
    [ // آية 35
      [], // إِن
      [], // هِىَ
      [], // إِلّا
      [], // مَوتَتُنَا
      [], // الأولىٰ
      [], // وَما
      [], // نَحنُ
      ["بمُنشرين : بمبعوثين بعد موتتنا"] // بِمُنشَرينَ
    ],
    [ // آية 36
      [], // فَأتوا
      [], // بِـٔابائِنا
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 37
      [], // أَهُم
      [], // خَيرٌ
      [], // أَم
      ["قوم تبّع : أبـِـي كَــِرب الحِمْـيَـــِريّ ملك اليمن"], // قَومُ
      ["قوم تبّع : أبـِـي كَــِرب الحِمْـيَـــِريّ ملك اليمن"], // تُبَّعٍ
      [], // وَالَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // أَهلَكنـٰهُم
      [], // إِنَّهُم
      [], // كانوا
      [] // مُجرِمينَ
    ],
    [ // آية 38
      [], // وَما
      [], // خَلَقنَا
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [] // لـٰعِبينَ
    ],
    [ // آية 39
      [], // ما
      [], // خَلَقنـٰهُما
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 40
      [], // إِنَّ
      ["يوم الفصْل : يوم القيامة و الحساب"], // يَومَ
      ["يوم الفصْل : يوم القيامة و الحساب"], // الفَصلِ
      [], // ميقـٰتُهُم
      [] // أَجمَعينَ
    ],
    [ // آية 41
      [], // يَومَ
      [], // لا
      [], // يُغنى
      [], // مَولًى
      [], // عَن
      [], // مَولًى
      [], // شَيـًٔا
      [], // وَلا
      [], // هُم
      [] // يُنصَرونَ
    ],
    [ // آية 42
      [], // إِلّا
      [], // مَن
      [], // رَحِمَ
      [], // اللَّهُ
      [], // إِنَّهُ
      [], // هُوَ
      [], // العَزيزُ
      [] // الرَّحيمُ
    ],
    [ // آية 43
      [], // إِنَّ
      [], // شَجَرَتَ
      [] // الزَّقّومِ
    ],
    [ // آية 44
      [], // طَعامُ
      [] // الأَثيمِ
    ],
    [ // آية 45
      ["كالمهل : دُرْديّ الزّيت . أو المعدن المُذاب"], // كَالمُهلِ
      [], // يَغلى
      [], // فِى
      [] // البُطونِ
    ],
    [ // آية 46
      [], // كَغَلىِ
      ["الحميم : الماء البالغ غاية الحرارة"] // الحَميمِ
    ],
    [ // آية 47
      [], // خُذوهُ
      ["فاعتلوه : فجرّوه بعنف و قهر"], // فَاعتِلوهُ
      [], // إِلىٰ
      ["سواء الجحيم : وَسَط النّار"], // سَواءِ
      ["سواء الجحيم : وَسَط النّار"] // الجَحيمِ
    ],
    [ // آية 48
      [], // ثُمَّ
      [], // صُبّوا
      [], // فَوقَ
      [], // رَأسِهِ
      [], // مِن
      [], // عَذابِ
      [] // الحَميمِ
    ],
    [ // آية 49
      [], // ذُق
      [], // إِنَّكَ
      [], // أَنتَ
      [], // العَزيزُ
      [] // الكَريمُ
    ],
    [ // آية 50
      [], // إِنَّ
      [], // هـٰذا
      [], // ما
      [], // كُنتُم
      ["به تمترون : فيه تجادلون و تمارون"], // بِهِ
      ["به تمترون : فيه تجادلون و تمارون"] // تَمتَرونَ
    ],
    [ // آية 51
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // مَقامٍ
      [] // أَمينٍ
    ],
    [ // آية 52
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 53
      [], // يَلبَسونَ
      [], // مِن
      ["سندس : رقيق الدّيباج"], // سُندُسٍ
      [], // وَإِستَبرَقٍ
      [] // مُتَقـٰبِلينَ
    ],
    [ // آية 54
      [], // كَذٰلِكَ
      [], // وَزَوَّجنـٰهُم
      [], // بِحورٍ
      [] // عينٍ
    ],
    [ // آية 55
      ["يدعون فيها : يطلبون فيها"], // يَدعونَ
      ["يدعون فيها : يطلبون فيها"], // فيها
      [], // بِكُلِّ
      [], // فـٰكِهَةٍ
      [] // ءامِنينَ
    ],
    [ // آية 56
      [], // لا
      [], // يَذوقونَ
      [], // فيهَا
      [], // المَوتَ
      [], // إِلَّا
      [], // المَوتَةَ
      [], // الأولىٰ
      [], // وَوَقىٰهُم
      [], // عَذابَ
      [] // الجَحيمِ
    ],
    [ // آية 57
      [], // فَضلًا
      [], // مِن
      [], // رَبِّكَ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 58
      [], // فَإِنَّما
      [], // يَسَّرنـٰهُ
      [], // بِلِسانِكَ
      [], // لَعَلَّهُم
      [] // يَتَذَكَّرونَ
    ],
    [ // آية 59
      ["فارتقب : فانتظر ما يحلّ بهم"], // فَارتَقِب
      ["إنهم مرتقبون : منتظرون ما يحلّ بك"], // إِنَّهُم
      ["إنهم مرتقبون : منتظرون ما يحلّ بك"] // مُرتَقِبونَ
    ]
  ]
];

export default meanings;