const meanings = [
  [ // سورة 45: الجاثية
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // تَنزيلُ
      [], // الكِتـٰبِ
      [], // مِنَ
      [], // اللَّهِ
      [], // العَزيزِ
      [] // الحَكيمِ
    ],
    [ // آية 3
      [], // إِنَّ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لَـٔايـٰتٍ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 4
      [], // وَفى
      [], // خَلقِكُم
      [], // وَما
      ["يبثّ : يَنشر و يفرّق"], // يَبُثُّ
      [], // مِن
      [], // دابَّةٍ
      [], // ءايـٰتٌ
      [], // لِقَومٍ
      [] // يوقِنونَ
    ],
    [ // آية 5
      [], // وَاختِلـٰفِ
      [], // الَّيلِ
      [], // وَالنَّهارِ
      [], // وَما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // مِنَ
      [], // السَّماءِ
      [], // مِن
      [], // رِزقٍ
      [], // فَأَحيا
      [], // بِهِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // وَتَصريفِ
      [], // الرِّيـٰحِ
      [], // ءايـٰتٌ
      [], // لِقَومٍ
      [] // يَعقِلونَ
    ],
    [ // آية 6
      [], // تِلكَ
      [], // ءايـٰتُ
      [], // اللَّهِ
      [], // نَتلوها
      [], // عَلَيكَ
      [], // بِالحَقِّ
      [], // فَبِأَىِّ
      [], // حَديثٍ
      [], // بَعدَ
      [], // اللَّهِ
      [], // وَءايـٰتِهِ
      [] // يُؤمِنونَ
    ],
    [ // آية 7
      ["ويْلٌ : هلاكٌ ، أو حَسرة أو شدة عذاب"], // وَيلٌ
      [], // لِكُلِّ
      ["أفّاك أثيم : كذاب كثير الإثم"], // أَفّاكٍ
      ["أفّاك أثيم : كذاب كثير الإثم"] // أَثيمٍ
    ],
    [ // آية 8
      [], // يَسمَعُ
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // تُتلىٰ
      [], // عَلَيهِ
      [], // ثُمَّ
      [], // يُصِرُّ
      [], // مُستَكبِرًا
      [], // كَأَن
      [], // لَم
      [], // يَسمَعها
      [], // فَبَشِّرهُ
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 9
      [], // وَإِذا
      [], // عَلِمَ
      [], // مِن
      [], // ءايـٰتِنا
      [], // شَيـًٔا
      [], // اتَّخَذَها
      [], // هُزُوًا
      [], // أُولـٰئِكَ
      [], // لَهُم
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 10
      [], // مِن
      [], // وَرائِهِم
      [], // جَهَنَّمُ
      [], // وَلا
      [], // يُغنى
      [], // عَنهُم
      [], // ما
      [], // كَسَبوا
      [], // شَيـًٔا
      [], // وَلا
      [], // مَا
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَولِياءَ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 11
      [], // هـٰذا
      [], // هُدًى
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      [], // لَهُم
      [], // عَذابٌ
      [], // مِن
      ["رجْزٌ : أشدّ العذاب"], // رِجزٍ
      [] // أَليمٌ
    ],
    [ // آية 12
      [], // اللَّهُ
      [], // الَّذى
      [], // سَخَّرَ
      [], // لَكُمُ
      [], // البَحرَ
      [], // لِتَجرِىَ
      [], // الفُلكُ
      [], // فيهِ
      [], // بِأَمرِهِ
      [], // وَلِتَبتَغوا
      [], // مِن
      [], // فَضلِهِ
      [], // وَلَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 13
      [], // وَسَخَّرَ
      [], // لَكُم
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // جَميعًا
      [], // مِنهُ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 14
      [], // قُل
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // يَغفِروا
      [], // لِلَّذينَ
      ["لا يرجون أيام الله : لا يتوقعون وقائعه بأعدائه"], // لا
      ["لا يرجون أيام الله : لا يتوقعون وقائعه بأعدائه"], // يَرجونَ
      ["لا يرجون أيام الله : لا يتوقعون وقائعه بأعدائه"], // أَيّامَ
      ["لا يرجون أيام الله : لا يتوقعون وقائعه بأعدائه"], // اللَّهِ
      [], // لِيَجزِىَ
      [], // قَومًا
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 15
      [], // مَن
      [], // عَمِلَ
      [], // صـٰلِحًا
      [], // فَلِنَفسِهِ
      [], // وَمَن
      [], // أَساءَ
      [], // فَعَلَيها
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّكُم
      [] // تُرجَعونَ
    ],
    [ // آية 16
      [], // وَلَقَد
      [], // ءاتَينا
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // الكِتـٰبَ
      [], // وَالحُكمَ
      [], // وَالنُّبُوَّةَ
      [], // وَرَزَقنـٰهُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // وَفَضَّلنـٰهُم
      [], // عَلَى
      [] // العـٰلَمينَ
    ],
    [ // آية 17
      [], // وَءاتَينـٰهُم
      [], // بَيِّنـٰتٍ
      [], // مِنَ
      [], // الأَمرِ
      [], // فَمَا
      [], // اختَلَفوا
      [], // إِلّا
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // جاءَهُمُ
      [], // العِلمُ
      [], // بَغيًا
      [], // بَينَهُم
      [], // إِنَّ
      [], // رَبَّكَ
      [], // يَقضى
      [], // بَينَهُم
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // فيما
      [], // كانوا
      [], // فيهِ
      [] // يَختَلِفونَ
    ],
    [ // آية 18
      [], // ثُمَّ
      [], // جَعَلنـٰكَ
      [], // عَلىٰ
      ["شريعة من الأمر : طريقة و منهاج من أمر الدين"], // شَريعَةٍ
      ["شريعة من الأمر : طريقة و منهاج من أمر الدين"], // مِنَ
      ["شريعة من الأمر : طريقة و منهاج من أمر الدين"], // الأَمرِ
      [], // فَاتَّبِعها
      [], // وَلا
      [], // تَتَّبِع
      [], // أَهواءَ
      [], // الَّذينَ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 19
      [], // إِنَّهُم
      ["لن يغنوا عنك : لن يدفعوا عنك"], // لَن
      ["لن يغنوا عنك : لن يدفعوا عنك"], // يُغنوا
      ["لن يغنوا عنك : لن يدفعوا عنك"], // عَنكَ
      [], // مِنَ
      [], // اللَّهِ
      [], // شَيـًٔا
      [], // وَإِنَّ
      [], // الظّـٰلِمينَ
      [], // بَعضُهُم
      [], // أَولِياءُ
      [], // بَعضٍ
      [], // وَاللَّهُ
      [], // وَلِىُّ
      [] // المُتَّقينَ
    ],
    [ // آية 20
      [], // هـٰذا
      [], // بَصـٰئِرُ
      [], // لِلنّاسِ
      [], // وَهُدًى
      [], // وَرَحمَةٌ
      [], // لِقَومٍ
      [] // يوقِنونَ
    ],
    [ // آية 21
      [], // أَم
      [], // حَسِبَ
      [], // الَّذينَ
      [], // اجتَرَحُوا
      [], // السَّيِّـٔاتِ
      [], // أَن
      [], // نَجعَلَهُم
      [], // كَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // سَواءً
      [], // مَحياهُم
      [], // وَمَماتُهُم
      [], // ساءَ
      [], // ما
      [] // يَحكُمونَ
    ],
    [ // آية 22
      [], // وَخَلَقَ
      [], // اللَّهُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // وَلِتُجزىٰ
      [], // كُلُّ
      [], // نَفسٍ
      [], // بِما
      [], // كَسَبَت
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 23
      [], // أَفَرَءَيتَ
      [], // مَنِ
      [], // اتَّخَذَ
      [], // إِلـٰهَهُ
      [], // هَوىٰهُ
      [], // وَأَضَلَّهُ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // عِلمٍ
      [], // وَخَتَمَ
      [], // عَلىٰ
      [], // سَمعِهِ
      [], // وَقَلبِهِ
      [], // وَجَعَلَ
      [], // عَلىٰ
      [], // بَصَرِهِ
      [], // غِشـٰوَةً
      [], // فَمَن
      [], // يَهديهِ
      [], // مِن
      [], // بَعدِ
      [], // اللَّهِ
      [], // أَفَلا
      [] // تَذَكَّرونَ
    ],
    [ // آية 24
      [], // وَقالوا
      [], // ما
      [], // هِىَ
      [], // إِلّا
      [], // حَياتُنَا
      [], // الدُّنيا
      [], // نَموتُ
      [], // وَنَحيا
      [], // وَما
      [], // يُهلِكُنا
      [], // إِلَّا
      [], // الدَّهرُ
      [], // وَما
      [], // لَهُم
      [], // بِذٰلِكَ
      [], // مِن
      [], // عِلمٍ
      [], // إِن
      [], // هُم
      [], // إِلّا
      [] // يَظُنّونَ
    ],
    [ // آية 25
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // بَيِّنـٰتٍ
      [], // ما
      [], // كانَ
      [], // حُجَّتَهُم
      [], // إِلّا
      [], // أَن
      [], // قالُوا
      [], // ائتوا
      [], // بِـٔابائِنا
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 26
      [], // قُلِ
      [], // اللَّهُ
      [], // يُحييكُم
      [], // ثُمَّ
      [], // يُميتُكُم
      [], // ثُمَّ
      [], // يَجمَعُكُم
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 27
      [], // وَلِلَّهِ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَيَومَ
      [], // تَقومُ
      [], // السّاعَةُ
      [], // يَومَئِذٍ
      [], // يَخسَرُ
      [] // المُبطِلونَ
    ],
    [ // آية 28
      [], // وَتَرىٰ
      [], // كُلَّ
      [], // أُمَّةٍ
      ["جاثية : باركة على الرّكب لشدة الهوْل"], // جاثِيَةً
      [], // كُلُّ
      [], // أُمَّةٍ
      [], // تُدعىٰ
      [], // إِلىٰ
      [], // كِتـٰبِهَا
      [], // اليَومَ
      [], // تُجزَونَ
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 29
      [], // هـٰذا
      [], // كِتـٰبُنا
      [], // يَنطِقُ
      [], // عَلَيكُم
      [], // بِالحَقِّ
      [], // إِنّا
      [], // كُنّا
      [], // نَستَنسِخُ
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 30
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فَيُدخِلُهُم
      [], // رَبُّهُم
      [], // فى
      [], // رَحمَتِهِ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // المُبينُ
    ],
    [ // آية 31
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَفَلَم
      [], // تَكُن
      [], // ءايـٰتى
      [], // تُتلىٰ
      [], // عَلَيكُم
      [], // فَاستَكبَرتُم
      [], // وَكُنتُم
      [], // قَومًا
      [] // مُجرِمينَ
    ],
    [ // آية 32
      [], // وَإِذا
      [], // قيلَ
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // وَالسّاعَةُ
      [], // لا
      [], // رَيبَ
      [], // فيها
      [], // قُلتُم
      [], // ما
      [], // نَدرى
      [], // مَا
      [], // السّاعَةُ
      [], // إِن
      [], // نَظُنُّ
      [], // إِلّا
      [], // ظَنًّا
      [], // وَما
      [], // نَحنُ
      [] // بِمُستَيقِنينَ
    ],
    [ // آية 33
      [], // وَبَدا
      [], // لَهُم
      [], // سَيِّـٔاتُ
      [], // ما
      [], // عَمِلوا
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 34
      [], // وَقيلَ
      [], // اليَومَ
      [], // نَنسىٰكُم
      [], // كَما
      [], // نَسيتُم
      [], // لِقاءَ
      [], // يَومِكُم
      [], // هـٰذا
      [], // وَمَأوىٰكُمُ
      [], // النّارُ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [] // نـٰصِرينَ
    ],
    [ // آية 35
      [], // ذٰلِكُم
      [], // بِأَنَّكُمُ
      [], // اتَّخَذتُم
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // هُزُوًا
      [], // وَغَرَّتكُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // فَاليَومَ
      [], // لا
      [], // يُخرَجونَ
      [], // مِنها
      [], // وَلا
      [], // هُم
      ["يستعتبون : يُطلب منهم الرجوع إلى ما يرضي الله"] // يُستَعتَبونَ
    ],
    [ // آية 36
      [], // فَلِلَّهِ
      [], // الحَمدُ
      [], // رَبِّ
      [], // السَّمـٰوٰتِ
      [], // وَرَبِّ
      [], // الأَرضِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 37
      [], // وَلَهُ
      [], // الكِبرِياءُ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ]
  ]
];

export default meanings;