const meanings = [
  [ // سورة 46: الأحقاف
[ // آية 1
      [] // حم
    ],
    [ // آية 2
      [], // تَنزيلُ
      [], // الكِتـٰبِ
      [], // مِنَ
      [], // اللَّهِ
      [], // العَزيزِ
      [] // الحَكيمِ
    ],
    [ // آية 3
      [], // ما
      [], // خَلَقنَا
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // إِلّا
      [], // بِالحَقِّ
      [], // وَأَجَلٍ
      [], // مُسَمًّى
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // عَمّا
      [], // أُنذِروا
      [] // مُعرِضونَ
    ],
    [ // آية 4
      [], // قُل
      [], // أَرَءَيتُم
      [], // ما
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // أَرونى
      [], // ماذا
      [], // خَلَقوا
      [], // مِنَ
      [], // الأَرضِ
      [], // أَم
      ["لهم شرك : شركة و نـَـصيبٌ مع الله تعالى"], // لَهُم
      ["لهم شرك : شركة و نـَـصيبٌ مع الله تعالى"], // شِركٌ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // ائتونى
      [], // بِكِتـٰبٍ
      [], // مِن
      [], // قَبلِ
      [], // هـٰذا
      [], // أَو
      [], // أَثـٰرَةٍ
      [], // مِن
      [], // عِلمٍ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 5
      [], // وَمَن
      [], // أَضَلُّ
      [], // مِمَّن
      [], // يَدعوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مَن
      [], // لا
      [], // يَستَجيبُ
      [], // لَهُ
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // وَهُم
      [], // عَن
      [], // دُعائِهِم
      [] // غـٰفِلونَ
    ],
    [ // آية 6
      [], // وَإِذا
      [], // حُشِرَ
      [], // النّاسُ
      [], // كانوا
      [], // لَهُم
      [], // أَعداءً
      [], // وَكانوا
      [], // بِعِبادَتِهِم
      [] // كـٰفِرينَ
    ],
    [ // آية 7
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // بَيِّنـٰتٍ
      [], // قالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلحَقِّ
      [], // لَمّا
      [], // جاءَهُم
      [], // هـٰذا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 8
      [], // أَم
      [], // يَقولونَ
      [], // افتَرىٰهُ
      [], // قُل
      [], // إِنِ
      [], // افتَرَيتُهُ
      [], // فَلا
      [], // تَملِكونَ
      [], // لى
      [], // مِنَ
      [], // اللَّهِ
      [], // شَيـًٔا
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِما
      ["تفيضون فيه : تندفعون فيه طعنا و تكذيبا"], // تُفيضونَ
      ["تفيضون فيه : تندفعون فيه طعنا و تكذيبا"], // فيهِ
      [], // كَفىٰ
      [], // بِهِ
      [], // شَهيدًا
      [], // بَينى
      [], // وَبَينَكُم
      [], // وَهُوَ
      [], // الغَفورُ
      [] // الرَّحيمُ
    ],
    [ // آية 9
      [], // قُل
      [], // ما
      [], // كُنتُ
      ["بدْعًا : بديعا منفردًا فيما جئتُ به"], // بِدعًا
      [], // مِنَ
      [], // الرُّسُلِ
      [], // وَما
      [], // أَدرى
      [], // ما
      [], // يُفعَلُ
      [], // بى
      [], // وَلا
      [], // بِكُم
      [], // إِن
      [], // أَتَّبِعُ
      [], // إِلّا
      [], // ما
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // وَما
      [], // أَنا۠
      [], // إِلّا
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 10
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // كانَ
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // وَكَفَرتُم
      [], // بِهِ
      [], // وَشَهِدَ
      [], // شاهِدٌ
      [], // مِن
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // عَلىٰ
      [], // مِثلِهِ
      [], // فَـٔامَنَ
      [], // وَاستَكبَرتُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 11
      [], // وَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // لَو
      [], // كانَ
      [], // خَيرًا
      [], // ما
      [], // سَبَقونا
      [], // إِلَيهِ
      [], // وَإِذ
      [], // لَم
      [], // يَهتَدوا
      [], // بِهِ
      [], // فَسَيَقولونَ
      [], // هـٰذا
      ["إفكٌ قديم : كذبٌ متقادمٌ"], // إِفكٌ
      ["إفكٌ قديم : كذبٌ متقادمٌ"] // قَديمٌ
    ],
    [ // آية 12
      [], // وَمِن
      [], // قَبلِهِ
      [], // كِتـٰبُ
      [], // موسىٰ
      [], // إِمامًا
      [], // وَرَحمَةً
      [], // وَهـٰذا
      [], // كِتـٰبٌ
      [], // مُصَدِّقٌ
      [], // لِسانًا
      [], // عَرَبِيًّا
      [], // لِيُنذِرَ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // وَبُشرىٰ
      [] // لِلمُحسِنينَ
    ],
    [ // آية 13
      [], // إِنَّ
      [], // الَّذينَ
      [], // قالوا
      [], // رَبُّنَا
      [], // اللَّهُ
      [], // ثُمَّ
      [], // استَقـٰموا
      [], // فَلا
      [], // خَوفٌ
      [], // عَلَيهِم
      [], // وَلا
      [], // هُم
      [] // يَحزَنونَ
    ],
    [ // آية 14
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // خـٰلِدينَ
      [], // فيها
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 15
      [], // وَوَصَّينَا
      [], // الإِنسـٰنَ
      [], // بِوٰلِدَيهِ
      [], // إِحسـٰنًا
      [], // حَمَلَتهُ
      [], // أُمُّهُ
      [], // كُرهًا
      [], // وَوَضَعَتهُ
      [], // كُرهًا
      [], // وَحَملُهُ
      [], // وَفِصـٰلُهُ
      [], // ثَلـٰثونَ
      [], // شَهرًا
      [], // حَتّىٰ
      [], // إِذا
      ["بَلغ أشدّه : بَلـَغ َ كمال قوته و عقله"], // بَلَغَ
      ["بَلغ أشدّه : بَلـَغ َ كمال قوته و عقله"], // أَشُدَّهُ
      [], // وَبَلَغَ
      [], // أَربَعينَ
      [], // سَنَةً
      [], // قالَ
      [], // رَبِّ
      [], // أَوزِعنى
      [], // أَن
      [], // أَشكُرَ
      [], // نِعمَتَكَ
      [], // الَّتى
      [], // أَنعَمتَ
      [], // عَلَىَّ
      [], // وَعَلىٰ
      [], // وٰلِدَىَّ
      [], // وَأَن
      [], // أَعمَلَ
      [], // صـٰلِحًا
      [], // تَرضىٰهُ
      [], // وَأَصلِح
      [], // لى
      [], // فى
      [], // ذُرِّيَّتى
      [], // إِنّى
      [], // تُبتُ
      [], // إِلَيكَ
      [], // وَإِنّى
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 16
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // نَتَقَبَّلُ
      [], // عَنهُم
      [], // أَحسَنَ
      [], // ما
      [], // عَمِلوا
      [], // وَنَتَجاوَزُ
      [], // عَن
      [], // سَيِّـٔاتِهِم
      [], // فى
      [], // أَصحـٰبِ
      [], // الجَنَّةِ
      [], // وَعدَ
      [], // الصِّدقِ
      [], // الَّذى
      [], // كانوا
      [] // يوعَدونَ
    ],
    [ // آية 17
      [], // وَالَّذى
      [], // قالَ
      [], // لِوٰلِدَيهِ
      ["أفّ لكما : كلمة تضجّرٍ و تبرّمٍ و كراهيّة"], // أُفٍّ
      ["أفّ لكما : كلمة تضجّرٍ و تبرّمٍ و كراهيّة"], // لَكُما
      [], // أَتَعِدانِنى
      ["أن أخرَج : أُبْعَثَ من القبر بعد الموت"], // أَن
      ["أن أخرَج : أُبْعَثَ من القبر بعد الموت"], // أُخرَجَ
      [], // وَقَد
      [], // خَلَتِ
      [], // القُرونُ
      [], // مِن
      [], // قَبلى
      [], // وَهُما
      [], // يَستَغيثانِ
      [], // اللَّهَ
      ["ويلكَ : هلكتَ و المراد حثـّه على الإيمان"], // وَيلَكَ
      [], // ءامِن
      [], // إِنَّ
      [], // وَعدَ
      [], // اللَّهِ
      [], // حَقٌّ
      [], // فَيَقولُ
      [], // ما
      [], // هـٰذا
      [], // إِلّا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 18
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      ["حقّ عليهم القول : وَجَبَ عليهم وعيد العذاب"], // حَقَّ
      ["حقّ عليهم القول : وَجَبَ عليهم وعيد العذاب"], // عَلَيهِمُ
      ["حقّ عليهم القول : وَجَبَ عليهم وعيد العذاب"], // القَولُ
      [], // فى
      [], // أُمَمٍ
      [], // قَد
      [], // خَلَت
      [], // مِن
      [], // قَبلِهِم
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // إِنَّهُم
      [], // كانوا
      [] // خـٰسِرينَ
    ],
    [ // آية 19
      [], // وَلِكُلٍّ
      [], // دَرَجـٰتٌ
      [], // مِمّا
      [], // عَمِلوا
      [], // وَلِيُوَفِّيَهُم
      [], // أَعمـٰلَهُم
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 20
      [], // وَيَومَ
      [], // يُعرَضُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // عَلَى
      [], // النّارِ
      [], // أَذهَبتُم
      [], // طَيِّبـٰتِكُم
      [], // فى
      [], // حَياتِكُمُ
      [], // الدُّنيا
      [], // وَاستَمتَعتُم
      [], // بِها
      [], // فَاليَومَ
      [], // تُجزَونَ
      ["عذاب الهون : الهوان و الذلّ"], // عَذابَ
      ["عذاب الهون : الهوان و الذلّ"], // الهونِ
      [], // بِما
      [], // كُنتُم
      [], // تَستَكبِرونَ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَبِما
      [], // كُنتُم
      [] // تَفسُقونَ
    ],
    [ // آية 21
      [], // وَاذكُر
      [], // أَخا
      [], // عادٍ
      [], // إِذ
      [], // أَنذَرَ
      [], // قَومَهُ
      ["بالأحقاف : وادٍ بين عُمان و أرض مَهْرَة"], // بِالأَحقافِ
      [], // وَقَد
      [], // خَلَتِ
      [], // النُّذُرُ
      [], // مِن
      [], // بَينِ
      [], // يَدَيهِ
      [], // وَمِن
      [], // خَلفِهِ
      [], // أَلّا
      [], // تَعبُدوا
      [], // إِلَّا
      [], // اللَّهَ
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 22
      [], // قالوا
      [], // أَجِئتَنا
      ["لتأفكنا : لتصرفنا . أو لتزيلنا بالإفك"], // لِتَأفِكَنا
      [], // عَن
      [], // ءالِهَتِنا
      [], // فَأتِنا
      [], // بِما
      [], // تَعِدُنا
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 23
      [], // قالَ
      [], // إِنَّمَا
      [], // العِلمُ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَأُبَلِّغُكُم
      [], // ما
      [], // أُرسِلتُ
      [], // بِهِ
      [], // وَلـٰكِنّى
      [], // أَرىٰكُم
      [], // قَومًا
      [] // تَجهَلونَ
    ],
    [ // آية 24
      [], // فَلَمّا
      [], // رَأَوهُ
      ["عارضا : سحابا يعرض في الأفق"], // عارِضًا
      [], // مُستَقبِلَ
      [], // أَودِيَتِهِم
      [], // قالوا
      [], // هـٰذا
      [], // عارِضٌ
      [], // مُمطِرُنا
      [], // بَل
      [], // هُوَ
      [], // مَا
      [], // استَعجَلتُم
      [], // بِهِ
      [], // ريحٌ
      [], // فيها
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 25
      [], // تُدَمِّرُ
      [], // كُلَّ
      [], // شَىءٍ
      [], // بِأَمرِ
      [], // رَبِّها
      [], // فَأَصبَحوا
      [], // لا
      [], // يُرىٰ
      [], // إِلّا
      [], // مَسـٰكِنُهُم
      [], // كَذٰلِكَ
      [], // نَجزِى
      [], // القَومَ
      [] // المُجرِمينَ
    ],
    [ // آية 26
      [], // وَلَقَد
      [], // مَكَّنّـٰهُم
      [], // فيما
      [], // إِن
      [], // مَكَّنّـٰكُم
      [], // فيهِ
      [], // وَجَعَلنا
      [], // لَهُم
      [], // سَمعًا
      [], // وَأَبصـٰرًا
      [], // وَأَفـِٔدَةً
      ["فما أغنى عنهم : فما دفع عنهم"], // فَما
      ["فما أغنى عنهم : فما دفع عنهم"], // أَغنىٰ
      ["فما أغنى عنهم : فما دفع عنهم"], // عَنهُم
      [], // سَمعُهُم
      [], // وَلا
      [], // أَبصـٰرُهُم
      [], // وَلا
      [], // أَفـِٔدَتُهُم
      [], // مِن
      [], // شَىءٍ
      [], // إِذ
      [], // كانوا
      [], // يَجحَدونَ
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَحاقَ
      [], // بِهِم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 27
      [], // وَلَقَد
      [], // أَهلَكنا
      [], // ما
      [], // حَولَكُم
      [], // مِنَ
      [], // القُرىٰ
      [], // وَصَرَّفنَا
      [], // الـٔايـٰتِ
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 28
      [], // فَلَولا
      [], // نَصَرَهُمُ
      [], // الَّذينَ
      [], // اتَّخَذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // قُربانًا
      [], // ءالِهَةً
      [], // بَل
      [], // ضَلّوا
      [], // عَنهُم
      [], // وَذٰلِكَ
      [], // إِفكُهُم
      [], // وَما
      [], // كانوا
      ["يفترون : يختلقونه في قوْلهم إنها آلهة"] // يَفتَرونَ
    ],
    [ // آية 29
      [], // وَإِذ
      ["صرفنا إليك : أمَلْـنا ووجهنا نَحْوَك"], // صَرَفنا
      ["صرفنا إليك : أمَلْـنا ووجهنا نَحْوَك"], // إِلَيكَ
      [], // نَفَرًا
      [], // مِنَ
      [], // الجِنِّ
      [], // يَستَمِعونَ
      [], // القُرءانَ
      [], // فَلَمّا
      [], // حَضَروهُ
      [], // قالوا
      ["أنصتوا : اسكتوا و اصغوا لنسمعه"], // أَنصِتوا
      [], // فَلَمّا
      [], // قُضِىَ
      [], // وَلَّوا
      [], // إِلىٰ
      [], // قَومِهِم
      [] // مُنذِرينَ
    ],
    [ // آية 30
      [], // قالوا
      [], // يـٰقَومَنا
      [], // إِنّا
      [], // سَمِعنا
      [], // كِتـٰبًا
      [], // أُنزِلَ
      [], // مِن
      [], // بَعدِ
      [], // موسىٰ
      [], // مُصَدِّقًا
      [], // لِما
      [], // بَينَ
      [], // يَدَيهِ
      [], // يَهدى
      [], // إِلَى
      [], // الحَقِّ
      [], // وَإِلىٰ
      [], // طَريقٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 31
      [], // يـٰقَومَنا
      [], // أَجيبوا
      [], // داعِىَ
      [], // اللَّهِ
      [], // وَءامِنوا
      [], // بِهِ
      [], // يَغفِر
      [], // لَكُم
      [], // مِن
      [], // ذُنوبِكُم
      [], // وَيُجِركُم
      [], // مِن
      [], // عَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 32
      [], // وَمَن
      [], // لا
      [], // يُجِب
      [], // داعِىَ
      [], // اللَّهِ
      ["فليس بمعجزٍ : لله فائت منه بالهَرَب"], // فَلَيسَ
      ["فليس بمعجزٍ : لله فائت منه بالهَرَب"], // بِمُعجِزٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَلَيسَ
      [], // لَهُ
      [], // مِن
      [], // دونِهِ
      [], // أَولِياءُ
      [], // أُولـٰئِكَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 33
      [], // أَوَلَم
      [], // يَرَوا
      [], // أَنَّ
      [], // اللَّهَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَلَم
      [], // يَعىَ
      [], // بِخَلقِهِنَّ
      [], // بِقـٰدِرٍ
      [], // عَلىٰ
      [], // أَن
      [], // يُحـِۧىَ
      [], // المَوتىٰ
      [], // بَلىٰ
      [], // إِنَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 34
      [], // وَيَومَ
      [], // يُعرَضُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // عَلَى
      [], // النّارِ
      [], // أَلَيسَ
      [], // هـٰذا
      [], // بِالحَقِّ
      [], // قالوا
      [], // بَلىٰ
      [], // وَرَبِّنا
      [], // قالَ
      [], // فَذوقُوا
      [], // العَذابَ
      [], // بِما
      [], // كُنتُم
      [] // تَكفُرونَ
    ],
    [ // آية 35
      [], // فَاصبِر
      [], // كَما
      [], // صَبَرَ
      ["أولوا العزم : ذوو الجـِــدّ و الثبات و الصّبر"], // أُولُوا
      ["أولوا العزم : ذوو الجـِــدّ و الثبات و الصّبر"], // العَزمِ
      [], // مِنَ
      [], // الرُّسُلِ
      [], // وَلا
      [], // تَستَعجِل
      [], // لَهُم
      [], // كَأَنَّهُم
      [], // يَومَ
      [], // يَرَونَ
      [], // ما
      [], // يوعَدونَ
      [], // لَم
      [], // يَلبَثوا
      [], // إِلّا
      [], // ساعَةً
      [], // مِن
      [], // نَهارٍ
      [], // بَلـٰغٌ
      [], // فَهَل
      [], // يُهلَكُ
      [], // إِلَّا
      [], // القَومُ
      [] // الفـٰسِقونَ
    ]
  ]
];

export default meanings;