const meanings = [
[ // آية 1
      [], // إِنّا
      [], // فَتَحنا
      [], // لَكَ
      ["فتحا مبينا : هو صُـلح الحديبية عام 6 هـ"], // فَتحًا
      ["فتحا مبينا : هو صُـلح الحديبية عام 6 هـ"] // مُبينًا
    ],
    [ // آية 2
      [], // لِيَغفِرَ
      [], // لَكَ
      [], // اللَّهُ
      [], // ما
      [], // تَقَدَّمَ
      [], // مِن
      [], // ذَنبِكَ
      [], // وَما
      [], // تَأَخَّرَ
      [], // وَيُتِمَّ
      [], // نِعمَتَهُ
      [], // عَلَيكَ
      [], // وَيَهدِيَكَ
      [], // صِرٰطًا
      [] // مُستَقيمًا
    ],
    [ // آية 3
      [], // وَيَنصُرَكَ
      [], // اللَّهُ
      [], // نَصرًا
      [] // عَزيزًا
    ],
    [ // آية 4
      [], // هُوَ
      [], // الَّذى
      [], // أَنزَلَ
      ["السكينة : السكون و الطمأنينة و الثبات"], // السَّكينَةَ
      [], // فى
      [], // قُلوبِ
      [], // المُؤمِنينَ
      [], // لِيَزدادوا
      [], // إيمـٰنًا
      [], // مَعَ
      [], // إيمـٰنِهِم
      [], // وَلِلَّهِ
      [], // جُنودُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 5
      [], // لِيُدخِلَ
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَيُكَفِّرَ
      [], // عَنهُم
      [], // سَيِّـٔاتِهِم
      [], // وَكانَ
      [], // ذٰلِكَ
      [], // عِندَ
      [], // اللَّهِ
      [], // فَوزًا
      [] // عَظيمًا
    ],
    [ // آية 6
      [], // وَيُعَذِّبَ
      [], // المُنـٰفِقينَ
      [], // وَالمُنـٰفِقـٰتِ
      [], // وَالمُشرِكينَ
      [], // وَالمُشرِكـٰتِ
      [], // الظّانّينَ
      [], // بِاللَّهِ
      ["ظن السوْء : ظنّ الأمر الفاسد المذموم"], // ظَنَّ
      ["ظن السوْء : ظنّ الأمر الفاسد المذموم"], // السَّوءِ
      [], // عَلَيهِم
      [], // دائِرَةُ
      [], // السَّوءِ
      [], // وَغَضِبَ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // وَلَعَنَهُم
      [], // وَأَعَدَّ
      [], // لَهُم
      [], // جَهَنَّمَ
      [], // وَساءَت
      [] // مَصيرًا
    ],
    [ // آية 7
      [], // وَلِلَّهِ
      [], // جُنودُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَزيزًا
      [] // حَكيمًا
    ],
    [ // آية 8
      [], // إِنّا
      [], // أَرسَلنـٰكَ
      [], // شـٰهِدًا
      [], // وَمُبَشِّرًا
      [] // وَنَذيرًا
    ],
    [ // آية 9
      [], // لِتُؤمِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَتُعَزِّروهُ
      [], // وَتُوَقِّروهُ
      [], // وَتُسَبِّحوهُ
      [], // بُكرَةً
      [] // وَأَصيلًا
    ],
    [ // آية 10
      [], // إِنَّ
      [], // الَّذينَ
      [], // يُبايِعونَكَ
      [], // إِنَّما
      [], // يُبايِعونَ
      [], // اللَّهَ
      [], // يَدُ
      [], // اللَّهِ
      [], // فَوقَ
      [], // أَيديهِم
      [], // فَمَن
      [], // نَكَثَ
      [], // فَإِنَّما
      [], // يَنكُثُ
      [], // عَلىٰ
      [], // نَفسِهِ
      [], // وَمَن
      [], // أَوفىٰ
      [], // بِما
      [], // عـٰهَدَ
      [], // عَلَيهُ
      [], // اللَّهَ
      [], // فَسَيُؤتيهِ
      [], // أَجرًا
      [] // عَظيمًا
    ],
    [ // آية 11
      [], // سَيَقولُ
      [], // لَكَ
      [], // المُخَلَّفونَ
      [], // مِنَ
      [], // الأَعرابِ
      [], // شَغَلَتنا
      [], // أَموٰلُنا
      [], // وَأَهلونا
      [], // فَاستَغفِر
      [], // لَنا
      [], // يَقولونَ
      [], // بِأَلسِنَتِهِم
      [], // ما
      [], // لَيسَ
      [], // فى
      [], // قُلوبِهِم
      [], // قُل
      [], // فَمَن
      [], // يَملِكُ
      [], // لَكُم
      [], // مِنَ
      [], // اللَّهِ
      [], // شَيـًٔا
      [], // إِن
      [], // أَرادَ
      [], // بِكُم
      [], // ضَرًّا
      [], // أَو
      [], // أَرادَ
      [], // بِكُم
      [], // نَفعًا
      [], // بَل
      [], // كانَ
      [], // اللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرًا
    ],
    [ // آية 12
      [], // بَل
      [], // ظَنَنتُم
      [], // أَن
      [], // لَن
      [], // يَنقَلِبَ
      [], // الرَّسولُ
      [], // وَالمُؤمِنونَ
      [], // إِلىٰ
      [], // أَهليهِم
      [], // أَبَدًا
      [], // وَزُيِّنَ
      [], // ذٰلِكَ
      [], // فى
      [], // قُلوبِكُم
      [], // وَظَنَنتُم
      [], // ظَنَّ
      [], // السَّوءِ
      [], // وَكُنتُم
      ["قوْمًا بُورا : هالكين أو فاسدين"], // قَومًا
      ["قوْمًا بُورا : هالكين أو فاسدين"] // بورًا
    ],
    [ // آية 13
      [], // وَمَن
      [], // لَم
      [], // يُؤمِن
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // فَإِنّا
      [], // أَعتَدنا
      [], // لِلكـٰفِرينَ
      [] // سَعيرًا
    ],
    [ // آية 14
      [], // وَلِلَّهِ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يَغفِرُ
      [], // لِمَن
      [], // يَشاءُ
      [], // وَيُعَذِّبُ
      [], // مَن
      [], // يَشاءُ
      [], // وَكانَ
      [], // اللَّهُ
      [], // غَفورًا
      [] // رَحيمًا
    ],
    [ // آية 15
      [], // سَيَقولُ
      [], // المُخَلَّفونَ
      [], // إِذَا
      [], // انطَلَقتُم
      [], // إِلىٰ
      [], // مَغانِمَ
      [], // لِتَأخُذوها
      [], // ذَرونا
      [], // نَتَّبِعكُم
      [], // يُريدونَ
      [], // أَن
      [], // يُبَدِّلوا
      [], // كَلـٰمَ
      [], // اللَّهِ
      [], // قُل
      [], // لَن
      [], // تَتَّبِعونا
      [], // كَذٰلِكُم
      [], // قالَ
      [], // اللَّهُ
      [], // مِن
      [], // قَبلُ
      [], // فَسَيَقولونَ
      [], // بَل
      [], // تَحسُدونَنا
      [], // بَل
      [], // كانوا
      [], // لا
      [], // يَفقَهونَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 16
      [], // قُل
      [], // لِلمُخَلَّفينَ
      [], // مِنَ
      [], // الأَعرابِ
      [], // سَتُدعَونَ
      [], // إِلىٰ
      [], // قَومٍ
      [], // أُولى
      [], // بَأسٍ
      [], // شَديدٍ
      [], // تُقـٰتِلونَهُم
      [], // أَو
      [], // يُسلِمونَ
      [], // فَإِن
      [], // تُطيعوا
      [], // يُؤتِكُمُ
      [], // اللَّهُ
      [], // أَجرًا
      [], // حَسَنًا
      [], // وَإِن
      [], // تَتَوَلَّوا
      [], // كَما
      [], // تَوَلَّيتُم
      [], // مِن
      [], // قَبلُ
      [], // يُعَذِّبكُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 17
      [], // لَيسَ
      [], // عَلَى
      [], // الأَعمىٰ
      ["حَرَجٌ : إثم في التخلّـف عن الجهاد"], // حَرَجٌ
      [], // وَلا
      [], // عَلَى
      [], // الأَعرَجِ
      [], // حَرَجٌ
      [], // وَلا
      [], // عَلَى
      [], // المَريضِ
      [], // حَرَجٌ
      [], // وَمَن
      [], // يُطِعِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // يُدخِلهُ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // وَمَن
      [], // يَتَوَلَّ
      [], // يُعَذِّبهُ
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 18
      [], // لَقَد
      [], // رَضِىَ
      [], // اللَّهُ
      [], // عَنِ
      [], // المُؤمِنينَ
      [], // إِذ
      ["يبايعونك : بَيْعة الرضوان بالحديبيّة"], // يُبايِعونَكَ
      [], // تَحتَ
      [], // الشَّجَرَةِ
      [], // فَعَلِمَ
      [], // ما
      [], // فى
      [], // قُلوبِهِم
      [], // فَأَنزَلَ
      [], // السَّكينَةَ
      [], // عَلَيهِم
      [], // وَأَثـٰبَهُم
      ["فتحا قريبا : فتح خيبر عام سبع ٍ"], // فَتحًا
      ["فتحا قريبا : فتح خيبر عام سبع ٍ"] // قَريبًا
    ],
    [ // آية 19
      [], // وَمَغانِمَ
      [], // كَثيرَةً
      [], // يَأخُذونَها
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَزيزًا
      [] // حَكيمًا
    ],
    [ // آية 20
      [], // وَعَدَكُمُ
      [], // اللَّهُ
      [], // مَغانِمَ
      [], // كَثيرَةً
      [], // تَأخُذونَها
      [], // فَعَجَّلَ
      [], // لَكُم
      [], // هـٰذِهِ
      [], // وَكَفَّ
      [], // أَيدِىَ
      [], // النّاسِ
      [], // عَنكُم
      [], // وَلِتَكونَ
      [], // ءايَةً
      [], // لِلمُؤمِنينَ
      [], // وَيَهدِيَكُم
      [], // صِرٰطًا
      [] // مُستَقيمًا
    ],
    [ // آية 21
      [], // وَأُخرىٰ
      [], // لَم
      [], // تَقدِروا
      [], // عَلَيها
      [], // قَد
      ["أحاط الله بها : أعدّها لكم أو حَفظها لكم"], // أَحاطَ
      ["أحاط الله بها : أعدّها لكم أو حَفظها لكم"], // اللَّهُ
      ["أحاط الله بها : أعدّها لكم أو حَفظها لكم"], // بِها
      [], // وَكانَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرًا
    ],
    [ // آية 22
      [], // وَلَو
      [], // قـٰتَلَكُمُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَوَلَّوُا
      [], // الأَدبـٰرَ
      [], // ثُمَّ
      [], // لا
      [], // يَجِدونَ
      [], // وَلِيًّا
      [], // وَلا
      [] // نَصيرًا
    ],
    [ // آية 23
      [], // سُنَّةَ
      [], // اللَّهِ
      [], // الَّتى
      [], // قَد
      [], // خَلَت
      [], // مِن
      [], // قَبلُ
      [], // وَلَن
      [], // تَجِدَ
      [], // لِسُنَّةِ
      [], // اللَّهِ
      [] // تَبديلًا
    ],
    [ // آية 24
      [], // وَهُوَ
      [], // الَّذى
      [], // كَفَّ
      [], // أَيدِيَهُم
      [], // عَنكُم
      [], // وَأَيدِيَكُم
      [], // عَنهُم
      ["ببطن مكّة : بالحديبية قرب مكّة"], // بِبَطنِ
      ["ببطن مكّة : بالحديبية قرب مكّة"], // مَكَّةَ
      [], // مِن
      [], // بَعدِ
      [], // أَن
      ["أظفركم عليهم : أظهركم عليهم و أعلاكم"], // أَظفَرَكُم
      ["أظفركم عليهم : أظهركم عليهم و أعلاكم"], // عَلَيهِم
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرًا
    ],
    [ // آية 25
      [], // هُمُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَصَدّوكُم
      [], // عَنِ
      [], // المَسجِدِ
      [], // الحَرامِ
      [], // وَالهَدىَ
      ["مَعْكوفا : مَحْبوسًا"], // مَعكوفًا
      [], // أَن
      [], // يَبلُغَ
      [], // مَحِلَّهُ
      [], // وَلَولا
      [], // رِجالٌ
      [], // مُؤمِنونَ
      [], // وَنِساءٌ
      [], // مُؤمِنـٰتٌ
      [], // لَم
      [], // تَعلَموهُم
      [], // أَن
      [], // تَطَـٔوهُم
      [], // فَتُصيبَكُم
      [], // مِنهُم
      ["مَعَرّة : مَكروهٌ و مشقّة، أو سُـبّـة"], // مَعَرَّةٌ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // لِيُدخِلَ
      [], // اللَّهُ
      [], // فى
      [], // رَحمَتِهِ
      [], // مَن
      [], // يَشاءُ
      [], // لَو
      [], // تَزَيَّلوا
      [], // لَعَذَّبنَا
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِنهُم
      [], // عَذابًا
      [] // أَليمًا
    ],
    [ // آية 26
      [], // إِذ
      [], // جَعَلَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فى
      [], // قُلوبِهِمُ
      ["الحميّة : الأنفة و الغضب الشديد"], // الحَمِيَّةَ
      [], // حَمِيَّةَ
      [], // الجـٰهِلِيَّةِ
      [], // فَأَنزَلَ
      [], // اللَّهُ
      ["سكينته : الإطمئنان و الوقار"], // سَكينَتَهُ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // وَعَلَى
      [], // المُؤمِنينَ
      [], // وَأَلزَمَهُم
      ["كلمة التقوى : كلمة التوحيد و الإخلاص"], // كَلِمَةَ
      ["كلمة التقوى : كلمة التوحيد و الإخلاص"], // التَّقوىٰ
      [], // وَكانوا
      [], // أَحَقَّ
      [], // بِها
      [], // وَأَهلَها
      [], // وَكانَ
      [], // اللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمًا
    ],
    [ // آية 27
      [], // لَقَد
      [], // صَدَقَ
      [], // اللَّهُ
      [], // رَسولَهُ
      [], // الرُّءيا
      [], // بِالحَقِّ
      [], // لَتَدخُلُنَّ
      [], // المَسجِدَ
      [], // الحَرامَ
      [], // إِن
      [], // شاءَ
      [], // اللَّهُ
      [], // ءامِنينَ
      [], // مُحَلِّقينَ
      [], // رُءوسَكُم
      [], // وَمُقَصِّرينَ
      [], // لا
      [], // تَخافونَ
      [], // فَعَلِمَ
      [], // ما
      [], // لَم
      [], // تَعلَموا
      [], // فَجَعَلَ
      [], // مِن
      [], // دونِ
      [], // ذٰلِكَ
      ["فتحا قريبا : صلح الحديبية أو فتح خيبر"], // فَتحًا
      ["فتحا قريبا : صلح الحديبية أو فتح خيبر"] // قَريبًا
    ],
    [ // آية 28
      [], // هُوَ
      [], // الَّذى
      [], // أَرسَلَ
      [], // رَسولَهُ
      [], // بِالهُدىٰ
      [], // وَدينِ
      [], // الحَقِّ
      ["ليُظهرَه : لِـيعليَه و يُقوّيَه"], // لِيُظهِرَهُ
      [], // عَلَى
      [], // الدّينِ
      [], // كُلِّهِ
      [], // وَكَفىٰ
      [], // بِاللَّهِ
      [] // شَهيدًا
    ],
    [ // آية 29
      [], // مُحَمَّدٌ
      [], // رَسولُ
      [], // اللَّهِ
      [], // وَالَّذينَ
      [], // مَعَهُ
      [], // أَشِدّاءُ
      [], // عَلَى
      [], // الكُفّارِ
      [], // رُحَماءُ
      [], // بَينَهُم
      [], // تَرىٰهُم
      [], // رُكَّعًا
      [], // سُجَّدًا
      [], // يَبتَغونَ
      [], // فَضلًا
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرِضوٰنًا
      [], // سيماهُم
      [], // فى
      [], // وُجوهِهِم
      [], // مِن
      [], // أَثَرِ
      [], // السُّجودِ
      [], // ذٰلِكَ
      [], // مَثَلُهُم
      [], // فِى
      [], // التَّورىٰةِ
      [], // وَمَثَلُهُم
      [], // فِى
      [], // الإِنجيلِ
      [], // كَزَرعٍ
      [], // أَخرَجَ
      [], // شَطـَٔهُ
      [], // فَـٔازَرَهُ
      ["فاسْتغلظ : فصار غليظا"], // فَاستَغلَظَ
      ["فاستوى على سوقه : فاستقام على أصوله و جُذوعِه"], // فَاستَوىٰ
      ["فاستوى على سوقه : فاستقام على أصوله و جُذوعِه"], // عَلىٰ
      ["فاستوى على سوقه : فاستقام على أصوله و جُذوعِه"], // سوقِهِ
      [], // يُعجِبُ
      [], // الزُّرّاعَ
      [], // لِيَغيظَ
      [], // بِهِمُ
      [], // الكُفّارَ
      [], // وَعَدَ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // مِنهُم
      [], // مَغفِرَةً
      [], // وَأَجرًا
      [] // عَظيمًا
    ]
];

export default meanings;