const meanings = [
  [ // سورة 50: ق
[ // آية 1
      [], // ق
      [], // وَالقُرءانِ
      [] // المَجيدِ
    ],
    [ // آية 2
      [], // بَل
      [], // عَجِبوا
      [], // أَن
      [], // جاءَهُم
      [], // مُنذِرٌ
      [], // مِنهُم
      [], // فَقالَ
      [], // الكـٰفِرونَ
      [], // هـٰذا
      [], // شَىءٌ
      [] // عَجيبٌ
    ],
    [ // آية 3
      [], // أَءِذا
      [], // مِتنا
      [], // وَكُنّا
      [], // تُرابًا
      [], // ذٰلِكَ
      [], // رَجعٌ
      [] // بَعيدٌ
    ],
    [ // آية 4
      [], // قَد
      [], // عَلِمنا
      [], // ما
      [], // تَنقُصُ
      [], // الأَرضُ
      [], // مِنهُم
      [], // وَعِندَنا
      [], // كِتـٰبٌ
      [] // حَفيظٌ
    ],
    [ // آية 5
      [], // بَل
      [], // كَذَّبوا
      [], // بِالحَقِّ
      [], // لَمّا
      [], // جاءَهُم
      [], // فَهُم
      [], // فى
      ["أمرٍ مريج : مختلط مضطرب"], // أَمرٍ
      ["أمرٍ مريج : مختلط مضطرب"] // مَريجٍ
    ],
    [ // آية 6
      [], // أَفَلَم
      [], // يَنظُروا
      [], // إِلَى
      [], // السَّماءِ
      [], // فَوقَهُم
      [], // كَيفَ
      [], // بَنَينـٰها
      [], // وَزَيَّنّـٰها
      [], // وَما
      [], // لَها
      [], // مِن
      ["فروج : فتوق و شقوق"] // فُروجٍ
    ],
    [ // آية 7
      [], // وَالأَرضَ
      [], // مَدَدنـٰها
      [], // وَأَلقَينا
      [], // فيها
      [], // رَوٰسِىَ
      [], // وَأَنبَتنا
      [], // فيها
      [], // مِن
      [], // كُلِّ
      ["زوْج بهيج : صِنـْـف حسن نضير"], // زَوجٍ
      ["زوْج بهيج : صِنـْـف حسن نضير"] // بَهيجٍ
    ],
    [ // آية 8
      [], // تَبصِرَةً
      [], // وَذِكرىٰ
      [], // لِكُلِّ
      ["عبد منيب : راجع إلينا مذعن ٍ بقدرتنا"], // عَبدٍ
      ["عبد منيب : راجع إلينا مذعن ٍ بقدرتنا"] // مُنيبٍ
    ],
    [ // آية 9
      [], // وَنَزَّلنا
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // مُبـٰرَكًا
      [], // فَأَنبَتنا
      [], // بِهِ
      [], // جَنّـٰتٍ
      [], // وَحَبَّ
      [] // الحَصيدِ
    ],
    [ // آية 10
      [], // وَالنَّخلَ
      [], // باسِقـٰتٍ
      ["لها طلعٌ : هو ثمرها ما دام في وعائه"], // لَها
      ["لها طلعٌ : هو ثمرها ما دام في وعائه"], // طَلعٌ
      ["نضيد : متراكمٌ بعضه فوق بعض"] // نَضيدٌ
    ],
    [ // آية 11
      [], // رِزقًا
      [], // لِلعِبادِ
      [], // وَأَحيَينا
      [], // بِهِ
      [], // بَلدَةً
      [], // مَيتًا
      ["كذلك الخروج : من القبور أحياءً عند البعث"], // كَذٰلِكَ
      ["كذلك الخروج : من القبور أحياءً عند البعث"] // الخُروجُ
    ],
    [ // آية 12
      [], // كَذَّبَت
      [], // قَبلَهُم
      [], // قَومُ
      [], // نوحٍ
      [], // وَأَصحـٰبُ
      [], // الرَّسِّ
      [] // وَثَمودُ
    ],
    [ // آية 13
      [], // وَعادٌ
      [], // وَفِرعَونُ
      [], // وَإِخوٰنُ
      [] // لوطٍ
    ],
    [ // آية 14
      [], // وَأَصحـٰبُ
      [], // الأَيكَةِ
      [], // وَقَومُ
      [], // تُبَّعٍ
      [], // كُلٌّ
      [], // كَذَّبَ
      [], // الرُّسُلَ
      [], // فَحَقَّ
      [] // وَعيدِ
    ],
    [ // آية 15
      ["أفعيينا بالخلق : أفعجزنا عنه – كلاّ"], // أَفَعَيينا
      ["أفعيينا بالخلق : أفعجزنا عنه – كلاّ"], // بِالخَلقِ
      [], // الأَوَّلِ
      [], // بَل
      [], // هُم
      [], // فى
      [], // لَبسٍ
      [], // مِن
      [], // خَلقٍ
      [] // جَديدٍ
    ],
    [ // آية 16
      [], // وَلَقَد
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // وَنَعلَمُ
      [], // ما
      [], // تُوَسوِسُ
      [], // بِهِ
      [], // نَفسُهُ
      [], // وَنَحنُ
      [], // أَقرَبُ
      [], // إِلَيهِ
      [], // مِن
      [], // حَبلِ
      [] // الوَريدِ
    ],
    [ // آية 17
      [], // إِذ
      [], // يَتَلَقَّى
      [], // المُتَلَقِّيانِ
      [], // عَنِ
      [], // اليَمينِ
      [], // وَعَنِ
      [], // الشِّمالِ
      ["قعيدٌ : مَلـَـكٌ قاعد"] // قَعيدٌ
    ],
    [ // آية 18
      [], // ما
      [], // يَلفِظُ
      [], // مِن
      [], // قَولٍ
      [], // إِلّا
      [], // لَدَيهِ
      ["رقيبٌ عتيدٌ : مَلـَـكٌ حافظ لأقواله مُعدّ حاضرٌ"], // رَقيبٌ
      ["رقيبٌ عتيدٌ : مَلـَـكٌ حافظ لأقواله مُعدّ حاضرٌ"] // عَتيدٌ
    ],
    [ // آية 19
      [], // وَجاءَت
      ["سَكْرة الموت : شِدّته و غَمْرَته الذاهبة بالعقل"], // سَكرَةُ
      ["سَكْرة الموت : شِدّته و غَمْرَته الذاهبة بالعقل"], // المَوتِ
      [], // بِالحَقِّ
      [], // ذٰلِكَ
      [], // ما
      [], // كُنتَ
      [], // مِنهُ
      ["تحيد : تميل عنه و تفرّ منه و تـَـهْرُب"] // تَحيدُ
    ],
    [ // آية 20
      [], // وَنُفِخَ
      [], // فِى
      [], // الصّورِ
      [], // ذٰلِكَ
      [], // يَومُ
      [] // الوَعيدِ
    ],
    [ // آية 21
      [], // وَجاءَت
      [], // كُلُّ
      [], // نَفسٍ
      [], // مَعَها
      [], // سائِقٌ
      [] // وَشَهيدٌ
    ],
    [ // آية 22
      [], // لَقَد
      [], // كُنتَ
      [], // فى
      [], // غَفلَةٍ
      [], // مِن
      [], // هـٰذا
      [], // فَكَشَفنا
      [], // عَنكَ
      ["غِطاءَك : حِحاب غفلتك عن الآخرة"], // غِطاءَكَ
      [], // فَبَصَرُكَ
      [], // اليَومَ
      ["حديد : نافِذ قويّ"] // حَديدٌ
    ],
    [ // آية 23
      [], // وَقالَ
      [], // قَرينُهُ
      [], // هـٰذا
      [], // ما
      [], // لَدَىَّ
      ["عتيد : مُعدّ حاضر مُهَـيّـأ للعرْض"] // عَتيدٌ
    ],
    [ // آية 24
      [], // أَلقِيا
      [], // فى
      [], // جَهَنَّمَ
      [], // كُلَّ
      [], // كَفّارٍ
      ["عنيد : شديد العِناد و المجافاة للحقّ"] // عَنيدٍ
    ],
    [ // آية 25
      [], // مَنّاعٍ
      [], // لِلخَيرِ
      ["مُعتد : ظالم متجاوز للحدّ"], // مُعتَدٍ
      ["مُريب : شاكّ في الله و في دينه"] // مُريبٍ
    ],
    [ // آية 26
      [], // الَّذى
      [], // جَعَلَ
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // فَأَلقِياهُ
      [], // فِى
      [], // العَذابِ
      [] // الشَّديدِ
    ],
    [ // آية 27
      [], // قالَ
      [], // قَرينُهُ
      [], // رَبَّنا
      ["ما أطْغيته : ما قهَرْتـُـهعلى الطغيان و الغَواية"], // ما
      ["ما أطْغيته : ما قهَرْتـُـهعلى الطغيان و الغَواية"], // أَطغَيتُهُ
      [], // وَلـٰكِن
      [], // كانَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // بَعيدٍ
    ],
    [ // آية 28
      [], // قالَ
      [], // لا
      [], // تَختَصِموا
      [], // لَدَىَّ
      [], // وَقَد
      [], // قَدَّمتُ
      [], // إِلَيكُم
      [] // بِالوَعيدِ
    ],
    [ // آية 29
      [], // ما
      [], // يُبَدَّلُ
      [], // القَولُ
      [], // لَدَىَّ
      [], // وَما
      [], // أَنا۠
      [], // بِظَلّـٰمٍ
      [] // لِلعَبيدِ
    ],
    [ // آية 30
      [], // يَومَ
      [], // نَقولُ
      [], // لِجَهَنَّمَ
      [], // هَلِ
      [], // امتَلَأتِ
      [], // وَتَقولُ
      [], // هَل
      [], // مِن
      [] // مَزيدٍ
    ],
    [ // آية 31
      [], // وَأُزلِفَتِ
      [], // الجَنَّةُ
      [], // لِلمُتَّقينَ
      [], // غَيرَ
      [] // بَعيدٍ
    ],
    [ // آية 32
      [], // هـٰذا
      [], // ما
      [], // توعَدونَ
      [], // لِكُلِّ
      ["أوّاب : رجّاع إلى الله بالتوبة"], // أَوّابٍ
      ["حفيظ : لما استودعه الله من حقّه"] // حَفيظٍ
    ],
    [ // آية 33
      [], // مَن
      [], // خَشِىَ
      [], // الرَّحمـٰنَ
      [], // بِالغَيبِ
      [], // وَجاءَ
      ["بقلب منيب : مُخلص مُقبل على طاعة الله"], // بِقَلبٍ
      ["بقلب منيب : مُخلص مُقبل على طاعة الله"] // مُنيبٍ
    ],
    [ // آية 34
      [], // ادخُلوها
      [], // بِسَلـٰمٍ
      [], // ذٰلِكَ
      [], // يَومُ
      [] // الخُلودِ
    ],
    [ // آية 35
      [], // لَهُم
      [], // ما
      [], // يَشاءونَ
      [], // فيها
      [], // وَلَدَينا
      [] // مَزيدٌ
    ],
    [ // آية 36
      [], // وَكَم
      [], // أَهلَكنا
      [], // قَبلَهُم
      [], // مِن
      ["قرنٍ : أمّة"], // قَرنٍ
      [], // هُم
      [], // أَشَدُّ
      [], // مِنهُم
      ["بَطشًا : قوّة أو أخْذا شديدا في كلّ شيء"], // بَطشًا
      [], // فَنَقَّبوا
      [], // فِى
      [], // البِلـٰدِ
      [], // هَل
      [], // مِن
      ["محيص : مَهْرَبٍ و مفرّ من الله"] // مَحيصٍ
    ],
    [ // آية 37
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَذِكرىٰ
      [], // لِمَن
      [], // كانَ
      [], // لَهُ
      [], // قَلبٌ
      [], // أَو
      [], // أَلقَى
      [], // السَّمعَ
      [], // وَهُوَ
      [] // شَهيدٌ
    ],
    [ // آية 38
      [], // وَلَقَد
      [], // خَلَقنَا
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَما
      [], // بَينَهُما
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // وَما
      [], // مَسَّنا
      [], // مِن
      ["لُغوب : تعب و إعياءٍ"] // لُغوبٍ
    ],
    [ // آية 39
      [], // فَاصبِر
      [], // عَلىٰ
      [], // ما
      [], // يَقولونَ
      [], // وَسَبِّح
      [], // بِحَمدِ
      [], // رَبِّكَ
      [], // قَبلَ
      [], // طُلوعِ
      [], // الشَّمسِ
      [], // وَقَبلَ
      [] // الغُروبِ
    ],
    [ // آية 40
      [], // وَمِنَ
      [], // الَّيلِ
      [], // فَسَبِّحهُ
      [], // وَأَدبـٰرَ
      [] // السُّجودِ
    ],
    [ // آية 41
      [], // وَاستَمِع
      [], // يَومَ
      [], // يُنادِ
      [], // المُنادِ
      [], // مِن
      [], // مَكانٍ
      [] // قَريبٍ
    ],
    [ // آية 42
      [], // يَومَ
      ["يسْمعون الصيحة : نفخة البعث"], // يَسمَعونَ
      ["يسْمعون الصيحة : نفخة البعث"], // الصَّيحَةَ
      [], // بِالحَقِّ
      [], // ذٰلِكَ
      [], // يَومُ
      [] // الخُروجِ
    ],
    [ // آية 43
      [], // إِنّا
      [], // نَحنُ
      [], // نُحيۦ
      [], // وَنُميتُ
      [], // وَإِلَينَا
      [] // المَصيرُ
    ],
    [ // آية 44
      [], // يَومَ
      [], // تَشَقَّقُ
      [], // الأَرضُ
      [], // عَنهُم
      ["سِراعًا : مُسرعين إلى الدّاعي"], // سِراعًا
      [], // ذٰلِكَ
      [], // حَشرٌ
      [], // عَلَينا
      [] // يَسيرٌ
    ],
    [ // آية 45
      [], // نَحنُ
      [], // أَعلَمُ
      [], // بِما
      [], // يَقولونَ
      [], // وَما
      [], // أَنتَ
      [], // عَلَيهِم
      ["بجبّار : بمُسلـّط تجْـبـرُهمْ على الإيمان"], // بِجَبّارٍ
      [], // فَذَكِّر
      [], // بِالقُرءانِ
      [], // مَن
      [], // يَخافُ
      [] // وَعيدِ
    ]
  ]
];

export default meanings;