const meanings = [
[ // آية 1
      [], // وَالذّٰرِيـٰتِ
      [] // ذَروًا
    ],
    [ // آية 2
      [], // فَالحـٰمِلـٰتِ
      [] // وِقرًا
    ],
    [ // آية 3
      [], // فَالجـٰرِيـٰتِ
      [] // يُسرًا
    ],
    [ // آية 4
      [], // فَالمُقَسِّمـٰتِ
      [] // أَمرًا
    ],
    [ // آية 5
      [], // إِنَّما
      [], // توعَدونَ
      [] // لَصادِقٌ
    ],
    [ // آية 6
      [], // وَإِنَّ
      [], // الدّينَ
      [] // لَوٰقِعٌ
    ],
    [ // آية 7
      [], // وَالسَّماءِ
      ["ذات الحُبك : الطرق التي تسير فيها الكواكب"], // ذاتِ
      ["ذات الحُبك : الطرق التي تسير فيها الكواكب"] // الحُبُكِ
    ],
    [ // آية 8
      [], // إِنَّكُم
      [], // لَفى
      ["قوْل مختلف : متناقضٍ فينا كلـّـفتم الإيمان به"], // قَولٍ
      ["قوْل مختلف : متناقضٍ فينا كلـّـفتم الإيمان به"] // مُختَلِفٍ
    ],
    [ // آية 9
      ["يؤفك عنه : يُصْرَف عن الحقّ الآتي به الرسول"], // يُؤفَكُ
      ["يؤفك عنه : يُصْرَف عن الحقّ الآتي به الرسول"], // عَنهُ
      [], // مَن
      [] // أُفِكَ
    ],
    [ // آية 10
      [], // قُتِلَ
      [] // الخَرّٰصونَ
    ],
    [ // آية 11
      [], // الَّذينَ
      [], // هُم
      [], // فى
      ["غمرة : جهالة غامرة بأمور الآخرة"], // غَمرَةٍ
      ["ساهون : غافلون عمّا أمروا به"] // ساهونَ
    ],
    [ // آية 12
      [], // يَسـَٔلونَ
      [], // أَيّانَ
      [], // يَومُ
      [] // الدّينِ
    ],
    [ // آية 13
      [], // يَومَ
      [], // هُم
      [], // عَلَى
      [], // النّارِ
      [] // يُفتَنونَ
    ],
    [ // آية 14
      [], // ذوقوا
      [], // فِتنَتَكُم
      [], // هـٰذَا
      [], // الَّذى
      [], // كُنتُم
      [], // بِهِ
      [] // تَستَعجِلونَ
    ],
    [ // آية 15
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَعُيونٍ
    ],
    [ // آية 16
      [], // ءاخِذينَ
      [], // ما
      [], // ءاتىٰهُم
      [], // رَبُّهُم
      [], // إِنَّهُم
      [], // كانوا
      [], // قَبلَ
      [], // ذٰلِكَ
      [] // مُحسِنينَ
    ],
    [ // آية 17
      [], // كانوا
      [], // قَليلًا
      [], // مِنَ
      [], // الَّيلِ
      [], // ما
      ["يَهجعون : يَنامون"] // يَهجَعونَ
    ],
    [ // آية 18
      [], // وَبِالأَسحارِ
      [], // هُم
      [] // يَستَغفِرونَ
    ],
    [ // آية 19
      [], // وَفى
      [], // أَموٰلِهِم
      [], // حَقٌّ
      [], // لِلسّائِلِ
      [] // وَالمَحرومِ
    ],
    [ // آية 20
      [], // وَفِى
      [], // الأَرضِ
      [], // ءايـٰتٌ
      [] // لِلموقِنينَ
    ],
    [ // آية 21
      [], // وَفى
      [], // أَنفُسِكُم
      [], // أَفَلا
      [] // تُبصِرونَ
    ],
    [ // آية 22
      [], // وَفِى
      [], // السَّماءِ
      [], // رِزقُكُم
      [], // وَما
      [] // توعَدونَ
    ],
    [ // آية 23
      [], // فَوَرَبِّ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // إِنَّهُ
      [], // لَحَقٌّ
      [], // مِثلَ
      [], // ما
      [], // أَنَّكُم
      [] // تَنطِقونَ
    ],
    [ // آية 24
      [], // هَل
      [], // أَتىٰكَ
      [], // حَديثُ
      [], // ضَيفِ
      [], // إِبرٰهيمَ
      [] // المُكرَمينَ
    ],
    [ // آية 25
      [], // إِذ
      [], // دَخَلوا
      [], // عَلَيهِ
      [], // فَقالوا
      [], // سَلـٰمًا
      [], // قالَ
      [], // سَلـٰمٌ
      ["قوم منكرون : قاله في نفسه لغرابَتهمْ"], // قَومٌ
      ["قوم منكرون : قاله في نفسه لغرابَتهمْ"] // مُنكَرونَ
    ],
    [ // آية 26
      ["فراغ إلى أهله : ذهَبَ إليهم في خِفـيَة من ضَيفه"], // فَراغَ
      ["فراغ إلى أهله : ذهَبَ إليهم في خِفـيَة من ضَيفه"], // إِلىٰ
      ["فراغ إلى أهله : ذهَبَ إليهم في خِفـيَة من ضَيفه"], // أَهلِهِ
      [], // فَجاءَ
      [], // بِعِجلٍ
      [] // سَمينٍ
    ],
    [ // آية 27
      [], // فَقَرَّبَهُ
      [], // إِلَيهِم
      [], // قالَ
      [], // أَلا
      [] // تَأكُلونَ
    ],
    [ // آية 28
      ["فأوجس منهم : فأحسّ في نفسه منهم"], // فَأَوجَسَ
      ["فأوجس منهم : فأحسّ في نفسه منهم"], // مِنهُم
      [], // خيفَةً
      [], // قالوا
      [], // لا
      [], // تَخَف
      [], // وَبَشَّروهُ
      [], // بِغُلـٰمٍ
      [] // عَليمٍ
    ],
    [ // آية 29
      [], // فَأَقبَلَتِ
      [], // امرَأَتُهُ
      [], // فى
      ["صرّة : صَيْحة و ضَجّـة"], // صَرَّةٍ
      ["فصكّت وجهها : لطمته بيدها تعجّبا"], // فَصَكَّت
      ["فصكّت وجهها : لطمته بيدها تعجّبا"], // وَجهَها
      [], // وَقالَت
      [], // عَجوزٌ
      [] // عَقيمٌ
    ],
    [ // آية 30
      [], // قالوا
      [], // كَذٰلِكِ
      [], // قالَ
      [], // رَبُّكِ
      [], // إِنَّهُ
      [], // هُوَ
      [], // الحَكيمُ
      [] // العَليمُ
    ],
    [ // آية 31
      [], // قالَ
      [], // فَما
      [], // خَطبُكُم
      [], // أَيُّهَا
      [] // المُرسَلونَ
    ],
    [ // آية 32
      [], // قالوا
      [], // إِنّا
      [], // أُرسِلنا
      [], // إِلىٰ
      [], // قَومٍ
      [] // مُجرِمينَ
    ],
    [ // آية 33
      [], // لِنُرسِلَ
      [], // عَلَيهِم
      [], // حِجارَةً
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 34
      ["مسَوّمة : مُعْـلـَـمَة بأنّها حجارة عذاب"], // مُسَوَّمَةً
      [], // عِندَ
      [], // رَبِّكَ
      [] // لِلمُسرِفينَ
    ],
    [ // آية 35
      [], // فَأَخرَجنا
      [], // مَن
      [], // كانَ
      [], // فيها
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 36
      [], // فَما
      [], // وَجَدنا
      [], // فيها
      [], // غَيرَ
      [], // بَيتٍ
      [], // مِنَ
      [] // المُسلِمينَ
    ],
    [ // آية 37
      [], // وَتَرَكنا
      [], // فيها
      [], // ءايَةً
      [], // لِلَّذينَ
      [], // يَخافونَ
      [], // العَذابَ
      [] // الأَليمَ
    ],
    [ // آية 38
      [], // وَفى
      [], // موسىٰ
      [], // إِذ
      [], // أَرسَلنـٰهُ
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // بِسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 39
      [], // فَتَوَلّىٰ
      [], // بِرُكنِهِ
      [], // وَقالَ
      [], // سـٰحِرٌ
      [], // أَو
      [] // مَجنونٌ
    ],
    [ // آية 40
      [], // فَأَخَذنـٰهُ
      [], // وَجُنودَهُ
      [], // فَنَبَذنـٰهُم
      [], // فِى
      [], // اليَمِّ
      [], // وَهُوَ
      [] // مُليمٌ
    ],
    [ // آية 41
      [], // وَفى
      [], // عادٍ
      [], // إِذ
      [], // أَرسَلنا
      [], // عَلَيهِمُ
      ["الريح العقيم : المُهلكة لهمْ، القاطعة لنـَـسْـلهمْ"], // الرّيحَ
      ["الريح العقيم : المُهلكة لهمْ، القاطعة لنـَـسْـلهمْ"] // العَقيمَ
    ],
    [ // آية 42
      [], // ما
      [], // تَذَرُ
      [], // مِن
      [], // شَىءٍ
      [], // أَتَت
      [], // عَلَيهِ
      [], // إِلّا
      [], // جَعَلَتهُ
      ["كالرّميم : كالشيء البالي المفـتـّـت الهالك"] // كَالرَّميمِ
    ],
    [ // آية 43
      [], // وَفى
      [], // ثَمودَ
      [], // إِذ
      [], // قيلَ
      [], // لَهُم
      [], // تَمَتَّعوا
      [], // حَتّىٰ
      [] // حينٍ
    ],
    [ // آية 44
      ["فعَتوْا : فاستكبروا"], // فَعَتَوا
      [], // عَن
      [], // أَمرِ
      [], // رَبِّهِم
      [], // فَأَخَذَتهُمُ
      [], // الصّـٰعِقَةُ
      [], // وَهُم
      [] // يَنظُرونَ
    ],
    [ // آية 45
      [], // فَمَا
      [], // استَطـٰعوا
      [], // مِن
      [], // قِيامٍ
      [], // وَما
      [], // كانوا
      [] // مُنتَصِرينَ
    ],
    [ // آية 46
      [], // وَقَومَ
      [], // نوحٍ
      [], // مِن
      [], // قَبلُ
      [], // إِنَّهُم
      [], // كانوا
      [], // قَومًا
      [] // فـٰسِقينَ
    ],
    [ // آية 47
      [], // وَالسَّماءَ
      [], // بَنَينـٰها
      [], // بِأَيي۟دٍ
      [], // وَإِنّا
      [] // لَموسِعونَ
    ],
    [ // آية 48
      [], // وَالأَرضَ
      [], // فَرَشنـٰها
      [], // فَنِعمَ
      [] // المـٰهِدونَ
    ],
    [ // آية 49
      [], // وَمِن
      [], // كُلِّ
      [], // شَىءٍ
      ["خلقنا زوجين : صِنـفَـيْـن و نوعين مختلفين"], // خَلَقنا
      ["خلقنا زوجين : صِنـفَـيْـن و نوعين مختلفين"], // زَوجَينِ
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 50
      [], // فَفِرّوا
      [], // إِلَى
      [], // اللَّهِ
      [], // إِنّى
      [], // لَكُم
      [], // مِنهُ
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 51
      [], // وَلا
      [], // تَجعَلوا
      [], // مَعَ
      [], // اللَّهِ
      [], // إِلـٰهًا
      [], // ءاخَرَ
      [], // إِنّى
      [], // لَكُم
      [], // مِنهُ
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 52
      [], // كَذٰلِكَ
      [], // ما
      [], // أَتَى
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // مِن
      [], // رَسولٍ
      [], // إِلّا
      [], // قالوا
      [], // ساحِرٌ
      [], // أَو
      [] // مَجنونٌ
    ],
    [ // آية 53
      [], // أَتَواصَوا
      [], // بِهِ
      [], // بَل
      [], // هُم
      [], // قَومٌ
      ["طاغون : متجاوزون الحدّ في الكفر"] // طاغونَ
    ],
    [ // آية 54
      [], // فَتَوَلَّ
      [], // عَنهُم
      [], // فَما
      [], // أَنتَ
      [] // بِمَلومٍ
    ],
    [ // آية 55
      [], // وَذَكِّر
      [], // فَإِنَّ
      [], // الذِّكرىٰ
      [], // تَنفَعُ
      [] // المُؤمِنينَ
    ],
    [ // آية 56
      [], // وَما
      [], // خَلَقتُ
      [], // الجِنَّ
      [], // وَالإِنسَ
      [], // إِلّا
      [] // لِيَعبُدونِ
    ],
    [ // آية 57
      [], // ما
      [], // أُريدُ
      [], // مِنهُم
      [], // مِن
      [], // رِزقٍ
      [], // وَما
      [], // أُريدُ
      [], // أَن
      [] // يُطعِمونِ
    ],
    [ // آية 58
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الرَّزّاقُ
      [], // ذُو
      [], // القُوَّةِ
      [] // المَتينُ
    ],
    [ // آية 59
      [], // فَإِنَّ
      [], // لِلَّذينَ
      [], // ظَلَموا
      ["ذنوبًا : نـَـصيبًـا مِنَ العَذاب"], // ذَنوبًا
      [], // مِثلَ
      [], // ذَنوبِ
      [], // أَصحـٰبِهِم
      [], // فَلا
      [] // يَستَعجِلونِ
    ],
    [ // آية 60
      [], // فَوَيلٌ
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // يَومِهِمُ
      [], // الَّذى
      [] // يوعَدونَ
    ]
];

export default meanings;