const meanings = [
  [ // سورة 52: الطور
[ // آية 1
      [] // وَالطّورِ
    ],
    [ // آية 2
      [], // وَكِتـٰبٍ
      [] // مَسطورٍ
    ],
    [ // آية 3
      [], // فى
      [], // رَقٍّ
      ["منشور : مبْسوط غير مختوم عليه"] // مَنشورٍ
    ],
    [ // آية 4
      [], // وَالبَيتِ
      [] // المَعمورِ
    ],
    [ // آية 5
      [], // وَالسَّقفِ
      [] // المَرفوعِ
    ],
    [ // آية 6
      [], // وَالبَحرِ
      [] // المَسجورِ
    ],
    [ // آية 7
      [], // إِنَّ
      [], // عَذابَ
      [], // رَبِّكَ
      [] // لَوٰقِعٌ
    ],
    [ // آية 8
      [], // ما
      [], // لَهُ
      [], // مِن
      [] // دافِعٍ
    ],
    [ // آية 9
      [], // يَومَ
      ["تمور السماء : تـَـضْـطرب و تـَـدور كالرّحَى"], // تَمورُ
      ["تمور السماء : تـَـضْـطرب و تـَـدور كالرّحَى"], // السَّماءُ
      [] // مَورًا
    ],
    [ // آية 10
      [], // وَتَسيرُ
      [], // الجِبالُ
      [] // سَيرًا
    ],
    [ // آية 11
      [], // فَوَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 12
      [], // الَّذينَ
      [], // هُم
      [], // فى
      ["خوْض : انـْدفاع في الأباطيل و الأكاذيب"], // خَوضٍ
      [] // يَلعَبونَ
    ],
    [ // آية 13
      [], // يَومَ
      ["يُدعّون : يُدفعون بـِعُـنـْـفٍ و شدّة"], // يُدَعّونَ
      [], // إِلىٰ
      [], // نارِ
      [], // جَهَنَّمَ
      [] // دَعًّا
    ],
    [ // آية 14
      [], // هـٰذِهِ
      [], // النّارُ
      [], // الَّتى
      [], // كُنتُم
      [], // بِها
      [] // تُكَذِّبونَ
    ],
    [ // آية 15
      [], // أَفَسِحرٌ
      [], // هـٰذا
      [], // أَم
      [], // أَنتُم
      [], // لا
      [] // تُبصِرونَ
    ],
    [ // آية 16
      ["اصلوها : ادخلوها . أو قاسوا حرّها"], // اصلَوها
      [], // فَاصبِروا
      [], // أَو
      [], // لا
      [], // تَصبِروا
      [], // سَواءٌ
      [], // عَلَيكُم
      [], // إِنَّما
      [], // تُجزَونَ
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 17
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَنَعيمٍ
    ],
    [ // آية 18
      [], // فـٰكِهينَ
      [], // بِما
      [], // ءاتىٰهُم
      [], // رَبُّهُم
      [], // وَوَقىٰهُم
      [], // رَبُّهُم
      [], // عَذابَ
      [] // الجَحيمِ
    ],
    [ // آية 19
      [], // كُلوا
      [], // وَاشرَبوا
      [], // هَنيـًٔا
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 20
      [], // مُتَّكِـٔينَ
      [], // عَلىٰ
      ["سُرُرٍ مصفوفة : مَوْصولٍ بعضها ببعـض باستواءٍ"], // سُرُرٍ
      ["سُرُرٍ مصفوفة : مَوْصولٍ بعضها ببعـض باستواءٍ"], // مَصفوفَةٍ
      [], // وَزَوَّجنـٰهُم
      [], // بِحورٍ
      [] // عينٍ
    ],
    [ // آية 21
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَاتَّبَعَتهُم
      [], // ذُرِّيَّتُهُم
      [], // بِإيمـٰنٍ
      [], // أَلحَقنا
      [], // بِهِم
      [], // ذُرِّيَّتَهُم
      [], // وَما
      [], // أَلَتنـٰهُم
      [], // مِن
      [], // عَمَلِهِم
      [], // مِن
      [], // شَىءٍ
      [], // كُلُّ
      [], // امرِئٍ
      [], // بِما
      [], // كَسَبَ
      ["رَهين : مَرْهونٌ عِـنـْد الله تعالى"] // رَهينٌ
    ],
    [ // آية 22
      [], // وَأَمدَدنـٰهُم
      [], // بِفـٰكِهَةٍ
      [], // وَلَحمٍ
      [], // مِمّا
      [] // يَشتَهونَ
    ],
    [ // آية 23
      [], // يَتَنـٰزَعونَ
      [], // فيها
      [], // كَأسًا
      [], // لا
      [], // لَغوٌ
      [], // فيها
      [], // وَلا
      [] // تَأثيمٌ
    ],
    [ // آية 24
      [], // وَيَطوفُ
      [], // عَلَيهِم
      [], // غِلمانٌ
      [], // لَهُم
      [], // كَأَنَّهُم
      [], // لُؤلُؤٌ
      [] // مَكنونٌ
    ],
    [ // آية 25
      [], // وَأَقبَلَ
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [] // يَتَساءَلونَ
    ],
    [ // آية 26
      [], // قالوا
      [], // إِنّا
      [], // كُنّا
      [], // قَبلُ
      [], // فى
      [], // أَهلِنا
      [] // مُشفِقينَ
    ],
    [ // آية 27
      [], // فَمَنَّ
      [], // اللَّهُ
      [], // عَلَينا
      [], // وَوَقىٰنا
      ["عذاب السّموم : نار جهنّم النّـافذة في المَـسَامّ"], // عَذابَ
      ["عذاب السّموم : نار جهنّم النّـافذة في المَـسَامّ"] // السَّمومِ
    ],
    [ // آية 28
      [], // إِنّا
      [], // كُنّا
      [], // مِن
      [], // قَبلُ
      [], // نَدعوهُ
      [], // إِنَّهُ
      ["هو البرّ الرحيم : المحسِن العَطوف، العظيم الرحمة"], // هُوَ
      ["هو البرّ الرحيم : المحسِن العَطوف، العظيم الرحمة"], // البَرُّ
      ["هو البرّ الرحيم : المحسِن العَطوف، العظيم الرحمة"] // الرَّحيمُ
    ],
    [ // آية 29
      [], // فَذَكِّر
      [], // فَما
      [], // أَنتَ
      [], // بِنِعمَتِ
      [], // رَبِّكَ
      [], // بِكاهِنٍ
      [], // وَلا
      [] // مَجنونٍ
    ],
    [ // آية 30
      [], // أَم
      [], // يَقولونَ
      [], // شاعِرٌ
      [], // نَتَرَبَّصُ
      [], // بِهِ
      ["رَيْبَ المَنون : صُرُوف الدّهْـر المُهلكَة"], // رَيبَ
      ["رَيْبَ المَنون : صُرُوف الدّهْـر المُهلكَة"] // المَنونِ
    ],
    [ // آية 31
      [], // قُل
      [], // تَرَبَّصوا
      [], // فَإِنّى
      [], // مَعَكُم
      [], // مِنَ
      [] // المُتَرَبِّصينَ
    ],
    [ // آية 32
      [], // أَم
      [], // تَأمُرُهُم
      [], // أَحلـٰمُهُم
      [], // بِهـٰذا
      [], // أَم
      [], // هُم
      ["قوْمٌ طاغون : متجاوزون الحَدّ في العِناد"], // قَومٌ
      ["قوْمٌ طاغون : متجاوزون الحَدّ في العِناد"] // طاغونَ
    ],
    [ // آية 33
      [], // أَم
      [], // يَقولونَ
      ["تقوّله : اختلق القرآن منْ تلقاء نفسه"], // تَقَوَّلَهُ
      [], // بَل
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 34
      [], // فَليَأتوا
      [], // بِحَديثٍ
      [], // مِثلِهِ
      [], // إِن
      [], // كانوا
      [] // صـٰدِقينَ
    ],
    [ // آية 35
      [], // أَم
      [], // خُلِقوا
      [], // مِن
      [], // غَيرِ
      [], // شَىءٍ
      [], // أَم
      [], // هُمُ
      [] // الخـٰلِقونَ
    ],
    [ // آية 36
      [], // أَم
      [], // خَلَقُوا
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بَل
      [], // لا
      [] // يوقِنونَ
    ],
    [ // آية 37
      [], // أَم
      [], // عِندَهُم
      [], // خَزائِنُ
      [], // رَبِّكَ
      [], // أَم
      [], // هُمُ
      [] // المُصَۣيطِرونَ
    ],
    [ // آية 38
      [], // أَم
      [], // لَهُم
      [], // سُلَّمٌ
      [], // يَستَمِعونَ
      [], // فيهِ
      [], // فَليَأتِ
      [], // مُستَمِعُهُم
      [], // بِسُلطـٰنٍ
      [] // مُبينٍ
    ],
    [ // آية 39
      [], // أَم
      [], // لَهُ
      [], // البَنـٰتُ
      [], // وَلَكُمُ
      [] // البَنونَ
    ],
    [ // آية 40
      [], // أَم
      [], // تَسـَٔلُهُم
      [], // أَجرًا
      [], // فَهُم
      ["منْ مَغْرَمٍ مثقلون : من التزام غرْمٍ متعبون"], // مِن
      ["منْ مَغْرَمٍ مثقلون : من التزام غرْمٍ متعبون"], // مَغرَمٍ
      ["منْ مَغْرَمٍ مثقلون : من التزام غرْمٍ متعبون"] // مُثقَلونَ
    ],
    [ // آية 41
      [], // أَم
      [], // عِندَهُمُ
      [], // الغَيبُ
      [], // فَهُم
      [] // يَكتُبونَ
    ],
    [ // آية 42
      [], // أَم
      [], // يُريدونَ
      [], // كَيدًا
      [], // فَالَّذينَ
      [], // كَفَروا
      ["هم المكيدون : المَـجْـزيون بكيْدهم و مَكْرهم"], // هُمُ
      ["هم المكيدون : المَـجْـزيون بكيْدهم و مَكْرهم"] // المَكيدونَ
    ],
    [ // آية 43
      [], // أَم
      [], // لَهُم
      [], // إِلـٰهٌ
      [], // غَيرُ
      [], // اللَّهِ
      [], // سُبحـٰنَ
      [], // اللَّهِ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 44
      [], // وَإِن
      [], // يَرَوا
      [], // كِسفًا
      [], // مِنَ
      [], // السَّماءِ
      [], // ساقِطًا
      [], // يَقولوا
      ["سحابٌ مَرْكوم : مجموعٌ بَعضه على بعض يُمْطِرُنا"], // سَحابٌ
      ["سحابٌ مَرْكوم : مجموعٌ بَعضه على بعض يُمْطِرُنا"] // مَركومٌ
    ],
    [ // آية 45
      [], // فَذَرهُم
      [], // حَتّىٰ
      [], // يُلـٰقوا
      [], // يَومَهُمُ
      [], // الَّذى
      ["فيه يصعقون : يُهلكون (يوم بَدْر)"], // فيهِ
      ["فيه يصعقون : يُهلكون (يوم بَدْر)"] // يُصعَقونَ
    ],
    [ // آية 46
      [], // يَومَ
      [], // لا
      [], // يُغنى
      [], // عَنهُم
      [], // كَيدُهُم
      [], // شَيـًٔا
      [], // وَلا
      [], // هُم
      [] // يُنصَرونَ
    ],
    [ // آية 47
      [], // وَإِنَّ
      [], // لِلَّذينَ
      [], // ظَلَموا
      [], // عَذابًا
      [], // دونَ
      [], // ذٰلِكَ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 48
      [], // وَاصبِر
      [], // لِحُكمِ
      [], // رَبِّكَ
      [], // فَإِنَّكَ
      ["بأعيننا : في حِفظنا  و حراستنا"], // بِأَعيُنِنا
      [], // وَسَبِّح
      [], // بِحَمدِ
      [], // رَبِّكَ
      [], // حينَ
      [] // تَقومُ
    ],
    [ // آية 49
      [], // وَمِنَ
      [], // الَّيلِ
      [], // فَسَبِّحهُ
      [], // وَإِدبـٰرَ
      [] // النُّجومِ
    ]
  ]
];

export default meanings;