const meanings = [
  [ // سورة 53: النجم
[ // آية 1
      [], // وَالنَّجمِ
      [], // إِذا
      [] // هَوىٰ
    ],
    [ // آية 2
      ["ما ضلّ صاحبكم : ما عدَل الرّسول عن الحقّ و الهُـدَى (جواب القسم)"], // ما
      ["ما ضلّ صاحبكم : ما عدَل الرّسول عن الحقّ و الهُـدَى (جواب القسم)"], // ضَلَّ
      ["ما ضلّ صاحبكم : ما عدَل الرّسول عن الحقّ و الهُـدَى (جواب القسم)"], // صاحِبُكُم
      [], // وَما
      [] // غَوىٰ
    ],
    [ // آية 3
      [], // وَما
      [], // يَنطِقُ
      [], // عَنِ
      [] // الهَوىٰ
    ],
    [ // آية 4
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // وَحىٌ
      [] // يوحىٰ
    ],
    [ // آية 5
      [], // عَلَّمَهُ
      ["شديد القوى : أمين الوحي جبريل عليه السلام"], // شَديدُ
      ["شديد القوى : أمين الوحي جبريل عليه السلام"] // القُوىٰ
    ],
    [ // آية 6
      ["ذو مرّة : قوة أو خَلْق ٍ حَسَن . أو آثار بديعة"], // ذو
      ["ذو مرّة : قوة أو خَلْق ٍ حَسَن . أو آثار بديعة"], // مِرَّةٍ
      ["فاستوى : فاسْتقام على صورته الخِلقـيّة"] // فَاستَوىٰ
    ],
    [ // آية 7
      [], // وَهُوَ
      [], // بِالأُفُقِ
      [] // الأَعلىٰ
    ],
    [ // آية 8
      [], // ثُمَّ
      ["دنا : قـَرُبَ جبريل من النبي صلى الله عليه و سلم"], // دَنا
      [] // فَتَدَلّىٰ
    ],
    [ // آية 9
      [], // فَكانَ
      ["قاب قوسين : قـَـدْرَ قـَوْسَيْن أو ذراعَـيْن من النبي صلى الله عليه و سلم"], // قابَ
      ["قاب قوسين : قـَـدْرَ قـَوْسَيْن أو ذراعَـيْن من النبي صلى الله عليه و سلم"], // قَوسَينِ
      [], // أَو
      [] // أَدنىٰ
    ],
    [ // آية 10
      [], // فَأَوحىٰ
      [], // إِلىٰ
      ["عبده : عبد الله و هو محمد صلى الله عليه و سلم"], // عَبدِهِ
      [], // ما
      [] // أَوحىٰ
    ],
    [ // آية 11
      [], // ما
      [], // كَذَبَ
      [], // الفُؤادُ
      [], // ما
      [] // رَأىٰ
    ],
    [ // آية 12
      [], // أَفَتُمـٰرونَهُ
      [], // عَلىٰ
      [], // ما
      [] // يَرىٰ
    ],
    [ // آية 13
      [], // وَلَقَد
      [], // رَءاهُ
      [], // نَزلَةً
      [] // أُخرىٰ
    ],
    [ // آية 14
      [], // عِندَ
      ["سدرة المنتهى : التي تنتهي إليها علومُ الخلائق"], // سِدرَةِ
      ["سدرة المنتهى : التي تنتهي إليها علومُ الخلائق"] // المُنتَهىٰ
    ],
    [ // آية 15
      [], // عِندَها
      ["جنّة المأوى : مُـقام أرواح الشهداء"], // جَنَّةُ
      ["جنّة المأوى : مُـقام أرواح الشهداء"] // المَأوىٰ
    ],
    [ // آية 16
      [], // إِذ
      ["يغشى السّدرة : يُغَـطّيها و يسْـتـرها"], // يَغشَى
      ["يغشى السّدرة : يُغَـطّيها و يسْـتـرها"], // السِّدرَةَ
      [], // ما
      [] // يَغشىٰ
    ],
    [ // آية 17
      ["ما زاغ البصر : ما مال بَصَره عمّا أمِرَ برُؤيته"], // ما
      ["ما زاغ البصر : ما مال بَصَره عمّا أمِرَ برُؤيته"], // زاغَ
      ["ما زاغ البصر : ما مال بَصَره عمّا أمِرَ برُؤيته"], // البَصَرُ
      [], // وَما
      [] // طَغىٰ
    ],
    [ // آية 18
      [], // لَقَد
      [], // رَأىٰ
      [], // مِن
      [], // ءايـٰتِ
      [], // رَبِّهِ
      [] // الكُبرىٰ
    ],
    [ // آية 19
      [], // أَفَرَءَيتُمُ
      [], // اللّـٰتَ
      [] // وَالعُزّىٰ
    ],
    [ // آية 20
      [], // وَمَنوٰةَ
      [], // الثّالِثَةَ
      [] // الأُخرىٰ
    ],
    [ // آية 21
      [], // أَلَكُمُ
      [], // الذَّكَرُ
      [], // وَلَهُ
      [] // الأُنثىٰ
    ],
    [ // آية 22
      [], // تِلكَ
      [], // إِذًا
      ["قسمة ضيزى : جائِـرَة . أو عَوْجَاء"], // قِسمَةٌ
      ["قسمة ضيزى : جائِـرَة . أو عَوْجَاء"] // ضيزىٰ
    ],
    [ // آية 23
      [], // إِن
      [], // هِىَ
      [], // إِلّا
      [], // أَسماءٌ
      [], // سَمَّيتُموها
      [], // أَنتُم
      [], // وَءاباؤُكُم
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // بِها
      [], // مِن
      [], // سُلطـٰنٍ
      [], // إِن
      [], // يَتَّبِعونَ
      [], // إِلَّا
      [], // الظَّنَّ
      [], // وَما
      [], // تَهوَى
      [], // الأَنفُسُ
      [], // وَلَقَد
      [], // جاءَهُم
      [], // مِن
      [], // رَبِّهِمُ
      [] // الهُدىٰ
    ],
    [ // آية 24
      [], // أَم
      [], // لِلإِنسـٰنِ
      [], // ما
      [] // تَمَنّىٰ
    ],
    [ // آية 25
      [], // فَلِلَّهِ
      [], // الـٔاخِرَةُ
      [] // وَالأولىٰ
    ],
    [ // آية 26
      [], // وَكَم
      [], // مِن
      [], // مَلَكٍ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // لا
      [], // تُغنى
      [], // شَفـٰعَتُهُم
      [], // شَيـًٔا
      [], // إِلّا
      [], // مِن
      [], // بَعدِ
      [], // أَن
      [], // يَأذَنَ
      [], // اللَّهُ
      [], // لِمَن
      [], // يَشاءُ
      [] // وَيَرضىٰ
    ],
    [ // آية 27
      [], // إِنَّ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // لَيُسَمّونَ
      [], // المَلـٰئِكَةَ
      [], // تَسمِيَةَ
      [] // الأُنثىٰ
    ],
    [ // آية 28
      [], // وَما
      [], // لَهُم
      [], // بِهِ
      [], // مِن
      [], // عِلمٍ
      [], // إِن
      [], // يَتَّبِعونَ
      [], // إِلَّا
      [], // الظَّنَّ
      [], // وَإِنَّ
      [], // الظَّنَّ
      [], // لا
      [], // يُغنى
      [], // مِنَ
      [], // الحَقِّ
      [] // شَيـًٔا
    ],
    [ // آية 29
      [], // فَأَعرِض
      [], // عَن
      [], // مَن
      [], // تَوَلّىٰ
      [], // عَن
      [], // ذِكرِنا
      [], // وَلَم
      [], // يُرِد
      [], // إِلَّا
      [], // الحَيوٰةَ
      [] // الدُّنيا
    ],
    [ // آية 30
      [], // ذٰلِكَ
      [], // مَبلَغُهُم
      [], // مِنَ
      [], // العِلمِ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِمَن
      [], // ضَلَّ
      [], // عَن
      [], // سَبيلِهِ
      [], // وَهُوَ
      [], // أَعلَمُ
      [], // بِمَنِ
      [] // اهتَدىٰ
    ],
    [ // آية 31
      [], // وَلِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // لِيَجزِىَ
      [], // الَّذينَ
      [], // أَسـٰـٔوا
      [], // بِما
      [], // عَمِلوا
      [], // وَيَجزِىَ
      [], // الَّذينَ
      [], // أَحسَنوا
      [] // بِالحُسنَى
    ],
    [ // آية 32
      [], // الَّذينَ
      [], // يَجتَنِبونَ
      [], // كَبـٰئِرَ
      [], // الإِثمِ
      [], // وَالفَوٰحِشَ
      [], // إِلَّا
      [], // اللَّمَمَ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // وٰسِعُ
      [], // المَغفِرَةِ
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِكُم
      [], // إِذ
      [], // أَنشَأَكُم
      [], // مِنَ
      [], // الأَرضِ
      [], // وَإِذ
      [], // أَنتُم
      [], // أَجِنَّةٌ
      [], // فى
      [], // بُطونِ
      [], // أُمَّهـٰتِكُم
      ["فلا تزكّوا أنفسكم : فلا تمدحوها بحُسْنِ الأعمال"], // فَلا
      ["فلا تزكّوا أنفسكم : فلا تمدحوها بحُسْنِ الأعمال"], // تُزَكّوا
      ["فلا تزكّوا أنفسكم : فلا تمدحوها بحُسْنِ الأعمال"], // أَنفُسَكُم
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِمَنِ
      [] // اتَّقىٰ
    ],
    [ // آية 33
      [], // أَفَرَءَيتَ
      [], // الَّذى
      [] // تَوَلّىٰ
    ],
    [ // آية 34
      [], // وَأَعطىٰ
      [], // قَليلًا
      [] // وَأَكدىٰ
    ],
    [ // آية 35
      [], // أَعِندَهُ
      [], // عِلمُ
      [], // الغَيبِ
      [], // فَهُوَ
      [] // يَرىٰ
    ],
    [ // آية 36
      [], // أَم
      [], // لَم
      [], // يُنَبَّأ
      [], // بِما
      [], // فى
      [], // صُحُفِ
      [] // موسىٰ
    ],
    [ // آية 37
      [], // وَإِبرٰهيمَ
      [], // الَّذى
      [] // وَفّىٰ
    ],
    [ // آية 38
      [], // أَلّا
      [], // تَزِرُ
      [], // وازِرَةٌ
      [], // وِزرَ
      [] // أُخرىٰ
    ],
    [ // آية 39
      [], // وَأَن
      [], // لَيسَ
      [], // لِلإِنسـٰنِ
      [], // إِلّا
      [], // ما
      [] // سَعىٰ
    ],
    [ // آية 40
      [], // وَأَنَّ
      [], // سَعيَهُ
      [], // سَوفَ
      [] // يُرىٰ
    ],
    [ // آية 41
      [], // ثُمَّ
      [], // يُجزىٰهُ
      [], // الجَزاءَ
      [] // الأَوفىٰ
    ],
    [ // آية 42
      [], // وَأَنَّ
      [], // إِلىٰ
      [], // رَبِّكَ
      ["المنتهى : المصير في الآخرة للجزاء"] // المُنتَهىٰ
    ],
    [ // آية 43
      [], // وَأَنَّهُ
      [], // هُوَ
      [], // أَضحَكَ
      [] // وَأَبكىٰ
    ],
    [ // آية 44
      [], // وَأَنَّهُ
      [], // هُوَ
      [], // أَماتَ
      [] // وَأَحيا
    ],
    [ // آية 45
      [], // وَأَنَّهُ
      [], // خَلَقَ
      [], // الزَّوجَينِ
      [], // الذَّكَرَ
      [] // وَالأُنثىٰ
    ],
    [ // آية 46
      [], // مِن
      [], // نُطفَةٍ
      [], // إِذا
      [] // تُمنىٰ
    ],
    [ // آية 47
      [], // وَأَنَّ
      [], // عَلَيهِ
      ["النّشأة الأخرى : الإحياء بعد الإماتة كما وَعَدَ"], // النَّشأَةَ
      ["النّشأة الأخرى : الإحياء بعد الإماتة كما وَعَدَ"] // الأُخرىٰ
    ],
    [ // آية 48
      [], // وَأَنَّهُ
      [], // هُوَ
      [], // أَغنىٰ
      [] // وَأَقنىٰ
    ],
    [ // آية 49
      [], // وَأَنَّهُ
      [], // هُوَ
      [], // رَبُّ
      [] // الشِّعرىٰ
    ],
    [ // آية 50
      [], // وَأَنَّهُ
      [], // أَهلَكَ
      ["عادًا الأولى : قـَـوْم هودٍ عليه السلام"], // عادًا
      ["عادًا الأولى : قـَـوْم هودٍ عليه السلام"] // الأولىٰ
    ],
    [ // آية 51
      [], // وَثَمودَا۟
      [], // فَما
      [] // أَبقىٰ
    ],
    [ // آية 52
      [], // وَقَومَ
      [], // نوحٍ
      [], // مِن
      [], // قَبلُ
      [], // إِنَّهُم
      [], // كانوا
      [], // هُم
      [], // أَظلَمَ
      [] // وَأَطغىٰ
    ],
    [ // آية 53
      [], // وَالمُؤتَفِكَةَ
      ["أهْوى : أسْـقـَـطها إلى الأرض بعد رفعها"] // أَهوىٰ
    ],
    [ // آية 54
      [], // فَغَشّىٰها
      [], // ما
      [] // غَشّىٰ
    ],
    [ // آية 55
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكَ
      ["تتمارى : تتشكّـك"] // تَتَمارىٰ
    ],
    [ // آية 56
      [], // هـٰذا
      [], // نَذيرٌ
      [], // مِنَ
      [], // النُّذُرِ
      [] // الأولىٰ
    ],
    [ // آية 57
      [], // أَزِفَتِ
      [] // الـٔازِفَةُ
    ],
    [ // آية 58
      [], // لَيسَ
      [], // لَها
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      ["كاشفة : نـَفـْـسٌ تكشف أهوالها و شدائدها"] // كاشِفَةٌ
    ],
    [ // آية 59
      [], // أَفَمِن
      [], // هـٰذَا
      [], // الحَديثِ
      [] // تَعجَبونَ
    ],
    [ // آية 60
      [], // وَتَضحَكونَ
      [], // وَلا
      [] // تَبكونَ
    ],
    [ // آية 61
      [], // وَأَنتُم
      [] // سـٰمِدونَ
    ],
    [ // آية 62
      [], // فَاسجُدوا
      [], // لِلَّهِ
      [] // وَاعبُدوا
    ]
  ]
];

export default meanings;