const meanings = [
[ // آية 1
      [], // اقتَرَبَتِ
      [], // السّاعَةُ
      [], // وَانشَقَّ
      [] // القَمَرُ
    ],
    [ // آية 2
      [], // وَإِن
      [], // يَرَوا
      [], // ءايَةً
      [], // يُعرِضوا
      [], // وَيَقولوا
      [], // سِحرٌ
      [] // مُستَمِرٌّ
    ],
    [ // آية 3
      [], // وَكَذَّبوا
      [], // وَاتَّبَعوا
      [], // أَهواءَهُم
      [], // وَكُلُّ
      [], // أَمرٍ
      [] // مُستَقِرٌّ
    ],
    [ // آية 4
      [], // وَلَقَد
      [], // جاءَهُم
      [], // مِنَ
      [], // الأَنباءِ
      [], // ما
      [], // فيهِ
      ["مُزدجَرٌ : ازدجار و انتِهارٌ و ردْعٌ عمّا هم فيه من الكفر و الضلال"] // مُزدَجَرٌ
    ],
    [ // آية 5
      [], // حِكمَةٌ
      [], // بـٰلِغَةٌ
      [], // فَما
      [], // تُغنِ
      [] // النُّذُرُ
    ],
    [ // آية 6
      [], // فَتَوَلَّ
      [], // عَنهُم
      [], // يَومَ
      [], // يَدعُ
      [], // الدّاعِ
      [], // إِلىٰ
      [], // شَىءٍ
      [] // نُكُرٍ
    ],
    [ // آية 7
      [], // خُشَّعًا
      [], // أَبصـٰرُهُم
      [], // يَخرُجونَ
      [], // مِنَ
      ["الأجْدَاث : القبور"], // الأَجداثِ
      [], // كَأَنَّهُم
      [], // جَرادٌ
      [] // مُنتَشِرٌ
    ],
    [ // آية 8
      ["مُهْطعين : مسْرعين ، مادِّي أعناقهمْ"], // مُهطِعينَ
      [], // إِلَى
      [], // الدّاعِ
      [], // يَقولُ
      [], // الكـٰفِرونَ
      [], // هـٰذا
      ["يومٌ عَسِر : صعْب شديدٌ لِعِظم أهْواله"], // يَومٌ
      ["يومٌ عَسِر : صعْب شديدٌ لِعِظم أهْواله"] // عَسِرٌ
    ],
    [ // آية 9
      [], // كَذَّبَت
      [], // قَبلَهُم
      [], // قَومُ
      [], // نوحٍ
      [], // فَكَذَّبوا
      [], // عَبدَنا
      [], // وَقالوا
      [], // مَجنونٌ
      [] // وَازدُجِرَ
    ],
    [ // آية 10
      [], // فَدَعا
      [], // رَبَّهُ
      [], // أَنّى
      [], // مَغلوبٌ
      [] // فَانتَصِر
    ],
    [ // آية 11
      [], // فَفَتَحنا
      [], // أَبوٰبَ
      [], // السَّماءِ
      ["بماءٍ منهمِر : مُنـْـصبّ بشدّة و غزارة"], // بِماءٍ
      ["بماءٍ منهمِر : مُنـْـصبّ بشدّة و غزارة"] // مُنهَمِرٍ
    ],
    [ // آية 12
      [], // وَفَجَّرنَا
      [], // الأَرضَ
      [], // عُيونًا
      [], // فَالتَقَى
      [], // الماءُ
      [], // عَلىٰ
      [], // أَمرٍ
      [], // قَد
      [] // قُدِرَ
    ],
    [ // آية 13
      [], // وَحَمَلنـٰهُ
      [], // عَلىٰ
      [], // ذاتِ
      [], // أَلوٰحٍ
      [] // وَدُسُرٍ
    ],
    [ // آية 14
      [], // تَجرى
      [], // بِأَعيُنِنا
      [], // جَزاءً
      [], // لِمَن
      [], // كانَ
      [] // كُفِرَ
    ],
    [ // آية 15
      [], // وَلَقَد
      [], // تَرَكنـٰها
      [], // ءايَةً
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 16
      [], // فَكَيفَ
      [], // كانَ
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 17
      [], // وَلَقَد
      [], // يَسَّرنَا
      [], // القُرءانَ
      [], // لِلذِّكرِ
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 18
      [], // كَذَّبَت
      [], // عادٌ
      [], // فَكَيفَ
      [], // كانَ
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 19
      [], // إِنّا
      [], // أَرسَلنا
      [], // عَلَيهِم
      ["ريحًا صَرْصَرا : شديدة السّموم أو البرْدأو الصّوت"], // ريحًا
      ["ريحًا صَرْصَرا : شديدة السّموم أو البرْدأو الصّوت"], // صَرصَرًا
      [], // فى
      ["يَوْم نحْس : شؤْم عليهم"], // يَومِ
      ["يَوْم نحْس : شؤْم عليهم"], // نَحسٍ
      ["مستمرّ : دائم نحسُهُ. أو مُحكمٍ .  أو بَشِع"] // مُستَمِرٍّ
    ],
    [ // آية 20
      ["تنزع النّاس : تقـلعهم منْ أماكنهم و ترمي بهم"], // تَنزِعُ
      ["تنزع النّاس : تقـلعهم منْ أماكنهم و ترمي بهم"], // النّاسَ
      [], // كَأَنَّهُم
      ["أعجاز نخل : أصوله بلا رُءوس"], // أَعجازُ
      ["أعجاز نخل : أصوله بلا رُءوس"], // نَخلٍ
      ["منقعِر : منـْـقلع عن قعْره و مَغرسِه"] // مُنقَعِرٍ
    ],
    [ // آية 21
      [], // فَكَيفَ
      [], // كانَ
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 22
      [], // وَلَقَد
      [], // يَسَّرنَا
      [], // القُرءانَ
      [], // لِلذِّكرِ
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 23
      [], // كَذَّبَت
      [], // ثَمودُ
      [] // بِالنُّذُرِ
    ],
    [ // آية 24
      [], // فَقالوا
      [], // أَبَشَرًا
      [], // مِنّا
      [], // وٰحِدًا
      [], // نَتَّبِعُهُ
      [], // إِنّا
      [], // إِذًا
      [], // لَفى
      [], // ضَلـٰلٍ
      [] // وَسُعُرٍ
    ],
    [ // آية 25
      [], // أَءُلقِىَ
      [], // الذِّكرُ
      [], // عَلَيهِ
      [], // مِن
      [], // بَينِنا
      [], // بَل
      [], // هُوَ
      ["كذاب أشر : بَطِرٌ مُـتكبّرْ"], // كَذّابٌ
      ["كذاب أشر : بَطِرٌ مُـتكبّرْ"] // أَشِرٌ
    ],
    [ // آية 26
      [], // سَيَعلَمونَ
      [], // غَدًا
      [], // مَنِ
      [], // الكَذّابُ
      [] // الأَشِرُ
    ],
    [ // آية 27
      [], // إِنّا
      [], // مُرسِلُوا
      [], // النّاقَةِ
      [], // فِتنَةً
      [], // لَهُم
      [], // فَارتَقِبهُم
      [] // وَاصطَبِر
    ],
    [ // آية 28
      [], // وَنَبِّئهُم
      [], // أَنَّ
      [], // الماءَ
      [], // قِسمَةٌ
      [], // بَينَهُم
      [], // كُلُّ
      [], // شِربٍ
      [] // مُحتَضَرٌ
    ],
    [ // آية 29
      [], // فَنادَوا
      [], // صاحِبَهُم
      [], // فَتَعاطىٰ
      [] // فَعَقَرَ
    ],
    [ // آية 30
      [], // فَكَيفَ
      [], // كانَ
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 31
      [], // إِنّا
      [], // أَرسَلنا
      [], // عَلَيهِم
      [], // صَيحَةً
      [], // وٰحِدَةً
      [], // فَكانوا
      ["كهشيم : كاليابس المُـتـفـتـّـت من شجر الحظيرة"], // كَهَشيمِ
      ["المُحتظِر : صانع الحظيرة (الزّريبة) لمواشيه من هذا الشجر"] // المُحتَظِرِ
    ],
    [ // آية 32
      [], // وَلَقَد
      [], // يَسَّرنَا
      [], // القُرءانَ
      [], // لِلذِّكرِ
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 33
      [], // كَذَّبَت
      [], // قَومُ
      [], // لوطٍ
      [] // بِالنُّذُرِ
    ],
    [ // آية 34
      [], // إِنّا
      [], // أَرسَلنا
      [], // عَلَيهِم
      ["حاصبًا : ريحًا ترميهم بالحصباء"], // حاصِبًا
      [], // إِلّا
      [], // ءالَ
      [], // لوطٍ
      [], // نَجَّينـٰهُم
      [] // بِسَحَرٍ
    ],
    [ // آية 35
      [], // نِعمَةً
      [], // مِن
      [], // عِندِنا
      [], // كَذٰلِكَ
      [], // نَجزى
      [], // مَن
      [] // شَكَرَ
    ],
    [ // آية 36
      [], // وَلَقَد
      [], // أَنذَرَهُم
      [], // بَطشَتَنا
      [], // فَتَمارَوا
      [] // بِالنُّذُرِ
    ],
    [ // آية 37
      [], // وَلَقَد
      [], // رٰوَدوهُ
      [], // عَن
      [], // ضَيفِهِ
      ["فطمسْنا أعينهم : أعميْناهم أو أزلنا أثرَها بمَسْحِها"], // فَطَمَسنا
      ["فطمسْنا أعينهم : أعميْناهم أو أزلنا أثرَها بمَسْحِها"], // أَعيُنَهُم
      [], // فَذوقوا
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 38
      [], // وَلَقَد
      [], // صَبَّحَهُم
      ["بكرةً : أوّل النهار"], // بُكرَةً
      [], // عَذابٌ
      [] // مُستَقِرٌّ
    ],
    [ // آية 39
      [], // فَذوقوا
      [], // عَذابى
      [] // وَنُذُرِ
    ],
    [ // آية 40
      [], // وَلَقَد
      [], // يَسَّرنَا
      [], // القُرءانَ
      [], // لِلذِّكرِ
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 41
      [], // وَلَقَد
      [], // جاءَ
      [], // ءالَ
      [], // فِرعَونَ
      [] // النُّذُرُ
    ],
    [ // آية 42
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // كُلِّها
      [], // فَأَخَذنـٰهُم
      [], // أَخذَ
      [], // عَزيزٍ
      [] // مُقتَدِرٍ
    ],
    [ // آية 43
      [], // أَكُفّارُكُم
      [], // خَيرٌ
      [], // مِن
      [], // أُولـٰئِكُم
      [], // أَم
      [], // لَكُم
      [], // بَراءَةٌ
      [], // فِى
      [] // الزُّبُرِ
    ],
    [ // آية 44
      [], // أَم
      [], // يَقولونَ
      ["نحن جميعٌ : جماعة ، مجتمعٌ أمْرنا"], // نَحنُ
      ["نحن جميعٌ : جماعة ، مجتمعٌ أمْرنا"], // جَميعٌ
      ["مُنتصر : مُـمْـتـَـنِعٌ ، لا نُغلب"] // مُنتَصِرٌ
    ],
    [ // آية 45
      [], // سَيُهزَمُ
      [], // الجَمعُ
      [], // وَيُوَلّونَ
      [] // الدُّبُرَ
    ],
    [ // آية 46
      [], // بَلِ
      [], // السّاعَةُ
      [], // مَوعِدُهُم
      [], // وَالسّاعَةُ
      [], // أَدهىٰ
      [] // وَأَمَرُّ
    ],
    [ // آية 47
      [], // إِنَّ
      [], // المُجرِمينَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // وَسُعُرٍ
    ],
    [ // آية 48
      [], // يَومَ
      [], // يُسحَبونَ
      [], // فِى
      [], // النّارِ
      [], // عَلىٰ
      [], // وُجوهِهِم
      [], // ذوقوا
      [], // مَسَّ
      [] // سَقَرَ
    ],
    [ // آية 49
      [], // إِنّا
      [], // كُلَّ
      [], // شَىءٍ
      [], // خَلَقنـٰهُ
      [] // بِقَدَرٍ
    ],
    [ // آية 50
      [], // وَما
      [], // أَمرُنا
      [], // إِلّا
      [], // وٰحِدَةٌ
      [], // كَلَمحٍ
      [] // بِالبَصَرِ
    ],
    [ // آية 51
      [], // وَلَقَد
      [], // أَهلَكنا
      ["أشياعكمْ : أمثالهم في الكفر"], // أَشياعَكُم
      [], // فَهَل
      [], // مِن
      [] // مُدَّكِرٍ
    ],
    [ // آية 52
      [], // وَكُلُّ
      [], // شَىءٍ
      [], // فَعَلوهُ
      [], // فِى
      ["الزبر : كتب الحفظة"] // الزُّبُرِ
    ],
    [ // آية 53
      [], // وَكُلُّ
      [], // صَغيرٍ
      [], // وَكَبيرٍ
      ["مستطَر : مسطور مكتوب في اللوح المحفوظ"] // مُستَطَرٌ
    ],
    [ // آية 54
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // جَنّـٰتٍ
      [] // وَنَهَرٍ
    ],
    [ // آية 55
      [], // فى
      ["مقعد صدْق : مَكانٍ مَرْضى"], // مَقعَدِ
      ["مقعد صدْق : مَكانٍ مَرْضى"], // صِدقٍ
      [], // عِندَ
      [], // مَليكٍ
      [] // مُقتَدِرٍ
    ]
];

export default meanings;