const meanings = [
[ // آية 1
      [] // الرَّحمـٰنُ
    ],
    [ // آية 2
      [], // عَلَّمَ
      [] // القُرءانَ
    ],
    [ // آية 3
      [], // خَلَقَ
      [] // الإِنسـٰنَ
    ],
    [ // آية 4
      [], // عَلَّمَهُ
      [] // البَيانَ
    ],
    [ // آية 5
      [], // الشَّمسُ
      [], // وَالقَمَرُ
      [] // بِحُسبانٍ
    ],
    [ // آية 6
      [], // وَالنَّجمُ
      [], // وَالشَّجَرُ
      ["يسجدان : ينقادان لله فيما خُـلِقا له"] // يَسجُدانِ
    ],
    [ // آية 7
      [], // وَالسَّماءَ
      [], // رَفَعَها
      [], // وَوَضَعَ
      [] // الميزانَ
    ],
    [ // آية 8
      ["ألا تطْغَوْا : لئلاّ تتجاوزوا العدل و الحقّ"], // أَلّا
      ["ألا تطْغَوْا : لئلاّ تتجاوزوا العدل و الحقّ"], // تَطغَوا
      [], // فِى
      [] // الميزانِ
    ],
    [ // آية 9
      [], // وَأَقيمُوا
      [], // الوَزنَ
      ["بالقسْط : بالعدْل"], // بِالقِسطِ
      [], // وَلا
      [], // تُخسِرُوا
      [] // الميزانَ
    ],
    [ // آية 10
      [], // وَالأَرضَ
      [], // وَضَعَها
      [] // لِلأَنامِ
    ],
    [ // آية 11
      [], // فيها
      [], // فـٰكِهَةٌ
      [], // وَالنَّخلُ
      ["ذات الأكمام : أوعية الثمر و هي الطلْع"], // ذاتُ
      ["ذات الأكمام : أوعية الثمر و هي الطلْع"] // الأَكمامِ
    ],
    [ // آية 12
      [], // وَالحَبُّ
      ["ذو العَصْف : القِـشْـر أو التـّـبْن أو الوَرَق اليابس"], // ذُو
      ["ذو العَصْف : القِـشْـر أو التـّـبْن أو الوَرَق اليابس"], // العَصفِ
      [] // وَالرَّيحانُ
    ],
    [ // آية 13
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      ["تكذبان : تكفران أيها الثقلان"] // تُكَذِّبانِ
    ],
    [ // آية 14
      [], // خَلَقَ
      [], // الإِنسـٰنَ
      [], // مِن
      [], // صَلصـٰلٍ
      ["كالفخّار : هو الطين يُحرَق حتى يتحجّر"] // كَالفَخّارِ
    ],
    [ // آية 15
      [], // وَخَلَقَ
      [], // الجانَّ
      [], // مِن
      ["مارج : لهبٍ صافٍ لا دخان فيه"], // مارِجٍ
      [], // مِن
      [] // نارٍ
    ],
    [ // آية 16
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 17
      [], // رَبُّ
      [], // المَشرِقَينِ
      [], // وَرَبُّ
      [] // المَغرِبَينِ
    ],
    [ // آية 18
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 19
      ["مَرَج البحرين : أرْسَل العـذب و المِلح في مجاريهما"], // مَرَجَ
      ["مَرَج البحرين : أرْسَل العـذب و المِلح في مجاريهما"], // البَحرَينِ
      [] // يَلتَقِيانِ
    ],
    [ // آية 20
      ["بيْنهما برْزخ : حاجز أرضي أو من قدرته تعالى"], // بَينَهُما
      ["بيْنهما برْزخ : حاجز أرضي أو من قدرته تعالى"], // بَرزَخٌ
      [], // لا
      [] // يَبغِيانِ
    ],
    [ // آية 21
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 22
      [], // يَخرُجُ
      [], // مِنهُمَا
      [], // اللُّؤلُؤُ
      [] // وَالمَرجانُ
    ],
    [ // آية 23
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 24
      [], // وَلَهُ
      [], // الجَوارِ
      [], // المُنشَـٔاتُ
      [], // فِى
      [], // البَحرِ
      [] // كَالأَعلـٰمِ
    ],
    [ // آية 25
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 26
      [], // كُلُّ
      [], // مَن
      [], // عَلَيها
      ["فان : هالك"] // فانٍ
    ],
    [ // آية 27
      [], // وَيَبقىٰ
      [], // وَجهُ
      [], // رَبِّكَ
      [], // ذُو
      [], // الجَلـٰلِ
      [] // وَالإِكرامِ
    ],
    [ // آية 28
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 29
      [], // يَسـَٔلُهُ
      [], // مَن
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // كُلَّ
      [], // يَومٍ
      [], // هُوَ
      [], // فى
      [] // شَأنٍ
    ],
    [ // آية 30
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 31
      ["سنفرُغ لكم : سنقصِد لمحاسَبتكم بعد الإمهال"], // سَنَفرُغُ
      ["سنفرُغ لكم : سنقصِد لمحاسَبتكم بعد الإمهال"], // لَكُم
      [], // أَيُّهَ
      [] // الثَّقَلانِ
    ],
    [ // آية 32
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 33
      [], // يـٰمَعشَرَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // إِنِ
      [], // استَطَعتُم
      [], // أَن
      ["تنفذوا : تخرجوا هربا من قضائي"], // تَنفُذوا
      [], // مِن
      [], // أَقطارِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      ["فانفذوا : فاخرجوا (أمر تعجيز)"], // فَانفُذوا
      [], // لا
      [], // تَنفُذونَ
      [], // إِلّا
      [] // بِسُلطـٰنٍ
    ],
    [ // آية 34
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 35
      [], // يُرسَلُ
      [], // عَلَيكُما
      ["شواظ : لهب خالص لا دخان فيه"], // شُواظٌ
      [], // مِن
      [], // نارٍ
      [], // وَنُحاسٌ
      [], // فَلا
      [] // تَنتَصِرانِ
    ],
    [ // آية 36
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 37
      [], // فَإِذَا
      [], // انشَقَّتِ
      [], // السَّماءُ
      ["فكانت وردة : كالوردة في الحمرة"], // فَكانَت
      ["فكانت وردة : كالوردة في الحمرة"], // وَردَةً
      ["كالدّهان : كدُهْن الزيت في الذوبان"] // كَالدِّهانِ
    ],
    [ // آية 38
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 39
      [], // فَيَومَئِذٍ
      [], // لا
      [], // يُسـَٔلُ
      [], // عَن
      [], // ذَنبِهِ
      [], // إِنسٌ
      [], // وَلا
      [] // جانٌّ
    ],
    [ // آية 40
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 41
      [], // يُعرَفُ
      [], // المُجرِمونَ
      [], // بِسيمـٰهُم
      [], // فَيُؤخَذُ
      [], // بِالنَّوٰصى
      [] // وَالأَقدامِ
    ],
    [ // آية 42
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 43
      [], // هـٰذِهِ
      [], // جَهَنَّمُ
      [], // الَّتى
      [], // يُكَذِّبُ
      [], // بِهَا
      [] // المُجرِمونَ
    ],
    [ // آية 44
      [], // يَطوفونَ
      [], // بَينَها
      [], // وَبَينَ
      [], // حَميمٍ
      [] // ءانٍ
    ],
    [ // آية 45
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 46
      [], // وَلِمَن
      [], // خافَ
      [], // مَقامَ
      [], // رَبِّهِ
      [] // جَنَّتانِ
    ],
    [ // آية 47
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 48
      ["ذواتا أفنان : أغصان . أو أنواع من الثمار"], // ذَواتا
      ["ذواتا أفنان : أغصان . أو أنواع من الثمار"] // أَفنانٍ
    ],
    [ // آية 49
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 50
      [], // فيهِما
      ["عينان : التسْـنيم و السلسبيل"], // عَينانِ
      [] // تَجرِيانِ
    ],
    [ // آية 51
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 52
      [], // فيهِما
      [], // مِن
      [], // كُلِّ
      [], // فـٰكِهَةٍ
      ["زوجان : صِنفان : معروف و غريب"] // زَوجانِ
    ],
    [ // آية 53
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 54
      [], // مُتَّكِـٔينَ
      [], // عَلىٰ
      [], // فُرُشٍ
      [], // بَطائِنُها
      [], // مِن
      [], // إِستَبرَقٍ
      [], // وَجَنَى
      [], // الجَنَّتَينِ
      [] // دانٍ
    ],
    [ // آية 55
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 56
      [], // فيهِنَّ
      [], // قـٰصِرٰتُ
      [], // الطَّرفِ
      ["لم يطمثهنّ : لمْ يفـتضّهنّ قبل أزواجهنّ"], // لَم
      ["لم يطمثهنّ : لمْ يفـتضّهنّ قبل أزواجهنّ"], // يَطمِثهُنَّ
      [], // إِنسٌ
      [], // قَبلَهُم
      [], // وَلا
      [] // جانٌّ
    ],
    [ // آية 57
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 58
      [], // كَأَنَّهُنَّ
      [], // الياقوتُ
      [] // وَالمَرجانُ
    ],
    [ // آية 59
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 60
      [], // هَل
      [], // جَزاءُ
      [], // الإِحسـٰنِ
      [], // إِلَّا
      [] // الإِحسـٰنُ
    ],
    [ // آية 61
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 62
      [], // وَمِن
      [], // دونِهِما
      [] // جَنَّتانِ
    ],
    [ // آية 63
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 64
      [] // مُدهامَّتانِ
    ],
    [ // آية 65
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 66
      [], // فيهِما
      [], // عَينانِ
      ["نضّاختان : فوّارتان بالماء لا تنقطعان"] // نَضّاخَتانِ
    ],
    [ // آية 67
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 68
      [], // فيهِما
      [], // فـٰكِهَةٌ
      [], // وَنَخلٌ
      [] // وَرُمّانٌ
    ],
    [ // آية 69
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 70
      [], // فيهِنَّ
      [], // خَيرٰتٌ
      [] // حِسانٌ
    ],
    [ // آية 71
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 72
      ["حور : نساءٌ بيض حِسان"], // حورٌ
      [], // مَقصورٰتٌ
      [], // فِى
      [] // الخِيامِ
    ],
    [ // آية 73
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 74
      [], // لَم
      [], // يَطمِثهُنَّ
      [], // إِنسٌ
      [], // قَبلَهُم
      [], // وَلا
      [] // جانٌّ
    ],
    [ // آية 75
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 76
      [], // مُتَّكِـٔينَ
      [], // عَلىٰ
      ["رفرف : وسائد أو فُرُش مُرتفعة"], // رَفرَفٍ
      [], // خُضرٍ
      [], // وَعَبقَرِىٍّ
      [] // حِسانٍ
    ],
    [ // آية 77
      [], // فَبِأَىِّ
      [], // ءالاءِ
      [], // رَبِّكُما
      [] // تُكَذِّبانِ
    ],
    [ // آية 78
      [], // تَبـٰرَكَ
      [], // اسمُ
      [], // رَبِّكَ
      [], // ذِى
      [], // الجَلـٰلِ
      [] // وَالإِكرامِ
    ]
];

export default meanings;