const meanings = [
[ // آية 1
      [], // إِذا
      ["وقعت الواقعة : قامت القيامة بنفخة البعْث"], // وَقَعَتِ
      ["وقعت الواقعة : قامت القيامة بنفخة البعْث"] // الواقِعَةُ
    ],
    [ // آية 2
      [], // لَيسَ
      [], // لِوَقعَتِها
      ["كاذبة : نفْسٌ كاذبة تـُـنـْـكر وقوعها"] // كاذِبَةٌ
    ],
    [ // آية 3
      ["خافضة رافعة : هي خافضة للأشقياء رافعة للسّعداء"], // خافِضَةٌ
      ["خافضة رافعة : هي خافضة للأشقياء رافعة للسّعداء"] // رافِعَةٌ
    ],
    [ // آية 4
      [], // إِذا
      ["رُجّت الأرض : زلزلتْ وحُرّكت تحريكا بشدة"], // رُجَّتِ
      ["رُجّت الأرض : زلزلتْ وحُرّكت تحريكا بشدة"], // الأَرضُ
      [] // رَجًّا
    ],
    [ // آية 5
      [], // وَبُسَّتِ
      [], // الجِبالُ
      [] // بَسًّا
    ],
    [ // آية 6
      [], // فَكانَت
      [], // هَباءً
      [] // مُنبَثًّا
    ],
    [ // آية 7
      [], // وَكُنتُم
      [], // أَزوٰجًا
      [] // ثَلـٰثَةً
    ],
    [ // آية 8
      [], // فَأَصحـٰبُ
      [], // المَيمَنَةِ
      [], // ما
      [], // أَصحـٰبُ
      [] // المَيمَنَةِ
    ],
    [ // آية 9
      [], // وَأَصحـٰبُ
      [], // المَشـَٔمَةِ
      [], // ما
      [], // أَصحـٰبُ
      [] // المَشـَٔمَةِ
    ],
    [ // آية 10
      [], // وَالسّـٰبِقونَ
      [] // السّـٰبِقونَ
    ],
    [ // آية 11
      [], // أُولـٰئِكَ
      [] // المُقَرَّبونَ
    ],
    [ // آية 12
      [], // فى
      [], // جَنّـٰتِ
      [] // النَّعيمِ
    ],
    [ // آية 13
      [], // ثُلَّةٌ
      [], // مِنَ
      [] // الأَوَّلينَ
    ],
    [ // آية 14
      [], // وَقَليلٌ
      [], // مِنَ
      [] // الـٔاخِرينَ
    ],
    [ // آية 15
      [], // عَلىٰ
      ["سُرُر موضونة : منسوجة من الذهب بإحكام"], // سُرُرٍ
      ["سُرُر موضونة : منسوجة من الذهب بإحكام"] // مَوضونَةٍ
    ],
    [ // آية 16
      [], // مُتَّكِـٔينَ
      [], // عَلَيها
      [] // مُتَقـٰبِلينَ
    ],
    [ // آية 17
      [], // يَطوفُ
      [], // عَلَيهِم
      [], // وِلدٰنٌ
      [] // مُخَلَّدونَ
    ],
    [ // آية 18
      ["بأكواب : أقداح لا عُرى لها و لا خراطيم"], // بِأَكوابٍ
      [], // وَأَباريقَ
      [], // وَكَأسٍ
      ["من معين : خمْر جارية من العيون"], // مِن
      ["من معين : خمْر جارية من العيون"] // مَعينٍ
    ],
    [ // آية 19
      [], // لا
      [], // يُصَدَّعونَ
      [], // عَنها
      [], // وَلا
      [] // يُنزِفونَ
    ],
    [ // آية 20
      [], // وَفـٰكِهَةٍ
      [], // مِمّا
      [] // يَتَخَيَّرونَ
    ],
    [ // آية 21
      [], // وَلَحمِ
      [], // طَيرٍ
      [], // مِمّا
      [] // يَشتَهونَ
    ],
    [ // آية 22
      [], // وَحورٌ
      [] // عينٌ
    ],
    [ // آية 23
      [], // كَأَمثـٰلِ
      ["اللؤلؤ المكنون : المصون في أصدافه مما يغيّره"], // اللُّؤلُؤِ
      ["اللؤلؤ المكنون : المصون في أصدافه مما يغيّره"] // المَكنونِ
    ],
    [ // آية 24
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 25
      [], // لا
      [], // يَسمَعونَ
      [], // فيها
      ["لغْوًا : كلاما لا خير فيه أو باطلا"], // لَغوًا
      [], // وَلا
      [] // تَأثيمًا
    ],
    [ // آية 26
      [], // إِلّا
      [], // قيلًا
      [], // سَلـٰمًا
      [] // سَلـٰمًا
    ],
    [ // آية 27
      [], // وَأَصحـٰبُ
      [], // اليَمينِ
      [], // ما
      [], // أَصحـٰبُ
      [] // اليَمينِ
    ],
    [ // آية 28
      [], // فى
      [], // سِدرٍ
      ["مخضود : مقطوع شوكه"] // مَخضودٍ
    ],
    [ // آية 29
      [], // وَطَلحٍ
      ["منضود : نضّد بالحمْل من أسفله إلى أعلاه"] // مَنضودٍ
    ],
    [ // آية 30
      [], // وَظِلٍّ
      [] // مَمدودٍ
    ],
    [ // آية 31
      [], // وَماءٍ
      [] // مَسكوبٍ
    ],
    [ // آية 32
      [], // وَفـٰكِهَةٍ
      [] // كَثيرَةٍ
    ],
    [ // آية 33
      [], // لا
      [], // مَقطوعَةٍ
      [], // وَلا
      [] // مَمنوعَةٍ
    ],
    [ // آية 34
      [], // وَفُرُشٍ
      ["مرفوعة : على الأسرّة أو منضدّة مرتفعة"] // مَرفوعَةٍ
    ],
    [ // آية 35
      [], // إِنّا
      [], // أَنشَأنـٰهُنَّ
      [] // إِنشاءً
    ],
    [ // آية 36
      [], // فَجَعَلنـٰهُنَّ
      [] // أَبكارًا
    ],
    [ // آية 37
      ["عُرُبا : متحبّبات إلى أزواجهنّ"], // عُرُبًا
      ["أترابا : مسْتويات في السّنّ"] // أَترابًا
    ],
    [ // آية 38
      [], // لِأَصحـٰبِ
      [] // اليَمينِ
    ],
    [ // آية 39
      [], // ثُلَّةٌ
      [], // مِنَ
      [] // الأَوَّلينَ
    ],
    [ // آية 40
      [], // وَثُلَّةٌ
      [], // مِنَ
      [] // الـٔاخِرينَ
    ],
    [ // آية 41
      [], // وَأَصحـٰبُ
      [], // الشِّمالِ
      [], // ما
      [], // أَصحـٰبُ
      [] // الشِّمالِ
    ],
    [ // آية 42
      [], // فى
      ["سموم : ريح شديدة الحرارة تدخل المَسام"], // سَمومٍ
      [] // وَحَميمٍ
    ],
    [ // آية 43
      [], // وَظِلٍّ
      [], // مِن
      ["يَحْموم : دخان شديد السّواد أو نار"] // يَحمومٍ
    ],
    [ // آية 44
      [], // لا
      [], // بارِدٍ
      [], // وَلا
      [] // كَريمٍ
    ],
    [ // آية 45
      [], // إِنَّهُم
      [], // كانوا
      [], // قَبلَ
      [], // ذٰلِكَ
      ["مُترَفين : منعّمين متّبعين أهواء أنفسهم"] // مُترَفينَ
    ],
    [ // آية 46
      [], // وَكانوا
      [], // يُصِرّونَ
      [], // عَلَى
      ["الحِنث : الذنب العظيم – الشرك"], // الحِنثِ
      [] // العَظيمِ
    ],
    [ // آية 47
      [], // وَكانوا
      [], // يَقولونَ
      [], // أَئِذا
      [], // مِتنا
      [], // وَكُنّا
      [], // تُرابًا
      [], // وَعِظـٰمًا
      [], // أَءِنّا
      [] // لَمَبعوثونَ
    ],
    [ // آية 48
      [], // أَوَءاباؤُنَا
      [] // الأَوَّلونَ
    ],
    [ // آية 49
      [], // قُل
      [], // إِنَّ
      [], // الأَوَّلينَ
      [] // وَالـٔاخِرينَ
    ],
    [ // آية 50
      [], // لَمَجموعونَ
      [], // إِلىٰ
      [], // ميقـٰتِ
      [], // يَومٍ
      [] // مَعلومٍ
    ],
    [ // آية 51
      [], // ثُمَّ
      [], // إِنَّكُم
      [], // أَيُّهَا
      [], // الضّالّونَ
      [] // المُكَذِّبونَ
    ],
    [ // آية 52
      [], // لَـٔاكِلونَ
      [], // مِن
      [], // شَجَرٍ
      [], // مِن
      ["زقوم : شجر كريه جدّا في النار"] // زَقّومٍ
    ],
    [ // آية 53
      [], // فَمالِـٔونَ
      [], // مِنهَا
      [] // البُطونَ
    ],
    [ // آية 54
      [], // فَشـٰرِبونَ
      [], // عَلَيهِ
      [], // مِنَ
      [] // الحَميمِ
    ],
    [ // آية 55
      [], // فَشـٰرِبونَ
      ["شرب الهيم : الإبل العِطاش التي لا تروى"], // شُربَ
      ["شرب الهيم : الإبل العِطاش التي لا تروى"] // الهيمِ
    ],
    [ // آية 56
      [], // هـٰذا
      [], // نُزُلُهُم
      ["يوم الدين : يوم الجزاء ( يوم القيامة)"], // يَومَ
      ["يوم الدين : يوم الجزاء ( يوم القيامة)"] // الدّينِ
    ],
    [ // آية 57
      [], // نَحنُ
      [], // خَلَقنـٰكُم
      [], // فَلَولا
      [] // تُصَدِّقونَ
    ],
    [ // آية 58
      [], // أَفَرَءَيتُم
      [], // ما
      [] // تُمنونَ
    ],
    [ // آية 59
      [], // ءَأَنتُم
      ["تخلقونه : تصوّرونه بشرًا سويّا"], // تَخلُقونَهُ
      [], // أَم
      [], // نَحنُ
      [] // الخـٰلِقونَ
    ],
    [ // آية 60
      [], // نَحنُ
      [], // قَدَّرنا
      [], // بَينَكُمُ
      [], // المَوتَ
      [], // وَما
      [], // نَحنُ
      ["بمسبوقين : بمغلوبين عاجزين"] // بِمَسبوقينَ
    ],
    [ // آية 61
      [], // عَلىٰ
      [], // أَن
      [], // نُبَدِّلَ
      [], // أَمثـٰلَكُم
      [], // وَنُنشِئَكُم
      [], // فى
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 62
      [], // وَلَقَد
      [], // عَلِمتُمُ
      [], // النَّشأَةَ
      [], // الأولىٰ
      [], // فَلَولا
      [] // تَذَكَّرونَ
    ],
    [ // آية 63
      [], // أَفَرَءَيتُم
      ["ما تحرثون : البَذر الذي تلقونه في الأرض"], // ما
      ["ما تحرثون : البَذر الذي تلقونه في الأرض"] // تَحرُثونَ
    ],
    [ // آية 64
      [], // ءَأَنتُم
      ["تزرعونه : تنبتونه حتى يشتدّ و يبلغ الغاية"], // تَزرَعونَهُ
      [], // أَم
      [], // نَحنُ
      [] // الزّٰرِعونَ
    ],
    [ // آية 65
      [], // لَو
      [], // نَشاءُ
      [], // لَجَعَلنـٰهُ
      [], // حُطـٰمًا
      [], // فَظَلتُم
      ["تفكّهون : تتعجّبون من سوء حاله و مصيره"] // تَفَكَّهونَ
    ],
    [ // آية 66
      [], // إِنّا
      [] // لَمُغرَمونَ
    ],
    [ // آية 67
      [], // بَل
      [], // نَحنُ
      ["محرومون : ممنوعون الرّزق بالكلّـيّـة"] // مَحرومونَ
    ],
    [ // آية 68
      [], // أَفَرَءَيتُمُ
      [], // الماءَ
      [], // الَّذى
      [] // تَشرَبونَ
    ],
    [ // آية 69
      [], // ءَأَنتُم
      [], // أَنزَلتُموهُ
      [], // مِنَ
      [], // المُزنِ
      [], // أَم
      [], // نَحنُ
      [] // المُنزِلونَ
    ],
    [ // آية 70
      [], // لَو
      [], // نَشاءُ
      [], // جَعَلنـٰهُ
      [], // أُجاجًا
      [], // فَلَولا
      [] // تَشكُرونَ
    ],
    [ // آية 71
      [], // أَفَرَءَيتُمُ
      [], // النّارَ
      [], // الَّتى
      [] // تورونَ
    ],
    [ // آية 72
      [], // ءَأَنتُم
      [], // أَنشَأتُم
      [], // شَجَرَتَها
      [], // أَم
      [], // نَحنُ
      [] // المُنشِـٔونَ
    ],
    [ // آية 73
      [], // نَحنُ
      [], // جَعَلنـٰها
      ["تذكرة : تذكيرا لنار جهنّم"], // تَذكِرَةً
      [], // وَمَتـٰعًا
      [] // لِلمُقوينَ
    ],
    [ // آية 74
      [], // فَسَبِّح
      [], // بِاسمِ
      [], // رَبِّكَ
      [] // العَظيمِ
    ],
    [ // آية 75
      [], // فَلا
      [], // أُقسِمُ
      [], // بِمَوٰقِعِ
      [] // النُّجومِ
    ],
    [ // آية 76
      [], // وَإِنَّهُ
      [], // لَقَسَمٌ
      [], // لَو
      [], // تَعلَمونَ
      [] // عَظيمٌ
    ],
    [ // آية 77
      [], // إِنَّهُ
      [], // لَقُرءانٌ
      [] // كَريمٌ
    ],
    [ // آية 78
      [], // فى
      [], // كِتـٰبٍ
      [] // مَكنونٍ
    ],
    [ // آية 79
      ["لا يَمسّه إلا المطهّرون : صفة أخرى للقرآن"], // لا
      ["لا يَمسّه إلا المطهّرون : صفة أخرى للقرآن"], // يَمَسُّهُ
      ["لا يَمسّه إلا المطهّرون : صفة أخرى للقرآن"], // إِلَّا
      ["لا يَمسّه إلا المطهّرون : صفة أخرى للقرآن"] // المُطَهَّرونَ
    ],
    [ // آية 80
      [], // تَنزيلٌ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 81
      [], // أَفَبِهـٰذَا
      [], // الحَديثِ
      ["أنتم مُدهنون : مُتهاونون أو مكذبون"], // أَنتُم
      ["أنتم مُدهنون : مُتهاونون أو مكذبون"] // مُدهِنونَ
    ],
    [ // آية 82
      [], // وَتَجعَلونَ
      [], // رِزقَكُم
      [], // أَنَّكُم
      [] // تُكَذِّبونَ
    ],
    [ // آية 83
      [], // فَلَولا
      [], // إِذا
      ["بلغت الحلقوم : بلغت الرّوح الحلقوم عند المَوْت"], // بَلَغَتِ
      ["بلغت الحلقوم : بلغت الرّوح الحلقوم عند المَوْت"] // الحُلقومَ
    ],
    [ // آية 84
      [], // وَأَنتُم
      [], // حينَئِذٍ
      [] // تَنظُرونَ
    ],
    [ // آية 85
      [], // وَنَحنُ
      [], // أَقرَبُ
      [], // إِلَيهِ
      [], // مِنكُم
      [], // وَلـٰكِن
      [], // لا
      [] // تُبصِرونَ
    ],
    [ // آية 86
      [], // فَلَولا
      [], // إِن
      [], // كُنتُم
      ["غير مَدينين : غير مربوبين مقهورين"], // غَيرَ
      ["غير مَدينين : غير مربوبين مقهورين"] // مَدينينَ
    ],
    [ // آية 87
      [], // تَرجِعونَها
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 88
      [], // فَأَمّا
      [], // إِن
      [], // كانَ
      [], // مِنَ
      [] // المُقَرَّبينَ
    ],
    [ // آية 89
      ["فرَوْح : فله استراحة أو رحمة"], // فَرَوحٌ
      [], // وَرَيحانٌ
      [], // وَجَنَّتُ
      [] // نَعيمٍ
    ],
    [ // آية 90
      [], // وَأَمّا
      [], // إِن
      [], // كانَ
      [], // مِن
      [], // أَصحـٰبِ
      [] // اليَمينِ
    ],
    [ // آية 91
      [], // فَسَلـٰمٌ
      [], // لَكَ
      [], // مِن
      [], // أَصحـٰبِ
      [] // اليَمينِ
    ],
    [ // آية 92
      [], // وَأَمّا
      [], // إِن
      [], // كانَ
      [], // مِنَ
      [], // المُكَذِّبينَ
      [] // الضّالّينَ
    ],
    [ // آية 93
      [], // فَنُزُلٌ
      [], // مِن
      ["حميم : ماءٍ تناهت حرارته"] // حَميمٍ
    ],
    [ // آية 94
      [], // وَتَصلِيَةُ
      [] // جَحيمٍ
    ],
    [ // آية 95
      [], // إِنَّ
      [], // هـٰذا
      [], // لَهُوَ
      [], // حَقُّ
      [] // اليَقينِ
    ],
    [ // آية 96
      [], // فَسَبِّح
      [], // بِاسمِ
      [], // رَبِّكَ
      [] // العَظيمِ
    ]
];

export default meanings;