const meanings = [
  [ // سورة 57: الحديد
[ // آية 1
      [], // سَبَّحَ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 2
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 3
      [], // هُوَ
      ["الأوّل : السابق على جميع الموجودات"], // الأَوَّلُ
      [], // وَالـٔاخِرُ
      [], // وَالظّـٰهِرُ
      [], // وَالباطِنُ
      [], // وَهُوَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 4
      [], // هُوَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // ثُمَّ
      ["استوى على العرش : استواءٍ يليق بكماله تعالى"], // استَوىٰ
      ["استوى على العرش : استواءٍ يليق بكماله تعالى"], // عَلَى
      ["استوى على العرش : استواءٍ يليق بكماله تعالى"], // العَرشِ
      [], // يَعلَمُ
      [], // ما
      [], // يَلِجُ
      [], // فِى
      [], // الأَرضِ
      [], // وَما
      [], // يَخرُجُ
      [], // مِنها
      [], // وَما
      [], // يَنزِلُ
      [], // مِنَ
      [], // السَّماءِ
      [], // وَما
      [], // يَعرُجُ
      [], // فيها
      [], // وَهُوَ
      [], // مَعَكُم
      [], // أَينَ
      [], // ما
      [], // كُنتُم
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 5
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَإِلَى
      [], // اللَّهِ
      [], // تُرجَعُ
      [] // الأُمورُ
    ],
    [ // آية 6
      [], // يولِجُ
      [], // الَّيلَ
      [], // فِى
      [], // النَّهارِ
      [], // وَيولِجُ
      [], // النَّهارَ
      [], // فِى
      [], // الَّيلِ
      [], // وَهُوَ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 7
      [], // ءامِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَأَنفِقوا
      [], // مِمّا
      [], // جَعَلَكُم
      [], // مُستَخلَفينَ
      [], // فيهِ
      [], // فَالَّذينَ
      [], // ءامَنوا
      [], // مِنكُم
      [], // وَأَنفَقوا
      [], // لَهُم
      [], // أَجرٌ
      [] // كَبيرٌ
    ],
    [ // آية 8
      [], // وَما
      [], // لَكُم
      [], // لا
      [], // تُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَالرَّسولُ
      [], // يَدعوكُم
      [], // لِتُؤمِنوا
      [], // بِرَبِّكُم
      [], // وَقَد
      [], // أَخَذَ
      [], // ميثـٰقَكُم
      [], // إِن
      [], // كُنتُم
      [] // مُؤمِنينَ
    ],
    [ // آية 9
      [], // هُوَ
      [], // الَّذى
      [], // يُنَزِّلُ
      [], // عَلىٰ
      [], // عَبدِهِ
      [], // ءايـٰتٍ
      [], // بَيِّنـٰتٍ
      [], // لِيُخرِجَكُم
      [], // مِنَ
      [], // الظُّلُمـٰتِ
      [], // إِلَى
      [], // النّورِ
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // بِكُم
      [], // لَرَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 10
      [], // وَما
      [], // لَكُم
      [], // أَلّا
      [], // تُنفِقوا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَلِلَّهِ
      [], // ميرٰثُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لا
      [], // يَستَوى
      [], // مِنكُم
      [], // مَن
      [], // أَنفَقَ
      [], // مِن
      ["قبْل الفتح : فتح مكة أو صلح الحديبية"], // قَبلِ
      ["قبْل الفتح : فتح مكة أو صلح الحديبية"], // الفَتحِ
      [], // وَقـٰتَلَ
      [], // أُولـٰئِكَ
      [], // أَعظَمُ
      [], // دَرَجَةً
      [], // مِنَ
      [], // الَّذينَ
      [], // أَنفَقوا
      [], // مِن
      [], // بَعدُ
      [], // وَقـٰتَلوا
      [], // وَكُلًّا
      [], // وَعَدَ
      [], // اللَّهُ
      [], // الحُسنىٰ
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 11
      [], // مَن
      [], // ذَا
      [], // الَّذى
      [], // يُقرِضُ
      [], // اللَّهَ
      ["قرْضا حسنا : محتسبا به ، طيبة به نفسه"], // قَرضًا
      ["قرْضا حسنا : محتسبا به ، طيبة به نفسه"], // حَسَنًا
      [], // فَيُضـٰعِفَهُ
      [], // لَهُ
      [], // وَلَهُ
      [], // أَجرٌ
      [] // كَريمٌ
    ],
    [ // آية 12
      [], // يَومَ
      [], // تَرَى
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // يَسعىٰ
      [], // نورُهُم
      [], // بَينَ
      [], // أَيديهِم
      [], // وَبِأَيمـٰنِهِم
      [], // بُشرىٰكُمُ
      [], // اليَومَ
      [], // جَنّـٰتٌ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 13
      [], // يَومَ
      [], // يَقولُ
      [], // المُنـٰفِقونَ
      [], // وَالمُنـٰفِقـٰتُ
      [], // لِلَّذينَ
      [], // ءامَنُوا
      ["انظرونا : انتظرونا"], // انظُرونا
      ["نقتبس : نـُـصِـبْ و نأخذ و نستضيء"], // نَقتَبِس
      [], // مِن
      [], // نورِكُم
      [], // قيلَ
      [], // ارجِعوا
      [], // وَراءَكُم
      [], // فَالتَمِسوا
      [], // نورًا
      [], // فَضُرِبَ
      [], // بَينَهُم
      ["بسور : حاجز بين الجنة و النار (الأعراف)"], // بِسورٍ
      [], // لَهُ
      [], // بابٌ
      [], // باطِنُهُ
      [], // فيهِ
      [], // الرَّحمَةُ
      [], // وَظـٰهِرُهُ
      [], // مِن
      [], // قِبَلِهِ
      [] // العَذابُ
    ],
    [ // آية 14
      ["ينادونهم : ينادي المنافقون المؤمنين"], // يُنادونَهُم
      [], // أَلَم
      [], // نَكُن
      [], // مَعَكُم
      [], // قالوا
      [], // بَلىٰ
      [], // وَلـٰكِنَّكُم
      [], // فَتَنتُم
      [], // أَنفُسَكُم
      [], // وَتَرَبَّصتُم
      [], // وَارتَبتُم
      [], // وَغَرَّتكُمُ
      [], // الأَمانِىُّ
      [], // حَتّىٰ
      [], // جاءَ
      [], // أَمرُ
      [], // اللَّهِ
      [], // وَغَرَّكُم
      [], // بِاللَّهِ
      ["الغرور : الشيطان و كل خادع"] // الغَرورُ
    ],
    [ // آية 15
      [], // فَاليَومَ
      [], // لا
      [], // يُؤخَذُ
      [], // مِنكُم
      [], // فِديَةٌ
      [], // وَلا
      [], // مِنَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مَأوىٰكُمُ
      [], // النّارُ
      [], // هِىَ
      [], // مَولىٰكُم
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 16
      [], // أَلَم
      [], // يَأنِ
      [], // لِلَّذينَ
      [], // ءامَنوا
      ["أن تخشع : وقت أن تخضع و ترق و تلين"], // أَن
      ["أن تخشع : وقت أن تخضع و ترق و تلين"], // تَخشَعَ
      [], // قُلوبُهُم
      [], // لِذِكرِ
      [], // اللَّهِ
      [], // وَما
      [], // نَزَلَ
      [], // مِنَ
      [], // الحَقِّ
      [], // وَلا
      [], // يَكونوا
      [], // كَالَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // مِن
      [], // قَبلُ
      [], // فَطالَ
      [], // عَلَيهِمُ
      ["الأمد : الأجل أو الزمان"], // الأَمَدُ
      [], // فَقَسَت
      [], // قُلوبُهُم
      [], // وَكَثيرٌ
      [], // مِنهُم
      [] // فـٰسِقونَ
    ],
    [ // آية 17
      [], // اعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // يُحىِ
      [], // الأَرضَ
      [], // بَعدَ
      [], // مَوتِها
      [], // قَد
      [], // بَيَّنّا
      [], // لَكُمُ
      [], // الـٔايـٰتِ
      [], // لَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 18
      [], // إِنَّ
      [], // المُصَّدِّقينَ
      [], // وَالمُصَّدِّقـٰتِ
      [], // وَأَقرَضُوا
      [], // اللَّهَ
      [], // قَرضًا
      [], // حَسَنًا
      [], // يُضـٰعَفُ
      [], // لَهُم
      [], // وَلَهُم
      [], // أَجرٌ
      [] // كَريمٌ
    ],
    [ // آية 19
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَرُسُلِهِ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [], // الصِّدّيقونَ
      [], // وَالشُّهَداءُ
      [], // عِندَ
      [], // رَبِّهِم
      [], // لَهُم
      [], // أَجرُهُم
      [], // وَنورُهُم
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // وَكَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [] // الجَحيمِ
    ],
    [ // آية 20
      [], // اعلَموا
      [], // أَنَّمَا
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // لَعِبٌ
      [], // وَلَهوٌ
      [], // وَزينَةٌ
      [], // وَتَفاخُرٌ
      [], // بَينَكُم
      [], // وَتَكاثُرٌ
      [], // فِى
      [], // الأَموٰلِ
      [], // وَالأَولـٰدِ
      [], // كَمَثَلِ
      [], // غَيثٍ
      ["أعْجَب الكفار : راق الزّراع"], // أَعجَبَ
      ["أعْجَب الكفار : راق الزّراع"], // الكُفّارَ
      [], // نَباتُهُ
      [], // ثُمَّ
      ["يهيج : يَيْبس في أقصى غايته"], // يَهيجُ
      [], // فَتَرىٰهُ
      [], // مُصفَرًّا
      [], // ثُمَّ
      [], // يَكونُ
      [], // حُطـٰمًا
      [], // وَفِى
      [], // الـٔاخِرَةِ
      [], // عَذابٌ
      [], // شَديدٌ
      [], // وَمَغفِرَةٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرِضوٰنٌ
      [], // وَمَا
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // إِلّا
      [], // مَتـٰعُ
      [] // الغُرورِ
    ],
    [ // آية 21
      ["سابقوا : سارعوا مسارعة المتسابقين في المضمار"], // سابِقوا
      [], // إِلىٰ
      [], // مَغفِرَةٍ
      [], // مِن
      [], // رَبِّكُم
      [], // وَجَنَّةٍ
      [], // عَرضُها
      [], // كَعَرضِ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // أُعِدَّت
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // بِاللَّهِ
      [], // وَرُسُلِهِ
      [], // ذٰلِكَ
      [], // فَضلُ
      [], // اللَّهِ
      [], // يُؤتيهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // ذُو
      [], // الفَضلِ
      [] // العَظيمِ
    ],
    [ // آية 22
      [], // ما
      [], // أَصابَ
      [], // مِن
      [], // مُصيبَةٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // فى
      [], // أَنفُسِكُم
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      ["نبرأها : نـَـخْـلـُـقَ هذه الكائنات"], // نَبرَأَها
      [], // إِنَّ
      [], // ذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرٌ
    ],
    [ // آية 23
      ["لكيلا تأسَوْا : لكيلا تحزنوا حزن قنوط"], // لِكَيلا
      ["لكيلا تأسَوْا : لكيلا تحزنوا حزن قنوط"], // تَأسَوا
      [], // عَلىٰ
      [], // ما
      [], // فاتَكُم
      [], // وَلا
      [], // تَفرَحوا
      [], // بِما
      [], // ءاتىٰكُم
      [], // وَاللَّهُ
      [], // لا
      [], // يُحِبُّ
      [], // كُلَّ
      [], // مُختالٍ
      [] // فَخورٍ
    ],
    [ // آية 24
      [], // الَّذينَ
      [], // يَبخَلونَ
      [], // وَيَأمُرونَ
      [], // النّاسَ
      [], // بِالبُخلِ
      [], // وَمَن
      [], // يَتَوَلَّ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // الغَنِىُّ
      [] // الحَميدُ
    ],
    [ // آية 25
      [], // لَقَد
      [], // أَرسَلنا
      [], // رُسُلَنا
      [], // بِالبَيِّنـٰتِ
      [], // وَأَنزَلنا
      [], // مَعَهُمُ
      [], // الكِتـٰبَ
      [], // وَالميزانَ
      [], // لِيَقومَ
      [], // النّاسُ
      [], // بِالقِسطِ
      [], // وَأَنزَلنَا
      [], // الحَديدَ
      [], // فيهِ
      ["بأس شديد : قوة شديدة"], // بَأسٌ
      ["بأس شديد : قوة شديدة"], // شَديدٌ
      [], // وَمَنـٰفِعُ
      [], // لِلنّاسِ
      [], // وَلِيَعلَمَ
      [], // اللَّهُ
      [], // مَن
      [], // يَنصُرُهُ
      [], // وَرُسُلَهُ
      [], // بِالغَيبِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // قَوِىٌّ
      [] // عَزيزٌ
    ],
    [ // آية 26
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // نوحًا
      [], // وَإِبرٰهيمَ
      [], // وَجَعَلنا
      [], // فى
      [], // ذُرِّيَّتِهِمَا
      [], // النُّبُوَّةَ
      [], // وَالكِتـٰبَ
      [], // فَمِنهُم
      [], // مُهتَدٍ
      [], // وَكَثيرٌ
      [], // مِنهُم
      [] // فـٰسِقونَ
    ],
    [ // آية 27
      [], // ثُمَّ
      [], // قَفَّينا
      [], // عَلىٰ
      [], // ءاثـٰرِهِم
      [], // بِرُسُلِنا
      [], // وَقَفَّينا
      [], // بِعيسَى
      [], // ابنِ
      [], // مَريَمَ
      [], // وَءاتَينـٰهُ
      ["الإنجيل : و قد حرّفوه بَعد"], // الإِنجيلَ
      [], // وَجَعَلنا
      [], // فى
      [], // قُلوبِ
      ["الذين اتبعوه : على دينه الذي أرسل به"], // الَّذينَ
      ["الذين اتبعوه : على دينه الذي أرسل به"], // اتَّبَعوهُ
      [], // رَأفَةً
      [], // وَرَحمَةً
      [], // وَرَهبانِيَّةً
      [], // ابتَدَعوها
      [], // ما
      [], // كَتَبنـٰها
      [], // عَلَيهِم
      [], // إِلَّا
      [], // ابتِغاءَ
      [], // رِضوٰنِ
      [], // اللَّهِ
      ["فما رعوها : بلْ ضيّعها أخلافهم و كفروا بدين عيسى عليه السلام"], // فَما
      ["فما رعوها : بلْ ضيّعها أخلافهم و كفروا بدين عيسى عليه السلام"], // رَعَوها
      [], // حَقَّ
      [], // رِعايَتِها
      [], // فَـٔاتَينَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // مِنهُم
      [], // أَجرَهُم
      [], // وَكَثيرٌ
      [], // مِنهُم
      [] // فـٰسِقونَ
    ],
    [ // آية 28
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اتَّقُوا
      [], // اللَّهَ
      [], // وَءامِنوا
      [], // بِرَسولِهِ
      [], // يُؤتِكُم
      [], // كِفلَينِ
      [], // مِن
      [], // رَحمَتِهِ
      [], // وَيَجعَل
      [], // لَكُم
      [], // نورًا
      [], // تَمشونَ
      [], // بِهِ
      [], // وَيَغفِر
      [], // لَكُم
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 29
      ["لئلاّ يَعلم : \"ليعلم و \"\"لا\"\" مزيدة   \""], // لِئَلّا
      ["لئلاّ يَعلم : \"ليعلم و \"\"لا\"\" مزيدة   \""], // يَعلَمَ
      [], // أَهلُ
      [], // الكِتـٰبِ
      [], // أَلّا
      [], // يَقدِرونَ
      [], // عَلىٰ
      [], // شَىءٍ
      [], // مِن
      [], // فَضلِ
      [], // اللَّهِ
      [], // وَأَنَّ
      [], // الفَضلَ
      [], // بِيَدِ
      [], // اللَّهِ
      [], // يُؤتيهِ
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // ذُو
      [], // الفَضلِ
      [] // العَظيمِ
    ]
  ]
];

export default meanings;