const meanings = [
  [ // سورة 58: المجادلة
[ // آية 1
      [], // قَد
      [], // سَمِعَ
      [], // اللَّهُ
      [], // قَولَ
      [], // الَّتى
      [], // تُجـٰدِلُكَ
      [], // فى
      [], // زَوجِها
      [], // وَتَشتَكى
      [], // إِلَى
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // يَسمَعُ
      ["تحاوركما : مراجعتكما القوْل"], // تَحاوُرَكُما
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // بَصيرٌ
    ],
    [ // آية 2
      [], // الَّذينَ
      [], // يُظـٰهِرونَ
      [], // مِنكُم
      [], // مِن
      [], // نِسائِهِم
      [], // ما
      [], // هُنَّ
      [], // أُمَّهـٰتِهِم
      [], // إِن
      [], // أُمَّهـٰتُهُم
      [], // إِلَّا
      [], // الّـٰـٔى
      [], // وَلَدنَهُم
      [], // وَإِنَّهُم
      [], // لَيَقولونَ
      ["منكرا من القول : فظيعا منه يُنكِرهالشرع و العَقل"], // مُنكَرًا
      ["منكرا من القول : فظيعا منه يُنكِرهالشرع و العَقل"], // مِنَ
      ["منكرا من القول : فظيعا منه يُنكِرهالشرع و العَقل"], // القَولِ
      [], // وَزورًا
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَعَفُوٌّ
      [] // غَفورٌ
    ],
    [ // آية 3
      [], // وَالَّذينَ
      [], // يُظـٰهِرونَ
      [], // مِن
      [], // نِسائِهِم
      [], // ثُمَّ
      [], // يَعودونَ
      [], // لِما
      [], // قالوا
      [], // فَتَحريرُ
      [], // رَقَبَةٍ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَتَماسّا
      [], // ذٰلِكُم
      [], // توعَظونَ
      [], // بِهِ
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 4
      [], // فَمَن
      [], // لَم
      [], // يَجِد
      [], // فَصِيامُ
      [], // شَهرَينِ
      [], // مُتَتابِعَينِ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَتَماسّا
      [], // فَمَن
      [], // لَم
      [], // يَستَطِع
      [], // فَإِطعامُ
      [], // سِتّينَ
      [], // مِسكينًا
      [], // ذٰلِكَ
      [], // لِتُؤمِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَتِلكَ
      [], // حُدودُ
      [], // اللَّهِ
      [], // وَلِلكـٰفِرينَ
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 5
      [], // إِنَّ
      [], // الَّذينَ
      ["يحادّون : يعادون و يشاقّـون و يخالفون"], // يُحادّونَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      ["كبتوا : أذلـّـوا أو أهلكوا . أوْ لعِنوا"], // كُبِتوا
      [], // كَما
      [], // كُبِتَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // وَقَد
      [], // أَنزَلنا
      [], // ءايـٰتٍ
      [], // بَيِّنـٰتٍ
      [], // وَلِلكـٰفِرينَ
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 6
      [], // يَومَ
      [], // يَبعَثُهُمُ
      [], // اللَّهُ
      [], // جَميعًا
      [], // فَيُنَبِّئُهُم
      [], // بِما
      [], // عَمِلوا
      [], // أَحصىٰهُ
      [], // اللَّهُ
      [], // وَنَسوهُ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدٌ
    ],
    [ // آية 7
      [], // أَلَم
      [], // تَرَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَعلَمُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // ما
      [], // يَكونُ
      [], // مِن
      [], // نَجوىٰ
      [], // ثَلـٰثَةٍ
      [], // إِلّا
      ["هو رابعهم : بعلمه حيث يطلِع على نجواهم"], // هُوَ
      ["هو رابعهم : بعلمه حيث يطلِع على نجواهم"], // رابِعُهُم
      [], // وَلا
      [], // خَمسَةٍ
      [], // إِلّا
      [], // هُوَ
      [], // سادِسُهُم
      [], // وَلا
      [], // أَدنىٰ
      [], // مِن
      [], // ذٰلِكَ
      [], // وَلا
      [], // أَكثَرَ
      [], // إِلّا
      ["هو معهم : بعلمه المحيط بكل شيء"], // هُوَ
      ["هو معهم : بعلمه المحيط بكل شيء"], // مَعَهُم
      [], // أَينَ
      [], // ما
      [], // كانوا
      [], // ثُمَّ
      [], // يُنَبِّئُهُم
      [], // بِما
      [], // عَمِلوا
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 8
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // نُهوا
      [], // عَنِ
      [], // النَّجوىٰ
      [], // ثُمَّ
      [], // يَعودونَ
      [], // لِما
      [], // نُهوا
      [], // عَنهُ
      [], // وَيَتَنـٰجَونَ
      [], // بِالإِثمِ
      [], // وَالعُدوٰنِ
      [], // وَمَعصِيَتِ
      [], // الرَّسولِ
      [], // وَإِذا
      [], // جاءوكَ
      [], // حَيَّوكَ
      [], // بِما
      [], // لَم
      [], // يُحَيِّكَ
      [], // بِهِ
      [], // اللَّهُ
      [], // وَيَقولونَ
      [], // فى
      [], // أَنفُسِهِم
      ["لولا يعذبنا : هلاّ يعذبنا"], // لَولا
      ["لولا يعذبنا : هلاّ يعذبنا"], // يُعَذِّبُنَا
      [], // اللَّهُ
      [], // بِما
      [], // نَقولُ
      [], // حَسبُهُم
      [], // جَهَنَّمُ
      [], // يَصلَونَها
      [], // فَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 9
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // تَنـٰجَيتُم
      [], // فَلا
      [], // تَتَنـٰجَوا
      [], // بِالإِثمِ
      [], // وَالعُدوٰنِ
      [], // وَمَعصِيَتِ
      [], // الرَّسولِ
      [], // وَتَنـٰجَوا
      [], // بِالبِرِّ
      [], // وَالتَّقوىٰ
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // الَّذى
      [], // إِلَيهِ
      [] // تُحشَرونَ
    ],
    [ // آية 10
      ["إنما النجوى : المَنهيّ عنها"], // إِنَّمَا
      ["إنما النجوى : المَنهيّ عنها"], // النَّجوىٰ
      [], // مِنَ
      [], // الشَّيطـٰنِ
      [], // لِيَحزُنَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَلَيسَ
      [], // بِضارِّهِم
      [], // شَيـًٔا
      [], // إِلّا
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // وَعَلَى
      [], // اللَّهِ
      [], // فَليَتَوَكَّلِ
      [] // المُؤمِنونَ
    ],
    [ // آية 11
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // قيلَ
      [], // لَكُم
      [], // تَفَسَّحوا
      [], // فِى
      [], // المَجـٰلِسِ
      [], // فَافسَحوا
      [], // يَفسَحِ
      [], // اللَّهُ
      [], // لَكُم
      [], // وَإِذا
      [], // قيلَ
      [], // انشُزوا
      [], // فَانشُزوا
      [], // يَرفَعِ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // مِنكُم
      [], // وَالَّذينَ
      [], // أوتُوا
      [], // العِلمَ
      [], // دَرَجـٰتٍ
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 12
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // نـٰجَيتُمُ
      [], // الرَّسولَ
      [], // فَقَدِّموا
      [], // بَينَ
      [], // يَدَى
      [], // نَجوىٰكُم
      [], // صَدَقَةً
      [], // ذٰلِكَ
      [], // خَيرٌ
      [], // لَكُم
      [], // وَأَطهَرُ
      [], // فَإِن
      [], // لَم
      [], // تَجِدوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 13
      [], // ءَأَشفَقتُم
      [], // أَن
      [], // تُقَدِّموا
      [], // بَينَ
      [], // يَدَى
      [], // نَجوىٰكُم
      [], // صَدَقـٰتٍ
      [], // فَإِذ
      [], // لَم
      [], // تَفعَلوا
      [], // وَتابَ
      [], // اللَّهُ
      [], // عَلَيكُم
      [], // فَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَءاتُوا
      [], // الزَّكوٰةَ
      [], // وَأَطيعُوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَاللَّهُ
      [], // خَبيرٌ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 14
      [], // أَلَم
      [], // تَرَ
      ["إلى الذين : هم المنافقون"], // إِلَى
      ["إلى الذين : هم المنافقون"], // الَّذينَ
      ["توَلوْا قومًا : اتـّـخذوا اليهود أولياء"], // تَوَلَّوا
      ["توَلوْا قومًا : اتـّـخذوا اليهود أولياء"], // قَومًا
      [], // غَضِبَ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // ما
      [], // هُم
      [], // مِنكُم
      [], // وَلا
      [], // مِنهُم
      [], // وَيَحلِفونَ
      [], // عَلَى
      [], // الكَذِبِ
      [], // وَهُم
      [] // يَعلَمونَ
    ],
    [ // آية 15
      [], // أَعَدَّ
      [], // اللَّهُ
      [], // لَهُم
      [], // عَذابًا
      [], // شَديدًا
      [], // إِنَّهُم
      [], // ساءَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 16
      [], // اتَّخَذوا
      [], // أَيمـٰنَهُم
      [], // جُنَّةً
      [], // فَصَدّوا
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَلَهُم
      [], // عَذابٌ
      [] // مُهينٌ
    ],
    [ // آية 17
      [], // لَن
      [], // تُغنِىَ
      [], // عَنهُم
      [], // أَموٰلُهُم
      [], // وَلا
      [], // أَولـٰدُهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // شَيـًٔا
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 18
      [], // يَومَ
      [], // يَبعَثُهُمُ
      [], // اللَّهُ
      [], // جَميعًا
      [], // فَيَحلِفونَ
      [], // لَهُ
      [], // كَما
      [], // يَحلِفونَ
      [], // لَكُم
      [], // وَيَحسَبونَ
      [], // أَنَّهُم
      [], // عَلىٰ
      [], // شَىءٍ
      [], // أَلا
      [], // إِنَّهُم
      [], // هُمُ
      [] // الكـٰذِبونَ
    ],
    [ // آية 19
      ["استحوذ عليهم : اسْـتولى و غلبَ على عقولهم"], // استَحوَذَ
      ["استحوذ عليهم : اسْـتولى و غلبَ على عقولهم"], // عَلَيهِمُ
      [], // الشَّيطـٰنُ
      [], // فَأَنسىٰهُم
      [], // ذِكرَ
      [], // اللَّهِ
      [], // أُولـٰئِكَ
      [], // حِزبُ
      [], // الشَّيطـٰنِ
      [], // أَلا
      [], // إِنَّ
      [], // حِزبَ
      [], // الشَّيطـٰنِ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 20
      [], // إِنَّ
      [], // الَّذينَ
      ["يُحادّون : يُـعادون و يُشاقّـون و يُخالفون"], // يُحادّونَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // أُولـٰئِكَ
      [], // فِى
      ["الأذلين : الزّائدين في الذلة و الهوان"] // الأَذَلّينَ
    ],
    [ // آية 21
      [], // كَتَبَ
      [], // اللَّهُ
      [], // لَأَغلِبَنَّ
      [], // أَنا۠
      [], // وَرُسُلى
      [], // إِنَّ
      [], // اللَّهَ
      [], // قَوِىٌّ
      ["عزيزٌ : غالب على أعدائه غير مغلوب"] // عَزيزٌ
    ],
    [ // آية 22
      [], // لا
      [], // تَجِدُ
      [], // قَومًا
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // يُوادّونَ
      [], // مَن
      [], // حادَّ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَلَو
      [], // كانوا
      [], // ءاباءَهُم
      [], // أَو
      [], // أَبناءَهُم
      [], // أَو
      [], // إِخوٰنَهُم
      [], // أَو
      [], // عَشيرَتَهُم
      [], // أُولـٰئِكَ
      [], // كَتَبَ
      [], // فى
      [], // قُلوبِهِمُ
      [], // الإيمـٰنَ
      [], // وَأَيَّدَهُم
      ["بروح منه : بنور يقذفه في قلوبهم . أو بالقرآن"], // بِروحٍ
      ["بروح منه : بنور يقذفه في قلوبهم . أو بالقرآن"], // مِنهُ
      [], // وَيُدخِلُهُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // رَضِىَ
      [], // اللَّهُ
      [], // عَنهُم
      [], // وَرَضوا
      [], // عَنهُ
      [], // أُولـٰئِكَ
      [], // حِزبُ
      [], // اللَّهِ
      [], // أَلا
      [], // إِنَّ
      [], // حِزبَ
      [], // اللَّهِ
      [], // هُمُ
      [] // المُفلِحونَ
    ]
  ]
];

export default meanings;