const meanings = [
  [ // سورة 59: الحشر
[ // آية 1
      [], // سَبَّحَ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 2
      [], // هُوَ
      [], // الَّذى
      [], // أَخرَجَ
      ["الذين كفروا : هو يهود بني النضير  قرب المدينة"], // الَّذينَ
      ["الذين كفروا : هو يهود بني النضير  قرب المدينة"], // كَفَروا
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // مِن
      [], // دِيـٰرِهِم
      ["لأوّل الحَشر : في أول إخراج و إجلاء إلى الشام"], // لِأَوَّلِ
      ["لأوّل الحَشر : في أول إخراج و إجلاء إلى الشام"], // الحَشرِ
      [], // ما
      [], // ظَنَنتُم
      [], // أَن
      [], // يَخرُجوا
      [], // وَظَنّوا
      [], // أَنَّهُم
      [], // مانِعَتُهُم
      [], // حُصونُهُم
      [], // مِنَ
      [], // اللَّهِ
      [], // فَأَتىٰهُمُ
      [], // اللَّهُ
      [], // مِن
      [], // حَيثُ
      ["لمْ يحتسِبوا : لم يظنوا و لم يخطر لهم ببَال"], // لَم
      ["لمْ يحتسِبوا : لم يظنوا و لم يخطر لهم ببَال"], // يَحتَسِبوا
      [], // وَقَذَفَ
      [], // فى
      [], // قُلوبِهِمُ
      [], // الرُّعبَ
      [], // يُخرِبونَ
      [], // بُيوتَهُم
      [], // بِأَيديهِم
      [], // وَأَيدِى
      [], // المُؤمِنينَ
      [], // فَاعتَبِروا
      [], // يـٰأُولِى
      [] // الأَبصـٰرِ
    ],
    [ // آية 3
      [], // وَلَولا
      [], // أَن
      [], // كَتَبَ
      [], // اللَّهُ
      [], // عَلَيهِمُ
      ["الجَلاء : الخروج من الوَطن"], // الجَلاءَ
      [], // لَعَذَّبَهُم
      [], // فِى
      [], // الدُّنيا
      [], // وَلَهُم
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // عَذابُ
      [] // النّارِ
    ],
    [ // آية 4
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      ["شاقّوا : عادَوْا و عَصَوْا و حادّوا"], // شاقُّوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَمَن
      [], // يُشاقِّ
      [], // اللَّهَ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 5
      [], // ما
      [], // قَطَعتُم
      [], // مِن
      [], // لينَةٍ
      [], // أَو
      [], // تَرَكتُموها
      [], // قائِمَةً
      ["على أصولها : على سوقها"], // عَلىٰ
      ["على أصولها : على سوقها"], // أُصولِها
      [], // فَبِإِذنِ
      [], // اللَّهِ
      [], // وَلِيُخزِىَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 6
      [], // وَما
      [], // أَفاءَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // مِنهُم
      ["فما أوْجَفتم عليه : فما أجْرَيتم على تحصيله"], // فَما
      ["فما أوْجَفتم عليه : فما أجْرَيتم على تحصيله"], // أَوجَفتُم
      ["فما أوْجَفتم عليه : فما أجْرَيتم على تحصيله"], // عَلَيهِ
      [], // مِن
      [], // خَيلٍ
      [], // وَلا
      ["ركاب : ما يُركب ن الإبل خاصّة"], // رِكابٍ
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // يُسَلِّطُ
      [], // رُسُلَهُ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 7
      [], // ما
      [], // أَفاءَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // مِن
      [], // أَهلِ
      [], // القُرىٰ
      [], // فَلِلَّهِ
      [], // وَلِلرَّسولِ
      [], // وَلِذِى
      [], // القُربىٰ
      [], // وَاليَتـٰمىٰ
      [], // وَالمَسـٰكينِ
      [], // وَابنِ
      [], // السَّبيلِ
      [], // كَى
      [], // لا
      [], // يَكونَ
      ["دُولة بين الأغنياء : مِلكا مُتداولا بينهم خاصة"], // دولَةً
      ["دُولة بين الأغنياء : مِلكا مُتداولا بينهم خاصة"], // بَينَ
      ["دُولة بين الأغنياء : مِلكا مُتداولا بينهم خاصة"], // الأَغنِياءِ
      [], // مِنكُم
      [], // وَما
      [], // ءاتىٰكُمُ
      [], // الرَّسولُ
      [], // فَخُذوهُ
      [], // وَما
      [], // نَهىٰكُم
      [], // عَنهُ
      [], // فَانتَهوا
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 8
      [], // لِلفُقَراءِ
      [], // المُهـٰجِرينَ
      [], // الَّذينَ
      [], // أُخرِجوا
      [], // مِن
      [], // دِيـٰرِهِم
      [], // وَأَموٰلِهِم
      [], // يَبتَغونَ
      [], // فَضلًا
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرِضوٰنًا
      [], // وَيَنصُرونَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الصّـٰدِقونَ
    ],
    [ // آية 9
      [], // وَالَّذينَ
      [], // تَبَوَّءُو
      [], // الدّارَ
      [], // وَالإيمـٰنَ
      [], // مِن
      [], // قَبلِهِم
      [], // يُحِبّونَ
      [], // مَن
      [], // هاجَرَ
      [], // إِلَيهِم
      [], // وَلا
      [], // يَجِدونَ
      [], // فى
      [], // صُدورِهِم
      ["حاجَة : حَزَازَةً و حَسَدًا"], // حاجَةً
      [], // مِمّا
      [], // أوتوا
      [], // وَيُؤثِرونَ
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // وَلَو
      [], // كانَ
      [], // بِهِم
      ["خصاصة : فقـْـرٌ و احتياج"], // خَصاصَةٌ
      [], // وَمَن
      [], // يوقَ
      ["شحّ نفسه : بُخْـلها مع الحرص على المنع"], // شُحَّ
      ["شحّ نفسه : بُخْـلها مع الحرص على المنع"], // نَفسِهِ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 10
      [], // وَالَّذينَ
      [], // جاءو
      [], // مِن
      [], // بَعدِهِم
      [], // يَقولونَ
      [], // رَبَّنَا
      [], // اغفِر
      [], // لَنا
      [], // وَلِإِخوٰنِنَا
      [], // الَّذينَ
      [], // سَبَقونا
      [], // بِالإيمـٰنِ
      [], // وَلا
      [], // تَجعَل
      [], // فى
      [], // قُلوبِنا
      ["غِلاّ : حِقـدًا و بُـغـضـا و غِـشّـا"], // غِلًّا
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // رَبَّنا
      [], // إِنَّكَ
      [], // رَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 11
      [], // أَلَم
      [], // تَرَ
      [], // إِلَى
      [], // الَّذينَ
      [], // نافَقوا
      [], // يَقولونَ
      [], // لِإِخوٰنِهِمُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // لَئِن
      [], // أُخرِجتُم
      [], // لَنَخرُجَنَّ
      [], // مَعَكُم
      [], // وَلا
      [], // نُطيعُ
      [], // فيكُم
      [], // أَحَدًا
      [], // أَبَدًا
      [], // وَإِن
      [], // قوتِلتُم
      [], // لَنَنصُرَنَّكُم
      [], // وَاللَّهُ
      [], // يَشهَدُ
      [], // إِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 12
      [], // لَئِن
      [], // أُخرِجوا
      [], // لا
      [], // يَخرُجونَ
      [], // مَعَهُم
      [], // وَلَئِن
      [], // قوتِلوا
      [], // لا
      [], // يَنصُرونَهُم
      [], // وَلَئِن
      [], // نَصَروهُم
      [], // لَيُوَلُّنَّ
      [], // الأَدبـٰرَ
      [], // ثُمَّ
      [], // لا
      [] // يُنصَرونَ
    ],
    [ // آية 13
      [], // لَأَنتُم
      [], // أَشَدُّ
      [], // رَهبَةً
      [], // فى
      [], // صُدورِهِم
      [], // مِنَ
      [], // اللَّهِ
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // قَومٌ
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 14
      [], // لا
      [], // يُقـٰتِلونَكُم
      [], // جَميعًا
      [], // إِلّا
      [], // فى
      [], // قُرًى
      [], // مُحَصَّنَةٍ
      [], // أَو
      [], // مِن
      [], // وَراءِ
      [], // جُدُرٍ
      ["بَأسهم بينهم : قتالهم فيما بينهم"], // بَأسُهُم
      ["بَأسهم بينهم : قتالهم فيما بينهم"], // بَينَهُم
      [], // شَديدٌ
      [], // تَحسَبُهُم
      [], // جَميعًا
      [], // وَقُلوبُهُم
      [], // شَتّىٰ
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // قَومٌ
      [], // لا
      [] // يَعقِلونَ
    ],
    [ // آية 15
      [], // كَمَثَلِ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // قَريبًا
      [], // ذاقوا
      [], // وَبالَ
      [], // أَمرِهِم
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 16
      [], // كَمَثَلِ
      [], // الشَّيطـٰنِ
      [], // إِذ
      [], // قالَ
      [], // لِلإِنسـٰنِ
      [], // اكفُر
      [], // فَلَمّا
      [], // كَفَرَ
      [], // قالَ
      [], // إِنّى
      [], // بَرىءٌ
      [], // مِنكَ
      [], // إِنّى
      [], // أَخافُ
      [], // اللَّهَ
      [], // رَبَّ
      [] // العـٰلَمينَ
    ],
    [ // آية 17
      [], // فَكانَ
      [], // عـٰقِبَتَهُما
      [], // أَنَّهُما
      [], // فِى
      [], // النّارِ
      [], // خـٰلِدَينِ
      [], // فيها
      [], // وَذٰلِكَ
      [], // جَزٰؤُا۟
      [] // الظّـٰلِمينَ
    ],
    [ // آية 18
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اتَّقُوا
      [], // اللَّهَ
      [], // وَلتَنظُر
      [], // نَفسٌ
      [], // ما
      [], // قَدَّمَت
      [], // لِغَدٍ
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // خَبيرٌ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 19
      [], // وَلا
      [], // تَكونوا
      [], // كَالَّذينَ
      ["نسوا الله : لمْ يراعوا أوامره و نـَـواهيه"], // نَسُوا
      ["نسوا الله : لمْ يراعوا أوامره و نـَـواهيه"], // اللَّهَ
      [], // فَأَنسىٰهُم
      [], // أَنفُسَهُم
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الفـٰسِقونَ
    ],
    [ // آية 20
      [], // لا
      [], // يَستَوى
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // وَأَصحـٰبُ
      [], // الجَنَّةِ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // هُمُ
      [] // الفائِزونَ
    ],
    [ // آية 21
      [], // لَو
      [], // أَنزَلنا
      [], // هـٰذَا
      [], // القُرءانَ
      [], // عَلىٰ
      [], // جَبَلٍ
      [], // لَرَأَيتَهُ
      [], // خـٰشِعًا
      ["متصدّعًا : مُـتـشـقـّــقـا"], // مُتَصَدِّعًا
      [], // مِن
      [], // خَشيَةِ
      [], // اللَّهِ
      [], // وَتِلكَ
      [], // الأَمثـٰلُ
      [], // نَضرِبُها
      [], // لِلنّاسِ
      [], // لَعَلَّهُم
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 22
      [], // هُوَ
      [], // اللَّهُ
      [], // الَّذى
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // عـٰلِمُ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // هُوَ
      [], // الرَّحمـٰنُ
      [] // الرَّحيمُ
    ],
    [ // آية 23
      [], // هُوَ
      [], // اللَّهُ
      [], // الَّذى
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      ["المَلِك : المالك لكل شيء المتصرف فيه"], // المَلِكُ
      ["القدوس : البَليغ في النـّـزاهة عن الـنّـقائص"], // القُدّوسُ
      [], // السَّلـٰمُ
      ["المؤمن : المصَدّق لرسلِه بالمعجزات"], // المُؤمِنُ
      ["المهيمن : الرقيب على كلّ شيء"], // المُهَيمِنُ
      ["العزيز : القوّي  الغالب"], // العَزيزُ
      ["الجبّار : القهار . أو العظيم"], // الجَبّارُ
      ["المتكبّر : البَليغ الكبرياء و العظمة"], // المُتَكَبِّرُ
      [], // سُبحـٰنَ
      [], // اللَّهِ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 24
      [], // هُوَ
      [], // اللَّهُ
      [], // الخـٰلِقُ
      ["البارئ : المبدع المخترع"], // البارِئُ
      ["المصوّر : خالق الصّور على ما يريد"], // المُصَوِّرُ
      [], // لَهُ
      [], // الأَسماءُ
      [], // الحُسنىٰ
      [], // يُسَبِّحُ
      [], // لَهُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ]
  ]
];

export default meanings;