const meanings = [
  [ // سورة 6: الأنعام
[ // آية 1
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // وَجَعَلَ
      [], // الظُّلُمـٰتِ
      [], // وَالنّورَ
      [], // ثُمَّ
      [], // الَّذينَ
      [], // كَفَروا
      ["بربّهم يعدلون : يسوّون به غيره في العبادة"], // بِرَبِّهِم
      ["بربّهم يعدلون : يسوّون به غيره في العبادة"] // يَعدِلونَ
    ],
    [ // آية 2
      [], // هُوَ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // مِن
      [], // طينٍ
      [], // ثُمَّ
      ["قضى أجلاً : كتب و قدّر زمانًا مُعيّنا للموت"], // قَضىٰ
      ["قضى أجلاً : كتب و قدّر زمانًا مُعيّنا للموت"], // أَجَلًا
      [], // وَأَجَلٌ
      [], // مُسَمًّى
      [], // عِندَهُ
      [], // ثُمَّ
      [], // أَنتُم
      ["تمترون : تشكّون في البعث أو تجحدونه"] // تَمتَرونَ
    ],
    [ // آية 3
      [], // وَهُوَ
      [], // اللَّهُ
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَفِى
      [], // الأَرضِ
      [], // يَعلَمُ
      [], // سِرَّكُم
      [], // وَجَهرَكُم
      [], // وَيَعلَمُ
      [], // ما
      [] // تَكسِبونَ
    ],
    [ // آية 4
      [], // وَما
      [], // تَأتيهِم
      [], // مِن
      [], // ءايَةٍ
      [], // مِن
      [], // ءايـٰتِ
      [], // رَبِّهِم
      [], // إِلّا
      [], // كانوا
      [], // عَنها
      [] // مُعرِضينَ
    ],
    [ // آية 5
      [], // فَقَد
      [], // كَذَّبوا
      [], // بِالحَقِّ
      [], // لَمّا
      [], // جاءَهُم
      [], // فَسَوفَ
      [], // يَأتيهِم
      [], // أَنبـٰؤُا۟
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 6
      [], // أَلَم
      [], // يَرَوا
      ["كم أهلكنا : كثيراً أهلكنا"], // كَم
      ["كم أهلكنا : كثيراً أهلكنا"], // أَهلَكنا
      [], // مِن
      [], // قَبلِهِم
      [], // مِن
      ["قرن : أمّة من النّاس"], // قَرنٍ
      [], // مَكَّنّـٰهُم
      [], // فِى
      [], // الأَرضِ
      [], // ما
      [], // لَم
      [], // نُمَكِّن
      [], // لَكُم
      [], // وَأَرسَلنَا
      ["السّماء : المطر"], // السَّماءَ
      [], // عَلَيهِم
      ["مدرارا : غزيرا كثير الصبّ"], // مِدرارًا
      [], // وَجَعَلنَا
      [], // الأَنهـٰرَ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهِم
      [], // فَأَهلَكنـٰهُم
      [], // بِذُنوبِهِم
      [], // وَأَنشَأنا
      [], // مِن
      [], // بَعدِهِم
      [], // قَرنًا
      [] // ءاخَرينَ
    ],
    [ // آية 7
      [], // وَلَو
      [], // نَزَّلنا
      [], // عَلَيكَ
      [], // كِتـٰبًا
      [], // فى
      [], // قِرطاسٍ
      [], // فَلَمَسوهُ
      [], // بِأَيديهِم
      [], // لَقالَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 8
      [], // وَقالوا
      [], // لَولا
      [], // أُنزِلَ
      [], // عَلَيهِ
      [], // مَلَكٌ
      [], // وَلَو
      [], // أَنزَلنا
      [], // مَلَكًا
      [], // لَقُضِىَ
      [], // الأَمرُ
      [], // ثُمَّ
      ["لا يُنظرون : لا يُمهلون لحظة بعد إنزاله"], // لا
      ["لا يُنظرون : لا يُمهلون لحظة بعد إنزاله"] // يُنظَرونَ
    ],
    [ // آية 9
      [], // وَلَو
      [], // جَعَلنـٰهُ
      [], // مَلَكًا
      [], // لَجَعَلنـٰهُ
      [], // رَجُلًا
      [], // وَلَلَبَسنا
      [], // عَلَيهِم
      [], // ما
      [] // يَلبِسونَ
    ],
    [ // آية 10
      [], // وَلَقَدِ
      [], // استُهزِئَ
      [], // بِرُسُلٍ
      [], // مِن
      [], // قَبلِكَ
      [], // فَحاقَ
      [], // بِالَّذينَ
      [], // سَخِروا
      [], // مِنهُم
      [], // ما
      [], // كانوا
      [], // بِهِ
      [] // يَستَهزِءونَ
    ],
    [ // آية 11
      [], // قُل
      [], // سيروا
      [], // فِى
      [], // الأَرضِ
      [], // ثُمَّ
      [], // انظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُكَذِّبينَ
    ],
    [ // آية 12
      [], // قُل
      [], // لِمَن
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // قُل
      [], // لِلَّهِ
      [], // كَتَبَ
      [], // عَلىٰ
      [], // نَفسِهِ
      [], // الرَّحمَةَ
      [], // لَيَجمَعَنَّكُم
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // لا
      [], // رَيبَ
      [], // فيهِ
      [], // الَّذينَ
      ["خسروا أنفسهم : أهلكوها و غبنوها بالكفر"], // خَسِروا
      ["خسروا أنفسهم : أهلكوها و غبنوها بالكفر"], // أَنفُسَهُم
      [], // فَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 13
      [], // وَلَهُ
      [], // ما
      [], // سَكَنَ
      [], // فِى
      [], // الَّيلِ
      [], // وَالنَّهارِ
      [], // وَهُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 14
      [], // قُل
      [], // أَغَيرَ
      [], // اللَّهِ
      [], // أَتَّخِذُ
      ["وليّا : ربّا معبودًا و ناصرًا معينا"], // وَلِيًّا
      [], // فاطِرِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَهُوَ
      [], // يُطعِمُ
      [], // وَلا
      [], // يُطعَمُ
      [], // قُل
      [], // إِنّى
      [], // أُمِرتُ
      [], // أَن
      [], // أَكونَ
      [], // أَوَّلَ
      ["من أسلم : خضع لله بالعبودية و انقاد له"], // مَن
      ["من أسلم : خضع لله بالعبودية و انقاد له"], // أَسلَمَ
      [], // وَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 15
      [], // قُل
      [], // إِنّى
      [], // أَخافُ
      [], // إِن
      [], // عَصَيتُ
      [], // رَبّى
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 16
      [], // مَن
      [], // يُصرَف
      [], // عَنهُ
      [], // يَومَئِذٍ
      [], // فَقَد
      [], // رَحِمَهُ
      [], // وَذٰلِكَ
      [], // الفَوزُ
      [] // المُبينُ
    ],
    [ // آية 17
      [], // وَإِن
      [], // يَمسَسكَ
      [], // اللَّهُ
      [], // بِضُرٍّ
      [], // فَلا
      [], // كاشِفَ
      [], // لَهُ
      [], // إِلّا
      [], // هُوَ
      [], // وَإِن
      [], // يَمسَسكَ
      [], // بِخَيرٍ
      [], // فَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 18
      [], // وَهُوَ
      [], // القاهِرُ
      [], // فَوقَ
      [], // عِبادِهِ
      [], // وَهُوَ
      [], // الحَكيمُ
      [] // الخَبيرُ
    ],
    [ // آية 19
      [], // قُل
      [], // أَىُّ
      [], // شَىءٍ
      [], // أَكبَرُ
      [], // شَهـٰدَةً
      [], // قُلِ
      [], // اللَّهُ
      [], // شَهيدٌ
      [], // بَينى
      [], // وَبَينَكُم
      [], // وَأوحِىَ
      [], // إِلَىَّ
      [], // هـٰذَا
      [], // القُرءانُ
      [], // لِأُنذِرَكُم
      [], // بِهِ
      [], // وَمَن
      [], // بَلَغَ
      [], // أَئِنَّكُم
      [], // لَتَشهَدونَ
      [], // أَنَّ
      [], // مَعَ
      [], // اللَّهِ
      [], // ءالِهَةً
      [], // أُخرىٰ
      [], // قُل
      [], // لا
      [], // أَشهَدُ
      [], // قُل
      [], // إِنَّما
      [], // هُوَ
      [], // إِلـٰهٌ
      [], // وٰحِدٌ
      [], // وَإِنَّنى
      [], // بَرىءٌ
      [], // مِمّا
      [] // تُشرِكونَ
    ],
    [ // آية 20
      [], // الَّذينَ
      [], // ءاتَينـٰهُمُ
      [], // الكِتـٰبَ
      [], // يَعرِفونَهُ
      [], // كَما
      [], // يَعرِفونَ
      [], // أَبناءَهُمُ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // فَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 21
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَو
      [], // كَذَّبَ
      [], // بِـٔايـٰتِهِ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 22
      [], // وَيَومَ
      [], // نَحشُرُهُم
      [], // جَميعًا
      [], // ثُمَّ
      [], // نَقولُ
      [], // لِلَّذينَ
      [], // أَشرَكوا
      [], // أَينَ
      [], // شُرَكاؤُكُمُ
      [], // الَّذينَ
      [], // كُنتُم
      [] // تَزعُمونَ
    ],
    [ // آية 23
      [], // ثُمَّ
      [], // لَم
      [], // تَكُن
      ["فتنتهم : معذرتهم . أو عاقبة شركهم"], // فِتنَتُهُم
      [], // إِلّا
      [], // أَن
      [], // قالوا
      [], // وَاللَّهِ
      [], // رَبِّنا
      [], // ما
      [], // كُنّا
      [] // مُشرِكينَ
    ],
    [ // آية 24
      [], // انظُر
      [], // كَيفَ
      [], // كَذَبوا
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // وَضَلَّ
      [], // عَنهُم
      ["ما كانوا يفترون : يكذبون – الأصنام و شفاعتهم"], // ما
      ["ما كانوا يفترون : يكذبون – الأصنام و شفاعتهم"], // كانوا
      ["ما كانوا يفترون : يكذبون – الأصنام و شفاعتهم"] // يَفتَرونَ
    ],
    [ // آية 25
      [], // وَمِنهُم
      [], // مَن
      [], // يَستَمِعُ
      [], // إِلَيكَ
      [], // وَجَعَلنا
      [], // عَلىٰ
      [], // قُلوبِهِم
      ["أكِنّة : أغطية كثيرة"], // أَكِنَّةً
      [], // أَن
      [], // يَفقَهوهُ
      [], // وَفى
      [], // ءاذانِهِم
      ["وقرا : صمما و ثِقلا في السّمع"], // وَقرًا
      [], // وَإِن
      [], // يَرَوا
      [], // كُلَّ
      [], // ءايَةٍ
      [], // لا
      [], // يُؤمِنوا
      [], // بِها
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءوكَ
      [], // يُجـٰدِلونَكَ
      [], // يَقولُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 26
      [], // وَهُم
      [], // يَنهَونَ
      [], // عَنهُ
      [], // وَيَنـَٔونَ
      [], // عَنهُ
      [], // وَإِن
      [], // يُهلِكونَ
      [], // إِلّا
      [], // أَنفُسَهُم
      [], // وَما
      [] // يَشعُرونَ
    ],
    [ // آية 27
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذ
      ["وُقفوا على النّار : عرّفوها ، أو حُبسوا على متنها"], // وُقِفوا
      ["وُقفوا على النّار : عرّفوها ، أو حُبسوا على متنها"], // عَلَى
      ["وُقفوا على النّار : عرّفوها ، أو حُبسوا على متنها"], // النّارِ
      [], // فَقالوا
      [], // يـٰلَيتَنا
      [], // نُرَدُّ
      [], // وَلا
      [], // نُكَذِّبَ
      [], // بِـٔايـٰتِ
      [], // رَبِّنا
      [], // وَنَكونَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 28
      [], // بَل
      [], // بَدا
      [], // لَهُم
      [], // ما
      [], // كانوا
      [], // يُخفونَ
      [], // مِن
      [], // قَبلُ
      [], // وَلَو
      [], // رُدّوا
      [], // لَعادوا
      [], // لِما
      [], // نُهوا
      [], // عَنهُ
      [], // وَإِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 29
      [], // وَقالوا
      [], // إِن
      [], // هِىَ
      [], // إِلّا
      [], // حَياتُنَا
      [], // الدُّنيا
      [], // وَما
      [], // نَحنُ
      [] // بِمَبعوثينَ
    ],
    [ // آية 30
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذ
      ["وُقفوا على ربّهم : حُبسوا على حُكمه تعالى للسّؤال"], // وُقِفوا
      ["وُقفوا على ربّهم : حُبسوا على حُكمه تعالى للسّؤال"], // عَلىٰ
      ["وُقفوا على ربّهم : حُبسوا على حُكمه تعالى للسّؤال"], // رَبِّهِم
      [], // قالَ
      [], // أَلَيسَ
      [], // هـٰذا
      [], // بِالحَقِّ
      [], // قالوا
      [], // بَلىٰ
      [], // وَرَبِّنا
      [], // قالَ
      [], // فَذوقُوا
      [], // العَذابَ
      [], // بِما
      [], // كُنتُم
      [] // تَكفُرونَ
    ],
    [ // آية 31
      [], // قَد
      [], // خَسِرَ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِلِقاءِ
      [], // اللَّهِ
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَتهُمُ
      [], // السّاعَةُ
      ["بغتة : فجأة من غير شعور"], // بَغتَةً
      [], // قالوا
      [], // يـٰحَسرَتَنا
      [], // عَلىٰ
      [], // ما
      ["فرّطنا فيها : قصّرنا و ضيّعنا في الحياة الدّنيا"], // فَرَّطنا
      ["فرّطنا فيها : قصّرنا و ضيّعنا في الحياة الدّنيا"], // فيها
      [], // وَهُم
      [], // يَحمِلونَ
      ["أوزارهم : ذنوبهم و خطاياهم"], // أَوزارَهُم
      [], // عَلىٰ
      [], // ظُهورِهِم
      [], // أَلا
      [], // ساءَ
      [], // ما
      [] // يَزِرونَ
    ],
    [ // آية 32
      [], // وَمَا
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // إِلّا
      [], // لَعِبٌ
      [], // وَلَهوٌ
      [], // وَلَلدّارُ
      [], // الـٔاخِرَةُ
      [], // خَيرٌ
      [], // لِلَّذينَ
      [], // يَتَّقونَ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 33
      [], // قَد
      [], // نَعلَمُ
      [], // إِنَّهُ
      [], // لَيَحزُنُكَ
      [], // الَّذى
      [], // يَقولونَ
      [], // فَإِنَّهُم
      [], // لا
      [], // يُكَذِّبونَكَ
      [], // وَلـٰكِنَّ
      [], // الظّـٰلِمينَ
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [] // يَجحَدونَ
    ],
    [ // آية 34
      [], // وَلَقَد
      [], // كُذِّبَت
      [], // رُسُلٌ
      [], // مِن
      [], // قَبلِكَ
      [], // فَصَبَروا
      [], // عَلىٰ
      [], // ما
      [], // كُذِّبوا
      [], // وَأوذوا
      [], // حَتّىٰ
      [], // أَتىٰهُم
      [], // نَصرُنا
      [], // وَلا
      [], // مُبَدِّلَ
      [], // لِكَلِمـٰتِ
      [], // اللَّهِ
      [], // وَلَقَد
      [], // جاءَكَ
      [], // مِن
      [], // نَبَإِي۟
      [] // المُرسَلينَ
    ],
    [ // آية 35
      [], // وَإِن
      [], // كانَ
      ["كبُر عليك : شقّ و عظُم عليك"], // كَبُرَ
      ["كبُر عليك : شقّ و عظُم عليك"], // عَلَيكَ
      [], // إِعراضُهُم
      [], // فَإِنِ
      [], // استَطَعتَ
      [], // أَن
      [], // تَبتَغِىَ
      [], // نَفَقًا
      [], // فِى
      [], // الأَرضِ
      [], // أَو
      [], // سُلَّمًا
      [], // فِى
      [], // السَّماءِ
      [], // فَتَأتِيَهُم
      [], // بِـٔايَةٍ
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // لَجَمَعَهُم
      [], // عَلَى
      [], // الهُدىٰ
      [], // فَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [] // الجـٰهِلينَ
    ],
    [ // آية 36
      [], // إِنَّما
      [], // يَستَجيبُ
      [], // الَّذينَ
      [], // يَسمَعونَ
      [], // وَالمَوتىٰ
      [], // يَبعَثُهُمُ
      [], // اللَّهُ
      [], // ثُمَّ
      [], // إِلَيهِ
      [] // يُرجَعونَ
    ],
    [ // آية 37
      [], // وَقالوا
      [], // لَولا
      [], // نُزِّلَ
      [], // عَلَيهِ
      [], // ءايَةٌ
      [], // مِن
      [], // رَبِّهِ
      [], // قُل
      [], // إِنَّ
      [], // اللَّهَ
      [], // قادِرٌ
      [], // عَلىٰ
      [], // أَن
      [], // يُنَزِّلَ
      [], // ءايَةً
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 38
      [], // وَما
      [], // مِن
      [], // دابَّةٍ
      [], // فِى
      [], // الأَرضِ
      [], // وَلا
      [], // طـٰئِرٍ
      [], // يَطيرُ
      [], // بِجَناحَيهِ
      [], // إِلّا
      ["أممٌ أمثالكم : في خلقنا لها و تدبيرنا أمورها"], // أُمَمٌ
      ["أممٌ أمثالكم : في خلقنا لها و تدبيرنا أمورها"], // أَمثالُكُم
      [], // ما
      [], // فَرَّطنا
      [], // فِى
      [], // الكِتـٰبِ
      [], // مِن
      [], // شَىءٍ
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّهِم
      [] // يُحشَرونَ
    ],
    [ // آية 39
      [], // وَالَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // صُمٌّ
      [], // وَبُكمٌ
      [], // فِى
      [], // الظُّلُمـٰتِ
      [], // مَن
      [], // يَشَإِ
      [], // اللَّهُ
      [], // يُضلِلهُ
      [], // وَمَن
      [], // يَشَأ
      [], // يَجعَلهُ
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 40
      [], // قُل
      [], // أَرَءَيتَكُم
      [], // إِن
      [], // أَتىٰكُم
      [], // عَذابُ
      [], // اللَّهِ
      [], // أَو
      [], // أَتَتكُمُ
      [], // السّاعَةُ
      [], // أَغَيرَ
      [], // اللَّهِ
      [], // تَدعونَ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 41
      [], // بَل
      [], // إِيّاهُ
      [], // تَدعونَ
      [], // فَيَكشِفُ
      [], // ما
      [], // تَدعونَ
      [], // إِلَيهِ
      [], // إِن
      [], // شاءَ
      [], // وَتَنسَونَ
      [], // ما
      [] // تُشرِكونَ
    ],
    [ // آية 42
      [], // وَلَقَد
      [], // أَرسَلنا
      [], // إِلىٰ
      [], // أُمَمٍ
      [], // مِن
      [], // قَبلِكَ
      [], // فَأَخَذنـٰهُم
      [], // بِالبَأساءِ
      [], // وَالضَّرّاءِ
      [], // لَعَلَّهُم
      ["يتضرّعون : يتذلّلون و يتخشّعون و يتوبون"] // يَتَضَرَّعونَ
    ],
    [ // آية 43
      [], // فَلَولا
      [], // إِذ
      ["جاءهم بأسنا : أتاهم عذابنا"], // جاءَهُم
      ["جاءهم بأسنا : أتاهم عذابنا"], // بَأسُنا
      [], // تَضَرَّعوا
      [], // وَلـٰكِن
      [], // قَسَت
      [], // قُلوبُهُم
      [], // وَزَيَّنَ
      [], // لَهُمُ
      [], // الشَّيطـٰنُ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 44
      [], // فَلَمّا
      [], // نَسوا
      [], // ما
      [], // ذُكِّروا
      [], // بِهِ
      [], // فَتَحنا
      [], // عَلَيهِم
      [], // أَبوٰبَ
      [], // كُلِّ
      [], // شَىءٍ
      [], // حَتّىٰ
      [], // إِذا
      [], // فَرِحوا
      [], // بِما
      [], // أوتوا
      [], // أَخَذنـٰهُم
      [], // بَغتَةً
      [], // فَإِذا
      ["هم مبلسون : آيسون من الرّحمة أو مُكتئبون"], // هُم
      ["هم مبلسون : آيسون من الرّحمة أو مُكتئبون"] // مُبلِسونَ
    ],
    [ // آية 45
      [], // فَقُطِعَ
      ["دابر القوم : آخرهم"], // دابِرُ
      ["دابر القوم : آخرهم"], // القَومِ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // وَالحَمدُ
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 46
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // أَخَذَ
      [], // اللَّهُ
      [], // سَمعَكُم
      [], // وَأَبصـٰرَكُم
      [], // وَخَتَمَ
      [], // عَلىٰ
      [], // قُلوبِكُم
      [], // مَن
      [], // إِلـٰهٌ
      [], // غَيرُ
      [], // اللَّهِ
      [], // يَأتيكُم
      [], // بِهِ
      [], // انظُر
      [], // كَيفَ
      [], // نُصَرِّفُ
      [], // الـٔايـٰتِ
      [], // ثُمَّ
      ["هم يصدفون : هم يُعرضون عنها و يعدلون"], // هُم
      ["هم يصدفون : هم يُعرضون عنها و يعدلون"] // يَصدِفونَ
    ],
    [ // آية 47
      [], // قُل
      [], // أَرَءَيتَكُم
      [], // إِن
      [], // أَتىٰكُم
      [], // عَذابُ
      [], // اللَّهِ
      ["بغتة : فجاءة أو ليلا"], // بَغتَةً
      [], // أَو
      ["جهرة : مُعاينة أو نهارا"], // جَهرَةً
      [], // هَل
      [], // يُهلَكُ
      [], // إِلَّا
      [], // القَومُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 48
      [], // وَما
      [], // نُرسِلُ
      [], // المُرسَلينَ
      [], // إِلّا
      [], // مُبَشِّرينَ
      [], // وَمُنذِرينَ
      [], // فَمَن
      [], // ءامَنَ
      [], // وَأَصلَحَ
      [], // فَلا
      [], // خَوفٌ
      [], // عَلَيهِم
      [], // وَلا
      [], // هُم
      [] // يَحزَنونَ
    ],
    [ // آية 49
      [], // وَالَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // يَمَسُّهُمُ
      [], // العَذابُ
      [], // بِما
      [], // كانوا
      [] // يَفسُقونَ
    ],
    [ // آية 50
      [], // قُل
      [], // لا
      [], // أَقولُ
      [], // لَكُم
      [], // عِندى
      ["خزائن الله : مرزوقاته أو مقدوراته"], // خَزائِنُ
      ["خزائن الله : مرزوقاته أو مقدوراته"], // اللَّهِ
      [], // وَلا
      [], // أَعلَمُ
      [], // الغَيبَ
      [], // وَلا
      [], // أَقولُ
      [], // لَكُم
      [], // إِنّى
      [], // مَلَكٌ
      [], // إِن
      [], // أَتَّبِعُ
      [], // إِلّا
      [], // ما
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // قُل
      [], // هَل
      [], // يَستَوِى
      [], // الأَعمىٰ
      [], // وَالبَصيرُ
      [], // أَفَلا
      [] // تَتَفَكَّرونَ
    ],
    [ // آية 51
      [], // وَأَنذِر
      [], // بِهِ
      [], // الَّذينَ
      [], // يَخافونَ
      [], // أَن
      [], // يُحشَروا
      [], // إِلىٰ
      [], // رَبِّهِم
      [], // لَيسَ
      [], // لَهُم
      [], // مِن
      [], // دونِهِ
      [], // وَلِىٌّ
      [], // وَلا
      [], // شَفيعٌ
      [], // لَعَلَّهُم
      [] // يَتَّقونَ
    ],
    [ // آية 52
      [], // وَلا
      [], // تَطرُدِ
      [], // الَّذينَ
      [], // يَدعونَ
      [], // رَبَّهُم
      [], // بِالغَدوٰةِ
      [], // وَالعَشِىِّ
      [], // يُريدونَ
      [], // وَجهَهُ
      [], // ما
      [], // عَلَيكَ
      [], // مِن
      [], // حِسابِهِم
      [], // مِن
      [], // شَىءٍ
      [], // وَما
      [], // مِن
      [], // حِسابِكَ
      [], // عَلَيهِم
      [], // مِن
      [], // شَىءٍ
      [], // فَتَطرُدَهُم
      [], // فَتَكونَ
      [], // مِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 53
      [], // وَكَذٰلِكَ
      ["فتنّا : ابتلينا و امتحنّا و نحن أعلم بهم"], // فَتَنّا
      [], // بَعضَهُم
      [], // بِبَعضٍ
      [], // لِيَقولوا
      [], // أَهـٰؤُلاءِ
      [], // مَنَّ
      [], // اللَّهُ
      [], // عَلَيهِم
      [], // مِن
      [], // بَينِنا
      [], // أَلَيسَ
      [], // اللَّهُ
      [], // بِأَعلَمَ
      [] // بِالشّـٰكِرينَ
    ],
    [ // آية 54
      [], // وَإِذا
      [], // جاءَكَ
      [], // الَّذينَ
      [], // يُؤمِنونَ
      [], // بِـٔايـٰتِنا
      [], // فَقُل
      [], // سَلـٰمٌ
      [], // عَلَيكُم
      [], // كَتَبَ
      [], // رَبُّكُم
      [], // عَلىٰ
      [], // نَفسِهِ
      [], // الرَّحمَةَ
      [], // أَنَّهُ
      [], // مَن
      [], // عَمِلَ
      [], // مِنكُم
      [], // سوءًا
      [], // بِجَهـٰلَةٍ
      [], // ثُمَّ
      [], // تابَ
      [], // مِن
      [], // بَعدِهِ
      [], // وَأَصلَحَ
      [], // فَأَنَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 55
      [], // وَكَذٰلِكَ
      [], // نُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // وَلِتَستَبينَ
      [], // سَبيلُ
      [] // المُجرِمينَ
    ],
    [ // آية 56
      [], // قُل
      [], // إِنّى
      [], // نُهيتُ
      [], // أَن
      [], // أَعبُدَ
      [], // الَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // قُل
      [], // لا
      [], // أَتَّبِعُ
      [], // أَهواءَكُم
      [], // قَد
      [], // ضَلَلتُ
      [], // إِذًا
      [], // وَما
      [], // أَنا۠
      [], // مِنَ
      [] // المُهتَدينَ
    ],
    [ // آية 57
      [], // قُل
      [], // إِنّى
      [], // عَلىٰ
      [], // بَيِّنَةٍ
      [], // مِن
      [], // رَبّى
      [], // وَكَذَّبتُم
      [], // بِهِ
      [], // ما
      [], // عِندى
      [], // ما
      [], // تَستَعجِلونَ
      [], // بِهِ
      [], // إِنِ
      [], // الحُكمُ
      [], // إِلّا
      [], // لِلَّهِ
      ["يقصّ الحقّ : يتبعه فيما يحكم به أو يُبيّنه بيانا شافيا"], // يَقُصُّ
      ["يقصّ الحقّ : يتبعه فيما يحكم به أو يُبيّنه بيانا شافيا"], // الحَقَّ
      [], // وَهُوَ
      [], // خَيرُ
      [] // الفـٰصِلينَ
    ],
    [ // آية 58
      [], // قُل
      [], // لَو
      [], // أَنَّ
      [], // عِندى
      [], // ما
      [], // تَستَعجِلونَ
      [], // بِهِ
      [], // لَقُضِىَ
      [], // الأَمرُ
      [], // بَينى
      [], // وَبَينَكُم
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [] // بِالظّـٰلِمينَ
    ],
    [ // آية 59
      [], // وَعِندَهُ
      [], // مَفاتِحُ
      [], // الغَيبِ
      [], // لا
      [], // يَعلَمُها
      [], // إِلّا
      [], // هُوَ
      [], // وَيَعلَمُ
      [], // ما
      [], // فِى
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // وَما
      [], // تَسقُطُ
      [], // مِن
      [], // وَرَقَةٍ
      [], // إِلّا
      [], // يَعلَمُها
      [], // وَلا
      [], // حَبَّةٍ
      [], // فى
      [], // ظُلُمـٰتِ
      [], // الأَرضِ
      [], // وَلا
      [], // رَطبٍ
      [], // وَلا
      [], // يابِسٍ
      [], // إِلّا
      [], // فى
      [], // كِتـٰبٍ
      [] // مُبينٍ
    ],
    [ // آية 60
      [], // وَهُوَ
      [], // الَّذى
      [], // يَتَوَفّىٰكُم
      [], // بِالَّيلِ
      [], // وَيَعلَمُ
      [], // ما
      ["جرحتم بالنّهار : كسبتم فيه بجوارحكم من الإثم"], // جَرَحتُم
      ["جرحتم بالنّهار : كسبتم فيه بجوارحكم من الإثم"], // بِالنَّهارِ
      [], // ثُمَّ
      [], // يَبعَثُكُم
      [], // فيهِ
      [], // لِيُقضىٰ
      [], // أَجَلٌ
      [], // مُسَمًّى
      [], // ثُمَّ
      [], // إِلَيهِ
      [], // مَرجِعُكُم
      [], // ثُمَّ
      [], // يُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 61
      [], // وَهُوَ
      [], // القاهِرُ
      [], // فَوقَ
      [], // عِبادِهِ
      [], // وَيُرسِلُ
      [], // عَلَيكُم
      [], // حَفَظَةً
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَ
      [], // أَحَدَكُمُ
      [], // المَوتُ
      [], // تَوَفَّتهُ
      [], // رُسُلُنا
      [], // وَهُم
      ["لا يفرّطون : لا يتوانون أو لا يُقصّرون"], // لا
      ["لا يفرّطون : لا يتوانون أو لا يُقصّرون"] // يُفَرِّطونَ
    ],
    [ // آية 62
      [], // ثُمَّ
      [], // رُدّوا
      [], // إِلَى
      [], // اللَّهِ
      [], // مَولىٰهُمُ
      [], // الحَقِّ
      [], // أَلا
      [], // لَهُ
      [], // الحُكمُ
      [], // وَهُوَ
      [], // أَسرَعُ
      [] // الحـٰسِبينَ
    ],
    [ // آية 63
      [], // قُل
      [], // مَن
      [], // يُنَجّيكُم
      [], // مِن
      [], // ظُلُمـٰتِ
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // تَدعونَهُ
      ["تضرّعا : مُعلنين الضّراعة و التذلّل له"], // تَضَرُّعًا
      [], // وَخُفيَةً
      [], // لَئِن
      [], // أَنجىٰنا
      [], // مِن
      [], // هـٰذِهِ
      [], // لَنَكونَنَّ
      [], // مِنَ
      [] // الشّـٰكِرينَ
    ],
    [ // آية 64
      [], // قُلِ
      [], // اللَّهُ
      [], // يُنَجّيكُم
      [], // مِنها
      [], // وَمِن
      [], // كُلِّ
      [], // كَربٍ
      [], // ثُمَّ
      [], // أَنتُم
      [] // تُشرِكونَ
    ],
    [ // آية 65
      [], // قُل
      [], // هُوَ
      [], // القادِرُ
      [], // عَلىٰ
      [], // أَن
      [], // يَبعَثَ
      [], // عَلَيكُم
      [], // عَذابًا
      [], // مِن
      [], // فَوقِكُم
      [], // أَو
      [], // مِن
      [], // تَحتِ
      [], // أَرجُلِكُم
      [], // أَو
      ["يلبسكم : يخلطكم في ملاحم القتال"], // يَلبِسَكُم
      ["شيعا : فِرقا مُختلفة الأهواء"], // شِيَعًا
      [], // وَيُذيقَ
      [], // بَعضَكُم
      ["بأس بعض : شدّة بعض في القتال"], // بَأسَ
      ["بأس بعض : شدّة بعض في القتال"], // بَعضٍ
      [], // انظُر
      [], // كَيفَ
      [], // نُصَرِّفُ
      [], // الـٔايـٰتِ
      [], // لَعَلَّهُم
      [] // يَفقَهونَ
    ],
    [ // آية 66
      [], // وَكَذَّبَ
      [], // بِهِ
      [], // قَومُكَ
      [], // وَهُوَ
      [], // الحَقُّ
      [], // قُل
      [], // لَستُ
      [], // عَلَيكُم
      ["بوكيل : بحفيظ وكّل إليّ أمركم فأجازيكم"] // بِوَكيلٍ
    ],
    [ // آية 67
      [], // لِكُلِّ
      [], // نَبَإٍ
      [], // مُستَقَرٌّ
      [], // وَسَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 68
      [], // وَإِذا
      [], // رَأَيتَ
      [], // الَّذينَ
      ["يخوضون : يأخذون في الاستهزاء و الطّعن"], // يَخوضونَ
      [], // فى
      [], // ءايـٰتِنا
      [], // فَأَعرِض
      [], // عَنهُم
      [], // حَتّىٰ
      [], // يَخوضوا
      [], // فى
      [], // حَديثٍ
      [], // غَيرِهِ
      [], // وَإِمّا
      [], // يُنسِيَنَّكَ
      [], // الشَّيطـٰنُ
      [], // فَلا
      [], // تَقعُد
      [], // بَعدَ
      [], // الذِّكرىٰ
      [], // مَعَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 69
      [], // وَما
      [], // عَلَى
      [], // الَّذينَ
      [], // يَتَّقونَ
      [], // مِن
      [], // حِسابِهِم
      [], // مِن
      [], // شَىءٍ
      [], // وَلـٰكِن
      [], // ذِكرىٰ
      [], // لَعَلَّهُم
      [] // يَتَّقونَ
    ],
    [ // آية 70
      [], // وَذَرِ
      [], // الَّذينَ
      [], // اتَّخَذوا
      [], // دينَهُم
      [], // لَعِبًا
      [], // وَلَهوًا
      [], // وَغَرَّتهُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // وَذَكِّر
      [], // بِهِ
      ["أن تُبسل نفس : لئلاّ تحبس في النّار أو تسلم للهلكة"], // أَن
      ["أن تُبسل نفس : لئلاّ تحبس في النّار أو تسلم للهلكة"], // تُبسَلَ
      ["أن تُبسل نفس : لئلاّ تحبس في النّار أو تسلم للهلكة"], // نَفسٌ
      [], // بِما
      [], // كَسَبَت
      [], // لَيسَ
      [], // لَها
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلِىٌّ
      [], // وَلا
      [], // شَفيعٌ
      [], // وَإِن
      ["تعدل كلّ عدل : تفتد بكلّ فداء"], // تَعدِل
      ["تعدل كلّ عدل : تفتد بكلّ فداء"], // كُلَّ
      ["تعدل كلّ عدل : تفتد بكلّ فداء"], // عَدلٍ
      [], // لا
      [], // يُؤخَذ
      [], // مِنها
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // أُبسِلوا
      [], // بِما
      [], // كَسَبوا
      [], // لَهُم
      [], // شَرابٌ
      [], // مِن
      [], // حَميمٍ
      [], // وَعَذابٌ
      [], // أَليمٌ
      [], // بِما
      [], // كانوا
      [] // يَكفُرونَ
    ],
    [ // آية 71
      [], // قُل
      [], // أَنَدعوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [], // يَنفَعُنا
      [], // وَلا
      [], // يَضُرُّنا
      [], // وَنُرَدُّ
      [], // عَلىٰ
      [], // أَعقابِنا
      [], // بَعدَ
      [], // إِذ
      [], // هَدىٰنَا
      [], // اللَّهُ
      [], // كَالَّذِى
      [], // استَهوَتهُ
      [], // الشَّيـٰطينُ
      [], // فِى
      [], // الأَرضِ
      [], // حَيرانَ
      [], // لَهُ
      [], // أَصحـٰبٌ
      [], // يَدعونَهُ
      [], // إِلَى
      [], // الهُدَى
      [], // ائتِنا
      [], // قُل
      [], // إِنَّ
      [], // هُدَى
      [], // اللَّهِ
      [], // هُوَ
      [], // الهُدىٰ
      [], // وَأُمِرنا
      [], // لِنُسلِمَ
      [], // لِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 72
      [], // وَأَن
      [], // أَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَاتَّقوهُ
      [], // وَهُوَ
      [], // الَّذى
      [], // إِلَيهِ
      [] // تُحشَرونَ
    ],
    [ // آية 73
      [], // وَهُوَ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // بِالحَقِّ
      [], // وَيَومَ
      [], // يَقولُ
      [], // كُن
      [], // فَيَكونُ
      [], // قَولُهُ
      [], // الحَقُّ
      [], // وَلَهُ
      [], // المُلكُ
      [], // يَومَ
      [], // يُنفَخُ
      [], // فِى
      [], // الصّورِ
      [], // عـٰلِمُ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // وَهُوَ
      [], // الحَكيمُ
      [] // الخَبيرُ
    ],
    [ // آية 74
      [], // وَإِذ
      [], // قالَ
      [], // إِبرٰهيمُ
      [], // لِأَبيهِ
      [], // ءازَرَ
      [], // أَتَتَّخِذُ
      [], // أَصنامًا
      [], // ءالِهَةً
      [], // إِنّى
      [], // أَرىٰكَ
      [], // وَقَومَكَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 75
      [], // وَكَذٰلِكَ
      [], // نُرى
      [], // إِبرٰهيمَ
      [], // مَلَكوتَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلِيَكونَ
      [], // مِنَ
      [] // الموقِنينَ
    ],
    [ // آية 76
      [], // فَلَمّا
      [], // جَنَّ
      [], // عَلَيهِ
      [], // الَّيلُ
      [], // رَءا
      [], // كَوكَبًا
      [], // قالَ
      [], // هـٰذا
      [], // رَبّى
      [], // فَلَمّا
      [], // أَفَلَ
      [], // قالَ
      [], // لا
      [], // أُحِبُّ
      [] // الـٔافِلينَ
    ],
    [ // آية 77
      [], // فَلَمّا
      [], // رَءَا
      [], // القَمَرَ
      ["بازغا : طالعا من الأفق مُنتشر الضّوء"], // بازِغًا
      [], // قالَ
      [], // هـٰذا
      [], // رَبّى
      [], // فَلَمّا
      [], // أَفَلَ
      [], // قالَ
      [], // لَئِن
      [], // لَم
      [], // يَهدِنى
      [], // رَبّى
      [], // لَأَكونَنَّ
      [], // مِنَ
      [], // القَومِ
      [] // الضّالّينَ
    ],
    [ // آية 78
      [], // فَلَمّا
      [], // رَءَا
      [], // الشَّمسَ
      [], // بازِغَةً
      [], // قالَ
      [], // هـٰذا
      [], // رَبّى
      [], // هـٰذا
      [], // أَكبَرُ
      [], // فَلَمّا
      [], // أَفَلَت
      [], // قالَ
      [], // يـٰقَومِ
      [], // إِنّى
      [], // بَرىءٌ
      [], // مِمّا
      [] // تُشرِكونَ
    ],
    [ // آية 79
      [], // إِنّى
      [], // وَجَّهتُ
      [], // وَجهِىَ
      [], // لِلَّذى
      [], // فَطَرَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      ["حنيفا : مائلا عن الباطل إلى الدّين الحقّ"], // حَنيفًا
      [], // وَما
      [], // أَنا۠
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 80
      [], // وَحاجَّهُ
      [], // قَومُهُ
      [], // قالَ
      [], // أَتُحـٰجّونّى
      [], // فِى
      [], // اللَّهِ
      [], // وَقَد
      [], // هَدىٰنِ
      [], // وَلا
      [], // أَخافُ
      [], // ما
      [], // تُشرِكونَ
      [], // بِهِ
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // رَبّى
      [], // شَيـًٔا
      [], // وَسِعَ
      [], // رَبّى
      [], // كُلَّ
      [], // شَىءٍ
      [], // عِلمًا
      [], // أَفَلا
      [] // تَتَذَكَّرونَ
    ],
    [ // آية 81
      [], // وَكَيفَ
      [], // أَخافُ
      [], // ما
      [], // أَشرَكتُم
      [], // وَلا
      [], // تَخافونَ
      [], // أَنَّكُم
      [], // أَشرَكتُم
      [], // بِاللَّهِ
      [], // ما
      [], // لَم
      [], // يُنَزِّل
      [], // بِهِ
      [], // عَلَيكُم
      [], // سُلطـٰنًا
      [], // فَأَىُّ
      [], // الفَريقَينِ
      [], // أَحَقُّ
      [], // بِالأَمنِ
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 82
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَلَم
      [], // يَلبِسوا
      [], // إيمـٰنَهُم
      ["بظلم : بشرك . بكفر"], // بِظُلمٍ
      [], // أُولـٰئِكَ
      [], // لَهُمُ
      [], // الأَمنُ
      [], // وَهُم
      [] // مُهتَدونَ
    ],
    [ // آية 83
      [], // وَتِلكَ
      [], // حُجَّتُنا
      [], // ءاتَينـٰها
      [], // إِبرٰهيمَ
      [], // عَلىٰ
      [], // قَومِهِ
      [], // نَرفَعُ
      [], // دَرَجـٰتٍ
      [], // مَن
      [], // نَشاءُ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // حَكيمٌ
      [] // عَليمٌ
    ],
    [ // آية 84
      [], // وَوَهَبنا
      [], // لَهُ
      [], // إِسحـٰقَ
      [], // وَيَعقوبَ
      [], // كُلًّا
      [], // هَدَينا
      [], // وَنوحًا
      [], // هَدَينا
      [], // مِن
      [], // قَبلُ
      [], // وَمِن
      [], // ذُرِّيَّتِهِ
      [], // داوۥدَ
      [], // وَسُلَيمـٰنَ
      [], // وَأَيّوبَ
      [], // وَيوسُفَ
      [], // وَموسىٰ
      [], // وَهـٰرونَ
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 85
      [], // وَزَكَرِيّا
      [], // وَيَحيىٰ
      [], // وَعيسىٰ
      [], // وَإِلياسَ
      [], // كُلٌّ
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 86
      [], // وَإِسمـٰعيلَ
      [], // وَاليَسَعَ
      [], // وَيونُسَ
      [], // وَلوطًا
      [], // وَكُلًّا
      [], // فَضَّلنا
      [], // عَلَى
      [] // العـٰلَمينَ
    ],
    [ // آية 87
      [], // وَمِن
      [], // ءابائِهِم
      [], // وَذُرِّيّـٰتِهِم
      [], // وَإِخوٰنِهِم
      [], // وَاجتَبَينـٰهُم
      [], // وَهَدَينـٰهُم
      [], // إِلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 88
      [], // ذٰلِكَ
      [], // هُدَى
      [], // اللَّهِ
      [], // يَهدى
      [], // بِهِ
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَلَو
      [], // أَشرَكوا
      [], // لَحَبِطَ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 89
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // ءاتَينـٰهُمُ
      [], // الكِتـٰبَ
      [], // وَالحُكمَ
      [], // وَالنُّبُوَّةَ
      [], // فَإِن
      [], // يَكفُر
      [], // بِها
      [], // هـٰؤُلاءِ
      [], // فَقَد
      [], // وَكَّلنا
      [], // بِها
      [], // قَومًا
      [], // لَيسوا
      [], // بِها
      [] // بِكـٰفِرينَ
    ],
    [ // آية 90
      [], // أُولـٰئِكَ
      [], // الَّذينَ
      [], // هَدَى
      [], // اللَّهُ
      [], // فَبِهُدىٰهُمُ
      [], // اقتَدِه
      [], // قُل
      [], // لا
      [], // أَسـَٔلُكُم
      [], // عَلَيهِ
      [], // أَجرًا
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرىٰ
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 91
      [], // وَما
      [], // قَدَرُوا
      [], // اللَّهَ
      [], // حَقَّ
      [], // قَدرِهِ
      [], // إِذ
      [], // قالوا
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // بَشَرٍ
      [], // مِن
      [], // شَىءٍ
      [], // قُل
      [], // مَن
      [], // أَنزَلَ
      [], // الكِتـٰبَ
      [], // الَّذى
      [], // جاءَ
      [], // بِهِ
      [], // موسىٰ
      [], // نورًا
      [], // وَهُدًى
      [], // لِلنّاسِ
      [], // تَجعَلونَهُ
      [], // قَراطيسَ
      [], // تُبدونَها
      [], // وَتُخفونَ
      [], // كَثيرًا
      [], // وَعُلِّمتُم
      [], // ما
      [], // لَم
      [], // تَعلَموا
      [], // أَنتُم
      [], // وَلا
      [], // ءاباؤُكُم
      ["قل الله : قل الله أنزله (التوراة)"], // قُلِ
      ["قل الله : قل الله أنزله (التوراة)"], // اللَّهُ
      [], // ثُمَّ
      [], // ذَرهُم
      [], // فى
      ["خوضهم : باطلهم"], // خَوضِهِم
      [] // يَلعَبونَ
    ],
    [ // آية 92
      [], // وَهـٰذا
      [], // كِتـٰبٌ
      [], // أَنزَلنـٰهُ
      ["مبارك : كثير المنافع و الفوائد (القرآن)"], // مُبارَكٌ
      [], // مُصَدِّقُ
      [], // الَّذى
      [], // بَينَ
      [], // يَدَيهِ
      [], // وَلِتُنذِرَ
      ["أم القرى : مكّة : أي أهلها"], // أُمَّ
      ["أم القرى : مكّة : أي أهلها"], // القُرىٰ
      [], // وَمَن
      [], // حَولَها
      [], // وَالَّذينَ
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // يُؤمِنونَ
      [], // بِهِ
      [], // وَهُم
      [], // عَلىٰ
      [], // صَلاتِهِم
      [] // يُحافِظونَ
    ],
    [ // آية 93
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَو
      [], // قالَ
      [], // أوحِىَ
      [], // إِلَىَّ
      [], // وَلَم
      [], // يوحَ
      [], // إِلَيهِ
      [], // شَىءٌ
      [], // وَمَن
      [], // قالَ
      [], // سَأُنزِلُ
      [], // مِثلَ
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذِ
      [], // الظّـٰلِمونَ
      [], // فى
      [], // غَمَرٰتِ
      [], // المَوتِ
      [], // وَالمَلـٰئِكَةُ
      [], // باسِطوا
      [], // أَيديهِم
      ["أخرجوا أنفسكم : خلّصوها ممّا هي فيه من العذاب"], // أَخرِجوا
      ["أخرجوا أنفسكم : خلّصوها ممّا هي فيه من العذاب"], // أَنفُسَكُمُ
      [], // اليَومَ
      [], // تُجزَونَ
      ["عذاب الهون : الهوان الشّديد و الذّل و الخزي"], // عَذابَ
      ["عذاب الهون : الهوان الشّديد و الذّل و الخزي"], // الهونِ
      [], // بِما
      [], // كُنتُم
      [], // تَقولونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // غَيرَ
      [], // الحَقِّ
      [], // وَكُنتُم
      [], // عَن
      [], // ءايـٰتِهِ
      [] // تَستَكبِرونَ
    ],
    [ // آية 94
      [], // وَلَقَد
      [], // جِئتُمونا
      [], // فُرٰدىٰ
      [], // كَما
      [], // خَلَقنـٰكُم
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // وَتَرَكتُم
      [], // ما
      [], // خَوَّلنـٰكُم
      [], // وَراءَ
      [], // ظُهورِكُم
      [], // وَما
      [], // نَرىٰ
      [], // مَعَكُم
      [], // شُفَعاءَكُمُ
      [], // الَّذينَ
      [], // زَعَمتُم
      [], // أَنَّهُم
      [], // فيكُم
      [], // شُرَكـٰؤُا۟
      [], // لَقَد
      ["تقطّع بينكم : تفرّق الاتّصال بينكم"], // تَقَطَّعَ
      ["تقطّع بينكم : تفرّق الاتّصال بينكم"], // بَينَكُم
      [], // وَضَلَّ
      [], // عَنكُم
      [], // ما
      [], // كُنتُم
      [] // تَزعُمونَ
    ],
    [ // آية 95
      [], // إِنَّ
      [], // اللَّهَ
      ["فالق الحبّ : شاقّه عن النبات . أو خالقه"], // فالِقُ
      ["فالق الحبّ : شاقّه عن النبات . أو خالقه"], // الحَبِّ
      [], // وَالنَّوىٰ
      [], // يُخرِجُ
      [], // الحَىَّ
      [], // مِنَ
      [], // المَيِّتِ
      [], // وَمُخرِجُ
      [], // المَيِّتِ
      [], // مِنَ
      [], // الحَىِّ
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // فَأَنّىٰ
      [] // تُؤفَكونَ
    ],
    [ // آية 96
      ["فالق الإصباح : شاقّ ظلمته عن بياض النّهار أو خالقه"], // فالِقُ
      ["فالق الإصباح : شاقّ ظلمته عن بياض النّهار أو خالقه"], // الإِصباحِ
      [], // وَجَعَلَ
      [], // الَّيلَ
      [], // سَكَنًا
      [], // وَالشَّمسَ
      [], // وَالقَمَرَ
      [], // حُسبانًا
      [], // ذٰلِكَ
      [], // تَقديرُ
      [], // العَزيزِ
      [] // العَليمِ
    ],
    [ // آية 97
      [], // وَهُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      [], // النُّجومَ
      [], // لِتَهتَدوا
      [], // بِها
      [], // فى
      [], // ظُلُمـٰتِ
      [], // البَرِّ
      [], // وَالبَحرِ
      [], // قَد
      [], // فَصَّلنَا
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 98
      [], // وَهُوَ
      [], // الَّذى
      [], // أَنشَأَكُم
      [], // مِن
      [], // نَفسٍ
      [], // وٰحِدَةٍ
      ["فمستقرّ : في الأصلاب ، و فقيل في الأرحام و نحوها"], // فَمُستَقَرٌّ
      [], // وَمُستَودَعٌ
      [], // قَد
      [], // فَصَّلنَا
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَفقَهونَ
    ],
    [ // آية 99
      [], // وَهُوَ
      [], // الَّذى
      [], // أَنزَلَ
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // فَأَخرَجنا
      [], // بِهِ
      [], // نَباتَ
      [], // كُلِّ
      [], // شَىءٍ
      [], // فَأَخرَجنا
      [], // مِنهُ
      ["خضرا : شيئا أخضر غضّا"], // خَضِرًا
      [], // نُخرِجُ
      [], // مِنهُ
      ["حبّا مُتراكبا : متراكما كسنابل الحنطة و نحوها"], // حَبًّا
      ["حبّا مُتراكبا : متراكما كسنابل الحنطة و نحوها"], // مُتَراكِبًا
      [], // وَمِنَ
      [], // النَّخلِ
      [], // مِن
      ["طلعها : هو أوّل ما يخرج من ثمر النّخل في الكيزان"], // طَلعِها
      [], // قِنوانٌ
      ["دانية : متدلّية أو قريبة من المتناول"], // دانِيَةٌ
      [], // وَجَنّـٰتٍ
      [], // مِن
      [], // أَعنابٍ
      [], // وَالزَّيتونَ
      [], // وَالرُّمّانَ
      [], // مُشتَبِهًا
      [], // وَغَيرَ
      [], // مُتَشـٰبِهٍ
      [], // انظُروا
      [], // إِلىٰ
      [], // ثَمَرِهِ
      [], // إِذا
      [], // أَثمَرَ
      [], // وَيَنعِهِ
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكُم
      [], // لَـٔايـٰتٍ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 100
      [], // وَجَعَلوا
      [], // لِلَّهِ
      [], // شُرَكاءَ
      ["الجنّ : الشّياطين حيث أطاعوهم في الكفر"], // الجِنَّ
      [], // وَخَلَقَهُم
      [], // وَخَرَقوا
      [], // لَهُ
      [], // بَنينَ
      [], // وَبَنـٰتٍ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // سُبحـٰنَهُ
      [], // وَتَعـٰلىٰ
      [], // عَمّا
      [] // يَصِفونَ
    ],
    [ // آية 101
      [], // بَديعُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // أَنّىٰ
      [], // يَكونُ
      [], // لَهُ
      [], // وَلَدٌ
      [], // وَلَم
      [], // تَكُن
      [], // لَهُ
      [], // صـٰحِبَةٌ
      [], // وَخَلَقَ
      [], // كُلَّ
      [], // شَىءٍ
      [], // وَهُوَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 102
      [], // ذٰلِكُمُ
      [], // اللَّهُ
      [], // رَبُّكُم
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // خـٰلِقُ
      [], // كُلِّ
      [], // شَىءٍ
      [], // فَاعبُدوهُ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      ["وكيل : رقيب ز متولّ"] // وَكيلٌ
    ],
    [ // آية 103
      [], // لا
      [], // تُدرِكُهُ
      [], // الأَبصـٰرُ
      [], // وَهُوَ
      [], // يُدرِكُ
      [], // الأَبصـٰرَ
      [], // وَهُوَ
      [], // اللَّطيفُ
      [] // الخَبيرُ
    ],
    [ // آية 104
      [], // قَد
      [], // جاءَكُم
      ["بصائر : آيات و براهين تهدي للحقّ"], // بَصائِرُ
      [], // مِن
      [], // رَبِّكُم
      [], // فَمَن
      [], // أَبصَرَ
      [], // فَلِنَفسِهِ
      [], // وَمَن
      [], // عَمِىَ
      [], // فَعَلَيها
      [], // وَما
      [], // أَنا۠
      [], // عَلَيكُم
      [] // بِحَفيظٍ
    ],
    [ // آية 105
      [], // وَكَذٰلِكَ
      [], // نُصَرِّفُ
      [], // الـٔايـٰتِ
      [], // وَلِيَقولوا
      ["درست : قرأت و تعلّمت من أهل الكتاب"], // دَرَستَ
      [], // وَلِنُبَيِّنَهُ
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 106
      [], // اتَّبِع
      [], // ما
      [], // أوحِىَ
      [], // إِلَيكَ
      [], // مِن
      [], // رَبِّكَ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // وَأَعرِض
      [], // عَنِ
      [] // المُشرِكينَ
    ],
    [ // آية 107
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // ما
      [], // أَشرَكوا
      [], // وَما
      [], // جَعَلنـٰكَ
      [], // عَلَيهِم
      [], // حَفيظًا
      [], // وَما
      [], // أَنتَ
      [], // عَلَيهِم
      [] // بِوَكيلٍ
    ],
    [ // آية 108
      [], // وَلا
      [], // تَسُبُّوا
      [], // الَّذينَ
      [], // يَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // فَيَسُبُّوا
      [], // اللَّهَ
      ["عدوًا : اعتداء و ظلما"], // عَدوًا
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // كَذٰلِكَ
      [], // زَيَّنّا
      [], // لِكُلِّ
      [], // أُمَّةٍ
      [], // عَمَلَهُم
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّهِم
      [], // مَرجِعُهُم
      [], // فَيُنَبِّئُهُم
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 109
      [], // وَأَقسَموا
      [], // بِاللَّهِ
      [], // جَهدَ
      [], // أَيمـٰنِهِم
      [], // لَئِن
      [], // جاءَتهُم
      [], // ءايَةٌ
      [], // لَيُؤمِنُنَّ
      [], // بِها
      [], // قُل
      [], // إِنَّمَا
      [], // الـٔايـٰتُ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَما
      [], // يُشعِرُكُم
      [], // أَنَّها
      [], // إِذا
      [], // جاءَت
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 110
      [], // وَنُقَلِّبُ
      [], // أَفـِٔدَتَهُم
      [], // وَأَبصـٰرَهُم
      [], // كَما
      [], // لَم
      [], // يُؤمِنوا
      [], // بِهِ
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // وَنَذَرُهُم
      [], // فى
      [], // طُغيـٰنِهِم
      ["يعمهون : يعمون عن الرّشد أو يتحيّرون"] // يَعمَهونَ
    ],
    [ // آية 111
      [], // وَلَو
      [], // أَنَّنا
      [], // نَزَّلنا
      [], // إِلَيهِمُ
      [], // المَلـٰئِكَةَ
      [], // وَكَلَّمَهُمُ
      [], // المَوتىٰ
      [], // وَحَشَرنا
      [], // عَلَيهِم
      [], // كُلَّ
      [], // شَىءٍ
      ["قُبُلا : مُقابلة و مواجهة أو جماعة جماعة"], // قُبُلًا
      [], // ما
      [], // كانوا
      [], // لِيُؤمِنوا
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [] // يَجهَلونَ
    ],
    [ // آية 112
      [], // وَكَذٰلِكَ
      [], // جَعَلنا
      [], // لِكُلِّ
      [], // نَبِىٍّ
      [], // عَدُوًّا
      [], // شَيـٰطينَ
      [], // الإِنسِ
      [], // وَالجِنِّ
      [], // يوحى
      [], // بَعضُهُم
      [], // إِلىٰ
      [], // بَعضٍ
      ["زُخرف القول : باطله المُموّه المزوّق"], // زُخرُفَ
      ["زُخرف القول : باطله المُموّه المزوّق"], // القَولِ
      ["غرورا : خداعا و أخذا على الغرّة"], // غُرورًا
      [], // وَلَو
      [], // شاءَ
      [], // رَبُّكَ
      [], // ما
      [], // فَعَلوهُ
      [], // فَذَرهُم
      [], // وَما
      [] // يَفتَرونَ
    ],
    [ // آية 113
      [], // وَلِتَصغىٰ
      [], // إِلَيهِ
      [], // أَفـِٔدَةُ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // وَلِيَرضَوهُ
      [], // وَلِيَقتَرِفوا
      [], // ما
      [], // هُم
      [] // مُقتَرِفونَ
    ],
    [ // آية 114
      [], // أَفَغَيرَ
      [], // اللَّهِ
      [], // أَبتَغى
      [], // حَكَمًا
      [], // وَهُوَ
      [], // الَّذى
      [], // أَنزَلَ
      [], // إِلَيكُمُ
      [], // الكِتـٰبَ
      [], // مُفَصَّلًا
      [], // وَالَّذينَ
      [], // ءاتَينـٰهُمُ
      [], // الكِتـٰبَ
      [], // يَعلَمونَ
      [], // أَنَّهُ
      [], // مُنَزَّلٌ
      [], // مِن
      [], // رَبِّكَ
      [], // بِالحَقِّ
      [], // فَلا
      [], // تَكونَنَّ
      [], // مِنَ
      [] // المُمتَرينَ
    ],
    [ // آية 115
      [], // وَتَمَّت
      [], // كَلِمَتُ
      [], // رَبِّكَ
      [], // صِدقًا
      [], // وَعَدلًا
      [], // لا
      [], // مُبَدِّلَ
      [], // لِكَلِمـٰتِهِ
      [], // وَهُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 116
      [], // وَإِن
      [], // تُطِع
      [], // أَكثَرَ
      [], // مَن
      [], // فِى
      [], // الأَرضِ
      [], // يُضِلّوكَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // إِن
      [], // يَتَّبِعونَ
      [], // إِلَّا
      [], // الظَّنَّ
      [], // وَإِن
      [], // هُم
      [], // إِلّا
      ["يخرُصون : يكذبون فيما ينسُبونه إلى الله"] // يَخرُصونَ
    ],
    [ // آية 117
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // أَعلَمُ
      [], // مَن
      [], // يَضِلُّ
      [], // عَن
      [], // سَبيلِهِ
      [], // وَهُوَ
      [], // أَعلَمُ
      [] // بِالمُهتَدينَ
    ],
    [ // آية 118
      [], // فَكُلوا
      [], // مِمّا
      [], // ذُكِرَ
      [], // اسمُ
      [], // اللَّهِ
      [], // عَلَيهِ
      [], // إِن
      [], // كُنتُم
      [], // بِـٔايـٰتِهِ
      [] // مُؤمِنينَ
    ],
    [ // آية 119
      [], // وَما
      [], // لَكُم
      [], // أَلّا
      [], // تَأكُلوا
      [], // مِمّا
      [], // ذُكِرَ
      [], // اسمُ
      [], // اللَّهِ
      [], // عَلَيهِ
      [], // وَقَد
      [], // فَصَّلَ
      [], // لَكُم
      [], // ما
      [], // حَرَّمَ
      [], // عَلَيكُم
      [], // إِلّا
      [], // مَا
      [], // اضطُرِرتُم
      [], // إِلَيهِ
      [], // وَإِنَّ
      [], // كَثيرًا
      [], // لَيُضِلّونَ
      [], // بِأَهوائِهِم
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // أَعلَمُ
      [] // بِالمُعتَدينَ
    ],
    [ // آية 120
      [], // وَذَروا
      [], // ظـٰهِرَ
      [], // الإِثمِ
      [], // وَباطِنَهُ
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَكسِبونَ
      [], // الإِثمَ
      [], // سَيُجزَونَ
      [], // بِما
      [], // كانوا
      ["يقترفون : يكتسبون من الإثم أيّا كان"] // يَقتَرِفونَ
    ],
    [ // آية 121
      [], // وَلا
      [], // تَأكُلوا
      [], // مِمّا
      [], // لَم
      [], // يُذكَرِ
      [], // اسمُ
      [], // اللَّهِ
      [], // عَلَيهِ
      [], // وَإِنَّهُ
      [], // لَفِسقٌ
      [], // وَإِنَّ
      [], // الشَّيـٰطينَ
      [], // لَيوحونَ
      [], // إِلىٰ
      [], // أَولِيائِهِم
      [], // لِيُجـٰدِلوكُم
      [], // وَإِن
      [], // أَطَعتُموهُم
      [], // إِنَّكُم
      [] // لَمُشرِكونَ
    ],
    [ // آية 122
      [], // أَوَمَن
      [], // كانَ
      [], // مَيتًا
      [], // فَأَحيَينـٰهُ
      [], // وَجَعَلنا
      [], // لَهُ
      [], // نورًا
      [], // يَمشى
      [], // بِهِ
      [], // فِى
      [], // النّاسِ
      [], // كَمَن
      [], // مَثَلُهُ
      [], // فِى
      [], // الظُّلُمـٰتِ
      [], // لَيسَ
      [], // بِخارِجٍ
      [], // مِنها
      [], // كَذٰلِكَ
      [], // زُيِّنَ
      [], // لِلكـٰفِرينَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 123
      [], // وَكَذٰلِكَ
      [], // جَعَلنا
      [], // فى
      [], // كُلِّ
      [], // قَريَةٍ
      [], // أَكـٰبِرَ
      [], // مُجرِميها
      [], // لِيَمكُروا
      [], // فيها
      [], // وَما
      [], // يَمكُرونَ
      [], // إِلّا
      [], // بِأَنفُسِهِم
      [], // وَما
      [] // يَشعُرونَ
    ],
    [ // آية 124
      [], // وَإِذا
      [], // جاءَتهُم
      [], // ءايَةٌ
      [], // قالوا
      [], // لَن
      [], // نُؤمِنَ
      [], // حَتّىٰ
      [], // نُؤتىٰ
      [], // مِثلَ
      [], // ما
      [], // أوتِىَ
      [], // رُسُلُ
      [], // اللَّهِ
      [], // اللَّهُ
      [], // أَعلَمُ
      [], // حَيثُ
      [], // يَجعَلُ
      [], // رِسالَتَهُ
      [], // سَيُصيبُ
      [], // الَّذينَ
      [], // أَجرَموا
      [], // صَغارٌ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَعَذابٌ
      [], // شَديدٌ
      [], // بِما
      [], // كانوا
      [] // يَمكُرونَ
    ],
    [ // آية 125
      [], // فَمَن
      [], // يُرِدِ
      [], // اللَّهُ
      [], // أَن
      [], // يَهدِيَهُ
      [], // يَشرَح
      [], // صَدرَهُ
      [], // لِلإِسلـٰمِ
      [], // وَمَن
      [], // يُرِد
      [], // أَن
      [], // يُضِلَّهُ
      [], // يَجعَل
      [], // صَدرَهُ
      [], // ضَيِّقًا
      ["حرجًا : شديد الضّيق"], // حَرَجًا
      [], // كَأَنَّما
      [], // يَصَّعَّدُ
      [], // فِى
      [], // السَّماءِ
      [], // كَذٰلِكَ
      [], // يَجعَلُ
      [], // اللَّهُ
      [], // الرِّجسَ
      [], // عَلَى
      [], // الَّذينَ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 126
      [], // وَهـٰذا
      [], // صِرٰطُ
      [], // رَبِّكَ
      [], // مُستَقيمًا
      [], // قَد
      [], // فَصَّلنَا
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَذَّكَّرونَ
    ],
    [ // آية 127
      [], // لَهُم
      [], // دارُ
      [], // السَّلـٰمِ
      [], // عِندَ
      [], // رَبِّهِم
      [], // وَهُوَ
      [], // وَلِيُّهُم
      [], // بِما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 128
      [], // وَيَومَ
      [], // يَحشُرُهُم
      [], // جَميعًا
      [], // يـٰمَعشَرَ
      [], // الجِنِّ
      [], // قَدِ
      ["استكثرتم من الإنس : أكثرتم من دعوتهم للضّلال و الغواية"], // استَكثَرتُم
      ["استكثرتم من الإنس : أكثرتم من دعوتهم للضّلال و الغواية"], // مِنَ
      ["استكثرتم من الإنس : أكثرتم من دعوتهم للضّلال و الغواية"], // الإِنسِ
      [], // وَقالَ
      [], // أَولِياؤُهُم
      [], // مِنَ
      [], // الإِنسِ
      [], // رَبَّنَا
      [], // استَمتَعَ
      [], // بَعضُنا
      [], // بِبَعضٍ
      [], // وَبَلَغنا
      [], // أَجَلَنَا
      [], // الَّذى
      [], // أَجَّلتَ
      [], // لَنا
      [], // قالَ
      [], // النّارُ
      [], // مَثوىٰكُم
      [], // خـٰلِدينَ
      [], // فيها
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // اللَّهُ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // حَكيمٌ
      [] // عَليمٌ
    ],
    [ // آية 129
      [], // وَكَذٰلِكَ
      [], // نُوَلّى
      [], // بَعضَ
      [], // الظّـٰلِمينَ
      [], // بَعضًا
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 130
      [], // يـٰمَعشَرَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // أَلَم
      [], // يَأتِكُم
      [], // رُسُلٌ
      [], // مِنكُم
      [], // يَقُصّونَ
      [], // عَلَيكُم
      [], // ءايـٰتى
      [], // وَيُنذِرونَكُم
      [], // لِقاءَ
      [], // يَومِكُم
      [], // هـٰذا
      [], // قالوا
      [], // شَهِدنا
      [], // عَلىٰ
      [], // أَنفُسِنا
      [], // وَغَرَّتهُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // وَشَهِدوا
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // أَنَّهُم
      [], // كانوا
      [] // كـٰفِرينَ
    ],
    [ // آية 131
      [], // ذٰلِكَ
      [], // أَن
      [], // لَم
      [], // يَكُن
      [], // رَبُّكَ
      [], // مُهلِكَ
      [], // القُرىٰ
      [], // بِظُلمٍ
      [], // وَأَهلُها
      [] // غـٰفِلونَ
    ],
    [ // آية 132
      [], // وَلِكُلٍّ
      [], // دَرَجـٰتٌ
      [], // مِمّا
      [], // عَمِلوا
      [], // وَما
      [], // رَبُّكَ
      [], // بِغـٰفِلٍ
      [], // عَمّا
      [] // يَعمَلونَ
    ],
    [ // آية 133
      [], // وَرَبُّكَ
      [], // الغَنِىُّ
      [], // ذُو
      [], // الرَّحمَةِ
      [], // إِن
      [], // يَشَأ
      [], // يُذهِبكُم
      [], // وَيَستَخلِف
      [], // مِن
      [], // بَعدِكُم
      [], // ما
      [], // يَشاءُ
      [], // كَما
      [], // أَنشَأَكُم
      [], // مِن
      [], // ذُرِّيَّةِ
      [], // قَومٍ
      [] // ءاخَرينَ
    ],
    [ // آية 134
      [], // إِنَّ
      [], // ما
      [], // توعَدونَ
      [], // لَـٔاتٍ
      [], // وَما
      [], // أَنتُم
      [] // بِمُعجِزينَ
    ],
    [ // آية 135
      [], // قُل
      [], // يـٰقَومِ
      [], // اعمَلوا
      [], // عَلىٰ
      ["مكانتكم : غاية تمكّنكم و استطاعتكم"], // مَكانَتِكُم
      [], // إِنّى
      [], // عامِلٌ
      [], // فَسَوفَ
      [], // تَعلَمونَ
      [], // مَن
      [], // تَكونُ
      [], // لَهُ
      [], // عـٰقِبَةُ
      [], // الدّارِ
      [], // إِنَّهُ
      [], // لا
      [], // يُفلِحُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 136
      [], // وَجَعَلوا
      [], // لِلَّهِ
      [], // مِمّا
      ["ذرأ : خلق على وجه الإختراع"], // ذَرَأَ
      [], // مِنَ
      ["الحرث : الزّرع"], // الحَرثِ
      [], // وَالأَنعـٰمِ
      [], // نَصيبًا
      [], // فَقالوا
      [], // هـٰذا
      [], // لِلَّهِ
      [], // بِزَعمِهِم
      [], // وَهـٰذا
      [], // لِشُرَكائِنا
      [], // فَما
      [], // كانَ
      [], // لِشُرَكائِهِم
      [], // فَلا
      [], // يَصِلُ
      [], // إِلَى
      [], // اللَّهِ
      [], // وَما
      [], // كانَ
      [], // لِلَّهِ
      [], // فَهُوَ
      [], // يَصِلُ
      [], // إِلىٰ
      [], // شُرَكائِهِم
      [], // ساءَ
      [], // ما
      [] // يَحكُمونَ
    ],
    [ // آية 137
      [], // وَكَذٰلِكَ
      [], // زَيَّنَ
      [], // لِكَثيرٍ
      [], // مِنَ
      [], // المُشرِكينَ
      [], // قَتلَ
      [], // أَولـٰدِهِم
      [], // شُرَكاؤُهُم
      ["ليُردوهم : ليُهلكوهم بالإغواء"], // لِيُردوهُم
      [], // وَلِيَلبِسوا
      [], // عَلَيهِم
      [], // دينَهُم
      [], // وَلَو
      [], // شاءَ
      [], // اللَّهُ
      [], // ما
      [], // فَعَلوهُ
      [], // فَذَرهُم
      [], // وَما
      ["يفترون : يختلقونه من الكذب"] // يَفتَرونَ
    ],
    [ // آية 138
      [], // وَقالوا
      [], // هـٰذِهِ
      [], // أَنعـٰمٌ
      [], // وَحَرثٌ
      ["حِجر : محجورة مُحرّمة"], // حِجرٌ
      [], // لا
      [], // يَطعَمُها
      [], // إِلّا
      [], // مَن
      [], // نَشاءُ
      [], // بِزَعمِهِم
      [], // وَأَنعـٰمٌ
      ["حُرّمت ظهورها : البحائر و السّوائب و الحوامي"], // حُرِّمَت
      ["حُرّمت ظهورها : البحائر و السّوائب و الحوامي"], // ظُهورُها
      [], // وَأَنعـٰمٌ
      [], // لا
      [], // يَذكُرونَ
      [], // اسمَ
      [], // اللَّهِ
      [], // عَلَيهَا
      [], // افتِراءً
      [], // عَلَيهِ
      [], // سَيَجزيهِم
      [], // بِما
      [], // كانوا
      [] // يَفتَرونَ
    ],
    [ // آية 139
      [], // وَقالوا
      [], // ما
      [], // فى
      [], // بُطونِ
      [], // هـٰذِهِ
      [], // الأَنعـٰمِ
      [], // خالِصَةٌ
      [], // لِذُكورِنا
      [], // وَمُحَرَّمٌ
      [], // عَلىٰ
      [], // أَزوٰجِنا
      [], // وَإِن
      [], // يَكُن
      [], // مَيتَةً
      [], // فَهُم
      [], // فيهِ
      [], // شُرَكاءُ
      [], // سَيَجزيهِم
      [], // وَصفَهُم
      [], // إِنَّهُ
      [], // حَكيمٌ
      [] // عَليمٌ
    ],
    [ // آية 140
      [], // قَد
      [], // خَسِرَ
      [], // الَّذينَ
      [], // قَتَلوا
      [], // أَولـٰدَهُم
      [], // سَفَهًا
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // وَحَرَّموا
      [], // ما
      [], // رَزَقَهُمُ
      [], // اللَّهُ
      [], // افتِراءً
      [], // عَلَى
      [], // اللَّهِ
      [], // قَد
      [], // ضَلّوا
      [], // وَما
      [], // كانوا
      [] // مُهتَدينَ
    ],
    [ // آية 141
      [], // وَهُوَ
      [], // الَّذى
      [], // أَنشَأَ
      [], // جَنّـٰتٍ
      [], // مَعروشـٰتٍ
      [], // وَغَيرَ
      [], // مَعروشـٰتٍ
      [], // وَالنَّخلَ
      [], // وَالزَّرعَ
      ["مختلفا أكله : ثمره المأكول في الهيئة و الكيفية"], // مُختَلِفًا
      ["مختلفا أكله : ثمره المأكول في الهيئة و الكيفية"], // أُكُلُهُ
      [], // وَالزَّيتونَ
      [], // وَالرُّمّانَ
      [], // مُتَشـٰبِهًا
      [], // وَغَيرَ
      [], // مُتَشـٰبِهٍ
      [], // كُلوا
      [], // مِن
      [], // ثَمَرِهِ
      [], // إِذا
      [], // أَثمَرَ
      [], // وَءاتوا
      [], // حَقَّهُ
      [], // يَومَ
      [], // حَصادِهِ
      [], // وَلا
      [], // تُسرِفوا
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // المُسرِفينَ
    ],
    [ // آية 142
      [], // وَمِنَ
      [], // الأَنعـٰمِ
      ["حمولة : ما يحمل الأثقال كالإبل"], // حَمولَةً
      [], // وَفَرشًا
      [], // كُلوا
      [], // مِمّا
      [], // رَزَقَكُمُ
      [], // اللَّهُ
      [], // وَلا
      [], // تَتَّبِعوا
      [], // خُطُوٰتِ
      [], // الشَّيطـٰنِ
      [], // إِنَّهُ
      [], // لَكُم
      [], // عَدُوٌّ
      [] // مُبينٌ
    ],
    [ // آية 143
      [], // ثَمـٰنِيَةَ
      [], // أَزوٰجٍ
      [], // مِنَ
      [], // الضَّأنِ
      [], // اثنَينِ
      [], // وَمِنَ
      [], // المَعزِ
      [], // اثنَينِ
      [], // قُل
      [], // ءالذَّكَرَينِ
      [], // حَرَّمَ
      [], // أَمِ
      [], // الأُنثَيَينِ
      [], // أَمَّا
      [], // اشتَمَلَت
      [], // عَلَيهِ
      [], // أَرحامُ
      [], // الأُنثَيَينِ
      [], // نَبِّـٔونى
      [], // بِعِلمٍ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 144
      [], // وَمِنَ
      [], // الإِبِلِ
      [], // اثنَينِ
      [], // وَمِنَ
      [], // البَقَرِ
      [], // اثنَينِ
      [], // قُل
      [], // ءالذَّكَرَينِ
      [], // حَرَّمَ
      [], // أَمِ
      [], // الأُنثَيَينِ
      [], // أَمَّا
      [], // اشتَمَلَت
      [], // عَلَيهِ
      [], // أَرحامُ
      [], // الأُنثَيَينِ
      [], // أَم
      [], // كُنتُم
      [], // شُهَداءَ
      [], // إِذ
      [], // وَصّىٰكُمُ
      [], // اللَّهُ
      [], // بِهـٰذا
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // لِيُضِلَّ
      [], // النّاسَ
      [], // بِغَيرِ
      [], // عِلمٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 145
      [], // قُل
      [], // لا
      [], // أَجِدُ
      [], // فى
      [], // ما
      [], // أوحِىَ
      [], // إِلَىَّ
      [], // مُحَرَّمًا
      [], // عَلىٰ
      ["طاعمٍ يطعمه : آكل أيّا كان يأكله"], // طاعِمٍ
      ["طاعمٍ يطعمه : آكل أيّا كان يأكله"], // يَطعَمُهُ
      [], // إِلّا
      [], // أَن
      [], // يَكونَ
      [], // مَيتَةً
      [], // أَو
      ["دما مسفوحا : سائلا مهراقا"], // دَمًا
      ["دما مسفوحا : سائلا مهراقا"], // مَسفوحًا
      [], // أَو
      [], // لَحمَ
      [], // خِنزيرٍ
      ["فإنّه رجس : قذر أو خبيث أو نجس حرام"], // فَإِنَّهُ
      ["فإنّه رجس : قذر أو خبيث أو نجس حرام"], // رِجسٌ
      [], // أَو
      [], // فِسقًا
      ["أهلّ لغير الله به : ذكر عند ذبحه اسم غير الله"], // أُهِلَّ
      ["أهلّ لغير الله به : ذكر عند ذبحه اسم غير الله"], // لِغَيرِ
      ["أهلّ لغير الله به : ذكر عند ذبحه اسم غير الله"], // اللَّهِ
      ["أهلّ لغير الله به : ذكر عند ذبحه اسم غير الله"], // بِهِ
      [], // فَمَنِ
      [], // اضطُرَّ
      ["غير باغٍ : غير طالب للمحرّم للذّة أو استئثار"], // غَيرَ
      ["غير باغٍ : غير طالب للمحرّم للذّة أو استئثار"], // باغٍ
      [], // وَلا
      [], // عادٍ
      [], // فَإِنَّ
      [], // رَبَّكَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 146
      [], // وَعَلَى
      [], // الَّذينَ
      [], // هادوا
      [], // حَرَّمنا
      [], // كُلَّ
      [], // ذى
      [], // ظُفُرٍ
      [], // وَمِنَ
      [], // البَقَرِ
      [], // وَالغَنَمِ
      [], // حَرَّمنا
      [], // عَلَيهِم
      ["شحومهما : شحوم الكرش و الكليتين"], // شُحومَهُما
      [], // إِلّا
      ["ما حملت ظهورهما : ما علق بهما من الشحم فيُحلّ"], // ما
      ["ما حملت ظهورهما : ما علق بهما من الشحم فيُحلّ"], // حَمَلَت
      ["ما حملت ظهورهما : ما علق بهما من الشحم فيُحلّ"], // ظُهورُهُما
      [], // أَوِ
      ["الحوايا : المصارين و الأمعاء فيُحلّ شحمها"], // الحَوايا
      [], // أَو
      ["ما اختلط بعظم : إلية الضّأن فتحل"], // مَا
      ["ما اختلط بعظم : إلية الضّأن فتحل"], // اختَلَطَ
      ["ما اختلط بعظم : إلية الضّأن فتحل"], // بِعَظمٍ
      [], // ذٰلِكَ
      [], // جَزَينـٰهُم
      [], // بِبَغيِهِم
      [], // وَإِنّا
      [] // لَصـٰدِقونَ
    ],
    [ // آية 147
      [], // فَإِن
      [], // كَذَّبوكَ
      [], // فَقُل
      [], // رَبُّكُم
      [], // ذو
      [], // رَحمَةٍ
      [], // وٰسِعَةٍ
      [], // وَلا
      [], // يُرَدُّ
      [], // بَأسُهُ
      [], // عَنِ
      [], // القَومِ
      [] // المُجرِمينَ
    ],
    [ // آية 148
      [], // سَيَقولُ
      [], // الَّذينَ
      [], // أَشرَكوا
      [], // لَو
      [], // شاءَ
      [], // اللَّهُ
      [], // ما
      [], // أَشرَكنا
      [], // وَلا
      [], // ءاباؤُنا
      [], // وَلا
      [], // حَرَّمنا
      [], // مِن
      [], // شَىءٍ
      [], // كَذٰلِكَ
      [], // كَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // حَتّىٰ
      [], // ذاقوا
      [], // بَأسَنا
      [], // قُل
      [], // هَل
      [], // عِندَكُم
      [], // مِن
      [], // عِلمٍ
      [], // فَتُخرِجوهُ
      [], // لَنا
      [], // إِن
      [], // تَتَّبِعونَ
      [], // إِلَّا
      [], // الظَّنَّ
      [], // وَإِن
      [], // أَنتُم
      [], // إِلّا
      ["تخرصون : تكذبون على الله تعالى"] // تَخرُصونَ
    ],
    [ // آية 149
      [], // قُل
      [], // فَلِلَّهِ
      [], // الحُجَّةُ
      [], // البـٰلِغَةُ
      [], // فَلَو
      [], // شاءَ
      [], // لَهَدىٰكُم
      [] // أَجمَعينَ
    ],
    [ // آية 150
      [], // قُل
      ["هلمّ شُهداءكم : أحضروا أو هاتوا شهودكم"], // هَلُمَّ
      ["هلمّ شُهداءكم : أحضروا أو هاتوا شهودكم"], // شُهَداءَكُمُ
      [], // الَّذينَ
      [], // يَشهَدونَ
      [], // أَنَّ
      [], // اللَّهَ
      [], // حَرَّمَ
      [], // هـٰذا
      [], // فَإِن
      [], // شَهِدوا
      [], // فَلا
      [], // تَشهَد
      [], // مَعَهُم
      [], // وَلا
      [], // تَتَّبِع
      [], // أَهواءَ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَالَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِالـٔاخِرَةِ
      [], // وَهُم
      ["بربّهم يعدلون : يسوّون به غيره في العبادة"], // بِرَبِّهِم
      ["بربّهم يعدلون : يسوّون به غيره في العبادة"] // يَعدِلونَ
    ],
    [ // آية 151
      [], // قُل
      [], // تَعالَوا
      [], // أَتلُ
      [], // ما
      [], // حَرَّمَ
      [], // رَبُّكُم
      [], // عَلَيكُم
      [], // أَلّا
      [], // تُشرِكوا
      [], // بِهِ
      [], // شَيـًٔا
      [], // وَبِالوٰلِدَينِ
      [], // إِحسـٰنًا
      [], // وَلا
      [], // تَقتُلوا
      [], // أَولـٰدَكُم
      [], // مِن
      [], // إِملـٰقٍ
      [], // نَحنُ
      [], // نَرزُقُكُم
      [], // وَإِيّاهُم
      [], // وَلا
      [], // تَقرَبُوا
      [], // الفَوٰحِشَ
      [], // ما
      [], // ظَهَرَ
      [], // مِنها
      [], // وَما
      [], // بَطَنَ
      [], // وَلا
      [], // تَقتُلُوا
      [], // النَّفسَ
      [], // الَّتى
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // إِلّا
      [], // بِالحَقِّ
      [], // ذٰلِكُم
      [], // وَصّىٰكُم
      [], // بِهِ
      [], // لَعَلَّكُم
      [] // تَعقِلونَ
    ],
    [ // آية 152
      [], // وَلا
      [], // تَقرَبوا
      [], // مالَ
      [], // اليَتيمِ
      [], // إِلّا
      [], // بِالَّتى
      [], // هِىَ
      [], // أَحسَنُ
      [], // حَتّىٰ
      ["يبلغ أشدّه : استحكام قوّته و يرشد"], // يَبلُغَ
      ["يبلغ أشدّه : استحكام قوّته و يرشد"], // أَشُدَّهُ
      [], // وَأَوفُوا
      [], // الكَيلَ
      [], // وَالميزانَ
      ["بالقسط : بالعدل دون زيادة و نقص"], // بِالقِسطِ
      [], // لا
      [], // نُكَلِّفُ
      [], // نَفسًا
      [], // إِلّا
      ["وُسعها : طاقتها و ما تقدِر عليه"], // وُسعَها
      [], // وَإِذا
      [], // قُلتُم
      [], // فَاعدِلوا
      [], // وَلَو
      [], // كانَ
      [], // ذا
      [], // قُربىٰ
      [], // وَبِعَهدِ
      [], // اللَّهِ
      [], // أَوفوا
      [], // ذٰلِكُم
      [], // وَصّىٰكُم
      [], // بِهِ
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 153
      [], // وَأَنَّ
      [], // هـٰذا
      [], // صِرٰطى
      [], // مُستَقيمًا
      [], // فَاتَّبِعوهُ
      [], // وَلا
      [], // تَتَّبِعُوا
      [], // السُّبُلَ
      [], // فَتَفَرَّقَ
      [], // بِكُم
      [], // عَن
      [], // سَبيلِهِ
      [], // ذٰلِكُم
      [], // وَصّىٰكُم
      [], // بِهِ
      [], // لَعَلَّكُم
      [] // تَتَّقونَ
    ],
    [ // آية 154
      [], // ثُمَّ
      [], // ءاتَينا
      [], // موسَى
      [], // الكِتـٰبَ
      [], // تَمامًا
      [], // عَلَى
      [], // الَّذى
      [], // أَحسَنَ
      [], // وَتَفصيلًا
      [], // لِكُلِّ
      [], // شَىءٍ
      [], // وَهُدًى
      [], // وَرَحمَةً
      [], // لَعَلَّهُم
      [], // بِلِقاءِ
      [], // رَبِّهِم
      [] // يُؤمِنونَ
    ],
    [ // آية 155
      [], // وَهـٰذا
      [], // كِتـٰبٌ
      [], // أَنزَلنـٰهُ
      [], // مُبارَكٌ
      [], // فَاتَّبِعوهُ
      [], // وَاتَّقوا
      [], // لَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 156
      [], // أَن
      [], // تَقولوا
      [], // إِنَّما
      [], // أُنزِلَ
      [], // الكِتـٰبُ
      [], // عَلىٰ
      [], // طائِفَتَينِ
      [], // مِن
      [], // قَبلِنا
      [], // وَإِن
      [], // كُنّا
      [], // عَن
      [], // دِراسَتِهِم
      [] // لَغـٰفِلينَ
    ],
    [ // آية 157
      [], // أَو
      [], // تَقولوا
      [], // لَو
      [], // أَنّا
      [], // أُنزِلَ
      [], // عَلَينَا
      [], // الكِتـٰبُ
      [], // لَكُنّا
      [], // أَهدىٰ
      [], // مِنهُم
      [], // فَقَد
      [], // جاءَكُم
      [], // بَيِّنَةٌ
      [], // مِن
      [], // رَبِّكُم
      [], // وَهُدًى
      [], // وَرَحمَةٌ
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّن
      [], // كَذَّبَ
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // وَصَدَفَ
      [], // عَنها
      [], // سَنَجزِى
      [], // الَّذينَ
      [], // يَصدِفونَ
      [], // عَن
      [], // ءايـٰتِنا
      [], // سوءَ
      [], // العَذابِ
      [], // بِما
      [], // كانوا
      [] // يَصدِفونَ
    ],
    [ // آية 158
      [], // هَل
      [], // يَنظُرونَ
      [], // إِلّا
      [], // أَن
      [], // تَأتِيَهُمُ
      [], // المَلـٰئِكَةُ
      [], // أَو
      [], // يَأتِىَ
      [], // رَبُّكَ
      [], // أَو
      [], // يَأتِىَ
      [], // بَعضُ
      [], // ءايـٰتِ
      [], // رَبِّكَ
      [], // يَومَ
      [], // يَأتى
      [], // بَعضُ
      [], // ءايـٰتِ
      [], // رَبِّكَ
      [], // لا
      [], // يَنفَعُ
      [], // نَفسًا
      [], // إيمـٰنُها
      [], // لَم
      [], // تَكُن
      [], // ءامَنَت
      [], // مِن
      [], // قَبلُ
      [], // أَو
      [], // كَسَبَت
      [], // فى
      [], // إيمـٰنِها
      [], // خَيرًا
      [], // قُلِ
      [], // انتَظِروا
      [], // إِنّا
      [] // مُنتَظِرونَ
    ],
    [ // آية 159
      [], // إِنَّ
      [], // الَّذينَ
      [], // فَرَّقوا
      [], // دينَهُم
      [], // وَكانوا
      [], // شِيَعًا
      [], // لَستَ
      [], // مِنهُم
      [], // فى
      [], // شَىءٍ
      [], // إِنَّما
      [], // أَمرُهُم
      [], // إِلَى
      [], // اللَّهِ
      [], // ثُمَّ
      [], // يُنَبِّئُهُم
      [], // بِما
      [], // كانوا
      [] // يَفعَلونَ
    ],
    [ // آية 160
      [], // مَن
      [], // جاءَ
      [], // بِالحَسَنَةِ
      [], // فَلَهُ
      [], // عَشرُ
      [], // أَمثالِها
      [], // وَمَن
      [], // جاءَ
      [], // بِالسَّيِّئَةِ
      [], // فَلا
      [], // يُجزىٰ
      [], // إِلّا
      [], // مِثلَها
      [], // وَهُم
      [], // لا
      [] // يُظلَمونَ
    ],
    [ // آية 161
      [], // قُل
      [], // إِنَّنى
      [], // هَدىٰنى
      [], // رَبّى
      [], // إِلىٰ
      [], // صِرٰطٍ
      [], // مُستَقيمٍ
      ["دينا قيما : ثابتا مُقوّما لأمور المعاش و المعاد"], // دينًا
      ["دينا قيما : ثابتا مُقوّما لأمور المعاش و المعاد"], // قِيَمًا
      [], // مِلَّةَ
      [], // إِبرٰهيمَ
      ["حنيفا : مائلا عن الباطل إلى الدّين الحق"], // حَنيفًا
      [], // وَما
      [], // كانَ
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 162
      [], // قُل
      [], // إِنَّ
      [], // صَلاتى
      [], // وَنُسُكى
      [], // وَمَحياىَ
      [], // وَمَماتى
      [], // لِلَّهِ
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 163
      [], // لا
      [], // شَريكَ
      [], // لَهُ
      [], // وَبِذٰلِكَ
      [], // أُمِرتُ
      [], // وَأَنا۠
      [], // أَوَّلُ
      [] // المُسلِمينَ
    ],
    [ // آية 164
      [], // قُل
      [], // أَغَيرَ
      [], // اللَّهِ
      [], // أَبغى
      [], // رَبًّا
      [], // وَهُوَ
      [], // رَبُّ
      [], // كُلِّ
      [], // شَىءٍ
      [], // وَلا
      [], // تَكسِبُ
      [], // كُلُّ
      [], // نَفسٍ
      ["إلا عليها : إلاّ ذنبا محمولا عليها عقابه"], // إِلّا
      ["إلا عليها : إلاّ ذنبا محمولا عليها عقابه"], // عَلَيها
      [], // وَلا
      [], // تَزِرُ
      [], // وازِرَةٌ
      [], // وِزرَ
      [], // أُخرىٰ
      [], // ثُمَّ
      [], // إِلىٰ
      [], // رَبِّكُم
      [], // مَرجِعُكُم
      [], // فَيُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [], // فيهِ
      [] // تَختَلِفونَ
    ],
    [ // آية 165
      [], // وَهُوَ
      [], // الَّذى
      [], // جَعَلَكُم
      [], // خَلـٰئِفَ
      [], // الأَرضِ
      [], // وَرَفَعَ
      [], // بَعضَكُم
      [], // فَوقَ
      [], // بَعضٍ
      [], // دَرَجـٰتٍ
      ["ليبلُوكم : ليختبركم و هو بكم عليم"], // لِيَبلُوَكُم
      [], // فى
      [], // ما
      [], // ءاتىٰكُم
      [], // إِنَّ
      [], // رَبَّكَ
      [], // سَريعُ
      [], // العِقابِ
      [], // وَإِنَّهُ
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ]
  ]
];

export default meanings;