const meanings = [
  [ // سورة 61: الصف
[ // آية 1
      [], // سَبَّحَ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الحَكيمُ
    ],
    [ // آية 2
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لِمَ
      [], // تَقولونَ
      [], // ما
      [], // لا
      [] // تَفعَلونَ
    ],
    [ // آية 3
      [], // كَبُرَ
      [], // مَقتًا
      [], // عِندَ
      [], // اللَّهِ
      [], // أَن
      [], // تَقولوا
      [], // ما
      [], // لا
      [] // تَفعَلونَ
    ],
    [ // آية 4
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُحِبُّ
      [], // الَّذينَ
      [], // يُقـٰتِلونَ
      [], // فى
      [], // سَبيلِهِ
      ["صَفّا : صافّين أنفسهم أو مصفوفين"], // صَفًّا
      [], // كَأَنَّهُم
      [], // بُنيـٰنٌ
      [] // مَرصوصٌ
    ],
    [ // آية 5
      [], // وَإِذ
      [], // قالَ
      [], // موسىٰ
      [], // لِقَومِهِ
      [], // يـٰقَومِ
      [], // لِمَ
      [], // تُؤذونَنى
      [], // وَقَد
      [], // تَعلَمونَ
      [], // أَنّى
      [], // رَسولُ
      [], // اللَّهِ
      [], // إِلَيكُم
      [], // فَلَمّا
      [], // زاغوا
      ["أزاغ الله قلوبهم : حَرَمَهم التوفيق لاتـّباع الحقّ"], // أَزاغَ
      ["أزاغ الله قلوبهم : حَرَمَهم التوفيق لاتـّباع الحقّ"], // اللَّهُ
      ["أزاغ الله قلوبهم : حَرَمَهم التوفيق لاتـّباع الحقّ"], // قُلوبَهُم
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 6
      [], // وَإِذ
      [], // قالَ
      [], // عيسَى
      [], // ابنُ
      [], // مَريَمَ
      [], // يـٰبَنى
      [], // إِسرٰءيلَ
      [], // إِنّى
      [], // رَسولُ
      [], // اللَّهِ
      [], // إِلَيكُم
      [], // مُصَدِّقًا
      [], // لِما
      [], // بَينَ
      [], // يَدَىَّ
      [], // مِنَ
      [], // التَّورىٰةِ
      [], // وَمُبَشِّرًا
      [], // بِرَسولٍ
      [], // يَأتى
      [], // مِن
      [], // بَعدِى
      [], // اسمُهُ
      [], // أَحمَدُ
      [], // فَلَمّا
      [], // جاءَهُم
      [], // بِالبَيِّنـٰتِ
      [], // قالوا
      [], // هـٰذا
      [], // سِحرٌ
      [] // مُبينٌ
    ],
    [ // آية 7
      [], // وَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // الكَذِبَ
      [], // وَهُوَ
      [], // يُدعىٰ
      [], // إِلَى
      [], // الإِسلـٰمِ
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 8
      [], // يُريدونَ
      [], // لِيُطفِـٔوا
      ["نور الله : الحقّ الذي جاء به الرسول صلى الله عليه و سلم"], // نورَ
      ["نور الله : الحقّ الذي جاء به الرسول صلى الله عليه و سلم"], // اللَّهِ
      [], // بِأَفوٰهِهِم
      [], // وَاللَّهُ
      [], // مُتِمُّ
      [], // نورِهِ
      [], // وَلَو
      [], // كَرِهَ
      [] // الكـٰفِرونَ
    ],
    [ // آية 9
      [], // هُوَ
      [], // الَّذى
      [], // أَرسَلَ
      [], // رَسولَهُ
      [], // بِالهُدىٰ
      [], // وَدينِ
      [], // الحَقِّ
      [], // لِيُظهِرَهُ
      [], // عَلَى
      [], // الدّينِ
      [], // كُلِّهِ
      [], // وَلَو
      [], // كَرِهَ
      [] // المُشرِكونَ
    ],
    [ // آية 10
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // هَل
      [], // أَدُلُّكُم
      [], // عَلىٰ
      [], // تِجـٰرَةٍ
      [], // تُنجيكُم
      [], // مِن
      [], // عَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 11
      [], // تُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَتُجـٰهِدونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // بِأَموٰلِكُم
      [], // وَأَنفُسِكُم
      [], // ذٰلِكُم
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 12
      [], // يَغفِر
      [], // لَكُم
      [], // ذُنوبَكُم
      [], // وَيُدخِلكُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // وَمَسـٰكِنَ
      [], // طَيِّبَةً
      [], // فى
      [], // جَنّـٰتِ
      [], // عَدنٍ
      [], // ذٰلِكَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 13
      [], // وَأُخرىٰ
      [], // تُحِبّونَها
      [], // نَصرٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَفَتحٌ
      [], // قَريبٌ
      [], // وَبَشِّرِ
      [] // المُؤمِنينَ
    ],
    [ // آية 14
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // كونوا
      [], // أَنصارَ
      [], // اللَّهِ
      [], // كَما
      [], // قالَ
      [], // عيسَى
      [], // ابنُ
      [], // مَريَمَ
      [], // لِلحَوارِيّـۧنَ
      [], // مَن
      [], // أَنصارى
      [], // إِلَى
      [], // اللَّهِ
      [], // قالَ
      [], // الحَوارِيّونَ
      [], // نَحنُ
      [], // أَنصارُ
      [], // اللَّهِ
      [], // فَـٔامَنَت
      [], // طائِفَةٌ
      [], // مِن
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // وَكَفَرَت
      [], // طائِفَةٌ
      ["فأيّدنا : قوّينا المحقّين بالإيمان"], // فَأَيَّدنَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // عَلىٰ
      [], // عَدُوِّهِم
      [], // فَأَصبَحوا
      [] // ظـٰهِرينَ
    ]
  ]
];

export default meanings;