const meanings = [
[ // آية 1
      [], // إِذا
      [], // جاءَكَ
      [], // المُنـٰفِقونَ
      [], // قالوا
      [], // نَشهَدُ
      [], // إِنَّكَ
      [], // لَرَسولُ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // إِنَّكَ
      [], // لَرَسولُهُ
      [], // وَاللَّهُ
      [], // يَشهَدُ
      [], // إِنَّ
      [], // المُنـٰفِقينَ
      [] // لَكـٰذِبونَ
    ],
    [ // آية 2
      [], // اتَّخَذوا
      [], // أَيمـٰنَهُم
      [], // جُنَّةً
      [], // فَصَدّوا
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // إِنَّهُم
      [], // ساءَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 3
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // ءامَنوا
      [], // ثُمَّ
      [], // كَفَروا
      [], // فَطُبِعَ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // فَهُم
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 4
      [], // وَإِذا
      [], // رَأَيتَهُم
      [], // تُعجِبُكَ
      [], // أَجسامُهُم
      [], // وَإِن
      [], // يَقولوا
      [], // تَسمَع
      [], // لِقَولِهِم
      [], // كَأَنَّهُم
      [], // خُشُبٌ
      [], // مُسَنَّدَةٌ
      [], // يَحسَبونَ
      [], // كُلَّ
      [], // صَيحَةٍ
      [], // عَلَيهِم
      ["هم العدوّ : الراسخون في العداوة"], // هُمُ
      ["هم العدوّ : الراسخون في العداوة"], // العَدُوُّ
      [], // فَاحذَرهُم
      [], // قـٰتَلَهُمُ
      [], // اللَّهُ
      [], // أَنّىٰ
      [] // يُؤفَكونَ
    ],
    [ // آية 5
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُم
      [], // تَعالَوا
      [], // يَستَغفِر
      [], // لَكُم
      [], // رَسولُ
      [], // اللَّهِ
      [], // لَوَّوا
      [], // رُءوسَهُم
      [], // وَرَأَيتَهُم
      [], // يَصُدّونَ
      [], // وَهُم
      [] // مُستَكبِرونَ
    ],
    [ // آية 6
      [], // سَواءٌ
      [], // عَلَيهِم
      [], // أَستَغفَرتَ
      [], // لَهُم
      [], // أَم
      [], // لَم
      [], // تَستَغفِر
      [], // لَهُم
      [], // لَن
      [], // يَغفِرَ
      [], // اللَّهُ
      [], // لَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 7
      [], // هُمُ
      [], // الَّذينَ
      [], // يَقولونَ
      [], // لا
      [], // تُنفِقوا
      [], // عَلىٰ
      [], // مَن
      [], // عِندَ
      [], // رَسولِ
      [], // اللَّهِ
      ["حتى ينفضّوا : كيْ يَـتفـرقوا عنه"], // حَتّىٰ
      ["حتى ينفضّوا : كيْ يَـتفـرقوا عنه"], // يَنفَضّوا
      [], // وَلِلَّهِ
      [], // خَزائِنُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَلـٰكِنَّ
      [], // المُنـٰفِقينَ
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 8
      [], // يَقولونَ
      [], // لَئِن
      [], // رَجَعنا
      [], // إِلَى
      [], // المَدينَةِ
      [], // لَيُخرِجَنَّ
      [], // الأَعَزُّ
      [], // مِنهَا
      ["الأذلّ : الأضعف و الأهون . يعنون الرسول و المؤمنين"], // الأَذَلَّ
      [], // وَلِلَّهِ
      [], // العِزَّةُ
      [], // وَلِرَسولِهِ
      [], // وَلِلمُؤمِنينَ
      [], // وَلـٰكِنَّ
      [], // المُنـٰفِقينَ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 9
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تُلهِكُم
      [], // أَموٰلُكُم
      [], // وَلا
      [], // أَولـٰدُكُم
      [], // عَن
      ["ذِكر الله : عِبادَته و طاعته و مراقبته"], // ذِكرِ
      ["ذِكر الله : عِبادَته و طاعته و مراقبته"], // اللَّهِ
      [], // وَمَن
      [], // يَفعَل
      [], // ذٰلِكَ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 10
      [], // وَأَنفِقوا
      [], // مِن
      [], // ما
      [], // رَزَقنـٰكُم
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِىَ
      [], // أَحَدَكُمُ
      [], // المَوتُ
      [], // فَيَقولَ
      [], // رَبِّ
      [], // لَولا
      [], // أَخَّرتَنى
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // قَريبٍ
      [], // فَأَصَّدَّقَ
      [], // وَأَكُن
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 11
      [], // وَلَن
      [], // يُؤَخِّرَ
      [], // اللَّهُ
      [], // نَفسًا
      [], // إِذا
      [], // جاءَ
      [], // أَجَلُها
      [], // وَاللَّهُ
      [], // خَبيرٌ
      [], // بِما
      [] // تَعمَلونَ
    ]
];

export default meanings;