const meanings = [
[ // آية 1
      [], // يُسَبِّحُ
      [], // لِلَّهِ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَما
      [], // فِى
      [], // الأَرضِ
      [], // لَهُ
      [], // المُلكُ
      [], // وَلَهُ
      [], // الحَمدُ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 2
      [], // هُوَ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // فَمِنكُم
      [], // كافِرٌ
      [], // وَمِنكُم
      [], // مُؤمِنٌ
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 3
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      ["بالحقّ : بالحِـكمة البالغة"], // بِالحَقِّ
      [], // وَصَوَّرَكُم
      ["فأحسن صُوَركم : أتقـَنـَـها و أحكمها"], // فَأَحسَنَ
      ["فأحسن صُوَركم : أتقـَنـَـها و أحكمها"], // صُوَرَكُم
      [], // وَإِلَيهِ
      [] // المَصيرُ
    ],
    [ // آية 4
      [], // يَعلَمُ
      [], // ما
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَيَعلَمُ
      [], // ما
      [], // تُسِرّونَ
      [], // وَما
      [], // تُعلِنونَ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 5
      [], // أَلَم
      [], // يَأتِكُم
      [], // نَبَؤُا۟
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَبلُ
      [], // فَذاقوا
      ["وَبال أمرهم : سوء عاقبة كفرهم في الدنيا"], // وَبالَ
      ["وَبال أمرهم : سوء عاقبة كفرهم في الدنيا"], // أَمرِهِم
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 6
      [], // ذٰلِكَ
      [], // بِأَنَّهُ
      [], // كانَت
      [], // تَأتيهِم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَقالوا
      [], // أَبَشَرٌ
      [], // يَهدونَنا
      [], // فَكَفَروا
      [], // وَتَوَلَّوا
      [], // وَاستَغنَى
      [], // اللَّهُ
      [], // وَاللَّهُ
      [], // غَنِىٌّ
      [] // حَميدٌ
    ],
    [ // آية 7
      [], // زَعَمَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // أَن
      [], // لَن
      [], // يُبعَثوا
      [], // قُل
      [], // بَلىٰ
      [], // وَرَبّى
      [], // لَتُبعَثُنَّ
      [], // ثُمَّ
      [], // لَتُنَبَّؤُنَّ
      [], // بِما
      [], // عَمِلتُم
      [], // وَذٰلِكَ
      [], // عَلَى
      [], // اللَّهِ
      [] // يَسيرٌ
    ],
    [ // آية 8
      [], // فَـٔامِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَالنّورِ
      [], // الَّذى
      [], // أَنزَلنا
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // خَبيرٌ
    ],
    [ // آية 9
      [], // يَومَ
      [], // يَجمَعُكُم
      ["ليَوْم الجمع : في يوم القيامة حيث تجتمع الخلائق للحساب و الجَزاء"], // لِيَومِ
      ["ليَوْم الجمع : في يوم القيامة حيث تجتمع الخلائق للحساب و الجَزاء"], // الجَمعِ
      [], // ذٰلِكَ
      [], // يَومُ
      [], // التَّغابُنِ
      [], // وَمَن
      [], // يُؤمِن
      [], // بِاللَّهِ
      [], // وَيَعمَل
      [], // صـٰلِحًا
      [], // يُكَفِّر
      [], // عَنهُ
      [], // سَيِّـٔاتِهِ
      [], // وَيُدخِلهُ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // ذٰلِكَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 10
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // وَكَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 11
      [], // ما
      [], // أَصابَ
      [], // مِن
      [], // مُصيبَةٍ
      [], // إِلّا
      ["بإذن الله : بإرادته و قضائه و قـَـدَره تعالى"], // بِإِذنِ
      ["بإذن الله : بإرادته و قضائه و قـَـدَره تعالى"], // اللَّهِ
      [], // وَمَن
      [], // يُؤمِن
      [], // بِاللَّهِ
      [], // يَهدِ
      [], // قَلبَهُ
      [], // وَاللَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 12
      [], // وَأَطيعُوا
      [], // اللَّهَ
      [], // وَأَطيعُوا
      [], // الرَّسولَ
      [], // فَإِن
      [], // تَوَلَّيتُم
      [], // فَإِنَّما
      [], // عَلىٰ
      [], // رَسولِنَا
      [], // البَلـٰغُ
      [] // المُبينُ
    ],
    [ // آية 13
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // وَعَلَى
      [], // اللَّهِ
      [], // فَليَتَوَكَّلِ
      [] // المُؤمِنونَ
    ],
    [ // آية 14
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّ
      [], // مِن
      [], // أَزوٰجِكُم
      [], // وَأَولـٰدِكُم
      [], // عَدُوًّا
      [], // لَكُم
      [], // فَاحذَروهُم
      [], // وَإِن
      [], // تَعفوا
      [], // وَتَصفَحوا
      [], // وَتَغفِروا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 15
      [], // إِنَّما
      [], // أَموٰلُكُم
      [], // وَأَولـٰدُكُم
      [], // فِتنَةٌ
      [], // وَاللَّهُ
      [], // عِندَهُ
      [], // أَجرٌ
      [] // عَظيمٌ
    ],
    [ // آية 16
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [], // مَا
      [], // استَطَعتُم
      [], // وَاسمَعوا
      [], // وَأَطيعوا
      [], // وَأَنفِقوا
      [], // خَيرًا
      [], // لِأَنفُسِكُم
      [], // وَمَن
      ["يُوق شُحّ نفسِه : يُـكْفَ بُخلَـهَا الشديد مع حِرْصها"], // يوقَ
      ["يُوق شُحّ نفسِه : يُـكْفَ بُخلَـهَا الشديد مع حِرْصها"], // شُحَّ
      ["يُوق شُحّ نفسِه : يُـكْفَ بُخلَـهَا الشديد مع حِرْصها"], // نَفسِهِ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 17
      [], // إِن
      [], // تُقرِضُوا
      [], // اللَّهَ
      [], // قَرضًا
      [], // حَسَنًا
      [], // يُضـٰعِفهُ
      [], // لَكُم
      [], // وَيَغفِر
      [], // لَكُم
      [], // وَاللَّهُ
      [], // شَكورٌ
      [] // حَليمٌ
    ],
    [ // آية 18
      [], // عـٰلِمُ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // العَزيزُ
      [] // الحَكيمُ
    ]
];

export default meanings;