const meanings = [
[ // آية 1
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // لِمَ
      [], // تُحَرِّمُ
      ["ما أحلّ الله لك : شرب العسل"], // ما
      ["ما أحلّ الله لك : شرب العسل"], // أَحَلَّ
      ["ما أحلّ الله لك : شرب العسل"], // اللَّهُ
      ["ما أحلّ الله لك : شرب العسل"], // لَكَ
      [], // تَبتَغى
      [], // مَرضاتَ
      [], // أَزوٰجِكَ
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 2
      [], // قَد
      [], // فَرَضَ
      [], // اللَّهُ
      [], // لَكُم
      [], // تَحِلَّةَ
      [], // أَيمـٰنِكُم
      [], // وَاللَّهُ
      [], // مَولىٰكُم
      [], // وَهُوَ
      [], // العَليمُ
      [] // الحَكيمُ
    ],
    [ // آية 3
      [], // وَإِذ
      [], // أَسَرَّ
      [], // النَّبِىُّ
      [], // إِلىٰ
      [], // بَعضِ
      [], // أَزوٰجِهِ
      [], // حَديثًا
      [], // فَلَمّا
      [], // نَبَّأَت
      [], // بِهِ
      [], // وَأَظهَرَهُ
      [], // اللَّهُ
      [], // عَلَيهِ
      [], // عَرَّفَ
      [], // بَعضَهُ
      [], // وَأَعرَضَ
      [], // عَن
      [], // بَعضٍ
      [], // فَلَمّا
      [], // نَبَّأَها
      [], // بِهِ
      [], // قالَت
      [], // مَن
      [], // أَنبَأَكَ
      [], // هـٰذا
      [], // قالَ
      [], // نَبَّأَنِىَ
      [], // العَليمُ
      [] // الخَبيرُ
    ],
    [ // آية 4
      [], // إِن
      [], // تَتوبا
      [], // إِلَى
      [], // اللَّهِ
      [], // فَقَد
      ["صَغَتْ قلوبكما : مَالتْ عن حَقـّه صلى الله عليه و سلم عليكما"], // صَغَت
      ["صَغَتْ قلوبكما : مَالتْ عن حَقـّه صلى الله عليه و سلم عليكما"], // قُلوبُكُما
      [], // وَإِن
      [], // تَظـٰهَرا
      [], // عَلَيهِ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // مَولىٰهُ
      [], // وَجِبريلُ
      [], // وَصـٰلِحُ
      [], // المُؤمِنينَ
      [], // وَالمَلـٰئِكَةُ
      [], // بَعدَ
      [], // ذٰلِكَ
      [] // ظَهيرٌ
    ],
    [ // آية 5
      [], // عَسىٰ
      [], // رَبُّهُ
      [], // إِن
      [], // طَلَّقَكُنَّ
      [], // أَن
      [], // يُبدِلَهُ
      [], // أَزوٰجًا
      [], // خَيرًا
      [], // مِنكُنَّ
      [], // مُسلِمـٰتٍ
      [], // مُؤمِنـٰتٍ
      [], // قـٰنِتـٰتٍ
      [], // تـٰئِبـٰتٍ
      [], // عـٰبِدٰتٍ
      [], // سـٰئِحـٰتٍ
      [], // ثَيِّبـٰتٍ
      [] // وَأَبكارًا
    ],
    [ // آية 6
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      ["قوا أنفسكم : جَـنّـبوها بالطاعات"], // قوا
      ["قوا أنفسكم : جَـنّـبوها بالطاعات"], // أَنفُسَكُم
      [], // وَأَهليكُم
      [], // نارًا
      [], // وَقودُهَا
      [], // النّاسُ
      [], // وَالحِجارَةُ
      [], // عَلَيها
      [], // مَلـٰئِكَةٌ
      ["غِلاظ شِداد : قساةٌ أقوياء و هم الزبانية"], // غِلاظٌ
      ["غِلاظ شِداد : قساةٌ أقوياء و هم الزبانية"], // شِدادٌ
      [], // لا
      [], // يَعصونَ
      [], // اللَّهَ
      [], // ما
      [], // أَمَرَهُم
      [], // وَيَفعَلونَ
      [], // ما
      [] // يُؤمَرونَ
    ],
    [ // آية 7
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // كَفَروا
      [], // لا
      [], // تَعتَذِرُوا
      [], // اليَومَ
      [], // إِنَّما
      [], // تُجزَونَ
      [], // ما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 8
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // توبوا
      [], // إِلَى
      [], // اللَّهِ
      [], // تَوبَةً
      [], // نَصوحًا
      [], // عَسىٰ
      [], // رَبُّكُم
      [], // أَن
      [], // يُكَفِّرَ
      [], // عَنكُم
      [], // سَيِّـٔاتِكُم
      [], // وَيُدخِلَكُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // يَومَ
      [], // لا
      [], // يُخزِى
      [], // اللَّهُ
      [], // النَّبِىَّ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // نورُهُم
      [], // يَسعىٰ
      [], // بَينَ
      [], // أَيديهِم
      [], // وَبِأَيمـٰنِهِم
      [], // يَقولونَ
      [], // رَبَّنا
      [], // أَتمِم
      [], // لَنا
      [], // نورَنا
      [], // وَاغفِر
      [], // لَنا
      [], // إِنَّكَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 9
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // جـٰهِدِ
      [], // الكُفّارَ
      [], // وَالمُنـٰفِقينَ
      [], // وَاغلُظ
      [], // عَلَيهِم
      [], // وَمَأوىٰهُم
      [], // جَهَنَّمُ
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 10
      [], // ضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // لِلَّذينَ
      [], // كَفَرُوا
      [], // امرَأَتَ
      [], // نوحٍ
      [], // وَامرَأَتَ
      [], // لوطٍ
      [], // كانَتا
      [], // تَحتَ
      [], // عَبدَينِ
      [], // مِن
      [], // عِبادِنا
      [], // صـٰلِحَينِ
      ["فخانتاهما : بالنّـفاق أو بالنميمة"], // فَخانَتاهُما
      ["فلم يغنيا عنهما : فـلمْ يَدْفَعا و لم يمْنعاعنهما"], // فَلَم
      ["فلم يغنيا عنهما : فـلمْ يَدْفَعا و لم يمْنعاعنهما"], // يُغنِيا
      ["فلم يغنيا عنهما : فـلمْ يَدْفَعا و لم يمْنعاعنهما"], // عَنهُما
      [], // مِنَ
      [], // اللَّهِ
      [], // شَيـًٔا
      [], // وَقيلَ
      [], // ادخُلَا
      [], // النّارَ
      [], // مَعَ
      [] // الدّٰخِلينَ
    ],
    [ // آية 11
      [], // وَضَرَبَ
      [], // اللَّهُ
      [], // مَثَلًا
      [], // لِلَّذينَ
      [], // ءامَنُوا
      [], // امرَأَتَ
      [], // فِرعَونَ
      [], // إِذ
      [], // قالَت
      [], // رَبِّ
      [], // ابنِ
      [], // لى
      [], // عِندَكَ
      [], // بَيتًا
      [], // فِى
      [], // الجَنَّةِ
      [], // وَنَجِّنى
      [], // مِن
      [], // فِرعَونَ
      [], // وَعَمَلِهِ
      [], // وَنَجِّنى
      [], // مِنَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 12
      [], // وَمَريَمَ
      [], // ابنَتَ
      [], // عِمرٰنَ
      [], // الَّتى
      ["أحصنت فرجها : عَـفّـتْ و صانته من الرّجال"], // أَحصَنَت
      ["أحصنت فرجها : عَـفّـتْ و صانته من الرّجال"], // فَرجَها
      [], // فَنَفَخنا
      [], // فيهِ
      ["من روحنا : روحًا مِنْ خَلقِـنـَـا بلا توسّط أبٍ (عيسى عليه السلام)"], // مِن
      ["من روحنا : روحًا مِنْ خَلقِـنـَـا بلا توسّط أبٍ (عيسى عليه السلام)"], // روحِنا
      [], // وَصَدَّقَت
      [], // بِكَلِمـٰتِ
      [], // رَبِّها
      [], // وَكُتُبِهِ
      [], // وَكانَت
      [], // مِنَ
      [] // القـٰنِتينَ
    ]
];

export default meanings;