const meanings = [
[ // آية 1
      [], // تَبـٰرَكَ
      [], // الَّذى
      ["بيده الملك : له الأمر و النّهي و السلطان"], // بِيَدِهِ
      ["بيده الملك : له الأمر و النّهي و السلطان"], // المُلكُ
      [], // وَهُوَ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 2
      [], // الَّذى
      ["خلق الموت : أوْدَه . أو قدّرَه أزلاً"], // خَلَقَ
      ["خلق الموت : أوْدَه . أو قدّرَه أزلاً"], // المَوتَ
      [], // وَالحَيوٰةَ
      ["ليبلوكم : ليَختبركم فيما بين الحياة و الموت"], // لِيَبلُوَكُم
      [], // أَيُّكُم
      ["أحسن عملا : أصْوبَه و أخلَصَه أو أسْرَع طاعة"], // أَحسَنُ
      ["أحسن عملا : أصْوبَه و أخلَصَه أو أسْرَع طاعة"], // عَمَلًا
      [], // وَهُوَ
      [], // العَزيزُ
      [] // الغَفورُ
    ],
    [ // آية 3
      [], // الَّذى
      [], // خَلَقَ
      [], // سَبعَ
      [], // سَمـٰوٰتٍ
      ["طباقا : كلّ سَماءٍ مَقـْـــِبـيّة على الأخرى"], // طِباقًا
      [], // ما
      [], // تَرىٰ
      [], // فى
      [], // خَلقِ
      [], // الرَّحمـٰنِ
      [], // مِن
      [], // تَفـٰوُتٍ
      [], // فَارجِعِ
      [], // البَصَرَ
      [], // هَل
      [], // تَرىٰ
      [], // مِن
      [] // فُطورٍ
    ],
    [ // آية 4
      [], // ثُمَّ
      [], // ارجِعِ
      [], // البَصَرَ
      ["كرتين : رَجْعَتين رَجعة بعد رجعة"], // كَرَّتَينِ
      [], // يَنقَلِب
      [], // إِلَيكَ
      [], // البَصَرُ
      ["خاسئا : صاغرا لعدم  ِوجْدان الفـُـطور"], // خاسِئًا
      [], // وَهُوَ
      [] // حَسيرٌ
    ],
    [ // آية 5
      [], // وَلَقَد
      [], // زَيَّنَّا
      [], // السَّماءَ
      [], // الدُّنيا
      [], // بِمَصـٰبيحَ
      [], // وَجَعَلنـٰها
      [], // رُجومًا
      [], // لِلشَّيـٰطينِ
      [], // وَأَعتَدنا
      [], // لَهُم
      [], // عَذابَ
      [] // السَّعيرِ
    ],
    [ // آية 6
      [], // وَلِلَّذينَ
      [], // كَفَروا
      [], // بِرَبِّهِم
      [], // عَذابُ
      [], // جَهَنَّمَ
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 7
      [], // إِذا
      [], // أُلقوا
      [], // فيها
      [], // سَمِعوا
      [], // لَها
      ["شهيقا : صَوْتا مُـنـْـكرًا كصوت الحمير"], // شَهيقًا
      [], // وَهِىَ
      ["تفور : تغلي بهم غليَان القِدْر بما فيها"] // تَفورُ
    ],
    [ // آية 8
      [], // تَكادُ
      [], // تَمَيَّزُ
      [], // مِنَ
      [], // الغَيظِ
      [], // كُلَّما
      [], // أُلقِىَ
      [], // فيها
      [], // فَوجٌ
      [], // سَأَلَهُم
      [], // خَزَنَتُها
      [], // أَلَم
      [], // يَأتِكُم
      [] // نَذيرٌ
    ],
    [ // آية 9
      [], // قالوا
      [], // بَلىٰ
      [], // قَد
      [], // جاءَنا
      [], // نَذيرٌ
      [], // فَكَذَّبنا
      [], // وَقُلنا
      [], // ما
      [], // نَزَّلَ
      [], // اللَّهُ
      [], // مِن
      [], // شَىءٍ
      [], // إِن
      [], // أَنتُم
      [], // إِلّا
      [], // فى
      [], // ضَلـٰلٍ
      [] // كَبيرٍ
    ],
    [ // آية 10
      [], // وَقالوا
      [], // لَو
      [], // كُنّا
      [], // نَسمَعُ
      [], // أَو
      [], // نَعقِلُ
      [], // ما
      [], // كُنّا
      [], // فى
      [], // أَصحـٰبِ
      [] // السَّعيرِ
    ],
    [ // آية 11
      [], // فَاعتَرَفوا
      [], // بِذَنبِهِم
      ["فَسُحْقا : فبُعْدا من الرّحمة و الكرامة"], // فَسُحقًا
      [], // لِأَصحـٰبِ
      [] // السَّعيرِ
    ],
    [ // آية 12
      [], // إِنَّ
      [], // الَّذينَ
      [], // يَخشَونَ
      [], // رَبَّهُم
      [], // بِالغَيبِ
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَأَجرٌ
      [] // كَبيرٌ
    ],
    [ // آية 13
      [], // وَأَسِرّوا
      [], // قَولَكُم
      [], // أَوِ
      [], // اجهَروا
      [], // بِهِ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 14
      [], // أَلا
      [], // يَعلَمُ
      [], // مَن
      [], // خَلَقَ
      [], // وَهُوَ
      [], // اللَّطيفُ
      [] // الخَبيرُ
    ],
    [ // آية 15
      [], // هُوَ
      [], // الَّذى
      [], // جَعَلَ
      [], // لَكُمُ
      ["الأرض ذلولا : مُذلـّـلة ليّـنـَـة سَهْلة تستقـرّون عليها"], // الأَرضَ
      ["الأرض ذلولا : مُذلـّـلة ليّـنـَـة سَهْلة تستقـرّون عليها"], // ذَلولًا
      [], // فَامشوا
      [], // فى
      ["مَناكبها : جَوَانبها . أو طُرُقِها و فِجَاجها"], // مَناكِبِها
      [], // وَكُلوا
      [], // مِن
      [], // رِزقِهِ
      [], // وَإِلَيهِ
      [] // النُّشورُ
    ],
    [ // آية 16
      [], // ءَأَمِنتُم
      [], // مَن
      [], // فِى
      [], // السَّماءِ
      [], // أَن
      ["يَخسف بكم : يُـغَوّر بكم"], // يَخسِفَ
      ["يَخسف بكم : يُـغَوّر بكم"], // بِكُمُ
      [], // الأَرضَ
      [], // فَإِذا
      [], // هِىَ
      [] // تَمورُ
    ],
    [ // آية 17
      [], // أَم
      [], // أَمِنتُم
      [], // مَن
      [], // فِى
      [], // السَّماءِ
      [], // أَن
      [], // يُرسِلَ
      [], // عَلَيكُم
      ["حاصبا : ريحًا من السّماء فيها حَصباء"], // حاصِبًا
      [], // فَسَتَعلَمونَ
      [], // كَيفَ
      [] // نَذيرِ
    ],
    [ // آية 18
      [], // وَلَقَد
      [], // كَذَّبَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // فَكَيفَ
      ["كان نكير : إنكاري عليهم بالإهلاك"], // كانَ
      ["كان نكير : إنكاري عليهم بالإهلاك"] // نَكيرِ
    ],
    [ // آية 19
      [], // أَوَلَم
      [], // يَرَوا
      [], // إِلَى
      [], // الطَّيرِ
      [], // فَوقَهُم
      [], // صـٰفّـٰتٍ
      [], // وَيَقبِضنَ
      [], // ما
      [], // يُمسِكُهُنَّ
      [], // إِلَّا
      [], // الرَّحمـٰنُ
      [], // إِنَّهُ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // بَصيرٌ
    ],
    [ // آية 20
      [], // أَمَّن
      [], // هـٰذَا
      [], // الَّذى
      [], // هُوَ
      ["جُندٌ لكم : أعْوان لكم و مَنـَـعَة"], // جُندٌ
      ["جُندٌ لكم : أعْوان لكم و مَنـَـعَة"], // لَكُم
      [], // يَنصُرُكُم
      [], // مِن
      [], // دونِ
      [], // الرَّحمـٰنِ
      [], // إِنِ
      [], // الكـٰفِرونَ
      [], // إِلّا
      [], // فى
      ["غرور : خديعة من الشيطان و جنده"] // غُرورٍ
    ],
    [ // آية 21
      [], // أَمَّن
      [], // هـٰذَا
      [], // الَّذى
      [], // يَرزُقُكُم
      [], // إِن
      [], // أَمسَكَ
      [], // رِزقَهُ
      [], // بَل
      [], // لَجّوا
      [], // فى
      [], // عُتُوٍّ
      [] // وَنُفورٍ
    ],
    [ // آية 22
      [], // أَفَمَن
      [], // يَمشى
      [], // مُكِبًّا
      [], // عَلىٰ
      [], // وَجهِهِ
      [], // أَهدىٰ
      [], // أَمَّن
      [], // يَمشى
      [], // سَوِيًّا
      [], // عَلىٰ
      [], // صِرٰطٍ
      [] // مُستَقيمٍ
    ],
    [ // آية 23
      [], // قُل
      [], // هُوَ
      [], // الَّذى
      [], // أَنشَأَكُم
      [], // وَجَعَلَ
      [], // لَكُمُ
      [], // السَّمعَ
      [], // وَالأَبصـٰرَ
      [], // وَالأَفـِٔدَةَ
      [], // قَليلًا
      [], // ما
      [] // تَشكُرونَ
    ],
    [ // آية 24
      [], // قُل
      [], // هُوَ
      [], // الَّذى
      ["ذرأكم : خَلقكم و بَثـّـكم و فرّقكم"], // ذَرَأَكُم
      [], // فِى
      [], // الأَرضِ
      [], // وَإِلَيهِ
      [] // تُحشَرونَ
    ],
    [ // آية 25
      [], // وَيَقولونَ
      [], // مَتىٰ
      [], // هـٰذَا
      [], // الوَعدُ
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 26
      [], // قُل
      [], // إِنَّمَا
      [], // العِلمُ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَإِنَّما
      [], // أَنا۠
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 27
      [], // فَلَمّا
      ["رأوه زلفة : رَأوُا العذاب قريبا منهم"], // رَأَوهُ
      ["رأوه زلفة : رَأوُا العذاب قريبا منهم"], // زُلفَةً
      [], // سيـَٔت
      [], // وُجوهُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَقيلَ
      [], // هـٰذَا
      [], // الَّذى
      [], // كُنتُم
      ["به تدعون : تـَـطلبون أن يُعجّل لكم استهزاءً"], // بِهِ
      ["به تدعون : تـَـطلبون أن يُعجّل لكم استهزاءً"] // تَدَّعونَ
    ],
    [ // آية 28
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // أَهلَكَنِىَ
      [], // اللَّهُ
      [], // وَمَن
      [], // مَعِىَ
      [], // أَو
      [], // رَحِمَنا
      [], // فَمَن
      [], // يُجيرُ
      [], // الكـٰفِرينَ
      [], // مِن
      [], // عَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 29
      [], // قُل
      [], // هُوَ
      [], // الرَّحمـٰنُ
      [], // ءامَنّا
      [], // بِهِ
      [], // وَعَلَيهِ
      [], // تَوَكَّلنا
      [], // فَسَتَعلَمونَ
      [], // مَن
      [], // هُوَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 30
      [], // قُل
      [], // أَرَءَيتُم
      [], // إِن
      [], // أَصبَحَ
      [], // ماؤُكُم
      ["غَوْرا : غائرا ذاهبا في الأرض لا يُنال"], // غَورًا
      [], // فَمَن
      [], // يَأتيكُم
      ["بماء معين : جَار أو ظاهرٍ . سَهْل التـّـناوُل"], // بِماءٍ
      ["بماء معين : جَار أو ظاهرٍ . سَهْل التـّـناوُل"] // مَعينٍ
    ]
];

export default meanings;