const meanings = [
[ // آية 1
      [], // ن
      [], // وَالقَلَمِ
      [], // وَما
      [] // يَسطُرونَ
    ],
    [ // آية 2
      ["ما أنت : يا محمد (جواب القسم)"], // ما
      ["ما أنت : يا محمد (جواب القسم)"], // أَنتَ
      [], // بِنِعمَةِ
      [], // رَبِّكَ
      [] // بِمَجنونٍ
    ],
    [ // آية 3
      [], // وَإِنَّ
      [], // لَكَ
      [], // لَأَجرًا
      ["غير ممنون : غير مقطوع عنك"], // غَيرَ
      ["غير ممنون : غير مقطوع عنك"] // مَمنونٍ
    ],
    [ // آية 4
      [], // وَإِنَّكَ
      [], // لَعَلىٰ
      [], // خُلُقٍ
      [] // عَظيمٍ
    ],
    [ // آية 5
      [], // فَسَتُبصِرُ
      [] // وَيُبصِرونَ
    ],
    [ // آية 6
      [], // بِأَييِكُمُ
      [] // المَفتونُ
    ],
    [ // آية 7
      [], // إِنَّ
      [], // رَبَّكَ
      [], // هُوَ
      [], // أَعلَمُ
      [], // بِمَن
      [], // ضَلَّ
      [], // عَن
      [], // سَبيلِهِ
      [], // وَهُوَ
      [], // أَعلَمُ
      [] // بِالمُهتَدينَ
    ],
    [ // آية 8
      [], // فَلا
      [], // تُطِعِ
      [] // المُكَذِّبينَ
    ],
    [ // آية 9
      ["ودّوا لو تدهن : أحبّوا لـَوْ تلايـنُهمْ و تصانِعُهمْ"], // وَدّوا
      ["ودّوا لو تدهن : أحبّوا لـَوْ تلايـنُهمْ و تصانِعُهمْ"], // لَو
      ["ودّوا لو تدهن : أحبّوا لـَوْ تلايـنُهمْ و تصانِعُهمْ"], // تُدهِنُ
      ["فيُدهِنون : فَهُمْ يُلاينونـَـك و يُصانعُونك"] // فَيُدهِنونَ
    ],
    [ // آية 10
      [], // وَلا
      [], // تُطِع
      [], // كُلَّ
      ["حلاف : كثير الحَلِفِ في الحقّ و الباطل"], // حَلّافٍ
      ["مهين : حقير في الرأي و التمييز أو كَذاب"] // مَهينٍ
    ],
    [ // آية 11
      ["همّاز : عيّـاب أو مُغتاب للنّـاس"], // هَمّازٍ
      [], // مَشّاءٍ
      [] // بِنَميمٍ
    ],
    [ // آية 12
      [], // مَنّاعٍ
      [], // لِلخَيرِ
      [], // مُعتَدٍ
      [] // أَثيمٍ
    ],
    [ // آية 13
      [], // عُتُلٍّ
      [], // بَعدَ
      [], // ذٰلِكَ
      ["زنيم : دَعِيّ مُـلصَق بقوْمِه أو شِرّير"] // زَنيمٍ
    ],
    [ // آية 14
      [], // أَن
      [], // كانَ
      [], // ذا
      [], // مالٍ
      [] // وَبَنينَ
    ],
    [ // آية 15
      [], // إِذا
      [], // تُتلىٰ
      [], // عَلَيهِ
      [], // ءايـٰتُنا
      [], // قالَ
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 16
      ["سنسمه على الخرطوم : سَنلحِق به عارًا لا يُـفارقه كالوَسْم على الأنف"], // سَنَسِمُهُ
      ["سنسمه على الخرطوم : سَنلحِق به عارًا لا يُـفارقه كالوَسْم على الأنف"], // عَلَى
      ["سنسمه على الخرطوم : سَنلحِق به عارًا لا يُـفارقه كالوَسْم على الأنف"] // الخُرطومِ
    ],
    [ // آية 17
      [], // إِنّا
      [], // بَلَونـٰهُم
      [], // كَما
      [], // بَلَونا
      [], // أَصحـٰبَ
      ["الجنّة : بُسْـتان بالقرب من صنعاء"], // الجَنَّةِ
      [], // إِذ
      [], // أَقسَموا
      ["ليَصْرمنها : لـَـيَـقـْـطعنّ ثمارها بعد الإستواء"], // لَيَصرِمُنَّها
      ["مصبحين : داخلين في وقت الصّباح"] // مُصبِحينَ
    ],
    [ // آية 18
      [], // وَلا
      [] // يَستَثنونَ
    ],
    [ // آية 19
      ["فطاف عليها : أحاط نازلا عليها"], // فَطافَ
      ["فطاف عليها : أحاط نازلا عليها"], // عَلَيها
      ["طائف : بَلاءٌ و عذابٌ (نارٌ مُحْرقة)"], // طائِفٌ
      [], // مِن
      [], // رَبِّكَ
      [], // وَهُم
      [] // نائِمونَ
    ],
    [ // آية 20
      [], // فَأَصبَحَت
      ["كالصريم : كالليل الأسود أو البستان المّصروم"] // كَالصَّريمِ
    ],
    [ // آية 21
      [], // فَتَنادَوا
      [] // مُصبِحينَ
    ],
    [ // آية 22
      [], // أَنِ
      ["اغدوا على حرْثِكم : بَـاكِرُوا مُقبلين على ثماركم"], // اغدوا
      ["اغدوا على حرْثِكم : بَـاكِرُوا مُقبلين على ثماركم"], // عَلىٰ
      ["اغدوا على حرْثِكم : بَـاكِرُوا مُقبلين على ثماركم"], // حَرثِكُم
      [], // إِن
      [], // كُنتُم
      [] // صـٰرِمينَ
    ],
    [ // آية 23
      [], // فَانطَلَقوا
      [], // وَهُم
      [] // يَتَخـٰفَتونَ
    ],
    [ // آية 24
      [], // أَن
      [], // لا
      [], // يَدخُلَنَّهَا
      [], // اليَومَ
      [], // عَلَيكُم
      [] // مِسكينٌ
    ],
    [ // آية 25
      [], // وَغَدَوا
      ["على حرْد : على انفراد عن المساكين"], // عَلىٰ
      ["على حرْد : على انفراد عن المساكين"], // حَردٍ
      [] // قـٰدِرينَ
    ],
    [ // آية 26
      [], // فَلَمّا
      [], // رَأَوها
      [], // قالوا
      [], // إِنّا
      [] // لَضالّونَ
    ],
    [ // آية 27
      [], // بَل
      [], // نَحنُ
      [] // مَحرومونَ
    ],
    [ // آية 28
      [], // قالَ
      ["أوْسَطهم : أحسنهم رأيا و أرجحهم عقلا"], // أَوسَطُهُم
      [], // أَلَم
      [], // أَقُل
      [], // لَكُم
      ["لولا تسبّحون : هلاّ تستغفرون الله من فعلكم و خبْث نيّـتكم"], // لَولا
      ["لولا تسبّحون : هلاّ تستغفرون الله من فعلكم و خبْث نيّـتكم"] // تُسَبِّحونَ
    ],
    [ // آية 29
      [], // قالوا
      [], // سُبحـٰنَ
      [], // رَبِّنا
      [], // إِنّا
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 30
      [], // فَأَقبَلَ
      [], // بَعضُهُم
      [], // عَلىٰ
      [], // بَعضٍ
      [] // يَتَلـٰوَمونَ
    ],
    [ // آية 31
      [], // قالوا
      [], // يـٰوَيلَنا
      [], // إِنّا
      [], // كُنّا
      [] // طـٰغينَ
    ],
    [ // آية 32
      [], // عَسىٰ
      [], // رَبُّنا
      [], // أَن
      [], // يُبدِلَنا
      [], // خَيرًا
      [], // مِنها
      [], // إِنّا
      [], // إِلىٰ
      [], // رَبِّنا
      [] // رٰغِبونَ
    ],
    [ // آية 33
      [], // كَذٰلِكَ
      [], // العَذابُ
      [], // وَلَعَذابُ
      [], // الـٔاخِرَةِ
      [], // أَكبَرُ
      [], // لَو
      [], // كانوا
      [] // يَعلَمونَ
    ],
    [ // آية 34
      [], // إِنَّ
      [], // لِلمُتَّقينَ
      [], // عِندَ
      [], // رَبِّهِم
      [], // جَنّـٰتِ
      [] // النَّعيمِ
    ],
    [ // آية 35
      [], // أَفَنَجعَلُ
      [], // المُسلِمينَ
      [] // كَالمُجرِمينَ
    ],
    [ // آية 36
      [], // ما
      [], // لَكُم
      [], // كَيفَ
      [] // تَحكُمونَ
    ],
    [ // آية 37
      [], // أَم
      [], // لَكُم
      [], // كِتـٰبٌ
      [], // فيهِ
      [] // تَدرُسونَ
    ],
    [ // آية 38
      [], // إِنَّ
      [], // لَكُم
      [], // فيهِ
      [], // لَما
      [] // تَخَيَّرونَ
    ],
    [ // آية 39
      [], // أَم
      [], // لَكُم
      [], // أَيمـٰنٌ
      [], // عَلَينا
      [], // بـٰلِغَةٌ
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // إِنَّ
      [], // لَكُم
      ["لما تحْكمون : لـلـّذي تحكمون به لأنفسكمْ"], // لَما
      ["لما تحْكمون : لـلـّذي تحكمون به لأنفسكمْ"] // تَحكُمونَ
    ],
    [ // آية 40
      [], // سَلهُم
      [], // أَيُّهُم
      [], // بِذٰلِكَ
      [] // زَعيمٌ
    ],
    [ // آية 41
      [], // أَم
      [], // لَهُم
      [], // شُرَكاءُ
      [], // فَليَأتوا
      [], // بِشُرَكائِهِم
      [], // إِن
      [], // كانوا
      [] // صـٰدِقينَ
    ],
    [ // آية 42
      [], // يَومَ
      ["يُكشف عن ساق : كنايَة عن شدّة هوْل يوم القـيامة"], // يُكشَفُ
      ["يُكشف عن ساق : كنايَة عن شدّة هوْل يوم القـيامة"], // عَن
      ["يُكشف عن ساق : كنايَة عن شدّة هوْل يوم القـيامة"], // ساقٍ
      [], // وَيُدعَونَ
      [], // إِلَى
      [], // السُّجودِ
      [], // فَلا
      [] // يَستَطيعونَ
    ],
    [ // آية 43
      [], // خـٰشِعَةً
      [], // أَبصـٰرُهُم
      [], // تَرهَقُهُم
      [], // ذِلَّةٌ
      [], // وَقَد
      [], // كانوا
      [], // يُدعَونَ
      [], // إِلَى
      [], // السُّجودِ
      [], // وَهُم
      [] // سـٰلِمونَ
    ],
    [ // آية 44
      [], // فَذَرنى
      [], // وَمَن
      [], // يُكَذِّبُ
      [], // بِهـٰذَا
      [], // الحَديثِ
      [], // سَنَستَدرِجُهُم
      [], // مِن
      [], // حَيثُ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 45
      [], // وَأُملى
      [], // لَهُم
      [], // إِنَّ
      [], // كَيدى
      [] // مَتينٌ
    ],
    [ // آية 46
      [], // أَم
      [], // تَسـَٔلُهُم
      [], // أَجرًا
      [], // فَهُم
      [], // مِن
      ["مَغرَمٍ : غَرامة ذلك الأجر"], // مَغرَمٍ
      ["مُثقلون : مُكلفون حِمْلاً ثقيلاً"] // مُثقَلونَ
    ],
    [ // آية 47
      [], // أَم
      [], // عِندَهُمُ
      [], // الغَيبُ
      [], // فَهُم
      [] // يَكتُبونَ
    ],
    [ // آية 48
      [], // فَاصبِر
      [], // لِحُكمِ
      [], // رَبِّكَ
      [], // وَلا
      [], // تَكُن
      ["كصاحب الحوت : يونس عليه السّـلام"], // كَصاحِبِ
      ["كصاحب الحوت : يونس عليه السّـلام"], // الحوتِ
      [], // إِذ
      [], // نادىٰ
      [], // وَهُوَ
      ["مَكظوم : مَمْـلوءٌ غَـيْظا في قـلبه على قَوْمه"] // مَكظومٌ
    ],
    [ // آية 49
      [], // لَولا
      [], // أَن
      [], // تَدٰرَكَهُ
      [], // نِعمَةٌ
      [], // مِن
      [], // رَبِّهِ
      [], // لَنُبِذَ
      [], // بِالعَراءِ
      [], // وَهُوَ
      [] // مَذمومٌ
    ],
    [ // آية 50
      [], // فَاجتَبـٰهُ
      [], // رَبُّهُ
      [], // فَجَعَلَهُ
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 51
      [], // وَإِن
      [], // يَكادُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // لَيُزلِقونَكَ
      [], // بِأَبصـٰرِهِم
      [], // لَمّا
      [], // سَمِعُوا
      [], // الذِّكرَ
      [], // وَيَقولونَ
      [], // إِنَّهُ
      [] // لَمَجنونٌ
    ],
    [ // آية 52
      [], // وَما
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرٌ
      [] // لِلعـٰلَمينَ
    ]
];

export default meanings;