const meanings = [
  [ // سورة 69: الحاقة
[ // آية 1
      ["الحاقّة : السّاعة يَتحقـّـق فيها ما أنكَرُوه"] // الحاقَّةُ
    ],
    [ // آية 2
      ["ما الحاقّة : أيّ شيءٍ هِيَ في أهْوَالها"], // مَا
      ["ما الحاقّة : أيّ شيءٍ هِيَ في أهْوَالها"] // الحاقَّةُ
    ],
    [ // آية 3
      [], // وَما
      [], // أَدرىٰكَ
      [], // مَا
      [] // الحاقَّةُ
    ],
    [ // آية 4
      [], // كَذَّبَت
      [], // ثَمودُ
      [], // وَعادٌ
      ["بالقارعة : بالقيامة تـقـْـرَع القـلوب بأفزَاعِها"] // بِالقارِعَةِ
    ],
    [ // آية 5
      [], // فَأَمّا
      [], // ثَمودُ
      [], // فَأُهلِكوا
      ["بالطاغية : بالصّـيْحَة المُجَاوزة للحدّ في الشّدة"] // بِالطّاغِيَةِ
    ],
    [ // آية 6
      [], // وَأَمّا
      [], // عادٌ
      [], // فَأُهلِكوا
      ["بريح صرصر : شديدة السّموم أو البرْد أو الصّوْت"], // بِريحٍ
      ["بريح صرصر : شديدة السّموم أو البرْد أو الصّوْت"], // صَرصَرٍ
      [] // عاتِيَةٍ
    ],
    [ // آية 7
      ["سَخّرها عليهم : سَلـّـطها عليهم بقدْرتِه تعالى"], // سَخَّرَها
      ["سَخّرها عليهم : سَلـّـطها عليهم بقدْرتِه تعالى"], // عَلَيهِم
      [], // سَبعَ
      [], // لَيالٍ
      [], // وَثَمـٰنِيَةَ
      [], // أَيّامٍ
      ["حُسُوما : مُـتـتـَـابعَاتٍ . أو مَشئوماتٍ"], // حُسومًا
      [], // فَتَرَى
      [], // القَومَ
      [], // فيها
      [], // صَرعىٰ
      [], // كَأَنَّهُم
      ["أعْجَاز نخل : جُذوع نـَخل بلا رُءُوس"], // أَعجازُ
      ["أعْجَاز نخل : جُذوع نـَخل بلا رُءُوس"], // نَخلٍ
      ["خاوية : ساقِطة أو فارغة  أو بالِيَة"] // خاوِيَةٍ
    ],
    [ // آية 8
      [], // فَهَل
      [], // تَرىٰ
      [], // لَهُم
      [], // مِن
      [] // باقِيَةٍ
    ],
    [ // آية 9
      [], // وَجاءَ
      [], // فِرعَونُ
      [], // وَمَن
      [], // قَبلَهُ
      [], // وَالمُؤتَفِكـٰتُ
      ["بالخاطئة : بالفَعَلات ذات الخَطَـأ الجَسيم"] // بِالخاطِئَةِ
    ],
    [ // آية 10
      [], // فَعَصَوا
      [], // رَسولَ
      [], // رَبِّهِم
      [], // فَأَخَذَهُم
      ["أخذة رَابيَة : زَائدة في الشدّة على الأخذات"], // أَخذَةً
      ["أخذة رَابيَة : زَائدة في الشدّة على الأخذات"] // رابِيَةً
    ],
    [ // آية 11
      [], // إِنّا
      [], // لَمّا
      [], // طَغَا
      [], // الماءُ
      [], // حَمَلنـٰكُم
      [], // فِى
      ["الجَاريَة : سَفينة نوح عليه السّـلام"] // الجارِيَةِ
    ],
    [ // آية 12
      [], // لِنَجعَلَها
      [], // لَكُم
      [], // تَذكِرَةً
      [], // وَتَعِيَها
      [], // أُذُنٌ
      [] // وٰعِيَةٌ
    ],
    [ // آية 13
      [], // فَإِذا
      [], // نُفِخَ
      [], // فِى
      [], // الصّورِ
      [], // نَفخَةٌ
      [] // وٰحِدَةٌ
    ],
    [ // آية 14
      [], // وَحُمِلَتِ
      [], // الأَرضُ
      [], // وَالجِبالُ
      [], // فَدُكَّتا
      [], // دَكَّةً
      [] // وٰحِدَةً
    ],
    [ // آية 15
      [], // فَيَومَئِذٍ
      ["وَقَعَت الواقِعة : قامت القيامة"], // وَقَعَتِ
      ["وَقَعَت الواقِعة : قامت القيامة"] // الواقِعَةُ
    ],
    [ // آية 16
      [], // وَانشَقَّتِ
      [], // السَّماءُ
      [], // فَهِىَ
      [], // يَومَئِذٍ
      [] // واهِيَةٌ
    ],
    [ // آية 17
      [], // وَالمَلَكُ
      ["على أرْجائها : جَوانبها و أطرافها"], // عَلىٰ
      ["على أرْجائها : جَوانبها و أطرافها"], // أَرجائِها
      [], // وَيَحمِلُ
      [], // عَرشَ
      [], // رَبِّكَ
      [], // فَوقَهُم
      [], // يَومَئِذٍ
      [] // ثَمـٰنِيَةٌ
    ],
    [ // آية 18
      [], // يَومَئِذٍ
      [], // تُعرَضونَ
      [], // لا
      [], // تَخفىٰ
      [], // مِنكُم
      [] // خافِيَةٌ
    ],
    [ // آية 19
      [], // فَأَمّا
      [], // مَن
      [], // أوتِىَ
      [], // كِتـٰبَهُ
      [], // بِيَمينِهِ
      [], // فَيَقولُ
      ["هاؤم : خُذوا أو تعالـَـوْا"], // هاؤُمُ
      [], // اقرَءوا
      [] // كِتـٰبِيَه
    ],
    [ // آية 20
      [], // إِنّى
      [], // ظَنَنتُ
      [], // أَنّى
      [], // مُلـٰقٍ
      [] // حِسابِيَه
    ],
    [ // آية 21
      [], // فَهُوَ
      [], // فى
      [], // عيشَةٍ
      [] // راضِيَةٍ
    ],
    [ // آية 22
      [], // فى
      [], // جَنَّةٍ
      [] // عالِيَةٍ
    ],
    [ // آية 23
      ["قطوفها دانية : ثمارها قريبة التـّـناول إذ تـُـجْـنى"], // قُطوفُها
      ["قطوفها دانية : ثمارها قريبة التـّـناول إذ تـُـجْـنى"] // دانِيَةٌ
    ],
    [ // آية 24
      [], // كُلوا
      [], // وَاشرَبوا
      [], // هَنيـًٔا
      [], // بِما
      [], // أَسلَفتُم
      [], // فِى
      [], // الأَيّامِ
      [] // الخالِيَةِ
    ],
    [ // آية 25
      [], // وَأَمّا
      [], // مَن
      [], // أوتِىَ
      [], // كِتـٰبَهُ
      [], // بِشِمالِهِ
      [], // فَيَقولُ
      [], // يـٰلَيتَنى
      [], // لَم
      [], // أوتَ
      [] // كِتـٰبِيَه
    ],
    [ // آية 26
      [], // وَلَم
      [], // أَدرِ
      [], // ما
      [] // حِسابِيَه
    ],
    [ // آية 27
      [], // يـٰلَيتَها
      ["كانت القاضية : الموْتة القاطعة لأمْري و لم أبْعَث"], // كانَتِ
      ["كانت القاضية : الموْتة القاطعة لأمْري و لم أبْعَث"] // القاضِيَةَ
    ],
    [ // آية 28
      [], // ما
      [], // أَغنىٰ
      [], // عَنّى
      [] // مالِيَه
    ],
    [ // آية 29
      [], // هَلَكَ
      [], // عَنّى
      [] // سُلطـٰنِيَه
    ],
    [ // آية 30
      [], // خُذوهُ
      [] // فَغُلّوهُ
    ],
    [ // آية 31
      [], // ثُمَّ
      [], // الجَحيمَ
      [] // صَلّوهُ
    ],
    [ // آية 32
      [], // ثُمَّ
      [], // فى
      [], // سِلسِلَةٍ
      [], // ذَرعُها
      [], // سَبعونَ
      [], // ذِراعًا
      [] // فَاسلُكوهُ
    ],
    [ // آية 33
      [], // إِنَّهُ
      [], // كانَ
      [], // لا
      [], // يُؤمِنُ
      [], // بِاللَّهِ
      [] // العَظيمِ
    ],
    [ // آية 34
      [], // وَلا
      [], // يَحُضُّ
      [], // عَلىٰ
      [], // طَعامِ
      [] // المِسكينِ
    ],
    [ // آية 35
      [], // فَلَيسَ
      [], // لَهُ
      [], // اليَومَ
      [], // هـٰهُنا
      [] // حَميمٌ
    ],
    [ // آية 36
      [], // وَلا
      [], // طَعامٌ
      [], // إِلّا
      [], // مِن
      ["غِسلين : صَديد أهْل النّـار"] // غِسلينٍ
    ],
    [ // آية 37
      [], // لا
      [], // يَأكُلُهُ
      [], // إِلَّا
      [] // الخـٰطِـٔونَ
    ],
    [ // آية 38
      [], // فَلا
      [], // أُقسِمُ
      [], // بِما
      [] // تُبصِرونَ
    ],
    [ // آية 39
      [], // وَما
      [], // لا
      [] // تُبصِرونَ
    ],
    [ // آية 40
      ["إنّه لَقوْل رَسول : يُـبَـلـّـغُهُ عن الله أوحِيَ إليْه"], // إِنَّهُ
      ["إنّه لَقوْل رَسول : يُـبَـلـّـغُهُ عن الله أوحِيَ إليْه"], // لَقَولُ
      ["إنّه لَقوْل رَسول : يُـبَـلـّـغُهُ عن الله أوحِيَ إليْه"], // رَسولٍ
      [] // كَريمٍ
    ],
    [ // آية 41
      [], // وَما
      [], // هُوَ
      [], // بِقَولِ
      [], // شاعِرٍ
      [], // قَليلًا
      [], // ما
      [] // تُؤمِنونَ
    ],
    [ // آية 42
      [], // وَلا
      [], // بِقَولِ
      [], // كاهِنٍ
      [], // قَليلًا
      [], // ما
      [] // تَذَكَّرونَ
    ],
    [ // آية 43
      [], // تَنزيلٌ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 44
      [], // وَلَو
      [], // تَقَوَّلَ
      [], // عَلَينا
      [], // بَعضَ
      [] // الأَقاويلِ
    ],
    [ // آية 45
      [], // لَأَخَذنا
      [], // مِنهُ
      ["باليَمين : بيَمينه . أوْ بالقـُـوّة و القُـدْرَة"] // بِاليَمينِ
    ],
    [ // آية 46
      [], // ثُمَّ
      [], // لَقَطَعنا
      [], // مِنهُ
      ["الوَتين : نِيَاط القـَـلب . أو نُخاع الظهر"] // الوَتينَ
    ],
    [ // آية 47
      [], // فَما
      [], // مِنكُم
      [], // مِن
      [], // أَحَدٍ
      [], // عَنهُ
      [] // حـٰجِزينَ
    ],
    [ // آية 48
      [], // وَإِنَّهُ
      [], // لَتَذكِرَةٌ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 49
      [], // وَإِنّا
      [], // لَنَعلَمُ
      [], // أَنَّ
      [], // مِنكُم
      [] // مُكَذِّبينَ
    ],
    [ // آية 50
      [], // وَإِنَّهُ
      ["لَحَسْرَةٌ : نـَـدامَة عظيمة"], // لَحَسرَةٌ
      [], // عَلَى
      [] // الكـٰفِرينَ
    ],
    [ // آية 51
      [], // وَإِنَّهُ
      [], // لَحَقُّ
      [] // اليَقينِ
    ],
    [ // آية 52
      [], // فَسَبِّح
      [], // بِاسمِ
      [], // رَبِّكَ
      [] // العَظيمِ
    ]
  ]
];

export default meanings;