const meanings = [
  [ // سورة 7: الأعراف
[ // آية 1
      [] // المص
    ],
    [ // آية 2
      [], // كِتـٰبٌ
      [], // أُنزِلَ
      [], // إِلَيكَ
      [], // فَلا
      [], // يَكُن
      [], // فى
      [], // صَدرِكَ
      ["حرجٌ منه : ضيقٌ من تبليغه خشية التكذيب"], // حَرَجٌ
      ["حرجٌ منه : ضيقٌ من تبليغه خشية التكذيب"], // مِنهُ
      [], // لِتُنذِرَ
      [], // بِهِ
      [], // وَذِكرىٰ
      [] // لِلمُؤمِنينَ
    ],
    [ // آية 3
      [], // اتَّبِعوا
      [], // ما
      [], // أُنزِلَ
      [], // إِلَيكُم
      [], // مِن
      [], // رَبِّكُم
      [], // وَلا
      [], // تَتَّبِعوا
      [], // مِن
      [], // دونِهِ
      [], // أَولِياءَ
      [], // قَليلًا
      [], // ما
      [] // تَذَكَّرونَ
    ],
    [ // آية 4
      ["وكم من قرية : كثيراً من القرى أهكلنا"], // وَكَم
      ["وكم من قرية : كثيراً من القرى أهكلنا"], // مِن
      ["وكم من قرية : كثيراً من القرى أهكلنا"], // قَريَةٍ
      [], // أَهلَكنـٰها
      [], // فَجاءَها
      ["بأسنا : عذابنا"], // بَأسُنا
      [], // بَيـٰتًا
      [], // أَو
      [], // هُم
      [] // قائِلونَ
    ],
    [ // آية 5
      [], // فَما
      [], // كانَ
      [], // دَعوىٰهُم
      [], // إِذ
      [], // جاءَهُم
      [], // بَأسُنا
      [], // إِلّا
      [], // أَن
      [], // قالوا
      [], // إِنّا
      [], // كُنّا
      [] // ظـٰلِمينَ
    ],
    [ // آية 6
      [], // فَلَنَسـَٔلَنَّ
      [], // الَّذينَ
      [], // أُرسِلَ
      [], // إِلَيهِم
      [], // وَلَنَسـَٔلَنَّ
      [] // المُرسَلينَ
    ],
    [ // آية 7
      [], // فَلَنَقُصَّنَّ
      [], // عَلَيهِم
      [], // بِعِلمٍ
      [], // وَما
      [], // كُنّا
      [] // غائِبينَ
    ],
    [ // آية 8
      [], // وَالوَزنُ
      [], // يَومَئِذٍ
      [], // الحَقُّ
      [], // فَمَن
      [], // ثَقُلَت
      [], // مَوٰزينُهُ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 9
      [], // وَمَن
      [], // خَفَّت
      [], // مَوٰزينُهُ
      [], // فَأُولـٰئِكَ
      [], // الَّذينَ
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // بِما
      [], // كانوا
      [], // بِـٔايـٰتِنا
      [] // يَظلِمونَ
    ],
    [ // آية 10
      [], // وَلَقَد
      [], // مَكَّنّـٰكُم
      [], // فِى
      [], // الأَرضِ
      [], // وَجَعَلنا
      [], // لَكُم
      [], // فيها
      [], // مَعـٰيِشَ
      [], // قَليلًا
      [], // ما
      [] // تَشكُرونَ
    ],
    [ // آية 11
      [], // وَلَقَد
      [], // خَلَقنـٰكُم
      [], // ثُمَّ
      [], // صَوَّرنـٰكُم
      [], // ثُمَّ
      [], // قُلنا
      [], // لِلمَلـٰئِكَةِ
      [], // اسجُدوا
      [], // لِـٔادَمَ
      [], // فَسَجَدوا
      [], // إِلّا
      [], // إِبليسَ
      [], // لَم
      [], // يَكُن
      [], // مِنَ
      [] // السّـٰجِدينَ
    ],
    [ // آية 12
      [], // قالَ
      ["ما منعك : ما اضطرك. أو ما دعاك وحملك"], // ما
      ["ما منعك : ما اضطرك. أو ما دعاك وحملك"], // مَنَعَكَ
      [], // أَلّا
      [], // تَسجُدَ
      [], // إِذ
      [], // أَمَرتُكَ
      [], // قالَ
      [], // أَنا۠
      [], // خَيرٌ
      [], // مِنهُ
      [], // خَلَقتَنى
      [], // مِن
      [], // نارٍ
      [], // وَخَلَقتَهُ
      [], // مِن
      [] // طينٍ
    ],
    [ // آية 13
      [], // قالَ
      [], // فَاهبِط
      [], // مِنها
      [], // فَما
      [], // يَكونُ
      [], // لَكَ
      [], // أَن
      [], // تَتَكَبَّرَ
      [], // فيها
      [], // فَاخرُج
      [], // إِنَّكَ
      [], // مِنَ
      [] // الصّـٰغِرينَ
    ],
    [ // آية 14
      [], // قالَ
      [], // أَنظِرنى
      [], // إِلىٰ
      [], // يَومِ
      [] // يُبعَثونَ
    ],
    [ // آية 15
      [], // قالَ
      [], // إِنَّكَ
      [], // مِنَ
      ["المنظرين : الممهلين إلى وقت النفخة الأولى"] // المُنظَرينَ
    ],
    [ // آية 16
      [], // قالَ
      [], // فَبِما
      [], // أَغوَيتَنى
      ["لأقعدن لهم : لأترصدنّهم ولأجلسنّ لهم"], // لَأَقعُدَنَّ
      ["لأقعدن لهم : لأترصدنّهم ولأجلسنّ لهم"], // لَهُم
      [], // صِرٰطَكَ
      [] // المُستَقيمَ
    ],
    [ // آية 17
      [], // ثُمَّ
      [], // لَـٔاتِيَنَّهُم
      [], // مِن
      [], // بَينِ
      [], // أَيديهِم
      [], // وَمِن
      [], // خَلفِهِم
      [], // وَعَن
      [], // أَيمـٰنِهِم
      [], // وَعَن
      [], // شَمائِلِهِم
      [], // وَلا
      [], // تَجِدُ
      [], // أَكثَرَهُم
      [] // شـٰكِرينَ
    ],
    [ // آية 18
      [], // قالَ
      [], // اخرُج
      [], // مِنها
      ["مذءوماً : مذموماً أومعيبا أو محقراً لعيناً"], // مَذءومًا
      ["مدحوراً : مطروداً مبعداً"], // مَدحورًا
      [], // لَمَن
      [], // تَبِعَكَ
      [], // مِنهُم
      [], // لَأَملَأَنَّ
      [], // جَهَنَّمَ
      [], // مِنكُم
      [] // أَجمَعينَ
    ],
    [ // آية 19
      [], // وَيـٰـٔادَمُ
      [], // اسكُن
      [], // أَنتَ
      [], // وَزَوجُكَ
      [], // الجَنَّةَ
      [], // فَكُلا
      [], // مِن
      [], // حَيثُ
      [], // شِئتُما
      [], // وَلا
      [], // تَقرَبا
      [], // هـٰذِهِ
      [], // الشَّجَرَةَ
      [], // فَتَكونا
      [], // مِنَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 20
      ["فوسوس لهما : ألقى إليهما الوسوسة"], // فَوَسوَسَ
      ["فوسوس لهما : ألقى إليهما الوسوسة"], // لَهُمَا
      [], // الشَّيطـٰنُ
      [], // لِيُبدِىَ
      [], // لَهُما
      [], // ما
      [], // وۥرِىَ
      [], // عَنهُما
      [], // مِن
      [], // سَوءٰتِهِما
      [], // وَقالَ
      [], // ما
      [], // نَهىٰكُما
      [], // رَبُّكُما
      [], // عَن
      [], // هـٰذِهِ
      [], // الشَّجَرَةِ
      [], // إِلّا
      [], // أَن
      [], // تَكونا
      [], // مَلَكَينِ
      [], // أَو
      [], // تَكونا
      [], // مِنَ
      [] // الخـٰلِدينَ
    ],
    [ // آية 21
      ["وقاسمهما : أقسم وحلف لهما"], // وَقاسَمَهُما
      [], // إِنّى
      [], // لَكُما
      [], // لَمِنَ
      [] // النّـٰصِحينَ
    ],
    [ // آية 22
      [], // فَدَلّىٰهُما
      [], // بِغُرورٍ
      [], // فَلَمّا
      [], // ذاقَا
      [], // الشَّجَرَةَ
      [], // بَدَت
      [], // لَهُما
      [], // سَوءٰتُهُما
      [], // وَطَفِقا
      [], // يَخصِفانِ
      [], // عَلَيهِما
      [], // مِن
      [], // وَرَقِ
      [], // الجَنَّةِ
      [], // وَنادىٰهُما
      [], // رَبُّهُما
      [], // أَلَم
      [], // أَنهَكُما
      [], // عَن
      [], // تِلكُمَا
      [], // الشَّجَرَةِ
      [], // وَأَقُل
      [], // لَكُما
      [], // إِنَّ
      [], // الشَّيطـٰنَ
      [], // لَكُما
      [], // عَدُوٌّ
      [] // مُبينٌ
    ],
    [ // آية 23
      [], // قالا
      [], // رَبَّنا
      [], // ظَلَمنا
      [], // أَنفُسَنا
      [], // وَإِن
      [], // لَم
      [], // تَغفِر
      [], // لَنا
      [], // وَتَرحَمنا
      [], // لَنَكونَنَّ
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 24
      [], // قالَ
      [], // اهبِطوا
      [], // بَعضُكُم
      [], // لِبَعضٍ
      [], // عَدُوٌّ
      [], // وَلَكُم
      [], // فِى
      [], // الأَرضِ
      [], // مُستَقَرٌّ
      [], // وَمَتـٰعٌ
      [], // إِلىٰ
      [] // حينٍ
    ],
    [ // آية 25
      [], // قالَ
      [], // فيها
      [], // تَحيَونَ
      [], // وَفيها
      [], // تَموتونَ
      [], // وَمِنها
      [] // تُخرَجونَ
    ],
    [ // آية 26
      [], // يـٰبَنى
      [], // ءادَمَ
      [], // قَد
      ["أنزلنا عليكم : أعطيناكم ووهبنا لكم"], // أَنزَلنا
      ["أنزلنا عليكم : أعطيناكم ووهبنا لكم"], // عَلَيكُم
      [], // لِباسًا
      [], // يُوٰرى
      [], // سَوءٰتِكُم
      [], // وَريشًا
      [], // وَلِباسُ
      [], // التَّقوىٰ
      [], // ذٰلِكَ
      [], // خَيرٌ
      [], // ذٰلِكَ
      [], // مِن
      [], // ءايـٰتِ
      [], // اللَّهِ
      [], // لَعَلَّهُم
      [] // يَذَّكَّرونَ
    ],
    [ // آية 27
      [], // يـٰبَنى
      [], // ءادَمَ
      [], // لا
      [], // يَفتِنَنَّكُمُ
      [], // الشَّيطـٰنُ
      [], // كَما
      [], // أَخرَجَ
      [], // أَبَوَيكُم
      [], // مِنَ
      [], // الجَنَّةِ
      ["ينزع عنهما : يزيل عنهما،  استلاباً بخداعه"], // يَنزِعُ
      ["ينزع عنهما : يزيل عنهما،  استلاباً بخداعه"], // عَنهُما
      [], // لِباسَهُما
      [], // لِيُرِيَهُما
      [], // سَوءٰتِهِما
      [], // إِنَّهُ
      [], // يَرىٰكُم
      [], // هُوَ
      [], // وَقَبيلُهُ
      [], // مِن
      [], // حَيثُ
      [], // لا
      [], // تَرَونَهُم
      [], // إِنّا
      [], // جَعَلنَا
      [], // الشَّيـٰطينَ
      [], // أَولِياءَ
      [], // لِلَّذينَ
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 28
      [], // وَإِذا
      [], // فَعَلوا
      [], // فـٰحِشَةً
      [], // قالوا
      [], // وَجَدنا
      [], // عَلَيها
      [], // ءاباءَنا
      [], // وَاللَّهُ
      [], // أَمَرَنا
      [], // بِها
      [], // قُل
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَأمُرُ
      [], // بِالفَحشاءِ
      [], // أَتَقولونَ
      [], // عَلَى
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 29
      [], // قُل
      [], // أَمَرَ
      [], // رَبّى
      ["بالقسط : بالعدل وهو جميع الطاعات والقُرَب"], // بِالقِسطِ
      [], // وَأَقيموا
      [], // وُجوهَكُم
      ["عند كل مسجد : في كل وقت سجود أو مكانه"], // عِندَ
      ["عند كل مسجد : في كل وقت سجود أو مكانه"], // كُلِّ
      ["عند كل مسجد : في كل وقت سجود أو مكانه"], // مَسجِدٍ
      [], // وَادعوهُ
      [], // مُخلِصينَ
      [], // لَهُ
      [], // الدّينَ
      [], // كَما
      [], // بَدَأَكُم
      [] // تَعودونَ
    ],
    [ // آية 30
      [], // فَريقًا
      [], // هَدىٰ
      [], // وَفَريقًا
      [], // حَقَّ
      [], // عَلَيهِمُ
      [], // الضَّلـٰلَةُ
      [], // إِنَّهُمُ
      [], // اتَّخَذُوا
      [], // الشَّيـٰطينَ
      [], // أَولِياءَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَيَحسَبونَ
      [], // أَنَّهُم
      [] // مُهتَدونَ
    ],
    [ // آية 31
      [], // يـٰبَنى
      [], // ءادَمَ
      ["خذوا زينتكم : البسوا ثيابكم لستر عوراتكم"], // خُذوا
      ["خذوا زينتكم : البسوا ثيابكم لستر عوراتكم"], // زينَتَكُم
      [], // عِندَ
      [], // كُلِّ
      [], // مَسجِدٍ
      [], // وَكُلوا
      [], // وَاشرَبوا
      [], // وَلا
      [], // تُسرِفوا
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // المُسرِفينَ
    ],
    [ // آية 32
      [], // قُل
      [], // مَن
      [], // حَرَّمَ
      [], // زينَةَ
      [], // اللَّهِ
      [], // الَّتى
      [], // أَخرَجَ
      [], // لِعِبادِهِ
      [], // وَالطَّيِّبـٰتِ
      [], // مِنَ
      [], // الرِّزقِ
      [], // قُل
      [], // هِىَ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // خالِصَةً
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // كَذٰلِكَ
      [], // نُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 33
      [], // قُل
      [], // إِنَّما
      [], // حَرَّمَ
      [], // رَبِّىَ
      [], // الفَوٰحِشَ
      [], // ما
      [], // ظَهَرَ
      [], // مِنها
      [], // وَما
      [], // بَطَنَ
      [], // وَالإِثمَ
      [], // وَالبَغىَ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَأَن
      [], // تُشرِكوا
      [], // بِاللَّهِ
      [], // ما
      [], // لَم
      [], // يُنَزِّل
      [], // بِهِ
      [], // سُلطـٰنًا
      [], // وَأَن
      [], // تَقولوا
      [], // عَلَى
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 34
      [], // وَلِكُلِّ
      [], // أُمَّةٍ
      [], // أَجَلٌ
      [], // فَإِذا
      [], // جاءَ
      [], // أَجَلُهُم
      [], // لا
      [], // يَستَأخِرونَ
      [], // ساعَةً
      [], // وَلا
      [] // يَستَقدِمونَ
    ],
    [ // آية 35
      [], // يـٰبَنى
      [], // ءادَمَ
      [], // إِمّا
      [], // يَأتِيَنَّكُم
      [], // رُسُلٌ
      [], // مِنكُم
      [], // يَقُصّونَ
      [], // عَلَيكُم
      [], // ءايـٰتى
      [], // فَمَنِ
      [], // اتَّقىٰ
      [], // وَأَصلَحَ
      [], // فَلا
      [], // خَوفٌ
      [], // عَلَيهِم
      [], // وَلا
      [], // هُم
      [] // يَحزَنونَ
    ],
    [ // آية 36
      [], // وَالَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَاستَكبَروا
      [], // عَنها
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 37
      [], // فَمَن
      [], // أَظلَمُ
      [], // مِمَّنِ
      [], // افتَرىٰ
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // أَو
      [], // كَذَّبَ
      [], // بِـٔايـٰتِهِ
      [], // أُولـٰئِكَ
      [], // يَنالُهُم
      [], // نَصيبُهُم
      [], // مِنَ
      [], // الكِتـٰبِ
      [], // حَتّىٰ
      [], // إِذا
      [], // جاءَتهُم
      [], // رُسُلُنا
      [], // يَتَوَفَّونَهُم
      [], // قالوا
      [], // أَينَ
      [], // ما
      [], // كُنتُم
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // قالوا
      [], // ضَلّوا
      [], // عَنّا
      [], // وَشَهِدوا
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // أَنَّهُم
      [], // كانوا
      [] // كـٰفِرينَ
    ],
    [ // آية 38
      [], // قالَ
      [], // ادخُلوا
      [], // فى
      [], // أُمَمٍ
      [], // قَد
      [], // خَلَت
      [], // مِن
      [], // قَبلِكُم
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // فِى
      [], // النّارِ
      [], // كُلَّما
      [], // دَخَلَت
      [], // أُمَّةٌ
      [], // لَعَنَت
      [], // أُختَها
      [], // حَتّىٰ
      [], // إِذَا
      ["ادّاركوا فيها : تلاحقوا في النّار واجتمعوا فيها"], // ادّارَكوا
      ["ادّاركوا فيها : تلاحقوا في النّار واجتمعوا فيها"], // فيها
      [], // جَميعًا
      [], // قالَت
      [], // أُخرىٰهُم
      [], // لِأولىٰهُم
      [], // رَبَّنا
      [], // هـٰؤُلاءِ
      [], // أَضَلّونا
      [], // فَـٔاتِهِم
      ["عذابا ضِعفاً : مضاعفاً مزيداً"], // عَذابًا
      ["عذابا ضِعفاً : مضاعفاً مزيداً"], // ضِعفًا
      [], // مِنَ
      [], // النّارِ
      [], // قالَ
      [], // لِكُلٍّ
      [], // ضِعفٌ
      [], // وَلـٰكِن
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 39
      [], // وَقالَت
      [], // أولىٰهُم
      [], // لِأُخرىٰهُم
      [], // فَما
      [], // كانَ
      [], // لَكُم
      [], // عَلَينا
      [], // مِن
      [], // فَضلٍ
      [], // فَذوقُوا
      [], // العَذابَ
      [], // بِما
      [], // كُنتُم
      [] // تَكسِبونَ
    ],
    [ // آية 40
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَاستَكبَروا
      [], // عَنها
      [], // لا
      [], // تُفَتَّحُ
      [], // لَهُم
      [], // أَبوٰبُ
      [], // السَّماءِ
      [], // وَلا
      [], // يَدخُلونَ
      [], // الجَنَّةَ
      [], // حَتّىٰ
      ["يلج الجمل : يدخل الجمل"], // يَلِجَ
      ["يلج الجمل : يدخل الجمل"], // الجَمَلُ
      [], // فى
      ["سمّ الخياط : ثقب الإبرة"], // سَمِّ
      ["سمّ الخياط : ثقب الإبرة"], // الخِياطِ
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // المُجرِمينَ
    ],
    [ // آية 41
      [], // لَهُم
      [], // مِن
      [], // جَهَنَّمَ
      ["مِهادٌ : فراشٌ ،أي مستقر"], // مِهادٌ
      [], // وَمِن
      [], // فَوقِهِم
      ["غواش : أغطية كاللُّحُف"], // غَواشٍ
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // الظّـٰلِمينَ
    ],
    [ // آية 42
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لا
      [], // نُكَلِّفُ
      [], // نَفسًا
      [], // إِلّا
      ["وُسعها : طاقتها وما تقدر عليه"], // وُسعَها
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // هُم
      [], // فيها
      [] // خـٰلِدونَ
    ],
    [ // آية 43
      [], // وَنَزَعنا
      [], // ما
      [], // فى
      [], // صُدورِهِم
      [], // مِن
      ["غِلٍ : حقد ٍ وضغنٍ وعداوة"], // غِلٍّ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهِمُ
      [], // الأَنهـٰرُ
      [], // وَقالُوا
      [], // الحَمدُ
      [], // لِلَّهِ
      [], // الَّذى
      [], // هَدىٰنا
      [], // لِهـٰذا
      [], // وَما
      [], // كُنّا
      [], // لِنَهتَدِىَ
      [], // لَولا
      [], // أَن
      [], // هَدىٰنَا
      [], // اللَّهُ
      [], // لَقَد
      [], // جاءَت
      [], // رُسُلُ
      [], // رَبِّنا
      [], // بِالحَقِّ
      [], // وَنودوا
      [], // أَن
      [], // تِلكُمُ
      [], // الجَنَّةُ
      [], // أورِثتُموها
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 44
      [], // وَنادىٰ
      [], // أَصحـٰبُ
      [], // الجَنَّةِ
      [], // أَصحـٰبَ
      [], // النّارِ
      [], // أَن
      [], // قَد
      [], // وَجَدنا
      [], // ما
      [], // وَعَدَنا
      [], // رَبُّنا
      [], // حَقًّا
      [], // فَهَل
      [], // وَجَدتُم
      [], // ما
      [], // وَعَدَ
      [], // رَبُّكُم
      [], // حَقًّا
      [], // قالوا
      [], // نَعَم
      [], // فَأَذَّنَ
      [], // مُؤَذِّنٌ
      [], // بَينَهُم
      [], // أَن
      [], // لَعنَةُ
      [], // اللَّهِ
      [], // عَلَى
      [] // الظّـٰلِمينَ
    ],
    [ // آية 45
      [], // الَّذينَ
      [], // يَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَيَبغونَها
      [], // عِوَجًا
      [], // وَهُم
      [], // بِالـٔاخِرَةِ
      [] // كـٰفِرونَ
    ],
    [ // آية 46
      [], // وَبَينَهُما
      [], // حِجابٌ
      [], // وَعَلَى
      [], // الأَعرافِ
      [], // رِجالٌ
      [], // يَعرِفونَ
      [], // كُلًّا
      [], // بِسيمىٰهُم
      [], // وَنادَوا
      [], // أَصحـٰبَ
      [], // الجَنَّةِ
      [], // أَن
      [], // سَلـٰمٌ
      [], // عَلَيكُم
      [], // لَم
      [], // يَدخُلوها
      [], // وَهُم
      [] // يَطمَعونَ
    ],
    [ // آية 47
      [], // وَإِذا
      [], // صُرِفَت
      [], // أَبصـٰرُهُم
      [], // تِلقاءَ
      [], // أَصحـٰبِ
      [], // النّارِ
      [], // قالوا
      [], // رَبَّنا
      [], // لا
      [], // تَجعَلنا
      [], // مَعَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 48
      [], // وَنادىٰ
      [], // أَصحـٰبُ
      [], // الأَعرافِ
      [], // رِجالًا
      [], // يَعرِفونَهُم
      [], // بِسيمىٰهُم
      [], // قالوا
      [], // ما
      [], // أَغنىٰ
      [], // عَنكُم
      [], // جَمعُكُم
      [], // وَما
      [], // كُنتُم
      [] // تَستَكبِرونَ
    ],
    [ // آية 49
      [], // أَهـٰؤُلاءِ
      [], // الَّذينَ
      [], // أَقسَمتُم
      [], // لا
      [], // يَنالُهُمُ
      [], // اللَّهُ
      [], // بِرَحمَةٍ
      [], // ادخُلُوا
      [], // الجَنَّةَ
      [], // لا
      [], // خَوفٌ
      [], // عَلَيكُم
      [], // وَلا
      [], // أَنتُم
      [] // تَحزَنونَ
    ],
    [ // آية 50
      [], // وَنادىٰ
      [], // أَصحـٰبُ
      [], // النّارِ
      [], // أَصحـٰبَ
      [], // الجَنَّةِ
      [], // أَن
      ["أفيضوا علينا : صُبوا أو ألقوا علينا"], // أَفيضوا
      ["أفيضوا علينا : صُبوا أو ألقوا علينا"], // عَلَينا
      [], // مِنَ
      [], // الماءِ
      [], // أَو
      [], // مِمّا
      [], // رَزَقَكُمُ
      [], // اللَّهُ
      [], // قالوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // حَرَّمَهُما
      [], // عَلَى
      [] // الكـٰفِرينَ
    ],
    [ // آية 51
      [], // الَّذينَ
      [], // اتَّخَذوا
      [], // دينَهُم
      [], // لَهوًا
      [], // وَلَعِبًا
      [], // وَغَرَّتهُمُ
      [], // الحَيوٰةُ
      [], // الدُّنيا
      [], // فَاليَومَ
      [], // نَنسىٰهُم
      [], // كَما
      [], // نَسوا
      [], // لِقاءَ
      [], // يَومِهِم
      [], // هـٰذا
      [], // وَما
      [], // كانوا
      [], // بِـٔايـٰتِنا
      [] // يَجحَدونَ
    ],
    [ // آية 52
      [], // وَلَقَد
      [], // جِئنـٰهُم
      [], // بِكِتـٰبٍ
      [], // فَصَّلنـٰهُ
      [], // عَلىٰ
      [], // عِلمٍ
      [], // هُدًى
      [], // وَرَحمَةً
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 53
      [], // هَل
      [], // يَنظُرونَ
      [], // إِلّا
      ["تأويله : عاقبة مواعيد الكتاب (القرآن) و مآلها من البعث و الحساب و الجزاء"], // تَأويلَهُ
      [], // يَومَ
      [], // يَأتى
      [], // تَأويلُهُ
      [], // يَقولُ
      [], // الَّذينَ
      [], // نَسوهُ
      [], // مِن
      [], // قَبلُ
      [], // قَد
      [], // جاءَت
      [], // رُسُلُ
      [], // رَبِّنا
      [], // بِالحَقِّ
      [], // فَهَل
      [], // لَنا
      [], // مِن
      [], // شُفَعاءَ
      [], // فَيَشفَعوا
      [], // لَنا
      [], // أَو
      [], // نُرَدُّ
      [], // فَنَعمَلَ
      [], // غَيرَ
      [], // الَّذى
      [], // كُنّا
      [], // نَعمَلُ
      [], // قَد
      [], // خَسِروا
      [], // أَنفُسَهُم
      [], // وَضَلَّ
      [], // عَنهُم
      [], // ما
      [], // كانوا
      ["يفترون : يكذبون من الشركاء وشفاعتهم"] // يَفتَرونَ
    ],
    [ // آية 54
      [], // إِنَّ
      [], // رَبَّكُمُ
      [], // اللَّهُ
      [], // الَّذى
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // فى
      [], // سِتَّةِ
      [], // أَيّامٍ
      [], // ثُمَّ
      ["استوى على العرش : إستواءً بالمعنى اللائق به سبحانه"], // استَوىٰ
      ["استوى على العرش : إستواءً بالمعنى اللائق به سبحانه"], // عَلَى
      ["استوى على العرش : إستواءً بالمعنى اللائق به سبحانه"], // العَرشِ
      [], // يُغشِى
      [], // الَّيلَ
      [], // النَّهارَ
      ["يطلبه حثيثاً : يطلب الليل النهار طلباً سريعاً"], // يَطلُبُهُ
      ["يطلبه حثيثاً : يطلب الليل النهار طلباً سريعاً"], // حَثيثًا
      [], // وَالشَّمسَ
      [], // وَالقَمَرَ
      [], // وَالنُّجومَ
      [], // مُسَخَّرٰتٍ
      [], // بِأَمرِهِ
      [], // أَلا
      [], // لَهُ
      [], // الخَلقُ
      [], // وَالأَمرُ
      ["تبارك الله : تنزّه أوتعظم أو كثر خيره"], // تَبارَكَ
      ["تبارك الله : تنزّه أوتعظم أو كثر خيره"], // اللَّهُ
      [], // رَبُّ
      [] // العـٰلَمينَ
    ],
    [ // آية 55
      ["ادعوا ربكم : اسألوه واطلبوا منه حوائجكم"], // ادعوا
      ["ادعوا ربكم : اسألوه واطلبوا منه حوائجكم"], // رَبَّكُم
      ["تضرعاً : مُظهرين الضراعة والذلة والإستكانة والخشوع"], // تَضَرُّعًا
      [], // وَخُفيَةً
      [], // إِنَّهُ
      [], // لا
      [], // يُحِبُّ
      [] // المُعتَدينَ
    ],
    [ // آية 56
      [], // وَلا
      [], // تُفسِدوا
      [], // فِى
      [], // الأَرضِ
      [], // بَعدَ
      [], // إِصلـٰحِها
      [], // وَادعوهُ
      [], // خَوفًا
      [], // وَطَمَعًا
      [], // إِنَّ
      [], // رَحمَتَ
      [], // اللَّهِ
      [], // قَريبٌ
      [], // مِنَ
      [] // المُحسِنينَ
    ],
    [ // آية 57
      [], // وَهُوَ
      [], // الَّذى
      [], // يُرسِلُ
      [], // الرِّيـٰحَ
      ["بشراً : مبشرات برحمته وهي الغيث"], // بُشرًا
      [], // بَينَ
      [], // يَدَى
      [], // رَحمَتِهِ
      [], // حَتّىٰ
      [], // إِذا
      ["أقلت سحاباً : حملته ورفعته"], // أَقَلَّت
      ["أقلت سحاباً : حملته ورفعته"], // سَحابًا
      ["ثِقالاً : مثقلة بحمل الماء"], // ثِقالًا
      [], // سُقنـٰهُ
      ["لبلدٍ ميت : مجدب لا ماء فيه ولا نبات"], // لِبَلَدٍ
      ["لبلدٍ ميت : مجدب لا ماء فيه ولا نبات"], // مَيِّتٍ
      [], // فَأَنزَلنا
      [], // بِهِ
      [], // الماءَ
      [], // فَأَخرَجنا
      [], // بِهِ
      [], // مِن
      [], // كُلِّ
      [], // الثَّمَرٰتِ
      [], // كَذٰلِكَ
      [], // نُخرِجُ
      [], // المَوتىٰ
      [], // لَعَلَّكُم
      [] // تَذَكَّرونَ
    ],
    [ // آية 58
      [], // وَالبَلَدُ
      [], // الطَّيِّبُ
      [], // يَخرُجُ
      [], // نَباتُهُ
      [], // بِإِذنِ
      [], // رَبِّهِ
      [], // وَالَّذى
      [], // خَبُثَ
      [], // لا
      [], // يَخرُجُ
      [], // إِلّا
      ["نكداً : عسراً أو قليلاً لا خير فيه"], // نَكِدًا
      [], // كَذٰلِكَ
      [], // نُصَرِّفُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَشكُرونَ
    ],
    [ // آية 59
      [], // لَقَد
      [], // أَرسَلنا
      [], // نوحًا
      [], // إِلىٰ
      [], // قَومِهِ
      [], // فَقالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // إِنّى
      [], // أَخافُ
      [], // عَلَيكُم
      [], // عَذابَ
      [], // يَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 60
      ["قال الملأ : السادة والرؤساء"], // قالَ
      ["قال الملأ : السادة والرؤساء"], // المَلَأُ
      [], // مِن
      [], // قَومِهِ
      [], // إِنّا
      [], // لَنَرىٰكَ
      [], // فى
      [], // ضَلـٰلٍ
      [] // مُبينٍ
    ],
    [ // آية 61
      [], // قالَ
      [], // يـٰقَومِ
      [], // لَيسَ
      [], // بى
      [], // ضَلـٰلَةٌ
      [], // وَلـٰكِنّى
      [], // رَسولٌ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 62
      [], // أُبَلِّغُكُم
      [], // رِسـٰلـٰتِ
      [], // رَبّى
      [], // وَأَنصَحُ
      [], // لَكُم
      [], // وَأَعلَمُ
      [], // مِنَ
      [], // اللَّهِ
      [], // ما
      [], // لا
      [] // تَعلَمونَ
    ],
    [ // آية 63
      [], // أَوَعَجِبتُم
      [], // أَن
      [], // جاءَكُم
      [], // ذِكرٌ
      [], // مِن
      [], // رَبِّكُم
      [], // عَلىٰ
      [], // رَجُلٍ
      [], // مِنكُم
      [], // لِيُنذِرَكُم
      [], // وَلِتَتَّقوا
      [], // وَلَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 64
      [], // فَكَذَّبوهُ
      [], // فَأَنجَينـٰهُ
      [], // وَالَّذينَ
      [], // مَعَهُ
      [], // فِى
      [], // الفُلكِ
      [], // وَأَغرَقنَا
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // إِنَّهُم
      [], // كانوا
      ["قوماً عمين : عُمي القلوب عن الحق والإيمان"], // قَومًا
      ["قوماً عمين : عُمي القلوب عن الحق والإيمان"] // عَمينَ
    ],
    [ // آية 65
      [], // وَإِلىٰ
      [], // عادٍ
      [], // أَخاهُم
      [], // هودًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // أَفَلا
      [] // تَتَّقونَ
    ],
    [ // آية 66
      [], // قالَ
      [], // المَلَأُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَومِهِ
      [], // إِنّا
      [], // لَنَرىٰكَ
      [], // فى
      ["سفاهة : خفة عقل وضلالة عن الحق"], // سَفاهَةٍ
      [], // وَإِنّا
      [], // لَنَظُنُّكَ
      [], // مِنَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 67
      [], // قالَ
      [], // يـٰقَومِ
      [], // لَيسَ
      [], // بى
      [], // سَفاهَةٌ
      [], // وَلـٰكِنّى
      [], // رَسولٌ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 68
      [], // أُبَلِّغُكُم
      [], // رِسـٰلـٰتِ
      [], // رَبّى
      [], // وَأَنا۠
      [], // لَكُم
      [], // ناصِحٌ
      [] // أَمينٌ
    ],
    [ // آية 69
      [], // أَوَعَجِبتُم
      [], // أَن
      [], // جاءَكُم
      [], // ذِكرٌ
      [], // مِن
      [], // رَبِّكُم
      [], // عَلىٰ
      [], // رَجُلٍ
      [], // مِنكُم
      [], // لِيُنذِرَكُم
      [], // وَاذكُروا
      [], // إِذ
      [], // جَعَلَكُم
      [], // خُلَفاءَ
      [], // مِن
      [], // بَعدِ
      [], // قَومِ
      [], // نوحٍ
      [], // وَزادَكُم
      [], // فِى
      [], // الخَلقِ
      [], // بَصطَةً
      [], // فَاذكُروا
      [], // ءالاءَ
      [], // اللَّهِ
      [], // لَعَلَّكُم
      [] // تُفلِحونَ
    ],
    [ // آية 70
      [], // قالوا
      [], // أَجِئتَنا
      [], // لِنَعبُدَ
      [], // اللَّهَ
      [], // وَحدَهُ
      [], // وَنَذَرَ
      [], // ما
      [], // كانَ
      [], // يَعبُدُ
      [], // ءاباؤُنا
      [], // فَأتِنا
      [], // بِما
      [], // تَعِدُنا
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 71
      [], // قالَ
      [], // قَد
      [], // وَقَعَ
      [], // عَلَيكُم
      [], // مِن
      [], // رَبِّكُم
      ["رجسٌ : عذابٌ .  أو رين على القلوب"], // رِجسٌ
      [], // وَغَضَبٌ
      [], // أَتُجـٰدِلونَنى
      [], // فى
      [], // أَسماءٍ
      [], // سَمَّيتُموها
      [], // أَنتُم
      [], // وَءاباؤُكُم
      [], // ما
      [], // نَزَّلَ
      [], // اللَّهُ
      [], // بِها
      [], // مِن
      [], // سُلطـٰنٍ
      [], // فَانتَظِروا
      [], // إِنّى
      [], // مَعَكُم
      [], // مِنَ
      [] // المُنتَظِرينَ
    ],
    [ // آية 72
      [], // فَأَنجَينـٰهُ
      [], // وَالَّذينَ
      [], // مَعَهُ
      [], // بِرَحمَةٍ
      [], // مِنّا
      [], // وَقَطَعنا
      [], // دابِرَ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَما
      [], // كانوا
      [] // مُؤمِنينَ
    ],
    [ // آية 73
      [], // وَإِلىٰ
      [], // ثَمودَ
      [], // أَخاهُم
      [], // صـٰلِحًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // قَد
      [], // جاءَتكُم
      [], // بَيِّنَةٌ
      [], // مِن
      [], // رَبِّكُم
      [], // هـٰذِهِ
      ["ناقةُ الله : خلقها الله من صخر لا من أبوين"], // ناقَةُ
      ["ناقةُ الله : خلقها الله من صخر لا من أبوين"], // اللَّهِ
      [], // لَكُم
      [], // ءايَةً
      [], // فَذَروها
      [], // تَأكُل
      [], // فى
      [], // أَرضِ
      [], // اللَّهِ
      [], // وَلا
      [], // تَمَسّوها
      [], // بِسوءٍ
      [], // فَيَأخُذَكُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 74
      [], // وَاذكُروا
      [], // إِذ
      [], // جَعَلَكُم
      [], // خُلَفاءَ
      [], // مِن
      [], // بَعدِ
      [], // عادٍ
      [], // وَبَوَّأَكُم
      [], // فِى
      [], // الأَرضِ
      [], // تَتَّخِذونَ
      [], // مِن
      [], // سُهولِها
      [], // قُصورًا
      [], // وَتَنحِتونَ
      [], // الجِبالَ
      [], // بُيوتًا
      [], // فَاذكُروا
      [], // ءالاءَ
      [], // اللَّهِ
      [], // وَلا
      [], // تَعثَوا
      [], // فِى
      [], // الأَرضِ
      [] // مُفسِدينَ
    ],
    [ // آية 75
      [], // قالَ
      [], // المَلَأُ
      [], // الَّذينَ
      [], // استَكبَروا
      [], // مِن
      [], // قَومِهِ
      [], // لِلَّذينَ
      [], // استُضعِفوا
      [], // لِمَن
      [], // ءامَنَ
      [], // مِنهُم
      [], // أَتَعلَمونَ
      [], // أَنَّ
      [], // صـٰلِحًا
      [], // مُرسَلٌ
      [], // مِن
      [], // رَبِّهِ
      [], // قالوا
      [], // إِنّا
      [], // بِما
      [], // أُرسِلَ
      [], // بِهِ
      [] // مُؤمِنونَ
    ],
    [ // آية 76
      [], // قالَ
      [], // الَّذينَ
      [], // استَكبَروا
      [], // إِنّا
      [], // بِالَّذى
      [], // ءامَنتُم
      [], // بِهِ
      [] // كـٰفِرونَ
    ],
    [ // آية 77
      [], // فَعَقَرُوا
      [], // النّاقَةَ
      [], // وَعَتَوا
      [], // عَن
      [], // أَمرِ
      [], // رَبِّهِم
      [], // وَقالوا
      [], // يـٰصـٰلِحُ
      [], // ائتِنا
      [], // بِما
      [], // تَعِدُنا
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // المُرسَلينَ
    ],
    [ // آية 78
      [], // فَأَخَذَتهُمُ
      ["الرّجفة : الزّلزلة الشّديدة . أو الصّيحة"], // الرَّجفَةُ
      [], // فَأَصبَحوا
      [], // فى
      [], // دارِهِم
      [] // جـٰثِمينَ
    ],
    [ // آية 79
      [], // فَتَوَلّىٰ
      [], // عَنهُم
      [], // وَقالَ
      [], // يـٰقَومِ
      [], // لَقَد
      [], // أَبلَغتُكُم
      [], // رِسالَةَ
      [], // رَبّى
      [], // وَنَصَحتُ
      [], // لَكُم
      [], // وَلـٰكِن
      [], // لا
      [], // تُحِبّونَ
      [] // النّـٰصِحينَ
    ],
    [ // آية 80
      [], // وَلوطًا
      [], // إِذ
      [], // قالَ
      [], // لِقَومِهِ
      [], // أَتَأتونَ
      [], // الفـٰحِشَةَ
      [], // ما
      [], // سَبَقَكُم
      [], // بِها
      [], // مِن
      [], // أَحَدٍ
      [], // مِنَ
      [] // العـٰلَمينَ
    ],
    [ // آية 81
      [], // إِنَّكُم
      [], // لَتَأتونَ
      [], // الرِّجالَ
      [], // شَهوَةً
      [], // مِن
      [], // دونِ
      [], // النِّساءِ
      [], // بَل
      [], // أَنتُم
      [], // قَومٌ
      [] // مُسرِفونَ
    ],
    [ // آية 82
      [], // وَما
      [], // كانَ
      [], // جَوابَ
      [], // قَومِهِ
      [], // إِلّا
      [], // أَن
      [], // قالوا
      [], // أَخرِجوهُم
      [], // مِن
      [], // قَريَتِكُم
      [], // إِنَّهُم
      [], // أُناسٌ
      [] // يَتَطَهَّرونَ
    ],
    [ // آية 83
      [], // فَأَنجَينـٰهُ
      [], // وَأَهلَهُ
      [], // إِلَّا
      [], // امرَأَتَهُ
      [], // كانَت
      [], // مِنَ
      [] // الغـٰبِرينَ
    ],
    [ // آية 84
      [], // وَأَمطَرنا
      [], // عَلَيهِم
      [], // مَطَرًا
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُجرِمينَ
    ],
    [ // آية 85
      [], // وَإِلىٰ
      [], // مَديَنَ
      [], // أَخاهُم
      [], // شُعَيبًا
      [], // قالَ
      [], // يـٰقَومِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // إِلـٰهٍ
      [], // غَيرُهُ
      [], // قَد
      [], // جاءَتكُم
      [], // بَيِّنَةٌ
      [], // مِن
      [], // رَبِّكُم
      [], // فَأَوفُوا
      [], // الكَيلَ
      [], // وَالميزانَ
      [], // وَلا
      [], // تَبخَسُوا
      [], // النّاسَ
      [], // أَشياءَهُم
      [], // وَلا
      [], // تُفسِدوا
      [], // فِى
      [], // الأَرضِ
      [], // بَعدَ
      [], // إِصلـٰحِها
      [], // ذٰلِكُم
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // مُؤمِنينَ
    ],
    [ // آية 86
      [], // وَلا
      [], // تَقعُدوا
      [], // بِكُلِّ
      [], // صِرٰطٍ
      [], // توعِدونَ
      [], // وَتَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // مَن
      [], // ءامَنَ
      [], // بِهِ
      [], // وَتَبغونَها
      [], // عِوَجًا
      [], // وَاذكُروا
      [], // إِذ
      [], // كُنتُم
      [], // قَليلًا
      [], // فَكَثَّرَكُم
      [], // وَانظُروا
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُفسِدينَ
    ],
    [ // آية 87
      [], // وَإِن
      [], // كانَ
      [], // طائِفَةٌ
      [], // مِنكُم
      [], // ءامَنوا
      [], // بِالَّذى
      [], // أُرسِلتُ
      [], // بِهِ
      [], // وَطائِفَةٌ
      [], // لَم
      [], // يُؤمِنوا
      [], // فَاصبِروا
      [], // حَتّىٰ
      [], // يَحكُمَ
      [], // اللَّهُ
      [], // بَينَنا
      [], // وَهُوَ
      [], // خَيرُ
      [] // الحـٰكِمينَ
    ],
    [ // آية 88
      [], // قالَ
      [], // المَلَأُ
      [], // الَّذينَ
      [], // استَكبَروا
      [], // مِن
      [], // قَومِهِ
      [], // لَنُخرِجَنَّكَ
      [], // يـٰشُعَيبُ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَكَ
      [], // مِن
      [], // قَريَتِنا
      [], // أَو
      [], // لَتَعودُنَّ
      [], // فى
      [], // مِلَّتِنا
      [], // قالَ
      [], // أَوَلَو
      [], // كُنّا
      [] // كـٰرِهينَ
    ],
    [ // آية 89
      [], // قَدِ
      [], // افتَرَينا
      [], // عَلَى
      [], // اللَّهِ
      [], // كَذِبًا
      [], // إِن
      [], // عُدنا
      [], // فى
      [], // مِلَّتِكُم
      [], // بَعدَ
      [], // إِذ
      [], // نَجّىٰنَا
      [], // اللَّهُ
      [], // مِنها
      [], // وَما
      [], // يَكونُ
      [], // لَنا
      [], // أَن
      [], // نَعودَ
      [], // فيها
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // رَبُّنا
      [], // وَسِعَ
      [], // رَبُّنا
      [], // كُلَّ
      [], // شَىءٍ
      [], // عِلمًا
      [], // عَلَى
      [], // اللَّهِ
      [], // تَوَكَّلنا
      ["ربّنا افتح : احكم و اقض و افصل"], // رَبَّنَا
      ["ربّنا افتح : احكم و اقض و افصل"], // افتَح
      [], // بَينَنا
      [], // وَبَينَ
      [], // قَومِنا
      [], // بِالحَقِّ
      [], // وَأَنتَ
      [], // خَيرُ
      [] // الفـٰتِحينَ
    ],
    [ // آية 90
      [], // وَقالَ
      [], // المَلَأُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَومِهِ
      [], // لَئِنِ
      [], // اتَّبَعتُم
      [], // شُعَيبًا
      [], // إِنَّكُم
      [], // إِذًا
      [] // لَخـٰسِرونَ
    ],
    [ // آية 91
      [], // فَأَخَذَتهُمُ
      [], // الرَّجفَةُ
      [], // فَأَصبَحوا
      [], // فى
      [], // دارِهِم
      [] // جـٰثِمينَ
    ],
    [ // آية 92
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // شُعَيبًا
      [], // كَأَن
      ["لم يغْنَوْا فيها : لم يقيموا ناعمين في دارهم"], // لَم
      ["لم يغْنَوْا فيها : لم يقيموا ناعمين في دارهم"], // يَغنَوا
      ["لم يغْنَوْا فيها : لم يقيموا ناعمين في دارهم"], // فيهَا
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // شُعَيبًا
      [], // كانوا
      [], // هُمُ
      [] // الخـٰسِرينَ
    ],
    [ // آية 93
      [], // فَتَوَلّىٰ
      [], // عَنهُم
      [], // وَقالَ
      [], // يـٰقَومِ
      [], // لَقَد
      [], // أَبلَغتُكُم
      [], // رِسـٰلـٰتِ
      [], // رَبّى
      [], // وَنَصَحتُ
      [], // لَكُم
      [], // فَكَيفَ
      [], // ءاسىٰ
      [], // عَلىٰ
      [], // قَومٍ
      [] // كـٰفِرينَ
    ],
    [ // آية 94
      [], // وَما
      [], // أَرسَلنا
      [], // فى
      [], // قَريَةٍ
      [], // مِن
      [], // نَبِىٍّ
      [], // إِلّا
      [], // أَخَذنا
      [], // أَهلَها
      [], // بِالبَأساءِ
      [], // وَالضَّرّاءِ
      [], // لَعَلَّهُم
      ["يضّرّعون : يتذلّلون و يخضعون"] // يَضَّرَّعونَ
    ],
    [ // آية 95
      [], // ثُمَّ
      [], // بَدَّلنا
      [], // مَكانَ
      [], // السَّيِّئَةِ
      [], // الحَسَنَةَ
      [], // حَتّىٰ
      ["عفوْا : كثُروا و نموا عددا و مالا"], // عَفَوا
      [], // وَقالوا
      [], // قَد
      [], // مَسَّ
      [], // ءاباءَنَا
      [], // الضَّرّاءُ
      [], // وَالسَّرّاءُ
      [], // فَأَخَذنـٰهُم
      ["بغتة : فجأة"], // بَغتَةً
      [], // وَهُم
      [], // لا
      [] // يَشعُرونَ
    ],
    [ // آية 96
      [], // وَلَو
      [], // أَنَّ
      [], // أَهلَ
      [], // القُرىٰ
      [], // ءامَنوا
      [], // وَاتَّقَوا
      ["لفتحنا عليهم : ليسّرنا عليهم أو تابعنا عليهم"], // لَفَتَحنا
      ["لفتحنا عليهم : ليسّرنا عليهم أو تابعنا عليهم"], // عَلَيهِم
      [], // بَرَكـٰتٍ
      [], // مِنَ
      [], // السَّماءِ
      [], // وَالأَرضِ
      [], // وَلـٰكِن
      [], // كَذَّبوا
      [], // فَأَخَذنـٰهُم
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 97
      [], // أَفَأَمِنَ
      [], // أَهلُ
      [], // القُرىٰ
      [], // أَن
      ["يأتيهم بأسنا : ينزل بهم عذابنا"], // يَأتِيَهُم
      ["يأتيهم بأسنا : ينزل بهم عذابنا"], // بَأسُنا
      [], // بَيـٰتًا
      [], // وَهُم
      [] // نائِمونَ
    ],
    [ // آية 98
      [], // أَوَأَمِنَ
      [], // أَهلُ
      [], // القُرىٰ
      [], // أَن
      [], // يَأتِيَهُم
      [], // بَأسُنا
      [], // ضُحًى
      [], // وَهُم
      [] // يَلعَبونَ
    ],
    [ // آية 99
      [], // أَفَأَمِنوا
      ["مكر الله : عقوبته . أو استدراجه إياهم"], // مَكرَ
      ["مكر الله : عقوبته . أو استدراجه إياهم"], // اللَّهِ
      [], // فَلا
      [], // يَأمَنُ
      [], // مَكرَ
      [], // اللَّهِ
      [], // إِلَّا
      [], // القَومُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 100
      [], // أَوَلَم
      [], // يَهدِ
      [], // لِلَّذينَ
      [], // يَرِثونَ
      [], // الأَرضَ
      [], // مِن
      [], // بَعدِ
      [], // أَهلِها
      [], // أَن
      [], // لَو
      [], // نَشاءُ
      [], // أَصَبنـٰهُم
      [], // بِذُنوبِهِم
      [], // وَنَطبَعُ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // فَهُم
      [], // لا
      [] // يَسمَعونَ
    ],
    [ // آية 101
      [], // تِلكَ
      [], // القُرىٰ
      [], // نَقُصُّ
      [], // عَلَيكَ
      [], // مِن
      [], // أَنبائِها
      [], // وَلَقَد
      [], // جاءَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَما
      [], // كانوا
      [], // لِيُؤمِنوا
      [], // بِما
      [], // كَذَّبوا
      [], // مِن
      [], // قَبلُ
      [], // كَذٰلِكَ
      [], // يَطبَعُ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // قُلوبِ
      [] // الكـٰفِرينَ
    ],
    [ // آية 102
      [], // وَما
      [], // وَجَدنا
      [], // لِأَكثَرِهِم
      ["من عهد : من وفاء بما أوصيناهم"], // مِن
      ["من عهد : من وفاء بما أوصيناهم"], // عَهدٍ
      [], // وَإِن
      [], // وَجَدنا
      [], // أَكثَرَهُم
      [] // لَفـٰسِقينَ
    ],
    [ // آية 103
      [], // ثُمَّ
      [], // بَعَثنا
      [], // مِن
      [], // بَعدِهِم
      [], // موسىٰ
      [], // بِـٔايـٰتِنا
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // وَمَلَإِي۟هِ
      ["فظلموا بها : فكفروا بالآيات"], // فَظَلَموا
      ["فظلموا بها : فكفروا بالآيات"], // بِها
      [], // فَانظُر
      [], // كَيفَ
      [], // كانَ
      [], // عـٰقِبَةُ
      [] // المُفسِدينَ
    ],
    [ // آية 104
      [], // وَقالَ
      [], // موسىٰ
      [], // يـٰفِرعَونُ
      [], // إِنّى
      [], // رَسولٌ
      [], // مِن
      [], // رَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 105
      [], // حَقيقٌ
      [], // عَلىٰ
      [], // أَن
      [], // لا
      [], // أَقولَ
      [], // عَلَى
      [], // اللَّهِ
      [], // إِلَّا
      [], // الحَقَّ
      [], // قَد
      [], // جِئتُكُم
      [], // بِبَيِّنَةٍ
      [], // مِن
      [], // رَبِّكُم
      [], // فَأَرسِل
      [], // مَعِىَ
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 106
      [], // قالَ
      [], // إِن
      [], // كُنتَ
      [], // جِئتَ
      [], // بِـٔايَةٍ
      [], // فَأتِ
      [], // بِها
      [], // إِن
      [], // كُنتَ
      [], // مِنَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 107
      [], // فَأَلقىٰ
      [], // عَصاهُ
      [], // فَإِذا
      [], // هِىَ
      [], // ثُعبانٌ
      ["مُبين : ظاهر أمره لا يشكّ فيه"] // مُبينٌ
    ],
    [ // آية 108
      [], // وَنَزَعَ
      [], // يَدَهُ
      [], // فَإِذا
      [], // هِىَ
      ["بيضاء : غلب شعاعها شعاع الشّمس"], // بَيضاءُ
      [] // لِلنّـٰظِرينَ
    ],
    [ // آية 109
      [], // قالَ
      ["الملأ : أهل المشورة و الرّؤساء"], // المَلَأُ
      [], // مِن
      [], // قَومِ
      [], // فِرعَونَ
      [], // إِنَّ
      [], // هـٰذا
      [], // لَسـٰحِرٌ
      [] // عَليمٌ
    ],
    [ // آية 110
      [], // يُريدُ
      [], // أَن
      [], // يُخرِجَكُم
      [], // مِن
      [], // أَرضِكُم
      [], // فَماذا
      [] // تَأمُرونَ
    ],
    [ // آية 111
      [], // قالوا
      [], // أَرجِه
      [], // وَأَخاهُ
      [], // وَأَرسِل
      [], // فِى
      [], // المَدائِنِ
      [] // حـٰشِرينَ
    ],
    [ // آية 112
      [], // يَأتوكَ
      [], // بِكُلِّ
      [], // سـٰحِرٍ
      [] // عَليمٍ
    ],
    [ // آية 113
      [], // وَجاءَ
      [], // السَّحَرَةُ
      [], // فِرعَونَ
      [], // قالوا
      [], // إِنَّ
      [], // لَنا
      [], // لَأَجرًا
      [], // إِن
      [], // كُنّا
      [], // نَحنُ
      [] // الغـٰلِبينَ
    ],
    [ // آية 114
      [], // قالَ
      [], // نَعَم
      [], // وَإِنَّكُم
      [], // لَمِنَ
      [] // المُقَرَّبينَ
    ],
    [ // آية 115
      [], // قالوا
      [], // يـٰموسىٰ
      [], // إِمّا
      [], // أَن
      [], // تُلقِىَ
      [], // وَإِمّا
      [], // أَن
      [], // نَكونَ
      [], // نَحنُ
      [] // المُلقينَ
    ],
    [ // آية 116
      [], // قالَ
      [], // أَلقوا
      [], // فَلَمّا
      [], // أَلقَوا
      ["سحروا أعين النّاس : خيّلوا لها ما يخالف الحقيقة"], // سَحَروا
      ["سحروا أعين النّاس : خيّلوا لها ما يخالف الحقيقة"], // أَعيُنَ
      ["سحروا أعين النّاس : خيّلوا لها ما يخالف الحقيقة"], // النّاسِ
      [], // وَاستَرهَبوهُم
      [], // وَجاءو
      [], // بِسِحرٍ
      [] // عَظيمٍ
    ],
    [ // آية 117
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // أَن
      [], // أَلقِ
      [], // عَصاكَ
      [], // فَإِذا
      [], // هِىَ
      ["تلقف : تبتلع أو تتناول بسرعة"], // تَلقَفُ
      ["ما يأفكون : ما يكذبونه و يُموّهونه"], // ما
      ["ما يأفكون : ما يكذبونه و يُموّهونه"] // يَأفِكونَ
    ],
    [ // آية 118
      ["فوقع الحقّ : ظهر و تبيّن أمر موسى عليه السّلام"], // فَوَقَعَ
      ["فوقع الحقّ : ظهر و تبيّن أمر موسى عليه السّلام"], // الحَقُّ
      [], // وَبَطَلَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 119
      [], // فَغُلِبوا
      [], // هُنالِكَ
      [], // وَانقَلَبوا
      [] // صـٰغِرينَ
    ],
    [ // آية 120
      [], // وَأُلقِىَ
      [], // السَّحَرَةُ
      [] // سـٰجِدينَ
    ],
    [ // آية 121
      [], // قالوا
      [], // ءامَنّا
      [], // بِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 122
      [], // رَبِّ
      [], // موسىٰ
      [] // وَهـٰرونَ
    ],
    [ // آية 123
      [], // قالَ
      [], // فِرعَونُ
      [], // ءامَنتُم
      [], // بِهِ
      [], // قَبلَ
      [], // أَن
      [], // ءاذَنَ
      [], // لَكُم
      [], // إِنَّ
      [], // هـٰذا
      [], // لَمَكرٌ
      [], // مَكَرتُموهُ
      [], // فِى
      [], // المَدينَةِ
      [], // لِتُخرِجوا
      [], // مِنها
      [], // أَهلَها
      [], // فَسَوفَ
      [] // تَعلَمونَ
    ],
    [ // آية 124
      [], // لَأُقَطِّعَنَّ
      [], // أَيدِيَكُم
      [], // وَأَرجُلَكُم
      [], // مِن
      [], // خِلـٰفٍ
      [], // ثُمَّ
      [], // لَأُصَلِّبَنَّكُم
      [] // أَجمَعينَ
    ],
    [ // آية 125
      [], // قالوا
      [], // إِنّا
      [], // إِلىٰ
      [], // رَبِّنا
      [] // مُنقَلِبونَ
    ],
    [ // آية 126
      [], // وَما
      [], // تَنقِمُ
      [], // مِنّا
      [], // إِلّا
      [], // أَن
      [], // ءامَنّا
      [], // بِـٔايـٰتِ
      [], // رَبِّنا
      [], // لَمّا
      [], // جاءَتنا
      [], // رَبَّنا
      [], // أَفرِغ
      [], // عَلَينا
      [], // صَبرًا
      [], // وَتَوَفَّنا
      [] // مُسلِمينَ
    ],
    [ // آية 127
      [], // وَقالَ
      [], // المَلَأُ
      [], // مِن
      [], // قَومِ
      [], // فِرعَونَ
      [], // أَتَذَرُ
      [], // موسىٰ
      [], // وَقَومَهُ
      [], // لِيُفسِدوا
      [], // فِى
      [], // الأَرضِ
      [], // وَيَذَرَكَ
      [], // وَءالِهَتَكَ
      [], // قالَ
      [], // سَنُقَتِّلُ
      [], // أَبناءَهُم
      [], // وَنَستَحيۦ
      [], // نِساءَهُم
      [], // وَإِنّا
      [], // فَوقَهُم
      [] // قـٰهِرونَ
    ],
    [ // آية 128
      [], // قالَ
      [], // موسىٰ
      [], // لِقَومِهِ
      [], // استَعينوا
      [], // بِاللَّهِ
      [], // وَاصبِروا
      [], // إِنَّ
      [], // الأَرضَ
      [], // لِلَّهِ
      [], // يورِثُها
      [], // مَن
      [], // يَشاءُ
      [], // مِن
      [], // عِبادِهِ
      [], // وَالعـٰقِبَةُ
      [] // لِلمُتَّقينَ
    ],
    [ // آية 129
      [], // قالوا
      [], // أوذينا
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // تَأتِيَنا
      [], // وَمِن
      [], // بَعدِ
      [], // ما
      [], // جِئتَنا
      [], // قالَ
      [], // عَسىٰ
      [], // رَبُّكُم
      [], // أَن
      [], // يُهلِكَ
      [], // عَدُوَّكُم
      [], // وَيَستَخلِفَكُم
      [], // فِى
      [], // الأَرضِ
      [], // فَيَنظُرَ
      [], // كَيفَ
      [] // تَعمَلونَ
    ],
    [ // آية 130
      [], // وَلَقَد
      [], // أَخَذنا
      [], // ءالَ
      [], // فِرعَونَ
      ["بالسّنين : بالجدوب و القحوط"], // بِالسِّنينَ
      [], // وَنَقصٍ
      [], // مِنَ
      [], // الثَّمَرٰتِ
      [], // لَعَلَّهُم
      [] // يَذَّكَّرونَ
    ],
    [ // آية 131
      [], // فَإِذا
      [], // جاءَتهُمُ
      [], // الحَسَنَةُ
      [], // قالوا
      [], // لَنا
      [], // هـٰذِهِ
      [], // وَإِن
      [], // تُصِبهُم
      [], // سَيِّئَةٌ
      ["يطّيّروا : يتشاءموا"], // يَطَّيَّروا
      [], // بِموسىٰ
      [], // وَمَن
      [], // مَعَهُ
      [], // أَلا
      [], // إِنَّما
      [], // طـٰئِرُهُم
      [], // عِندَ
      [], // اللَّهِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 132
      [], // وَقالوا
      [], // مَهما
      [], // تَأتِنا
      [], // بِهِ
      [], // مِن
      [], // ءايَةٍ
      [], // لِتَسحَرَنا
      [], // بِها
      [], // فَما
      [], // نَحنُ
      [], // لَكَ
      [] // بِمُؤمِنينَ
    ],
    [ // آية 133
      [], // فَأَرسَلنا
      [], // عَلَيهِمُ
      ["الطّوفان : الماء الكثير . أو الموت الجارف"], // الطّوفانَ
      [], // وَالجَرادَ
      [], // وَالقُمَّلَ
      [], // وَالضَّفادِعَ
      [], // وَالدَّمَ
      [], // ءايـٰتٍ
      [], // مُفَصَّلـٰتٍ
      [], // فَاستَكبَروا
      [], // وَكانوا
      [], // قَومًا
      [] // مُجرِمينَ
    ],
    [ // آية 134
      [], // وَلَمّا
      [], // وَقَعَ
      [], // عَلَيهِمُ
      ["الرّجز : العذاب بما ذكر من الآيات"], // الرِّجزُ
      [], // قالوا
      [], // يـٰموسَى
      [], // ادعُ
      [], // لَنا
      [], // رَبَّكَ
      [], // بِما
      [], // عَهِدَ
      [], // عِندَكَ
      [], // لَئِن
      [], // كَشَفتَ
      [], // عَنَّا
      [], // الرِّجزَ
      [], // لَنُؤمِنَنَّ
      [], // لَكَ
      [], // وَلَنُرسِلَنَّ
      [], // مَعَكَ
      [], // بَنى
      [] // إِسرٰءيلَ
    ],
    [ // آية 135
      [], // فَلَمّا
      [], // كَشَفنا
      [], // عَنهُمُ
      [], // الرِّجزَ
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // هُم
      [], // بـٰلِغوهُ
      [], // إِذا
      [], // هُم
      ["ينكثون : ينقضون عهدهم الذي أبرموه"] // يَنكُثونَ
    ],
    [ // آية 136
      [], // فَانتَقَمنا
      [], // مِنهُم
      [], // فَأَغرَقنـٰهُم
      [], // فِى
      [], // اليَمِّ
      [], // بِأَنَّهُم
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَكانوا
      [], // عَنها
      [] // غـٰفِلينَ
    ],
    [ // آية 137
      [], // وَأَورَثنَا
      [], // القَومَ
      [], // الَّذينَ
      [], // كانوا
      [], // يُستَضعَفونَ
      [], // مَشـٰرِقَ
      [], // الأَرضِ
      [], // وَمَغـٰرِبَهَا
      [], // الَّتى
      [], // بـٰرَكنا
      [], // فيها
      [], // وَتَمَّت
      [], // كَلِمَتُ
      [], // رَبِّكَ
      [], // الحُسنىٰ
      [], // عَلىٰ
      [], // بَنى
      [], // إِسرٰءيلَ
      [], // بِما
      [], // صَبَروا
      [], // وَدَمَّرنا
      [], // ما
      [], // كانَ
      [], // يَصنَعُ
      [], // فِرعَونُ
      [], // وَقَومُهُ
      [], // وَما
      [], // كانوا
      ["يعرشون : من الجنّات أو يرفعون من الأبنية"] // يَعرِشونَ
    ],
    [ // آية 138
      [], // وَجـٰوَزنا
      [], // بِبَنى
      [], // إِسرٰءيلَ
      [], // البَحرَ
      [], // فَأَتَوا
      [], // عَلىٰ
      [], // قَومٍ
      [], // يَعكُفونَ
      [], // عَلىٰ
      [], // أَصنامٍ
      [], // لَهُم
      [], // قالوا
      [], // يـٰموسَى
      [], // اجعَل
      [], // لَنا
      [], // إِلـٰهًا
      [], // كَما
      [], // لَهُم
      [], // ءالِهَةٌ
      [], // قالَ
      [], // إِنَّكُم
      [], // قَومٌ
      [] // تَجهَلونَ
    ],
    [ // آية 139
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      ["متبّر : مُهلَكٌ مُدمّر"], // مُتَبَّرٌ
      [], // ما
      [], // هُم
      [], // فيهِ
      [], // وَبـٰطِلٌ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 140
      [], // قالَ
      [], // أَغَيرَ
      [], // اللَّهِ
      [], // أَبغيكُم
      [], // إِلـٰهًا
      [], // وَهُوَ
      [], // فَضَّلَكُم
      [], // عَلَى
      [] // العـٰلَمينَ
    ],
    [ // آية 141
      [], // وَإِذ
      [], // أَنجَينـٰكُم
      [], // مِن
      [], // ءالِ
      [], // فِرعَونَ
      ["يسومونكم : يذيقونكم أو يكلّفونكم"], // يَسومونَكُم
      [], // سوءَ
      [], // العَذابِ
      [], // يُقَتِّلونَ
      [], // أَبناءَكُم
      [], // وَيَستَحيونَ
      [], // نِساءَكُم
      [], // وَفى
      [], // ذٰلِكُم
      ["بلاء : ابتلاء و امتحان بالنّعم و النّقم"], // بَلاءٌ
      [], // مِن
      [], // رَبِّكُم
      [] // عَظيمٌ
    ],
    [ // آية 142
      [], // وَوٰعَدنا
      [], // موسىٰ
      [], // ثَلـٰثينَ
      [], // لَيلَةً
      [], // وَأَتمَمنـٰها
      [], // بِعَشرٍ
      [], // فَتَمَّ
      [], // ميقـٰتُ
      [], // رَبِّهِ
      [], // أَربَعينَ
      [], // لَيلَةً
      [], // وَقالَ
      [], // موسىٰ
      [], // لِأَخيهِ
      [], // هـٰرونَ
      [], // اخلُفنى
      [], // فى
      [], // قَومى
      [], // وَأَصلِح
      [], // وَلا
      [], // تَتَّبِع
      [], // سَبيلَ
      [] // المُفسِدينَ
    ],
    [ // آية 143
      [], // وَلَمّا
      [], // جاءَ
      [], // موسىٰ
      [], // لِميقـٰتِنا
      [], // وَكَلَّمَهُ
      [], // رَبُّهُ
      [], // قالَ
      [], // رَبِّ
      [], // أَرِنى
      [], // أَنظُر
      [], // إِلَيكَ
      [], // قالَ
      [], // لَن
      [], // تَرىٰنى
      [], // وَلـٰكِنِ
      [], // انظُر
      [], // إِلَى
      [], // الجَبَلِ
      [], // فَإِنِ
      [], // استَقَرَّ
      [], // مَكانَهُ
      [], // فَسَوفَ
      [], // تَرىٰنى
      [], // فَلَمّا
      ["تجلّى ربّه للجبل : بدا له شيء من نوره تعالى"], // تَجَلّىٰ
      ["تجلّى ربّه للجبل : بدا له شيء من نوره تعالى"], // رَبُّهُ
      ["تجلّى ربّه للجبل : بدا له شيء من نوره تعالى"], // لِلجَبَلِ
      [], // جَعَلَهُ
      [], // دَكًّا
      [], // وَخَرَّ
      [], // موسىٰ
      ["صعقاً : مغشيّا عليه"], // صَعِقًا
      [], // فَلَمّا
      [], // أَفاقَ
      [], // قالَ
      [], // سُبحـٰنَكَ
      [], // تُبتُ
      [], // إِلَيكَ
      [], // وَأَنا۠
      [], // أَوَّلُ
      [] // المُؤمِنينَ
    ],
    [ // آية 144
      [], // قالَ
      [], // يـٰموسىٰ
      [], // إِنِّى
      [], // اصطَفَيتُكَ
      [], // عَلَى
      [], // النّاسِ
      [], // بِرِسـٰلـٰتى
      [], // وَبِكَلـٰمى
      [], // فَخُذ
      [], // ما
      [], // ءاتَيتُكَ
      [], // وَكُن
      [], // مِنَ
      [] // الشّـٰكِرينَ
    ],
    [ // آية 145
      [], // وَكَتَبنا
      [], // لَهُ
      [], // فِى
      ["الألواح : ألواح التوراة"], // الأَلواحِ
      [], // مِن
      [], // كُلِّ
      [], // شَىءٍ
      [], // مَوعِظَةً
      [], // وَتَفصيلًا
      [], // لِكُلِّ
      [], // شَىءٍ
      [], // فَخُذها
      [], // بِقُوَّةٍ
      [], // وَأمُر
      [], // قَومَكَ
      [], // يَأخُذوا
      [], // بِأَحسَنِها
      [], // سَأُو۟ريكُم
      [], // دارَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 146
      [], // سَأَصرِفُ
      [], // عَن
      [], // ءايـٰتِىَ
      [], // الَّذينَ
      [], // يَتَكَبَّرونَ
      [], // فِى
      [], // الأَرضِ
      [], // بِغَيرِ
      [], // الحَقِّ
      [], // وَإِن
      [], // يَرَوا
      [], // كُلَّ
      [], // ءايَةٍ
      [], // لا
      [], // يُؤمِنوا
      [], // بِها
      [], // وَإِن
      [], // يَرَوا
      ["سبيل الرّشد : طريق الهدى و السّداد"], // سَبيلَ
      ["سبيل الرّشد : طريق الهدى و السّداد"], // الرُّشدِ
      [], // لا
      [], // يَتَّخِذوهُ
      [], // سَبيلًا
      [], // وَإِن
      [], // يَرَوا
      [], // سَبيلَ
      [], // الغَىِّ
      [], // يَتَّخِذوهُ
      [], // سَبيلًا
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَكانوا
      [], // عَنها
      [] // غـٰفِلينَ
    ],
    [ // آية 147
      [], // وَالَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَلِقاءِ
      [], // الـٔاخِرَةِ
      [], // حَبِطَت
      [], // أَعمـٰلُهُم
      [], // هَل
      [], // يُجزَونَ
      [], // إِلّا
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 148
      [], // وَاتَّخَذَ
      [], // قَومُ
      [], // موسىٰ
      [], // مِن
      [], // بَعدِهِ
      [], // مِن
      [], // حُلِيِّهِم
      ["عجلا جسدا : مُجسّدا أي أحمر من ذهب"], // عِجلًا
      ["عجلا جسدا : مُجسّدا أي أحمر من ذهب"], // جَسَدًا
      ["له خوار : صوت كصوت البقرة"], // لَهُ
      ["له خوار : صوت كصوت البقرة"], // خُوارٌ
      [], // أَلَم
      [], // يَرَوا
      [], // أَنَّهُ
      [], // لا
      [], // يُكَلِّمُهُم
      [], // وَلا
      [], // يَهديهِم
      [], // سَبيلًا
      ["اتّخذوه : اتخذوا العجل إلها و عبدوه ضلالاً"], // اتَّخَذوهُ
      [], // وَكانوا
      [] // ظـٰلِمينَ
    ],
    [ // آية 149
      [], // وَلَمّا
      [], // سُقِطَ
      [], // فى
      [], // أَيديهِم
      [], // وَرَأَوا
      [], // أَنَّهُم
      [], // قَد
      [], // ضَلّوا
      [], // قالوا
      [], // لَئِن
      [], // لَم
      [], // يَرحَمنا
      [], // رَبُّنا
      [], // وَيَغفِر
      [], // لَنا
      [], // لَنَكونَنَّ
      [], // مِنَ
      [] // الخـٰسِرينَ
    ],
    [ // آية 150
      [], // وَلَمّا
      [], // رَجَعَ
      [], // موسىٰ
      [], // إِلىٰ
      [], // قَومِهِ
      [], // غَضبـٰنَ
      ["أسفا : شديد الغضب . أو حزينا"], // أَسِفًا
      [], // قالَ
      [], // بِئسَما
      [], // خَلَفتُمونى
      [], // مِن
      [], // بَعدى
      [], // أَعَجِلتُم
      [], // أَمرَ
      [], // رَبِّكُم
      [], // وَأَلقَى
      [], // الأَلواحَ
      [], // وَأَخَذَ
      [], // بِرَأسِ
      [], // أَخيهِ
      [], // يَجُرُّهُ
      [], // إِلَيهِ
      [], // قالَ
      [], // ابنَ
      [], // أُمَّ
      [], // إِنَّ
      [], // القَومَ
      [], // استَضعَفونى
      [], // وَكادوا
      [], // يَقتُلونَنى
      ["فلا تُشمت : فلا تسرّهم بما تنال منّي من المكروه"], // فَلا
      ["فلا تُشمت : فلا تسرّهم بما تنال منّي من المكروه"], // تُشمِت
      [], // بِىَ
      [], // الأَعداءَ
      [], // وَلا
      [], // تَجعَلنى
      [], // مَعَ
      [], // القَومِ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 151
      [], // قالَ
      [], // رَبِّ
      [], // اغفِر
      [], // لى
      [], // وَلِأَخى
      [], // وَأَدخِلنا
      [], // فى
      [], // رَحمَتِكَ
      [], // وَأَنتَ
      [], // أَرحَمُ
      [] // الرّٰحِمينَ
    ],
    [ // آية 152
      [], // إِنَّ
      [], // الَّذينَ
      [], // اتَّخَذُوا
      [], // العِجلَ
      [], // سَيَنالُهُم
      [], // غَضَبٌ
      [], // مِن
      [], // رَبِّهِم
      [], // وَذِلَّةٌ
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَكَذٰلِكَ
      [], // نَجزِى
      [] // المُفتَرينَ
    ],
    [ // آية 153
      [], // وَالَّذينَ
      [], // عَمِلُوا
      [], // السَّيِّـٔاتِ
      [], // ثُمَّ
      [], // تابوا
      [], // مِن
      [], // بَعدِها
      [], // وَءامَنوا
      [], // إِنَّ
      [], // رَبَّكَ
      [], // مِن
      [], // بَعدِها
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 154
      [], // وَلَمّا
      ["سكت : سَكَن"], // سَكَتَ
      [], // عَن
      [], // موسَى
      [], // الغَضَبُ
      [], // أَخَذَ
      [], // الأَلواحَ
      [], // وَفى
      [], // نُسخَتِها
      [], // هُدًى
      [], // وَرَحمَةٌ
      [], // لِلَّذينَ
      [], // هُم
      [], // لِرَبِّهِم
      [] // يَرهَبونَ
    ],
    [ // آية 155
      [], // وَاختارَ
      [], // موسىٰ
      [], // قَومَهُ
      [], // سَبعينَ
      [], // رَجُلًا
      [], // لِميقـٰتِنا
      [], // فَلَمّا
      [], // أَخَذَتهُمُ
      [], // الرَّجفَةُ
      [], // قالَ
      [], // رَبِّ
      [], // لَو
      [], // شِئتَ
      [], // أَهلَكتَهُم
      [], // مِن
      [], // قَبلُ
      [], // وَإِيّـٰىَ
      [], // أَتُهلِكُنا
      [], // بِما
      [], // فَعَلَ
      [], // السُّفَهاءُ
      [], // مِنّا
      [], // إِن
      [], // هِىَ
      [], // إِلّا
      ["فِتنتك : مِحنَتك و ابتلاؤك"], // فِتنَتُكَ
      [], // تُضِلُّ
      [], // بِها
      [], // مَن
      [], // تَشاءُ
      [], // وَتَهدى
      [], // مَن
      [], // تَشاءُ
      [], // أَنتَ
      [], // وَلِيُّنا
      [], // فَاغفِر
      [], // لَنا
      [], // وَارحَمنا
      [], // وَأَنتَ
      [], // خَيرُ
      [] // الغـٰفِرينَ
    ],
    [ // آية 156
      [], // وَاكتُب
      [], // لَنا
      [], // فى
      [], // هـٰذِهِ
      [], // الدُّنيا
      [], // حَسَنَةً
      [], // وَفِى
      [], // الـٔاخِرَةِ
      [], // إِنّا
      ["هُدْنا إليك : تبنا و رجعنا إليك"], // هُدنا
      ["هُدْنا إليك : تبنا و رجعنا إليك"], // إِلَيكَ
      [], // قالَ
      [], // عَذابى
      [], // أُصيبُ
      [], // بِهِ
      [], // مَن
      [], // أَشاءُ
      [], // وَرَحمَتى
      [], // وَسِعَت
      [], // كُلَّ
      [], // شَىءٍ
      [], // فَسَأَكتُبُها
      [], // لِلَّذينَ
      [], // يَتَّقونَ
      [], // وَيُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَالَّذينَ
      [], // هُم
      [], // بِـٔايـٰتِنا
      [] // يُؤمِنونَ
    ],
    [ // آية 157
      [], // الَّذينَ
      [], // يَتَّبِعونَ
      [], // الرَّسولَ
      [], // النَّبِىَّ
      [], // الأُمِّىَّ
      [], // الَّذى
      [], // يَجِدونَهُ
      [], // مَكتوبًا
      [], // عِندَهُم
      [], // فِى
      [], // التَّورىٰةِ
      [], // وَالإِنجيلِ
      [], // يَأمُرُهُم
      [], // بِالمَعروفِ
      [], // وَيَنهىٰهُم
      [], // عَنِ
      [], // المُنكَرِ
      [], // وَيُحِلُّ
      [], // لَهُمُ
      [], // الطَّيِّبـٰتِ
      [], // وَيُحَرِّمُ
      [], // عَلَيهِمُ
      [], // الخَبـٰئِثَ
      [], // وَيَضَعُ
      [], // عَنهُم
      ["إصرهم : عهدهم بالعمل بما في التوراة"], // إِصرَهُم
      [], // وَالأَغلـٰلَ
      [], // الَّتى
      [], // كانَت
      [], // عَلَيهِم
      [], // فَالَّذينَ
      [], // ءامَنوا
      [], // بِهِ
      [], // وَعَزَّروهُ
      [], // وَنَصَروهُ
      [], // وَاتَّبَعُوا
      [], // النّورَ
      [], // الَّذى
      [], // أُنزِلَ
      [], // مَعَهُ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 158
      [], // قُل
      [], // يـٰأَيُّهَا
      [], // النّاسُ
      [], // إِنّى
      [], // رَسولُ
      [], // اللَّهِ
      [], // إِلَيكُم
      [], // جَميعًا
      [], // الَّذى
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // فَـٔامِنوا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // النَّبِىِّ
      [], // الأُمِّىِّ
      [], // الَّذى
      [], // يُؤمِنُ
      [], // بِاللَّهِ
      [], // وَكَلِمـٰتِهِ
      [], // وَاتَّبِعوهُ
      [], // لَعَلَّكُم
      [] // تَهتَدونَ
    ],
    [ // آية 159
      [], // وَمِن
      [], // قَومِ
      [], // موسىٰ
      [], // أُمَّةٌ
      [], // يَهدونَ
      [], // بِالحَقِّ
      [], // وَبِهِ
      [] // يَعدِلونَ
    ],
    [ // آية 160
      [], // وَقَطَّعنـٰهُمُ
      [], // اثنَتَى
      [], // عَشرَةَ
      ["أسباطا : جماعات ، كالقبائل في العرب"], // أَسباطًا
      [], // أُمَمًا
      [], // وَأَوحَينا
      [], // إِلىٰ
      [], // موسىٰ
      [], // إِذِ
      [], // استَسقىٰهُ
      [], // قَومُهُ
      [], // أَنِ
      [], // اضرِب
      [], // بِعَصاكَ
      [], // الحَجَرَ
      ["فانبجست : فانفجرت"], // فَانبَجَسَت
      [], // مِنهُ
      [], // اثنَتا
      [], // عَشرَةَ
      [], // عَينًا
      [], // قَد
      [], // عَلِمَ
      [], // كُلُّ
      [], // أُناسٍ
      ["مشربهم : عينهم الخاصّة بهم"], // مَشرَبَهُم
      [], // وَظَلَّلنا
      [], // عَلَيهِمُ
      [], // الغَمـٰمَ
      [], // وَأَنزَلنا
      [], // عَلَيهِمُ
      ["المنّ : مادّة صَمغيّة حُلوة كالعسل"], // المَنَّ
      [], // وَالسَّلوىٰ
      [], // كُلوا
      [], // مِن
      [], // طَيِّبـٰتِ
      [], // ما
      [], // رَزَقنـٰكُم
      [], // وَما
      [], // ظَلَمونا
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 161
      [], // وَإِذ
      [], // قيلَ
      [], // لَهُمُ
      [], // اسكُنوا
      [], // هـٰذِهِ
      [], // القَريَةَ
      [], // وَكُلوا
      [], // مِنها
      [], // حَيثُ
      [], // شِئتُم
      [], // وَقولوا
      [], // حِطَّةٌ
      [], // وَادخُلُوا
      [], // البابَ
      [], // سُجَّدًا
      [], // نَغفِر
      [], // لَكُم
      [], // خَطيـٔـٰتِكُم
      [], // سَنَزيدُ
      [] // المُحسِنينَ
    ],
    [ // آية 162
      [], // فَبَدَّلَ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // مِنهُم
      [], // قَولًا
      [], // غَيرَ
      [], // الَّذى
      [], // قيلَ
      [], // لَهُم
      [], // فَأَرسَلنا
      [], // عَلَيهِم
      ["رجزا : عذابا (الطّاعون)"], // رِجزًا
      [], // مِنَ
      [], // السَّماءِ
      [], // بِما
      [], // كانوا
      [] // يَظلِمونَ
    ],
    [ // آية 163
      [], // وَسـَٔلهُم
      [], // عَنِ
      [], // القَريَةِ
      [], // الَّتى
      [], // كانَت
      ["حاضرة البحر : قريبةً من البحر"], // حاضِرَةَ
      ["حاضرة البحر : قريبةً من البحر"], // البَحرِ
      [], // إِذ
      [], // يَعدونَ
      [], // فِى
      [], // السَّبتِ
      [], // إِذ
      [], // تَأتيهِم
      [], // حيتانُهُم
      ["يوم سبتهم : يوم تعظيمهم أمر السّبت"], // يَومَ
      ["يوم سبتهم : يوم تعظيمهم أمر السّبت"], // سَبتِهِم
      ["شرّعا : ظاهرة على وجه الماء كثيرة"], // شُرَّعًا
      [], // وَيَومَ
      [], // لا
      [], // يَسبِتونَ
      [], // لا
      [], // تَأتيهِم
      [], // كَذٰلِكَ
      [], // نَبلوهُم
      [], // بِما
      [], // كانوا
      [] // يَفسُقونَ
    ],
    [ // آية 164
      [], // وَإِذ
      [], // قالَت
      [], // أُمَّةٌ
      [], // مِنهُم
      [], // لِمَ
      [], // تَعِظونَ
      [], // قَومًا
      [], // اللَّهُ
      [], // مُهلِكُهُم
      [], // أَو
      [], // مُعَذِّبُهُم
      [], // عَذابًا
      [], // شَديدًا
      [], // قالوا
      ["معذرة إلى ربّكم : نعِظهم اعتذارا إليه تعالى"], // مَعذِرَةً
      ["معذرة إلى ربّكم : نعِظهم اعتذارا إليه تعالى"], // إِلىٰ
      ["معذرة إلى ربّكم : نعِظهم اعتذارا إليه تعالى"], // رَبِّكُم
      [], // وَلَعَلَّهُم
      [] // يَتَّقونَ
    ],
    [ // آية 165
      [], // فَلَمّا
      [], // نَسوا
      [], // ما
      [], // ذُكِّروا
      [], // بِهِ
      [], // أَنجَينَا
      [], // الَّذينَ
      [], // يَنهَونَ
      [], // عَنِ
      [], // السّوءِ
      [], // وَأَخَذنَا
      [], // الَّذينَ
      [], // ظَلَموا
      [], // بِعَذابٍ
      [], // بَـٔيسٍ
      [], // بِما
      [], // كانوا
      [] // يَفسُقونَ
    ],
    [ // آية 166
      [], // فَلَمّا
      ["عتوْا : استكبروا و استعصوا"], // عَتَوا
      [], // عَن
      [], // ما
      [], // نُهوا
      [], // عَنهُ
      [], // قُلنا
      [], // لَهُم
      [], // كونوا
      [], // قِرَدَةً
      [] // خـٰسِـٔينَ
    ],
    [ // آية 167
      [], // وَإِذ
      ["تأذّن ربّك : أعلم ، أو عزم و قضى"], // تَأَذَّنَ
      ["تأذّن ربّك : أعلم ، أو عزم و قضى"], // رَبُّكَ
      [], // لَيَبعَثَنَّ
      [], // عَلَيهِم
      [], // إِلىٰ
      [], // يَومِ
      [], // القِيـٰمَةِ
      [], // مَن
      ["يسومهم : يُذيقهم و يكلّـفهم"], // يَسومُهُم
      [], // سوءَ
      [], // العَذابِ
      [], // إِنَّ
      [], // رَبَّكَ
      [], // لَسَريعُ
      [], // العِقابِ
      [], // وَإِنَّهُ
      [], // لَغَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 168
      [], // وَقَطَّعنـٰهُم
      [], // فِى
      [], // الأَرضِ
      [], // أُمَمًا
      [], // مِنهُمُ
      [], // الصّـٰلِحونَ
      [], // وَمِنهُم
      [], // دونَ
      [], // ذٰلِكَ
      [], // وَبَلَونـٰهُم
      [], // بِالحَسَنـٰتِ
      [], // وَالسَّيِّـٔاتِ
      [], // لَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 169
      [], // فَخَلَفَ
      [], // مِن
      [], // بَعدِهِم
      ["خلفٌ : بَدَل سَوءٍ"], // خَلفٌ
      [], // وَرِثُوا
      [], // الكِتـٰبَ
      [], // يَأخُذونَ
      [], // عَرَضَ
      [], // هـٰذَا
      [], // الأَدنىٰ
      [], // وَيَقولونَ
      [], // سَيُغفَرُ
      [], // لَنا
      [], // وَإِن
      [], // يَأتِهِم
      [], // عَرَضٌ
      [], // مِثلُهُ
      [], // يَأخُذوهُ
      [], // أَلَم
      [], // يُؤخَذ
      [], // عَلَيهِم
      [], // ميثـٰقُ
      [], // الكِتـٰبِ
      [], // أَن
      [], // لا
      [], // يَقولوا
      [], // عَلَى
      [], // اللَّهِ
      [], // إِلَّا
      [], // الحَقَّ
      [], // وَدَرَسوا
      [], // ما
      [], // فيهِ
      [], // وَالدّارُ
      [], // الـٔاخِرَةُ
      [], // خَيرٌ
      [], // لِلَّذينَ
      [], // يَتَّقونَ
      [], // أَفَلا
      [] // تَعقِلونَ
    ],
    [ // آية 170
      [], // وَالَّذينَ
      [], // يُمَسِّكونَ
      [], // بِالكِتـٰبِ
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // إِنّا
      [], // لا
      [], // نُضيعُ
      [], // أَجرَ
      [] // المُصلِحينَ
    ],
    [ // آية 171
      [], // وَإِذ
      [], // نَتَقنَا
      [], // الجَبَلَ
      [], // فَوقَهُم
      ["كأنّه ظلّة : غمامة . أو سقيفة تُـظلّ"], // كَأَنَّهُ
      ["كأنّه ظلّة : غمامة . أو سقيفة تُـظلّ"], // ظُلَّةٌ
      [], // وَظَنّوا
      [], // أَنَّهُ
      [], // واقِعٌ
      [], // بِهِم
      [], // خُذوا
      [], // ما
      [], // ءاتَينـٰكُم
      [], // بِقُوَّةٍ
      [], // وَاذكُروا
      [], // ما
      [], // فيهِ
      [], // لَعَلَّكُم
      [] // تَتَّقونَ
    ],
    [ // آية 172
      [], // وَإِذ
      [], // أَخَذَ
      [], // رَبُّكَ
      [], // مِن
      [], // بَنى
      [], // ءادَمَ
      [], // مِن
      [], // ظُهورِهِم
      [], // ذُرِّيَّتَهُم
      [], // وَأَشهَدَهُم
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // أَلَستُ
      [], // بِرَبِّكُم
      [], // قالوا
      [], // بَلىٰ
      [], // شَهِدنا
      [], // أَن
      [], // تَقولوا
      [], // يَومَ
      [], // القِيـٰمَةِ
      [], // إِنّا
      [], // كُنّا
      [], // عَن
      [], // هـٰذا
      [] // غـٰفِلينَ
    ],
    [ // آية 173
      [], // أَو
      [], // تَقولوا
      [], // إِنَّما
      [], // أَشرَكَ
      [], // ءاباؤُنا
      [], // مِن
      [], // قَبلُ
      [], // وَكُنّا
      [], // ذُرِّيَّةً
      [], // مِن
      [], // بَعدِهِم
      [], // أَفَتُهلِكُنا
      [], // بِما
      [], // فَعَلَ
      [] // المُبطِلونَ
    ],
    [ // آية 174
      [], // وَكَذٰلِكَ
      [], // نُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // وَلَعَلَّهُم
      [] // يَرجِعونَ
    ],
    [ // آية 175
      [], // وَاتلُ
      [], // عَلَيهِم
      [], // نَبَأَ
      [], // الَّذى
      [], // ءاتَينـٰهُ
      [], // ءايـٰتِنا
      ["فانسلخ منها : فخرج منها بكفره بها"], // فَانسَلَخَ
      ["فانسلخ منها : فخرج منها بكفره بها"], // مِنها
      [], // فَأَتبَعَهُ
      [], // الشَّيطـٰنُ
      [], // فَكانَ
      [], // مِنَ
      ["الغاوين : الضّالّين الهالكين"] // الغاوينَ
    ],
    [ // آية 176
      [], // وَلَو
      [], // شِئنا
      [], // لَرَفَعنـٰهُ
      [], // بِها
      [], // وَلـٰكِنَّهُ
      ["أخلد إلى الأرض : ركن إلى الدّنيا و رضي بها"], // أَخلَدَ
      ["أخلد إلى الأرض : ركن إلى الدّنيا و رضي بها"], // إِلَى
      ["أخلد إلى الأرض : ركن إلى الدّنيا و رضي بها"], // الأَرضِ
      [], // وَاتَّبَعَ
      [], // هَوىٰهُ
      [], // فَمَثَلُهُ
      [], // كَمَثَلِ
      [], // الكَلبِ
      [], // إِن
      ["تحمل عليه : تشدُد عليه و تزجزه"], // تَحمِل
      ["تحمل عليه : تشدُد عليه و تزجزه"], // عَلَيهِ
      ["يلهث : يُخرج لسانه بالنّـفَس الشديد"], // يَلهَث
      [], // أَو
      [], // تَترُكهُ
      [], // يَلهَث
      [], // ذٰلِكَ
      [], // مَثَلُ
      [], // القَومِ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // فَاقصُصِ
      [], // القَصَصَ
      [], // لَعَلَّهُم
      [] // يَتَفَكَّرونَ
    ],
    [ // آية 177
      [], // ساءَ
      [], // مَثَلًا
      [], // القَومُ
      [], // الَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      [], // وَأَنفُسَهُم
      [], // كانوا
      [] // يَظلِمونَ
    ],
    [ // آية 178
      [], // مَن
      [], // يَهدِ
      [], // اللَّهُ
      [], // فَهُوَ
      [], // المُهتَدى
      [], // وَمَن
      [], // يُضلِل
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 179
      [], // وَلَقَد
      ["ذرأنا : خلقنا و أوجدنا"], // ذَرَأنا
      [], // لِجَهَنَّمَ
      [], // كَثيرًا
      [], // مِنَ
      [], // الجِنِّ
      [], // وَالإِنسِ
      [], // لَهُم
      [], // قُلوبٌ
      [], // لا
      [], // يَفقَهونَ
      [], // بِها
      [], // وَلَهُم
      [], // أَعيُنٌ
      [], // لا
      [], // يُبصِرونَ
      [], // بِها
      [], // وَلَهُم
      [], // ءاذانٌ
      [], // لا
      [], // يَسمَعونَ
      [], // بِها
      [], // أُولـٰئِكَ
      [], // كَالأَنعـٰمِ
      [], // بَل
      [], // هُم
      [], // أَضَلُّ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الغـٰفِلونَ
    ],
    [ // آية 180
      [], // وَلِلَّهِ
      [], // الأَسماءُ
      [], // الحُسنىٰ
      [], // فَادعوهُ
      [], // بِها
      [], // وَذَرُوا
      [], // الَّذينَ
      [], // يُلحِدونَ
      [], // فى
      [], // أَسمـٰئِهِ
      [], // سَيُجزَونَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 181
      [], // وَمِمَّن
      [], // خَلَقنا
      [], // أُمَّةٌ
      [], // يَهدونَ
      [], // بِالحَقِّ
      [], // وَبِهِ
      [] // يَعدِلونَ
    ],
    [ // آية 182
      [], // وَالَّذينَ
      [], // كَذَّبوا
      [], // بِـٔايـٰتِنا
      ["سنستدرجهم : سنستدنيهم إلى الهلاك بالإنعام"], // سَنَستَدرِجُهُم
      [], // مِن
      [], // حَيثُ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 183
      [], // وَأُملى
      [], // لَهُم
      [], // إِنَّ
      [], // كَيدى
      [] // مَتينٌ
    ],
    [ // آية 184
      [], // أَوَلَم
      [], // يَتَفَكَّروا
      [], // ما
      [], // بِصاحِبِهِم
      [], // مِن
      ["جِنّة : جُنون كما يزعمون"], // جِنَّةٍ
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 185
      [], // أَوَلَم
      [], // يَنظُروا
      [], // فى
      ["ملكوت : هو المُـلك العظيم"], // مَلَكوتِ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // خَلَقَ
      [], // اللَّهُ
      [], // مِن
      [], // شَىءٍ
      [], // وَأَن
      [], // عَسىٰ
      [], // أَن
      [], // يَكونَ
      [], // قَدِ
      [], // اقتَرَبَ
      [], // أَجَلُهُم
      [], // فَبِأَىِّ
      [], // حَديثٍ
      [], // بَعدَهُ
      [] // يُؤمِنونَ
    ],
    [ // آية 186
      [], // مَن
      [], // يُضلِلِ
      [], // اللَّهُ
      [], // فَلا
      [], // هادِىَ
      [], // لَهُ
      [], // وَيَذَرُهُم
      [], // فى
      [], // طُغيـٰنِهِم
      ["يعمهون : يعمون عن الرّشد أو يتحيّرون"] // يَعمَهونَ
    ],
    [ // آية 187
      [], // يَسـَٔلونَكَ
      [], // عَنِ
      [], // السّاعَةِ
      [], // أَيّانَ
      [], // مُرسىٰها
      [], // قُل
      [], // إِنَّما
      [], // عِلمُها
      [], // عِندَ
      [], // رَبّى
      ["لا يجلّيها : لا يُظهرها و لا يكشف عنها"], // لا
      ["لا يجلّيها : لا يُظهرها و لا يكشف عنها"], // يُجَلّيها
      [], // لِوَقتِها
      [], // إِلّا
      [], // هُوَ
      [], // ثَقُلَت
      [], // فِى
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // لا
      [], // تَأتيكُم
      [], // إِلّا
      [], // بَغتَةً
      [], // يَسـَٔلونَكَ
      [], // كَأَنَّكَ
      [], // حَفِىٌّ
      [], // عَنها
      [], // قُل
      [], // إِنَّما
      [], // عِلمُها
      [], // عِندَ
      [], // اللَّهِ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَ
      [], // النّاسِ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 188
      [], // قُل
      [], // لا
      [], // أَملِكُ
      [], // لِنَفسى
      [], // نَفعًا
      [], // وَلا
      [], // ضَرًّا
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // اللَّهُ
      [], // وَلَو
      [], // كُنتُ
      [], // أَعلَمُ
      [], // الغَيبَ
      [], // لَاستَكثَرتُ
      [], // مِنَ
      [], // الخَيرِ
      [], // وَما
      [], // مَسَّنِىَ
      [], // السّوءُ
      [], // إِن
      [], // أَنا۠
      [], // إِلّا
      [], // نَذيرٌ
      [], // وَبَشيرٌ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 189
      [], // هُوَ
      [], // الَّذى
      [], // خَلَقَكُم
      [], // مِن
      [], // نَفسٍ
      [], // وٰحِدَةٍ
      [], // وَجَعَلَ
      [], // مِنها
      [], // زَوجَها
      [], // لِيَسكُنَ
      [], // إِلَيها
      [], // فَلَمّا
      [], // تَغَشّىٰها
      [], // حَمَلَت
      [], // حَملًا
      [], // خَفيفًا
      ["فمرّت به : فاستمرّت به بغير مشقّة"], // فَمَرَّت
      ["فمرّت به : فاستمرّت به بغير مشقّة"], // بِهِ
      [], // فَلَمّا
      ["أثقلت : صارت ذات ثِقل بكِبر الحمل"], // أَثقَلَت
      [], // دَعَوَا
      [], // اللَّهَ
      [], // رَبَّهُما
      [], // لَئِن
      [], // ءاتَيتَنا
      [], // صـٰلِحًا
      [], // لَنَكونَنَّ
      [], // مِنَ
      [] // الشّـٰكِرينَ
    ],
    [ // آية 190
      [], // فَلَمّا
      [], // ءاتىٰهُما
      [], // صـٰلِحًا
      ["جعلا له شركاء : بتسمية ولديهما عبد الحارث بوسوسة"], // جَعَلا
      ["جعلا له شركاء : بتسمية ولديهما عبد الحارث بوسوسة"], // لَهُ
      ["جعلا له شركاء : بتسمية ولديهما عبد الحارث بوسوسة"], // شُرَكاءَ
      [], // فيما
      [], // ءاتىٰهُما
      [], // فَتَعـٰلَى
      [], // اللَّهُ
      ["عمّا يُشركون : أي العرب بعبادة الأصنام"], // عَمّا
      ["عمّا يُشركون : أي العرب بعبادة الأصنام"] // يُشرِكونَ
    ],
    [ // آية 191
      [], // أَيُشرِكونَ
      [], // ما
      [], // لا
      [], // يَخلُقُ
      [], // شَيـًٔا
      [], // وَهُم
      [] // يُخلَقونَ
    ],
    [ // آية 192
      [], // وَلا
      [], // يَستَطيعونَ
      [], // لَهُم
      [], // نَصرًا
      [], // وَلا
      [], // أَنفُسَهُم
      [] // يَنصُرونَ
    ],
    [ // آية 193
      [], // وَإِن
      [], // تَدعوهُم
      [], // إِلَى
      [], // الهُدىٰ
      [], // لا
      [], // يَتَّبِعوكُم
      [], // سَواءٌ
      [], // عَلَيكُم
      [], // أَدَعَوتُموهُم
      [], // أَم
      [], // أَنتُم
      [] // صـٰمِتونَ
    ],
    [ // آية 194
      [], // إِنَّ
      [], // الَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // عِبادٌ
      [], // أَمثالُكُم
      [], // فَادعوهُم
      [], // فَليَستَجيبوا
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // صـٰدِقينَ
    ],
    [ // آية 195
      [], // أَلَهُم
      [], // أَرجُلٌ
      [], // يَمشونَ
      [], // بِها
      [], // أَم
      [], // لَهُم
      [], // أَيدٍ
      [], // يَبطِشونَ
      [], // بِها
      [], // أَم
      [], // لَهُم
      [], // أَعيُنٌ
      [], // يُبصِرونَ
      [], // بِها
      [], // أَم
      [], // لَهُم
      [], // ءاذانٌ
      [], // يَسمَعونَ
      [], // بِها
      [], // قُلِ
      [], // ادعوا
      [], // شُرَكاءَكُم
      [], // ثُمَّ
      [], // كيدونِ
      ["فلا تُنظرون : فلا تُمهلوني ساعة"], // فَلا
      ["فلا تُنظرون : فلا تُمهلوني ساعة"] // تُنظِرونِ
    ],
    [ // آية 196
      [], // إِنَّ
      [], // وَلِـِّۧىَ
      [], // اللَّهُ
      [], // الَّذى
      [], // نَزَّلَ
      [], // الكِتـٰبَ
      [], // وَهُوَ
      [], // يَتَوَلَّى
      [] // الصّـٰلِحينَ
    ],
    [ // آية 197
      [], // وَالَّذينَ
      [], // تَدعونَ
      [], // مِن
      [], // دونِهِ
      [], // لا
      [], // يَستَطيعونَ
      [], // نَصرَكُم
      [], // وَلا
      [], // أَنفُسَهُم
      [] // يَنصُرونَ
    ],
    [ // آية 198
      [], // وَإِن
      [], // تَدعوهُم
      [], // إِلَى
      [], // الهُدىٰ
      [], // لا
      [], // يَسمَعوا
      [], // وَتَرىٰهُم
      [], // يَنظُرونَ
      [], // إِلَيكَ
      [], // وَهُم
      ["لا يبصرون : لعدم قدرتهم على الإبصار"], // لا
      ["لا يبصرون : لعدم قدرتهم على الإبصار"] // يُبصِرونَ
    ],
    [ // آية 199
      ["خذ العفو : ما عفا و تيسّر من أخلاق النّاس"], // خُذِ
      ["خذ العفو : ما عفا و تيسّر من أخلاق النّاس"], // العَفوَ
      [], // وَأمُر
      [], // بِالعُرفِ
      [], // وَأَعرِض
      [], // عَنِ
      [] // الجـٰهِلينَ
    ],
    [ // آية 200
      [], // وَإِمّا
      ["ينزغنّك : يُصيبنّك . أو يصرفنّك"], // يَنزَغَنَّكَ
      [], // مِنَ
      [], // الشَّيطـٰنِ
      ["نزغ : وسوسة . أو صارف"], // نَزغٌ
      [], // فَاستَعِذ
      [], // بِاللَّهِ
      [], // إِنَّهُ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 201
      [], // إِنَّ
      [], // الَّذينَ
      [], // اتَّقَوا
      [], // إِذا
      [], // مَسَّهُم
      [], // طـٰئِفٌ
      [], // مِنَ
      [], // الشَّيطـٰنِ
      ["تذكّروا : أمر الله و نهيه و عداوة الشّيطان"], // تَذَكَّروا
      [], // فَإِذا
      [], // هُم
      [] // مُبصِرونَ
    ],
    [ // آية 202
      [], // وَإِخوٰنُهُم
      [], // يَمُدّونَهُم
      [], // فِى
      [], // الغَىِّ
      [], // ثُمَّ
      [], // لا
      [] // يُقصِرونَ
    ],
    [ // آية 203
      [], // وَإِذا
      [], // لَم
      [], // تَأتِهِم
      [], // بِـٔايَةٍ
      [], // قالوا
      [], // لَولَا
      ["اجتبيتها : اختلقتها و اخترعتها من عندك"], // اجتَبَيتَها
      [], // قُل
      [], // إِنَّما
      [], // أَتَّبِعُ
      [], // ما
      [], // يوحىٰ
      [], // إِلَىَّ
      [], // مِن
      [], // رَبّى
      [], // هـٰذا
      [], // بَصائِرُ
      [], // مِن
      [], // رَبِّكُم
      [], // وَهُدًى
      [], // وَرَحمَةٌ
      [], // لِقَومٍ
      [] // يُؤمِنونَ
    ],
    [ // آية 204
      [], // وَإِذا
      [], // قُرِئَ
      [], // القُرءانُ
      [], // فَاستَمِعوا
      [], // لَهُ
      [], // وَأَنصِتوا
      [], // لَعَلَّكُم
      [] // تُرحَمونَ
    ],
    [ // آية 205
      [], // وَاذكُر
      [], // رَبَّكَ
      [], // فى
      [], // نَفسِكَ
      ["تضرّعا : مُظهرا الضَّراعة و الذلة"], // تَضَرُّعًا
      [], // وَخيفَةً
      [], // وَدونَ
      [], // الجَهرِ
      [], // مِنَ
      [], // القَولِ
      [], // بِالغُدُوِّ
      [], // وَالـٔاصالِ
      [], // وَلا
      [], // تَكُن
      [], // مِنَ
      [] // الغـٰفِلينَ
    ],
    [ // آية 206
      [], // إِنَّ
      [], // الَّذينَ
      [], // عِندَ
      [], // رَبِّكَ
      [], // لا
      [], // يَستَكبِرونَ
      [], // عَن
      [], // عِبادَتِهِ
      [], // وَيُسَبِّحونَهُ
      [], // وَلَهُ
      [] // يَسجُدونَ
    ]
  ]
];

export default meanings;