const meanings = [
[ // آية 1
      ["سَأل سائل : دَعَـا دَاع على نـَـفـسِه و قوْمِه"], // سَأَلَ
      ["سَأل سائل : دَعَـا دَاع على نـَـفـسِه و قوْمِه"], // سائِلٌ
      [], // بِعَذابٍ
      [] // واقِعٍ
    ],
    [ // آية 2
      [], // لِلكـٰفِرينَ
      [], // لَيسَ
      [], // لَهُ
      [] // دافِعٌ
    ],
    [ // آية 3
      [], // مِنَ
      [], // اللَّهِ
      [], // ذِى
      [] // المَعارِجِ
    ],
    [ // آية 4
      [], // تَعرُجُ
      [], // المَلـٰئِكَةُ
      [], // وَالرّوحُ
      [], // إِلَيهِ
      [], // فى
      [], // يَومٍ
      [], // كانَ
      ["مِقداره : في حقّ الكفار"], // مِقدارُهُ
      [], // خَمسينَ
      [], // أَلفَ
      [] // سَنَةٍ
    ],
    [ // آية 5
      [], // فَاصبِر
      ["صَبْرًَا جميلا : لا شكوى فيه لغيْره تعالى"], // صَبرًا
      ["صَبْرًَا جميلا : لا شكوى فيه لغيْره تعالى"] // جَميلًا
    ],
    [ // آية 6
      [], // إِنَّهُم
      [], // يَرَونَهُ
      [] // بَعيدًا
    ],
    [ // آية 7
      [], // وَنَرىٰهُ
      [] // قَريبًا
    ],
    [ // آية 8
      [], // يَومَ
      [], // تَكونُ
      ["السّماء كالمُهل : كالمعدن المُذاب أو دُرْدُريّ الزّيت"], // السَّماءُ
      ["السّماء كالمُهل : كالمعدن المُذاب أو دُرْدُريّ الزّيت"] // كَالمُهلِ
    ],
    [ // آية 9
      [], // وَتَكونُ
      ["الجبال كالعِهن : كالصّوف المصبوغ ألوانا"], // الجِبالُ
      ["الجبال كالعِهن : كالصّوف المصبوغ ألوانا"] // كَالعِهنِ
    ],
    [ // آية 10
      [], // وَلا
      [], // يَسـَٔلُ
      ["حَميم : قريبٌ مُشْـفـقٌ لِشدّة الهَوْل"], // حَميمٌ
      [] // حَميمًا
    ],
    [ // آية 11
      [], // يُبَصَّرونَهُم
      [], // يَوَدُّ
      [], // المُجرِمُ
      [], // لَو
      [], // يَفتَدى
      [], // مِن
      [], // عَذابِ
      [], // يَومِئِذٍ
      [] // بِبَنيهِ
    ],
    [ // آية 12
      [], // وَصـٰحِبَتِهِ
      [] // وَأَخيهِ
    ],
    [ // آية 13
      [], // وَفَصيلَتِهِ
      [], // الَّتى
      [] // تُـٔويهِ
    ],
    [ // آية 14
      [], // وَمَن
      [], // فِى
      [], // الأَرضِ
      [], // جَميعًا
      [], // ثُمَّ
      [] // يُنجيهِ
    ],
    [ // آية 15
      [], // كَلّا
      [], // إِنَّها
      [] // لَظىٰ
    ],
    [ // آية 16
      [], // نَزّاعَةً
      [] // لِلشَّوىٰ
    ],
    [ // آية 17
      [], // تَدعوا
      [], // مَن
      [], // أَدبَرَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 18
      [], // وَجَمَعَ
      ["فأوْعى : أمْسَك ما له في وعاءٍ حرصًـا و تأميلاً"] // فَأَوعىٰ
    ],
    [ // آية 19
      [], // إِنَّ
      [], // الإِنسـٰنَ
      [], // خُلِقَ
      [] // هَلوعًا
    ],
    [ // آية 20
      [], // إِذا
      [], // مَسَّهُ
      [], // الشَّرُّ
      [] // جَزوعًا
    ],
    [ // آية 21
      [], // وَإِذا
      [], // مَسَّهُ
      [], // الخَيرُ
      ["مَنوعًا : كثيرَ المَنـْـعِ و الإمساك"] // مَنوعًا
    ],
    [ // آية 22
      [], // إِلَّا
      [] // المُصَلّينَ
    ],
    [ // آية 23
      [], // الَّذينَ
      [], // هُم
      [], // عَلىٰ
      [], // صَلاتِهِم
      [] // دائِمونَ
    ],
    [ // آية 24
      [], // وَالَّذينَ
      [], // فى
      [], // أَموٰلِهِم
      [], // حَقٌّ
      [] // مَعلومٌ
    ],
    [ // آية 25
      [], // لِلسّائِلِ
      [] // وَالمَحرومِ
    ],
    [ // آية 26
      [], // وَالَّذينَ
      [], // يُصَدِّقونَ
      [], // بِيَومِ
      [] // الدّينِ
    ],
    [ // آية 27
      [], // وَالَّذينَ
      [], // هُم
      [], // مِن
      [], // عَذابِ
      [], // رَبِّهِم
      [] // مُشفِقونَ
    ],
    [ // آية 28
      [], // إِنَّ
      [], // عَذابَ
      [], // رَبِّهِم
      [], // غَيرُ
      [] // مَأمونٍ
    ],
    [ // آية 29
      [], // وَالَّذينَ
      [], // هُم
      [], // لِفُروجِهِم
      [] // حـٰفِظونَ
    ],
    [ // آية 30
      [], // إِلّا
      [], // عَلىٰ
      [], // أَزوٰجِهِم
      [], // أَو
      [], // ما
      [], // مَلَكَت
      [], // أَيمـٰنُهُم
      [], // فَإِنَّهُم
      [], // غَيرُ
      [] // مَلومينَ
    ],
    [ // آية 31
      [], // فَمَنِ
      [], // ابتَغىٰ
      [], // وَراءَ
      [], // ذٰلِكَ
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      ["العادون : المُـجَاوزون الحلال إلى الحَرَام"] // العادونَ
    ],
    [ // آية 32
      [], // وَالَّذينَ
      [], // هُم
      [], // لِأَمـٰنـٰتِهِم
      [], // وَعَهدِهِم
      [] // رٰعونَ
    ],
    [ // آية 33
      [], // وَالَّذينَ
      [], // هُم
      [], // بِشَهـٰدٰتِهِم
      [] // قائِمونَ
    ],
    [ // آية 34
      [], // وَالَّذينَ
      [], // هُم
      [], // عَلىٰ
      [], // صَلاتِهِم
      [] // يُحافِظونَ
    ],
    [ // آية 35
      [], // أُولـٰئِكَ
      [], // فى
      [], // جَنّـٰتٍ
      [] // مُكرَمونَ
    ],
    [ // آية 36
      [], // فَمالِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // قِبَلَكَ
      ["مُهطِعين : مُسْرعين ، مادّي أعْناقِهم إليك"] // مُهطِعينَ
    ],
    [ // آية 37
      [], // عَنِ
      [], // اليَمينِ
      [], // وَعَنِ
      [], // الشِّمالِ
      ["عِزين : جماعات مُتفرقين"] // عِزينَ
    ],
    [ // آية 38
      [], // أَيَطمَعُ
      [], // كُلُّ
      [], // امرِئٍ
      [], // مِنهُم
      [], // أَن
      [], // يُدخَلَ
      [], // جَنَّةَ
      [] // نَعيمٍ
    ],
    [ // آية 39
      [], // كَلّا
      [], // إِنّا
      [], // خَلَقنـٰهُم
      ["ممّا يعلمون : مِنْ نُطفٍ مَهينـَـة مَذِرَة"], // مِمّا
      ["ممّا يعلمون : مِنْ نُطفٍ مَهينـَـة مَذِرَة"] // يَعلَمونَ
    ],
    [ // آية 40
      ["فلا أقسمُ : \"أقْـسِم . و \"\"لا\"\" مزيدة \""], // فَلا
      ["فلا أقسمُ : \"أقْـسِم . و \"\"لا\"\" مزيدة \""], // أُقسِمُ
      [], // بِرَبِّ
      [], // المَشـٰرِقِ
      [], // وَالمَغـٰرِبِ
      [], // إِنّا
      [] // لَقـٰدِرونَ
    ],
    [ // آية 41
      [], // عَلىٰ
      [], // أَن
      [], // نُبَدِّلَ
      [], // خَيرًا
      [], // مِنهُم
      [], // وَما
      [], // نَحنُ
      ["بمَسْبوقين : مَغْـلوبين عاجزين"] // بِمَسبوقينَ
    ],
    [ // آية 42
      [], // فَذَرهُم
      ["يَخوضوا : يَنغمِسُوا في باطلِهمْ"], // يَخوضوا
      [], // وَيَلعَبوا
      [], // حَتّىٰ
      [], // يُلـٰقوا
      [], // يَومَهُمُ
      [], // الَّذى
      [] // يوعَدونَ
    ],
    [ // آية 43
      [], // يَومَ
      [], // يَخرُجونَ
      ["مِنَ الأجداث : مِنَ القـبُور"], // مِنَ
      ["مِنَ الأجداث : مِنَ القـبُور"], // الأَجداثِ
      [], // سِراعًا
      [], // كَأَنَّهُم
      [], // إِلىٰ
      ["نُصُب : أحْجَار عَـــّظموها في الجاهلية"], // نُصُبٍ
      ["يوفِضون : يُسْرعون"] // يوفِضونَ
    ],
    [ // آية 44
      [], // خـٰشِعَةً
      [], // أَبصـٰرُهُم
      [], // تَرهَقُهُم
      [], // ذِلَّةٌ
      [], // ذٰلِكَ
      [], // اليَومُ
      [], // الَّذى
      [], // كانوا
      [] // يوعَدونَ
    ]
];

export default meanings;