const meanings = [
  [ // سورة 71: نوح
[ // آية 1
      [], // إِنّا
      [], // أَرسَلنا
      [], // نوحًا
      [], // إِلىٰ
      [], // قَومِهِ
      [], // أَن
      [], // أَنذِر
      [], // قَومَكَ
      [], // مِن
      [], // قَبلِ
      [], // أَن
      [], // يَأتِيَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 2
      [], // قالَ
      [], // يـٰقَومِ
      [], // إِنّى
      [], // لَكُم
      [], // نَذيرٌ
      [] // مُبينٌ
    ],
    [ // آية 3
      [], // أَنِ
      [], // اعبُدُوا
      [], // اللَّهَ
      [], // وَاتَّقوهُ
      [] // وَأَطيعونِ
    ],
    [ // آية 4
      [], // يَغفِر
      [], // لَكُم
      [], // مِن
      [], // ذُنوبِكُم
      [], // وَيُؤَخِّركُم
      [], // إِلىٰ
      [], // أَجَلٍ
      [], // مُسَمًّى
      [], // إِنَّ
      [], // أَجَلَ
      [], // اللَّهِ
      [], // إِذا
      [], // جاءَ
      [], // لا
      [], // يُؤَخَّرُ
      [], // لَو
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 5
      [], // قالَ
      [], // رَبِّ
      [], // إِنّى
      [], // دَعَوتُ
      [], // قَومى
      [], // لَيلًا
      [] // وَنَهارًا
    ],
    [ // آية 6
      [], // فَلَم
      [], // يَزِدهُم
      [], // دُعاءى
      [], // إِلّا
      ["فِرارًا : تـَـبَاعُـدًا و نِفـَـارًا عن الإيمان"] // فِرارًا
    ],
    [ // آية 7
      [], // وَإِنّى
      [], // كُلَّما
      [], // دَعَوتُهُم
      [], // لِتَغفِرَ
      [], // لَهُم
      [], // جَعَلوا
      [], // أَصـٰبِعَهُم
      [], // فى
      [], // ءاذانِهِم
      [], // وَاستَغشَوا
      [], // ثِيابَهُم
      [], // وَأَصَرّوا
      [], // وَاستَكبَرُوا
      [] // استِكبارًا
    ],
    [ // آية 8
      [], // ثُمَّ
      [], // إِنّى
      [], // دَعَوتُهُم
      [] // جِهارًا
    ],
    [ // آية 9
      [], // ثُمَّ
      [], // إِنّى
      [], // أَعلَنتُ
      [], // لَهُم
      [], // وَأَسرَرتُ
      [], // لَهُم
      [] // إِسرارًا
    ],
    [ // آية 10
      [], // فَقُلتُ
      [], // استَغفِروا
      [], // رَبَّكُم
      [], // إِنَّهُ
      [], // كانَ
      [] // غَفّارًا
    ],
    [ // آية 11
      ["يُرْسِل السّماء : المطر الذي في السّحاب"], // يُرسِلِ
      ["يُرْسِل السّماء : المطر الذي في السّحاب"], // السَّماءَ
      [], // عَلَيكُم
      ["مِدْرارًا : غزيرًا مُـتـتابعًا"] // مِدرارًا
    ],
    [ // آية 12
      [], // وَيُمدِدكُم
      [], // بِأَموٰلٍ
      [], // وَبَنينَ
      [], // وَيَجعَل
      [], // لَكُم
      [], // جَنّـٰتٍ
      [], // وَيَجعَل
      [], // لَكُم
      [] // أَنهـٰرًا
    ],
    [ // آية 13
      [], // ما
      [], // لَكُم
      [], // لا
      [], // تَرجونَ
      [], // لِلَّهِ
      [] // وَقارًا
    ],
    [ // آية 14
      [], // وَقَد
      [], // خَلَقَكُم
      [] // أَطوارًا
    ],
    [ // آية 15
      [], // أَلَم
      [], // تَرَوا
      [], // كَيفَ
      [], // خَلَقَ
      [], // اللَّهُ
      [], // سَبعَ
      [], // سَمـٰوٰتٍ
      [] // طِباقًا
    ],
    [ // آية 16
      [], // وَجَعَلَ
      [], // القَمَرَ
      [], // فيهِنَّ
      ["نورًا : مُنـَـوّرًا لِوَجْهِ الأرض في الظلام"], // نورًا
      [], // وَجَعَلَ
      [], // الشَّمسَ
      [] // سِراجًا
    ],
    [ // آية 17
      [], // وَاللَّهُ
      [], // أَنبَتَكُم
      [], // مِنَ
      [], // الأَرضِ
      [] // نَباتًا
    ],
    [ // آية 18
      [], // ثُمَّ
      [], // يُعيدُكُم
      [], // فيها
      [], // وَيُخرِجُكُم
      [] // إِخراجًا
    ],
    [ // آية 19
      [], // وَاللَّهُ
      [], // جَعَلَ
      [], // لَكُمُ
      ["الأرض بساطًا : فِـراشا مبسوطا للاستقـرار عليها"], // الأَرضَ
      ["الأرض بساطًا : فِـراشا مبسوطا للاستقـرار عليها"] // بِساطًا
    ],
    [ // آية 20
      [], // لِتَسلُكوا
      [], // مِنها
      [], // سُبُلًا
      [] // فِجاجًا
    ],
    [ // آية 21
      [], // قالَ
      [], // نوحٌ
      [], // رَبِّ
      [], // إِنَّهُم
      [], // عَصَونى
      [], // وَاتَّبَعوا
      [], // مَن
      [], // لَم
      [], // يَزِدهُ
      [], // مالُهُ
      [], // وَوَلَدُهُ
      [], // إِلّا
      [] // خَسارًا
    ],
    [ // آية 22
      [], // وَمَكَروا
      [], // مَكرًا
      [] // كُبّارًا
    ],
    [ // آية 23
      [], // وَقالوا
      [], // لا
      [], // تَذَرُنَّ
      [], // ءالِهَتَكُم
      [], // وَلا
      [], // تَذَرُنَّ
      ["وَدًّا : أصنامٌ عَبَدوها ثمّ انتقلت إلى العَرَب .،  فكان وَدّ لِكـَــلـْـب"], // وَدًّا
      [], // وَلا
      [], // سُواعًا
      [], // وَلا
      ["يَغوثَ : وَ يَغُوث لِغَطفان"], // يَغوثَ
      [], // وَيَعوقَ
      [] // وَنَسرًا
    ],
    [ // آية 24
      [], // وَقَد
      [], // أَضَلّوا
      [], // كَثيرًا
      [], // وَلا
      [], // تَزِدِ
      [], // الظّـٰلِمينَ
      [], // إِلّا
      [] // ضَلـٰلًا
    ],
    [ // آية 25
      [], // مِمّا
      [], // خَطيـٔـٰتِهِم
      [], // أُغرِقوا
      [], // فَأُدخِلوا
      [], // نارًا
      [], // فَلَم
      [], // يَجِدوا
      [], // لَهُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [] // أَنصارًا
    ],
    [ // آية 26
      [], // وَقالَ
      [], // نوحٌ
      [], // رَبِّ
      [], // لا
      [], // تَذَر
      [], // عَلَى
      [], // الأَرضِ
      [], // مِنَ
      [], // الكـٰفِرينَ
      [] // دَيّارًا
    ],
    [ // آية 27
      [], // إِنَّكَ
      [], // إِن
      [], // تَذَرهُم
      [], // يُضِلّوا
      [], // عِبادَكَ
      [], // وَلا
      [], // يَلِدوا
      [], // إِلّا
      [], // فاجِرًا
      [] // كَفّارًا
    ],
    [ // آية 28
      [], // رَبِّ
      [], // اغفِر
      [], // لى
      [], // وَلِوٰلِدَىَّ
      [], // وَلِمَن
      [], // دَخَلَ
      [], // بَيتِىَ
      [], // مُؤمِنًا
      [], // وَلِلمُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // وَلا
      [], // تَزِدِ
      [], // الظّـٰلِمينَ
      [], // إِلّا
      ["تبارًا : هَلاكًا وَ دَمارًا"] // تَبارًا
    ]
  ]
];

export default meanings;