const meanings = [
  [ // سورة 72: الجن
[ // آية 1
      [], // قُل
      [], // أوحِىَ
      [], // إِلَىَّ
      [], // أَنَّهُ
      [], // استَمَعَ
      [], // نَفَرٌ
      [], // مِنَ
      [], // الجِنِّ
      [], // فَقالوا
      [], // إِنّا
      [], // سَمِعنا
      [], // قُرءانًا
      [] // عَجَبًا
    ],
    [ // آية 2
      [], // يَهدى
      [], // إِلَى
      ["الرّشد : الحقّ و الصّــواب . أو التوحيد و الإيمان"], // الرُّشدِ
      [], // فَـٔامَنّا
      [], // بِهِ
      [], // وَلَن
      [], // نُشرِكَ
      [], // بِرَبِّنا
      [] // أَحَدًا
    ],
    [ // آية 3
      [], // وَأَنَّهُ
      [], // تَعـٰلىٰ
      [], // جَدُّ
      [], // رَبِّنا
      [], // مَا
      [], // اتَّخَذَ
      [], // صـٰحِبَةً
      [], // وَلا
      [] // وَلَدًا
    ],
    [ // آية 4
      [], // وَأَنَّهُ
      [], // كانَ
      [], // يَقولُ
      [], // سَفيهُنا
      [], // عَلَى
      [], // اللَّهِ
      ["شططا : قوْلاً مُـفرطًـا في الكذب و الضّـلال"] // شَطَطًا
    ],
    [ // آية 5
      [], // وَأَنّا
      [], // ظَنَنّا
      [], // أَن
      [], // لَن
      [], // تَقولَ
      [], // الإِنسُ
      [], // وَالجِنُّ
      [], // عَلَى
      [], // اللَّهِ
      [] // كَذِبًا
    ],
    [ // آية 6
      [], // وَأَنَّهُ
      [], // كانَ
      [], // رِجالٌ
      [], // مِنَ
      [], // الإِنسِ
      ["يَعوذون : يَسْـتعيذون و يَتحيّـرون"], // يَعوذونَ
      [], // بِرِجالٍ
      [], // مِنَ
      [], // الجِنِّ
      [], // فَزادوهُم
      [] // رَهَقًا
    ],
    [ // آية 7
      [], // وَأَنَّهُم
      [], // ظَنّوا
      [], // كَما
      [], // ظَنَنتُم
      [], // أَن
      [], // لَن
      [], // يَبعَثَ
      [], // اللَّهُ
      [] // أَحَدًا
    ],
    [ // آية 8
      [], // وَأَنّا
      [], // لَمَسنَا
      [], // السَّماءَ
      [], // فَوَجَدنـٰها
      [], // مُلِئَت
      [], // حَرَسًا
      [], // شَديدًا
      [] // وَشُهُبًا
    ],
    [ // آية 9
      [], // وَأَنّا
      [], // كُنّا
      [], // نَقعُدُ
      [], // مِنها
      [], // مَقـٰعِدَ
      [], // لِلسَّمعِ
      [], // فَمَن
      [], // يَستَمِعِ
      [], // الـٔانَ
      [], // يَجِد
      [], // لَهُ
      [], // شِهابًا
      [] // رَصَدًا
    ],
    [ // آية 10
      [], // وَأَنّا
      [], // لا
      [], // نَدرى
      [], // أَشَرٌّ
      [], // أُريدَ
      [], // بِمَن
      [], // فِى
      [], // الأَرضِ
      [], // أَم
      [], // أَرادَ
      [], // بِهِم
      [], // رَبُّهُم
      [] // رَشَدًا
    ],
    [ // آية 11
      [], // وَأَنّا
      [], // مِنَّا
      [], // الصّـٰلِحونَ
      [], // وَمِنّا
      [], // دونَ
      [], // ذٰلِكَ
      [], // كُنّا
      [], // طَرائِقَ
      [] // قِدَدًا
    ],
    [ // آية 12
      [], // وَأَنّا
      [], // ظَنَنّا
      [], // أَن
      [], // لَن
      [], // نُعجِزَ
      [], // اللَّهَ
      [], // فِى
      [], // الأَرضِ
      [], // وَلَن
      [], // نُعجِزَهُ
      [] // هَرَبًا
    ],
    [ // آية 13
      [], // وَأَنّا
      [], // لَمّا
      [], // سَمِعنَا
      [], // الهُدىٰ
      [], // ءامَنّا
      [], // بِهِ
      [], // فَمَن
      [], // يُؤمِن
      [], // بِرَبِّهِ
      ["فلا يَخاف بخسا : فلا يَخشى نـَـقـْصًـا منْ ثوَابه"], // فَلا
      ["فلا يَخاف بخسا : فلا يَخشى نـَـقـْصًـا منْ ثوَابه"], // يَخافُ
      ["فلا يَخاف بخسا : فلا يَخشى نـَـقـْصًـا منْ ثوَابه"], // بَخسًا
      [], // وَلا
      [] // رَهَقًا
    ],
    [ // آية 14
      [], // وَأَنّا
      [], // مِنَّا
      [], // المُسلِمونَ
      [], // وَمِنَّا
      [], // القـٰسِطونَ
      [], // فَمَن
      [], // أَسلَمَ
      [], // فَأُولـٰئِكَ
      [], // تَحَرَّوا
      [] // رَشَدًا
    ],
    [ // آية 15
      [], // وَأَمَّا
      [], // القـٰسِطونَ
      [], // فَكانوا
      ["لجهنّم حطبا : للنّـار وقودًا"], // لِجَهَنَّمَ
      ["لجهنّم حطبا : للنّـار وقودًا"] // حَطَبًا
    ],
    [ // آية 16
      [], // وَأَلَّوِ
      [], // استَقـٰموا
      ["على الطريقة : \"طريقة الهدى  \"\"ملـّة الإسلام\"\"\""], // عَلَى
      ["على الطريقة : \"طريقة الهدى  \"\"ملـّة الإسلام\"\"\""], // الطَّريقَةِ
      [], // لَأَسقَينـٰهُم
      [], // ماءً
      [] // غَدَقًا
    ],
    [ // آية 17
      [], // لِنَفتِنَهُم
      [], // فيهِ
      [], // وَمَن
      [], // يُعرِض
      [], // عَن
      [], // ذِكرِ
      [], // رَبِّهِ
      [], // يَسلُكهُ
      ["عَذابًا صَعَدًا : شاقّـا يعلوه و يَغلبُـه فلا يُطيقه"], // عَذابًا
      ["عَذابًا صَعَدًا : شاقّـا يعلوه و يَغلبُـه فلا يُطيقه"] // صَعَدًا
    ],
    [ // آية 18
      [], // وَأَنَّ
      [], // المَسـٰجِدَ
      [], // لِلَّهِ
      [], // فَلا
      [], // تَدعوا
      [], // مَعَ
      [], // اللَّهِ
      [] // أَحَدًا
    ],
    [ // آية 19
      [], // وَأَنَّهُ
      [], // لَمّا
      [], // قامَ
      [], // عَبدُ
      [], // اللَّهِ
      [], // يَدعوهُ
      [], // كادوا
      [], // يَكونونَ
      [], // عَلَيهِ
      [] // لِبَدًا
    ],
    [ // آية 20
      [], // قُل
      [], // إِنَّما
      [], // أَدعوا
      [], // رَبّى
      [], // وَلا
      [], // أُشرِكُ
      [], // بِهِ
      [] // أَحَدًا
    ],
    [ // آية 21
      [], // قُل
      [], // إِنّى
      [], // لا
      [], // أَملِكُ
      [], // لَكُم
      [], // ضَرًّا
      [], // وَلا
      ["رَشَدًا : نفعا أو هداية"] // رَشَدًا
    ],
    [ // آية 22
      [], // قُل
      [], // إِنّى
      [], // لَن
      [], // يُجيرَنى
      [], // مِنَ
      [], // اللَّهِ
      [], // أَحَدٌ
      [], // وَلَن
      [], // أَجِدَ
      [], // مِن
      [], // دونِهِ
      [] // مُلتَحَدًا
    ],
    [ // آية 23
      [], // إِلّا
      [], // بَلـٰغًا
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرِسـٰلـٰتِهِ
      [], // وَمَن
      [], // يَعصِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // فَإِنَّ
      [], // لَهُ
      [], // نارَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [] // أَبَدًا
    ],
    [ // آية 24
      [], // حَتّىٰ
      [], // إِذا
      [], // رَأَوا
      [], // ما
      [], // يوعَدونَ
      [], // فَسَيَعلَمونَ
      [], // مَن
      [], // أَضعَفُ
      [], // ناصِرًا
      [], // وَأَقَلُّ
      [] // عَدَدًا
    ],
    [ // آية 25
      [], // قُل
      [], // إِن
      [], // أَدرى
      [], // أَقَريبٌ
      [], // ما
      [], // توعَدونَ
      [], // أَم
      [], // يَجعَلُ
      [], // لَهُ
      [], // رَبّى
      ["أمَدًا : زمنا بعيدا"] // أَمَدًا
    ],
    [ // آية 26
      [], // عـٰلِمُ
      [], // الغَيبِ
      [], // فَلا
      [], // يُظهِرُ
      [], // عَلىٰ
      [], // غَيبِهِ
      [] // أَحَدًا
    ],
    [ // آية 27
      [], // إِلّا
      [], // مَنِ
      [], // ارتَضىٰ
      [], // مِن
      [], // رَسولٍ
      [], // فَإِنَّهُ
      [], // يَسلُكُ
      [], // مِن
      [], // بَينِ
      [], // يَدَيهِ
      [], // وَمِن
      [], // خَلفِهِ
      ["رَصَدًا : حَرَسا من الملائكة يحرسونه"] // رَصَدًا
    ],
    [ // آية 28
      [], // لِيَعلَمَ
      [], // أَن
      [], // قَد
      [], // أَبلَغوا
      [], // رِسـٰلـٰتِ
      [], // رَبِّهِم
      [], // وَأَحاطَ
      [], // بِما
      [], // لَدَيهِم
      [], // وَأَحصىٰ
      [], // كُلَّ
      [], // شَىءٍ
      [] // عَدَدًا
    ]
  ]
];

export default meanings;