const meanings = [
[ // آية 1
      [], // يـٰأَيُّهَا
      ["المزّمل : المتلفّـف بثيابه (النبي صلى الله عليه و سلم)"] // المُزَّمِّلُ
    ],
    [ // آية 2
      [], // قُمِ
      [], // الَّيلَ
      [], // إِلّا
      [] // قَليلًا
    ],
    [ // آية 3
      [], // نِصفَهُ
      [], // أَوِ
      [], // انقُص
      [], // مِنهُ
      [] // قَليلًا
    ],
    [ // آية 4
      [], // أَو
      [], // زِد
      [], // عَلَيهِ
      [], // وَرَتِّلِ
      [], // القُرءانَ
      [] // تَرتيلًا
    ],
    [ // آية 5
      [], // إِنّا
      [], // سَنُلقى
      [], // عَلَيكَ
      ["قوْلاً ثقيلا : شاقّـاعلى المكلـّـفـين"], // قَولًا
      ["قوْلاً ثقيلا : شاقّـاعلى المكلـّـفـين"] // ثَقيلًا
    ],
    [ // آية 6
      [], // إِنَّ
      [], // ناشِئَةَ
      [], // الَّيلِ
      [], // هِىَ
      [], // أَشَدُّ
      [], // وَطـًٔا
      [], // وَأَقوَمُ
      [] // قيلًا
    ],
    [ // آية 7
      [], // إِنَّ
      [], // لَكَ
      [], // فِى
      [], // النَّهارِ
      ["سَبْحًا : تصرّفا و تقـلـّـبا في مُهمّـاتك"], // سَبحًا
      [] // طَويلًا
    ],
    [ // آية 8
      [], // وَاذكُرِ
      [], // اسمَ
      [], // رَبِّكَ
      [], // وَتَبَتَّل
      [], // إِلَيهِ
      [] // تَبتيلًا
    ],
    [ // آية 9
      [], // رَبُّ
      [], // المَشرِقِ
      [], // وَالمَغرِبِ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // فَاتَّخِذهُ
      [] // وَكيلًا
    ],
    [ // آية 10
      [], // وَاصبِر
      [], // عَلىٰ
      [], // ما
      [], // يَقولونَ
      [], // وَاهجُرهُم
      ["هجرًا جميلا : اعتزالا حَسَنا لا جزع فيه"], // هَجرًا
      ["هجرًا جميلا : اعتزالا حَسَنا لا جزع فيه"] // جَميلًا
    ],
    [ // آية 11
      [], // وَذَرنى
      [], // وَالمُكَذِّبينَ
      [], // أُولِى
      [], // النَّعمَةِ
      [], // وَمَهِّلهُم
      [] // قَليلًا
    ],
    [ // آية 12
      [], // إِنَّ
      [], // لَدَينا
      [], // أَنكالًا
      [] // وَجَحيمًا
    ],
    [ // آية 13
      [], // وَطَعامًا
      [], // ذا
      [], // غُصَّةٍ
      [], // وَعَذابًا
      [] // أَليمًا
    ],
    [ // آية 14
      ["يوم ترجُف الأرض : تضطرب و تتزلزل (يوم القيامة)"], // يَومَ
      ["يوم ترجُف الأرض : تضطرب و تتزلزل (يوم القيامة)"], // تَرجُفُ
      ["يوم ترجُف الأرض : تضطرب و تتزلزل (يوم القيامة)"], // الأَرضُ
      [], // وَالجِبالُ
      [], // وَكانَتِ
      [], // الجِبالُ
      ["كثيبا مهيلا : رَمْلا مُجْـتمِعًـا – سائلا مُنهالا"], // كَثيبًا
      ["كثيبا مهيلا : رَمْلا مُجْـتمِعًـا – سائلا مُنهالا"] // مَهيلًا
    ],
    [ // آية 15
      [], // إِنّا
      [], // أَرسَلنا
      [], // إِلَيكُم
      [], // رَسولًا
      [], // شـٰهِدًا
      [], // عَلَيكُم
      [], // كَما
      [], // أَرسَلنا
      [], // إِلىٰ
      [], // فِرعَونَ
      [] // رَسولًا
    ],
    [ // آية 16
      [], // فَعَصىٰ
      [], // فِرعَونُ
      [], // الرَّسولَ
      [], // فَأَخَذنـٰهُ
      ["أخذا وبيلا : شديدا ثقيلا وَخيم العُقـبى"], // أَخذًا
      ["أخذا وبيلا : شديدا ثقيلا وَخيم العُقـبى"] // وَبيلًا
    ],
    [ // آية 17
      [], // فَكَيفَ
      [], // تَتَّقونَ
      [], // إِن
      [], // كَفَرتُم
      [], // يَومًا
      [], // يَجعَلُ
      [], // الوِلدٰنَ
      [] // شيبًا
    ],
    [ // آية 18
      ["السماء منفطر به : شيء مُنشقّ في ذلك اليوم لِهوْله"], // السَّماءُ
      ["السماء منفطر به : شيء مُنشقّ في ذلك اليوم لِهوْله"], // مُنفَطِرٌ
      ["السماء منفطر به : شيء مُنشقّ في ذلك اليوم لِهوْله"], // بِهِ
      [], // كانَ
      [], // وَعدُهُ
      [] // مَفعولًا
    ],
    [ // آية 19
      [], // إِنَّ
      [], // هـٰذِهِ
      [], // تَذكِرَةٌ
      [], // فَمَن
      [], // شاءَ
      [], // اتَّخَذَ
      [], // إِلىٰ
      [], // رَبِّهِ
      [] // سَبيلًا
    ],
    [ // آية 20
      [], // إِنَّ
      [], // رَبَّكَ
      [], // يَعلَمُ
      [], // أَنَّكَ
      [], // تَقومُ
      [], // أَدنىٰ
      [], // مِن
      [], // ثُلُثَىِ
      [], // الَّيلِ
      [], // وَنِصفَهُ
      [], // وَثُلُثَهُ
      [], // وَطائِفَةٌ
      [], // مِنَ
      [], // الَّذينَ
      [], // مَعَكَ
      [], // وَاللَّهُ
      [], // يُقَدِّرُ
      [], // الَّيلَ
      [], // وَالنَّهارَ
      [], // عَلِمَ
      [], // أَن
      [], // لَن
      [], // تُحصوهُ
      [], // فَتابَ
      [], // عَلَيكُم
      [], // فَاقرَءوا
      [], // ما
      [], // تَيَسَّرَ
      [], // مِنَ
      [], // القُرءانِ
      [], // عَلِمَ
      [], // أَن
      [], // سَيَكونُ
      [], // مِنكُم
      [], // مَرضىٰ
      [], // وَءاخَرونَ
      ["يَضربون : يُـسافـرون للتجارة و نحوها"], // يَضرِبونَ
      [], // فِى
      [], // الأَرضِ
      [], // يَبتَغونَ
      [], // مِن
      [], // فَضلِ
      [], // اللَّهِ
      [], // وَءاخَرونَ
      [], // يُقـٰتِلونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَاقرَءوا
      [], // ما
      [], // تَيَسَّرَ
      [], // مِنهُ
      [], // وَأَقيمُوا
      [], // الصَّلوٰةَ
      [], // وَءاتُوا
      [], // الزَّكوٰةَ
      [], // وَأَقرِضُوا
      [], // اللَّهَ
      ["قرضا حسنا : احتسابا بطيبة نفـْـس"], // قَرضًا
      ["قرضا حسنا : احتسابا بطيبة نفـْـس"], // حَسَنًا
      [], // وَما
      [], // تُقَدِّموا
      [], // لِأَنفُسِكُم
      [], // مِن
      [], // خَيرٍ
      [], // تَجِدوهُ
      [], // عِندَ
      [], // اللَّهِ
      [], // هُوَ
      [], // خَيرًا
      [], // وَأَعظَمَ
      [], // أَجرًا
      [], // وَاستَغفِرُوا
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ]
];

export default meanings;