const meanings = [
  [ // سورة 74: المدثر
[ // آية 1
      [], // يـٰأَيُّهَا
      ["المدثر : المتغشّى بثيابه (النبي صلى الله عليه و سلم)"] // المُدَّثِّرُ
    ],
    [ // آية 2
      [], // قُم
      [] // فَأَنذِر
    ],
    [ // آية 3
      [], // وَرَبَّكَ
      [] // فَكَبِّر
    ],
    [ // آية 4
      [], // وَثِيابَكَ
      [] // فَطَهِّر
    ],
    [ // آية 5
      [], // وَالرُّجزَ
      [] // فَاهجُر
    ],
    [ // آية 6
      [], // وَلا
      [], // تَمنُن
      [] // تَستَكثِرُ
    ],
    [ // آية 7
      [], // وَلِرَبِّكَ
      [] // فَاصبِر
    ],
    [ // آية 8
      [], // فَإِذا
      [], // نُقِرَ
      [], // فِى
      [] // النّاقورِ
    ],
    [ // آية 9
      [], // فَذٰلِكَ
      [], // يَومَئِذٍ
      [], // يَومٌ
      [] // عَسيرٌ
    ],
    [ // آية 10
      [], // عَلَى
      [], // الكـٰفِرينَ
      [], // غَيرُ
      [] // يَسيرٍ
    ],
    [ // آية 11
      [], // ذَرنى
      [], // وَمَن
      [], // خَلَقتُ
      [] // وَحيدًا
    ],
    [ // آية 12
      [], // وَجَعَلتُ
      [], // لَهُ
      [], // مالًا
      [] // مَمدودًا
    ],
    [ // آية 13
      [], // وَبَنينَ
      [] // شُهودًا
    ],
    [ // آية 14
      [], // وَمَهَّدتُ
      [], // لَهُ
      [] // تَمهيدًا
    ],
    [ // آية 15
      [], // ثُمَّ
      [], // يَطمَعُ
      [], // أَن
      [] // أَزيدَ
    ],
    [ // آية 16
      ["كلاّ : كلمة رَدْع و زجر عن الطمع الفارغ"], // كَلّا
      [], // إِنَّهُ
      [], // كانَ
      [], // لِـٔايـٰتِنا
      [] // عَنيدًا
    ],
    [ // آية 17
      ["سأرهقه صعودا : سَأكلـّـفه عَذابا  شاقّـا"], // سَأُرهِقُهُ
      ["سأرهقه صعودا : سَأكلـّـفه عَذابا  شاقّـا"] // صَعودًا
    ],
    [ // آية 18
      [], // إِنَّهُ
      [], // فَكَّرَ
      [] // وَقَدَّرَ
    ],
    [ // آية 19
      ["فقتل : لُعِنَ و عُذب أو قُـبِّـح"], // فَقُتِلَ
      [], // كَيفَ
      [] // قَدَّرَ
    ],
    [ // آية 20
      [], // ثُمَّ
      [], // قُتِلَ
      [], // كَيفَ
      [] // قَدَّرَ
    ],
    [ // آية 21
      [], // ثُمَّ
      ["نظر : تأمّل فيما قدّرَ و هيّـأ من الــّطـعْن"] // نَظَرَ
    ],
    [ // آية 22
      [], // ثُمَّ
      ["عَبَس : قـَــّطبَ وَجْهَه لمّا ضاقـَـتْ عليه الحِيَل"], // عَبَسَ
      [] // وَبَسَرَ
    ],
    [ // آية 23
      [], // ثُمَّ
      [], // أَدبَرَ
      [] // وَاستَكبَرَ
    ],
    [ // آية 24
      [], // فَقالَ
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      ["سِحْرٌ يُؤثر : يُرْوَى  و يُـتـَـعـلـّـمُ من السَّحَرَة"], // سِحرٌ
      ["سِحْرٌ يُؤثر : يُرْوَى  و يُـتـَـعـلـّـمُ من السَّحَرَة"] // يُؤثَرُ
    ],
    [ // آية 25
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // قَولُ
      [] // البَشَرِ
    ],
    [ // آية 26
      [], // سَأُصليهِ
      [] // سَقَرَ
    ],
    [ // آية 27
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [] // سَقَرُ
    ],
    [ // آية 28
      [], // لا
      [], // تُبقى
      [], // وَلا
      [] // تَذَرُ
    ],
    [ // آية 29
      ["لوّاحة للبشر : مُسودّة للجلود ، مُحْـرقَة  لها"], // لَوّاحَةٌ
      ["لوّاحة للبشر : مُسودّة للجلود ، مُحْـرقَة  لها"] // لِلبَشَرِ
    ],
    [ // آية 30
      [], // عَلَيها
      [], // تِسعَةَ
      [] // عَشَرَ
    ],
    [ // آية 31
      [], // وَما
      [], // جَعَلنا
      [], // أَصحـٰبَ
      [], // النّارِ
      [], // إِلّا
      [], // مَلـٰئِكَةً
      [], // وَما
      [], // جَعَلنا
      [], // عِدَّتَهُم
      [], // إِلّا
      ["فتنة : سبب فتنة و ضلال"], // فِتنَةً
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // لِيَستَيقِنَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // وَيَزدادَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إيمـٰنًا
      [], // وَلا
      [], // يَرتابَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // وَالمُؤمِنونَ
      [], // وَلِيَقولَ
      [], // الَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // وَالكـٰفِرونَ
      [], // ماذا
      [], // أَرادَ
      [], // اللَّهُ
      [], // بِهـٰذا
      [], // مَثَلًا
      [], // كَذٰلِكَ
      [], // يُضِلُّ
      [], // اللَّهُ
      [], // مَن
      [], // يَشاءُ
      [], // وَيَهدى
      [], // مَن
      [], // يَشاءُ
      [], // وَما
      [], // يَعلَمُ
      [], // جُنودَ
      [], // رَبِّكَ
      [], // إِلّا
      [], // هُوَ
      [], // وَما
      [], // هِىَ
      [], // إِلّا
      [], // ذِكرىٰ
      [] // لِلبَشَرِ
    ],
    [ // آية 32
      [], // كَلّا
      [] // وَالقَمَرِ
    ],
    [ // آية 33
      [], // وَالَّيلِ
      [], // إِذ
      [] // أَدبَرَ
    ],
    [ // آية 34
      [], // وَالصُّبحِ
      [], // إِذا
      [] // أَسفَرَ
    ],
    [ // آية 35
      [], // إِنَّها
      [], // لَإِحدَى
      [] // الكُبَرِ
    ],
    [ // آية 36
      [], // نَذيرًا
      [] // لِلبَشَرِ
    ],
    [ // آية 37
      [], // لِمَن
      [], // شاءَ
      [], // مِنكُم
      [], // أَن
      [], // يَتَقَدَّمَ
      [], // أَو
      [] // يَتَأَخَّرَ
    ],
    [ // آية 38
      [], // كُلُّ
      [], // نَفسٍ
      ["بما كَسَبَتْ رَهينة : مَرْهونة عنده تعالى بعَمَلِـها"], // بِما
      ["بما كَسَبَتْ رَهينة : مَرْهونة عنده تعالى بعَمَلِـها"], // كَسَبَت
      ["بما كَسَبَتْ رَهينة : مَرْهونة عنده تعالى بعَمَلِـها"] // رَهينَةٌ
    ],
    [ // آية 39
      [], // إِلّا
      [], // أَصحـٰبَ
      [] // اليَمينِ
    ],
    [ // آية 40
      [], // فى
      [], // جَنّـٰتٍ
      [] // يَتَساءَلونَ
    ],
    [ // آية 41
      [], // عَنِ
      [] // المُجرِمينَ
    ],
    [ // آية 42
      [], // ما
      [], // سَلَكَكُم
      [], // فى
      [] // سَقَرَ
    ],
    [ // آية 43
      [], // قالوا
      [], // لَم
      [], // نَكُ
      [], // مِنَ
      [] // المُصَلّينَ
    ],
    [ // آية 44
      [], // وَلَم
      [], // نَكُ
      [], // نُطعِمُ
      [] // المِسكينَ
    ],
    [ // آية 45
      [], // وَكُنّا
      [], // نَخوضُ
      [], // مَعَ
      [] // الخائِضينَ
    ],
    [ // آية 46
      [], // وَكُنّا
      [], // نُكَذِّبُ
      ["بيوم الدّين : بيَوْمِ البعْثِ و الحِسَاب و الجزاء"], // بِيَومِ
      ["بيوم الدّين : بيَوْمِ البعْثِ و الحِسَاب و الجزاء"] // الدّينِ
    ],
    [ // آية 47
      [], // حَتّىٰ
      [], // أَتىٰنَا
      [] // اليَقينُ
    ],
    [ // آية 48
      [], // فَما
      [], // تَنفَعُهُم
      [], // شَفـٰعَةُ
      [] // الشّـٰفِعينَ
    ],
    [ // آية 49
      [], // فَما
      [], // لَهُم
      [], // عَنِ
      [], // التَّذكِرَةِ
      [] // مُعرِضينَ
    ],
    [ // آية 50
      [], // كَأَنَّهُم
      [], // حُمُرٌ
      [] // مُستَنفِرَةٌ
    ],
    [ // آية 51
      [], // فَرَّت
      [], // مِن
      [] // قَسوَرَةٍ
    ],
    [ // آية 52
      [], // بَل
      [], // يُريدُ
      [], // كُلُّ
      [], // امرِئٍ
      [], // مِنهُم
      [], // أَن
      [], // يُؤتىٰ
      [], // صُحُفًا
      [] // مُنَشَّرَةً
    ],
    [ // آية 53
      [], // كَلّا
      [], // بَل
      [], // لا
      [], // يَخافونَ
      [] // الـٔاخِرَةَ
    ],
    [ // آية 54
      [], // كَلّا
      [], // إِنَّهُ
      [] // تَذكِرَةٌ
    ],
    [ // آية 55
      [], // فَمَن
      [], // شاءَ
      [] // ذَكَرَهُ
    ],
    [ // آية 56
      [], // وَما
      [], // يَذكُرونَ
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // هُوَ
      [], // أَهلُ
      [], // التَّقوىٰ
      [], // وَأَهلُ
      [] // المَغفِرَةِ
    ]
  ]
];

export default meanings;