const meanings = [
[ // آية 1
      [], // لا
      [], // أُقسِمُ
      [], // بِيَومِ
      [] // القِيـٰمَةِ
    ],
    [ // آية 2
      [], // وَلا
      [], // أُقسِمُ
      [], // بِالنَّفسِ
      [] // اللَّوّامَةِ
    ],
    [ // آية 3
      [], // أَيَحسَبُ
      [], // الإِنسـٰنُ
      [], // أَلَّن
      [], // نَجمَعَ
      [] // عِظامَهُ
    ],
    [ // آية 4
      [], // بَلىٰ
      [], // قـٰدِرينَ
      [], // عَلىٰ
      [], // أَن
      [], // نُسَوِّىَ
      [] // بَنانَهُ
    ],
    [ // آية 5
      [], // بَل
      [], // يُريدُ
      [], // الإِنسـٰنُ
      [], // لِيَفجُرَ
      [] // أَمامَهُ
    ],
    [ // آية 6
      [], // يَسـَٔلُ
      [], // أَيّانَ
      [], // يَومُ
      [] // القِيـٰمَةِ
    ],
    [ // آية 7
      [], // فَإِذا
      ["بَرقَ البَصر : دَهِشَ و تـَـحَـيّرَ فَزَعًا مما رأى"], // بَرِقَ
      ["بَرقَ البَصر : دَهِشَ و تـَـحَـيّرَ فَزَعًا مما رأى"] // البَصَرُ
    ],
    [ // آية 8
      [], // وَخَسَفَ
      [] // القَمَرُ
    ],
    [ // آية 9
      [], // وَجُمِعَ
      [], // الشَّمسُ
      [] // وَالقَمَرُ
    ],
    [ // آية 10
      [], // يَقولُ
      [], // الإِنسـٰنُ
      [], // يَومَئِذٍ
      [], // أَينَ
      [] // المَفَرُّ
    ],
    [ // آية 11
      [], // كَلّا
      [], // لا
      [] // وَزَرَ
    ],
    [ // آية 12
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // يَومَئِذٍ
      [] // المُستَقَرُّ
    ],
    [ // آية 13
      [], // يُنَبَّؤُا۟
      [], // الإِنسـٰنُ
      [], // يَومَئِذٍ
      [], // بِما
      [], // قَدَّمَ
      [] // وَأَخَّرَ
    ],
    [ // آية 14
      [], // بَلِ
      [], // الإِنسـٰنُ
      [], // عَلىٰ
      [], // نَفسِهِ
      ["بَصيرَة : حُجّة بَيّـنـَـة أو عَيْنٌ بَصيرة"] // بَصيرَةٌ
    ],
    [ // آية 15
      [], // وَلَو
      [], // أَلقىٰ
      [] // مَعاذيرَهُ
    ],
    [ // آية 16
      [], // لا
      [], // تُحَرِّك
      [], // بِهِ
      [], // لِسانَكَ
      [], // لِتَعجَلَ
      [] // بِهِ
    ],
    [ // آية 17
      [], // إِنَّ
      [], // عَلَينا
      [], // جَمعَهُ
      [] // وَقُرءانَهُ
    ],
    [ // آية 18
      [], // فَإِذا
      [], // قَرَأنـٰهُ
      [], // فَاتَّبِع
      [] // قُرءانَهُ
    ],
    [ // آية 19
      [], // ثُمَّ
      [], // إِنَّ
      [], // عَلَينا
      ["بَيَانه : تـَـفـْـسير ما أشكل مِنْ مَعانيه"] // بَيانَهُ
    ],
    [ // آية 20
      [], // كَلّا
      [], // بَل
      [], // تُحِبّونَ
      [] // العاجِلَةَ
    ],
    [ // آية 21
      [], // وَتَذَرونَ
      [] // الـٔاخِرَةَ
    ],
    [ // آية 22
      [], // وُجوهٌ
      [], // يَومَئِذٍ
      [] // ناضِرَةٌ
    ],
    [ // آية 23
      [], // إِلىٰ
      [], // رَبِّها
      [] // ناظِرَةٌ
    ],
    [ // آية 24
      [], // وَوُجوهٌ
      [], // يَومَئِذٍ
      [] // باسِرَةٌ
    ],
    [ // آية 25
      [], // تَظُنُّ
      [], // أَن
      [], // يُفعَلَ
      [], // بِها
      [] // فاقِرَةٌ
    ],
    [ // آية 26
      [], // كَلّا
      [], // إِذا
      [], // بَلَغَتِ
      [] // التَّراقِىَ
    ],
    [ // آية 27
      [], // وَقيلَ
      [], // مَن
      [] // راقٍ
    ],
    [ // آية 28
      [], // وَظَنَّ
      [], // أَنَّهُ
      [] // الفِراقُ
    ],
    [ // آية 29
      [], // وَالتَفَّتِ
      [], // السّاقُ
      [] // بِالسّاقِ
    ],
    [ // آية 30
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // يَومَئِذٍ
      ["المَساق : سَوْق العِبَـاد للجزاء"] // المَساقُ
    ],
    [ // آية 31
      [], // فَلا
      [], // صَدَّقَ
      [], // وَلا
      [] // صَلّىٰ
    ],
    [ // آية 32
      [], // وَلـٰكِن
      [], // كَذَّبَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 33
      [], // ثُمَّ
      [], // ذَهَبَ
      [], // إِلىٰ
      [], // أَهلِهِ
      ["يَتمَطى : يَـتبَختر في مِشيَـتِه اخْتِـيالا"] // يَتَمَطّىٰ
    ],
    [ // آية 34
      ["أوْلى لك : قارَبَك ما يُهْـلِـكُـك"], // أَولىٰ
      ["أوْلى لك : قارَبَك ما يُهْـلِـكُـك"], // لَكَ
      [] // فَأَولىٰ
    ],
    [ // آية 35
      [], // ثُمَّ
      [], // أَولىٰ
      [], // لَكَ
      [] // فَأَولىٰ
    ],
    [ // آية 36
      [], // أَيَحسَبُ
      [], // الإِنسـٰنُ
      [], // أَن
      [], // يُترَكَ
      [] // سُدًى
    ],
    [ // آية 37
      [], // أَلَم
      [], // يَكُ
      [], // نُطفَةً
      [], // مِن
      [], // مَنِىٍّ
      [] // يُمنىٰ
    ],
    [ // آية 38
      [], // ثُمَّ
      [], // كانَ
      [], // عَلَقَةً
      [], // فَخَلَقَ
      ["فَسَوّى : فعَدّله و كَمّـله و نـَـفَخَ فـيه الرّوح"] // فَسَوّىٰ
    ],
    [ // آية 39
      [], // فَجَعَلَ
      [], // مِنهُ
      [], // الزَّوجَينِ
      [], // الذَّكَرَ
      [] // وَالأُنثىٰ
    ],
    [ // آية 40
      [], // أَلَيسَ
      [], // ذٰلِكَ
      [], // بِقـٰدِرٍ
      [], // عَلىٰ
      [], // أَن
      [], // يُحـِۧىَ
      [] // المَوتىٰ
    ]
];

export default meanings;