const meanings = [
[ // آية 1
      [], // هَل
      [], // أَتىٰ
      [], // عَلَى
      [], // الإِنسـٰنِ
      [], // حينٌ
      [], // مِنَ
      [], // الدَّهرِ
      [], // لَم
      [], // يَكُن
      [], // شَيـًٔا
      [] // مَذكورًا
    ],
    [ // آية 2
      [], // إِنّا
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // مِن
      [], // نُطفَةٍ
      ["أمشاج : أخلاط ممتزجة مُتباينـَـة الصّـفات"], // أَمشاجٍ
      ["نبتليه : مُتبَلين له بالتّكاليف فيما بعد"], // نَبتَليهِ
      [], // فَجَعَلنـٰهُ
      [], // سَميعًا
      [] // بَصيرًا
    ],
    [ // آية 3
      [], // إِنّا
      [], // هَدَينـٰهُ
      [], // السَّبيلَ
      [], // إِمّا
      [], // شاكِرًا
      [], // وَإِمّا
      [] // كَفورًا
    ],
    [ // آية 4
      [], // إِنّا
      [], // أَعتَدنا
      [], // لِلكـٰفِرينَ
      [], // سَلـٰسِلَا۟
      [], // وَأَغلـٰلًا
      [] // وَسَعيرًا
    ],
    [ // آية 5
      [], // إِنَّ
      [], // الأَبرارَ
      [], // يَشرَبونَ
      [], // مِن
      ["كأس : خَمْر أو زُجاجة فيها خَمر"], // كَأسٍ
      [], // كانَ
      ["مزاجُها : ما تـُمـْـزَج الكأس به و تـُخْـلـَط"], // مِزاجُها
      ["كافورا : ماءً كالكافور في أحسن أوصافه"] // كافورًا
    ],
    [ // آية 6
      ["عيْنا : ماءَ عَـيْن أو خَمْر عيْن"], // عَينًا
      ["يَشرب بها : يَشرب منها . أو يَرتوي بها"], // يَشرَبُ
      ["يَشرب بها : يَشرب منها . أو يَرتوي بها"], // بِها
      [], // عِبادُ
      [], // اللَّهِ
      [], // يُفَجِّرونَها
      [] // تَفجيرًا
    ],
    [ // آية 7
      [], // يوفونَ
      [], // بِالنَّذرِ
      [], // وَيَخافونَ
      [], // يَومًا
      [], // كانَ
      [], // شَرُّهُ
      [] // مُستَطيرًا
    ],
    [ // آية 8
      [], // وَيُطعِمونَ
      [], // الطَّعامَ
      [], // عَلىٰ
      [], // حُبِّهِ
      [], // مِسكينًا
      [], // وَيَتيمًا
      [] // وَأَسيرًا
    ],
    [ // آية 9
      [], // إِنَّما
      [], // نُطعِمُكُم
      [], // لِوَجهِ
      [], // اللَّهِ
      [], // لا
      [], // نُريدُ
      [], // مِنكُم
      [], // جَزاءً
      [], // وَلا
      [] // شُكورًا
    ],
    [ // آية 10
      [], // إِنّا
      [], // نَخافُ
      [], // مِن
      [], // رَبِّنا
      ["يوما عبوسا : تـَـكْـلـَحُ فيه الوُجُوه لِهَوْله"], // يَومًا
      ["يوما عبوسا : تـَـكْـلـَحُ فيه الوُجُوه لِهَوْله"], // عَبوسًا
      ["قمطريرا : شديد العُبوس"] // قَمطَريرًا
    ],
    [ // آية 11
      [], // فَوَقىٰهُمُ
      [], // اللَّهُ
      [], // شَرَّ
      [], // ذٰلِكَ
      [], // اليَومِ
      [], // وَلَقّىٰهُم
      [], // نَضرَةً
      [] // وَسُرورًا
    ],
    [ // آية 12
      [], // وَجَزىٰهُم
      [], // بِما
      [], // صَبَروا
      [], // جَنَّةً
      [] // وَحَريرًا
    ],
    [ // آية 13
      [], // مُتَّكِـٔينَ
      [], // فيها
      [], // عَلَى
      ["الأرائك : السّرُر في الحِجال(جمع حِجلة مُحرّكة- بيت يُزيّن بالقـِباب و الأسِرّة و السّـتور)"], // الأَرائِكِ
      [], // لا
      [], // يَرَونَ
      [], // فيها
      [], // شَمسًا
      [], // وَلا
      [] // زَمهَريرًا
    ],
    [ // آية 14
      [], // وَدانِيَةً
      [], // عَلَيهِم
      [], // ظِلـٰلُها
      [], // وَذُلِّلَت
      [], // قُطوفُها
      [] // تَذليلًا
    ],
    [ // آية 15
      [], // وَيُطافُ
      [], // عَلَيهِم
      [], // بِـٔانِيَةٍ
      [], // مِن
      [], // فِضَّةٍ
      [], // وَأَكوابٍ
      [], // كانَت
      [] // قَواريرا۠
    ],
    [ // آية 16
      [], // قَواريرَا۟
      [], // مِن
      [], // فِضَّةٍ
      ["قدّروها : جَعَلوا شرابَها على قدْر الرِّيّ"], // قَدَّروها
      [] // تَقديرًا
    ],
    [ // آية 17
      [], // وَيُسقَونَ
      [], // فيها
      ["كأسًا : خَمْرًا أو زجاجة فيها خَمْر"], // كَأسًا
      [], // كانَ
      ["مزاجُها : ما تـُـمزَج به و تـُخْـلط"], // مِزاجُها
      ["زنجبيلا : ماءً كالزنجبيل في أحْسَن أوصافه"] // زَنجَبيلًا
    ],
    [ // آية 18
      [], // عَينًا
      [], // فيها
      ["تُسَمّى سلسبيلا : يُوصَف شرابُها بالسّلاسة في الإنسياغ"], // تُسَمّىٰ
      ["تُسَمّى سلسبيلا : يُوصَف شرابُها بالسّلاسة في الإنسياغ"] // سَلسَبيلًا
    ],
    [ // آية 19
      [], // وَيَطوفُ
      [], // عَلَيهِم
      [], // وِلدٰنٌ
      [], // مُخَلَّدونَ
      [], // إِذا
      [], // رَأَيتَهُم
      [], // حَسِبتَهُم
      ["لؤلؤا منثورا : اللؤلؤ المُـفـرّق في الحُـسْن و الصّـفاء"], // لُؤلُؤًا
      ["لؤلؤا منثورا : اللؤلؤ المُـفـرّق في الحُـسْن و الصّـفاء"] // مَنثورًا
    ],
    [ // آية 20
      [], // وَإِذا
      [], // رَأَيتَ
      [], // ثَمَّ
      [], // رَأَيتَ
      [], // نَعيمًا
      [], // وَمُلكًا
      [] // كَبيرًا
    ],
    [ // آية 21
      [], // عـٰلِيَهُم
      ["ثياب سندس : ثِـيَاب من ديباج رقيق"], // ثِيابُ
      ["ثياب سندس : ثِـيَاب من ديباج رقيق"], // سُندُسٍ
      [], // خُضرٌ
      [], // وَإِستَبرَقٌ
      [], // وَحُلّوا
      [], // أَساوِرَ
      [], // مِن
      [], // فِضَّةٍ
      [], // وَسَقىٰهُم
      [], // رَبُّهُم
      [], // شَرابًا
      [] // طَهورًا
    ],
    [ // آية 22
      [], // إِنَّ
      [], // هـٰذا
      [], // كانَ
      [], // لَكُم
      [], // جَزاءً
      [], // وَكانَ
      [], // سَعيُكُم
      [] // مَشكورًا
    ],
    [ // آية 23
      [], // إِنّا
      [], // نَحنُ
      [], // نَزَّلنا
      [], // عَلَيكَ
      [], // القُرءانَ
      [] // تَنزيلًا
    ],
    [ // آية 24
      [], // فَاصبِر
      [], // لِحُكمِ
      [], // رَبِّكَ
      [], // وَلا
      [], // تُطِع
      [], // مِنهُم
      [], // ءاثِمًا
      [], // أَو
      [] // كَفورًا
    ],
    [ // آية 25
      [], // وَاذكُرِ
      [], // اسمَ
      [], // رَبِّكَ
      [], // بُكرَةً
      [] // وَأَصيلًا
    ],
    [ // آية 26
      [], // وَمِنَ
      [], // الَّيلِ
      [], // فَاسجُد
      [], // لَهُ
      [], // وَسَبِّحهُ
      [], // لَيلًا
      [] // طَويلًا
    ],
    [ // آية 27
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      [], // يُحِبّونَ
      [], // العاجِلَةَ
      [], // وَيَذَرونَ
      [], // وَراءَهُم
      ["يوما ثقيلا : شديد الأهوال (يوم القيامة )"], // يَومًا
      ["يوما ثقيلا : شديد الأهوال (يوم القيامة )"] // ثَقيلًا
    ],
    [ // آية 28
      [], // نَحنُ
      [], // خَلَقنـٰهُم
      [], // وَشَدَدنا
      [], // أَسرَهُم
      [], // وَإِذا
      [], // شِئنا
      [], // بَدَّلنا
      [], // أَمثـٰلَهُم
      [] // تَبديلًا
    ],
    [ // آية 29
      [], // إِنَّ
      [], // هـٰذِهِ
      [], // تَذكِرَةٌ
      [], // فَمَن
      [], // شاءَ
      [], // اتَّخَذَ
      [], // إِلىٰ
      [], // رَبِّهِ
      [] // سَبيلًا
    ],
    [ // آية 30
      [], // وَما
      [], // تَشاءونَ
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // كانَ
      [], // عَليمًا
      [] // حَكيمًا
    ],
    [ // آية 31
      [], // يُدخِلُ
      [], // مَن
      [], // يَشاءُ
      [], // فى
      [], // رَحمَتِهِ
      [], // وَالظّـٰلِمينَ
      [], // أَعَدَّ
      [], // لَهُم
      [], // عَذابًا
      [] // أَليمًا
    ]
];

export default meanings;