const meanings = [
  [ // سورة 77: المرسلات
[ // آية 1
      [], // وَالمُرسَلـٰتِ
      [] // عُرفًا
    ],
    [ // آية 2
      [], // فَالعـٰصِفـٰتِ
      [] // عَصفًا
    ],
    [ // آية 3
      [], // وَالنّـٰشِرٰتِ
      [] // نَشرًا
    ],
    [ // آية 4
      [], // فَالفـٰرِقـٰتِ
      [] // فَرقًا
    ],
    [ // آية 5
      [], // فَالمُلقِيـٰتِ
      [] // ذِكرًا
    ],
    [ // آية 6
      ["عُذرا : للإعذار من الله للخَلـْـق"], // عُذرًا
      [], // أَو
      [] // نُذرًا
    ],
    [ // آية 7
      ["إنما توعدون : من البَعْثْ ( جَوَاب القـَـسَم)"], // إِنَّما
      ["إنما توعدون : من البَعْثْ ( جَوَاب القـَـسَم)"], // توعَدونَ
      [] // لَوٰقِعٌ
    ],
    [ // آية 8
      [], // فَإِذَا
      ["النجوم طُمِسَتْ : مُـحِـيَ نورُها و أذهِبَ ضوؤها"], // النُّجومُ
      ["النجوم طُمِسَتْ : مُـحِـيَ نورُها و أذهِبَ ضوؤها"] // طُمِسَت
    ],
    [ // آية 9
      [], // وَإِذَا
      [], // السَّماءُ
      [] // فُرِجَت
    ],
    [ // آية 10
      [], // وَإِذَا
      ["الجبال نُسِفت : قُـلِعَت من أماكِنِها بسُرْعَة"], // الجِبالُ
      ["الجبال نُسِفت : قُـلِعَت من أماكِنِها بسُرْعَة"] // نُسِفَت
    ],
    [ // آية 11
      [], // وَإِذَا
      [], // الرُّسُلُ
      [] // أُقِّتَت
    ],
    [ // آية 12
      [], // لِأَىِّ
      [], // يَومٍ
      [] // أُجِّلَت
    ],
    [ // آية 13
      [], // لِيَومِ
      [] // الفَصلِ
    ],
    [ // آية 14
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [], // يَومُ
      [] // الفَصلِ
    ],
    [ // آية 15
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 16
      [], // أَلَم
      [], // نُهلِكِ
      [] // الأَوَّلينَ
    ],
    [ // آية 17
      [], // ثُمَّ
      [], // نُتبِعُهُمُ
      [] // الـٔاخِرينَ
    ],
    [ // آية 18
      [], // كَذٰلِكَ
      [], // نَفعَلُ
      [] // بِالمُجرِمينَ
    ],
    [ // آية 19
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 20
      [], // أَلَم
      [], // نَخلُقكُم
      [], // مِن
      ["ماءٍ مهين : مَنِـيّ ضعيف حَقير"], // ماءٍ
      ["ماءٍ مهين : مَنِـيّ ضعيف حَقير"] // مَهينٍ
    ],
    [ // آية 21
      [], // فَجَعَلنـٰهُ
      [], // فى
      ["قرار مكين : مُتمَكّن ، و هو الرّحِم"], // قَرارٍ
      ["قرار مكين : مُتمَكّن ، و هو الرّحِم"] // مَكينٍ
    ],
    [ // آية 22
      [], // إِلىٰ
      [], // قَدَرٍ
      [] // مَعلومٍ
    ],
    [ // آية 23
      [], // فَقَدَرنا
      [], // فَنِعمَ
      [] // القـٰدِرونَ
    ],
    [ // آية 24
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 25
      [], // أَلَم
      [], // نَجعَلِ
      ["الأرض كِفاتا : وعاءًا تضمّ  الأحياء على ظهرها"], // الأَرضَ
      ["الأرض كِفاتا : وعاءًا تضمّ  الأحياء على ظهرها"] // كِفاتًا
    ],
    [ // آية 26
      [], // أَحياءً
      [] // وَأَموٰتًا
    ],
    [ // آية 27
      [], // وَجَعَلنا
      [], // فيها
      [], // رَوٰسِىَ
      [], // شـٰمِخـٰتٍ
      [], // وَأَسقَينـٰكُم
      [], // ماءً
      [] // فُراتًا
    ],
    [ // آية 28
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 29
      [], // انطَلِقوا
      [], // إِلىٰ
      [], // ما
      [], // كُنتُم
      [], // بِهِ
      [] // تُكَذِّبونَ
    ],
    [ // آية 30
      [], // انطَلِقوا
      [], // إِلىٰ
      ["ظلّ : هو دُخان جهنّم"], // ظِلٍّ
      [], // ذى
      [], // ثَلـٰثِ
      [] // شُعَبٍ
    ],
    [ // آية 31
      [], // لا
      [], // ظَليلٍ
      [], // وَلا
      [], // يُغنى
      [], // مِنَ
      [] // اللَّهَبِ
    ],
    [ // آية 32
      [], // إِنَّها
      [], // تَرمى
      [], // بِشَرَرٍ
      [] // كَالقَصرِ
    ],
    [ // آية 33
      [], // كَأَنَّهُ
      [], // جِمـٰلَتٌ
      [] // صُفرٌ
    ],
    [ // آية 34
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 35
      [], // هـٰذا
      [], // يَومُ
      [], // لا
      [] // يَنطِقونَ
    ],
    [ // آية 36
      [], // وَلا
      [], // يُؤذَنُ
      [], // لَهُم
      [] // فَيَعتَذِرونَ
    ],
    [ // آية 37
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 38
      [], // هـٰذا
      [], // يَومُ
      [], // الفَصلِ
      [], // جَمَعنـٰكُم
      [] // وَالأَوَّلينَ
    ],
    [ // آية 39
      [], // فَإِن
      [], // كانَ
      ["لكم كيْدٌ :"], // لَكُم
      ["لكم كيْدٌ :"], // كَيدٌ
      [] // فَكيدونِ
    ],
    [ // آية 40
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 41
      [], // إِنَّ
      [], // المُتَّقينَ
      [], // فى
      [], // ظِلـٰلٍ
      [] // وَعُيونٍ
    ],
    [ // آية 42
      [], // وَفَوٰكِهَ
      [], // مِمّا
      [] // يَشتَهونَ
    ],
    [ // آية 43
      [], // كُلوا
      [], // وَاشرَبوا
      [], // هَنيـًٔا
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 44
      [], // إِنّا
      [], // كَذٰلِكَ
      [], // نَجزِى
      [] // المُحسِنينَ
    ],
    [ // آية 45
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 46
      [], // كُلوا
      [], // وَتَمَتَّعوا
      [], // قَليلًا
      [], // إِنَّكُم
      [] // مُجرِمونَ
    ],
    [ // آية 47
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 48
      [], // وَإِذا
      [], // قيلَ
      [], // لَهُمُ
      [], // اركَعوا
      [], // لا
      [] // يَركَعونَ
    ],
    [ // آية 49
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 50
      [], // فَبِأَىِّ
      [], // حَديثٍ
      [], // بَعدَهُ
      [] // يُؤمِنونَ
    ]
  ]
];

export default meanings;