const meanings = [
  [ // سورة 78: النبأ
[ // آية 1
      [], // عَمَّ
      [] // يَتَساءَلونَ
    ],
    [ // آية 2
      ["عن النّبإ العظيم : عن القرآن أو البَعْث"], // عَنِ
      ["عن النّبإ العظيم : عن القرآن أو البَعْث"], // النَّبَإِ
      ["عن النّبإ العظيم : عن القرآن أو البَعْث"] // العَظيمِ
    ],
    [ // آية 3
      [], // الَّذى
      [], // هُم
      [], // فيهِ
      [] // مُختَلِفونَ
    ],
    [ // آية 4
      ["كلاّ : رَدْعٌ و زَجْر عن الإختلاف فيه"], // كَلّا
      [] // سَيَعلَمونَ
    ],
    [ // آية 5
      [], // ثُمَّ
      [], // كَلّا
      [] // سَيَعلَمونَ
    ],
    [ // آية 6
      [], // أَلَم
      [], // نَجعَلِ
      [], // الأَرضَ
      [] // مِهـٰدًا
    ],
    [ // آية 7
      [], // وَالجِبالَ
      [] // أَوتادًا
    ],
    [ // آية 8
      [], // وَخَلَقنـٰكُم
      [] // أَزوٰجًا
    ],
    [ // آية 9
      [], // وَجَعَلنا
      ["نومَكم سُباتا : قـَـطْعًا لأعمالِكُمْ و راحة لأبْدانِكم"], // نَومَكُم
      ["نومَكم سُباتا : قـَـطْعًا لأعمالِكُمْ و راحة لأبْدانِكم"] // سُباتًا
    ],
    [ // آية 10
      [], // وَجَعَلنَا
      [], // الَّيلَ
      [] // لِباسًا
    ],
    [ // آية 11
      [], // وَجَعَلنَا
      [], // النَّهارَ
      [] // مَعاشًا
    ],
    [ // آية 12
      [], // وَبَنَينا
      [], // فَوقَكُم
      [], // سَبعًا
      [] // شِدادًا
    ],
    [ // آية 13
      [], // وَجَعَلنا
      ["سِرَاجا وهّاجا : مِصْباحا مُنيرا وقـّـادًا (الشّمس)"], // سِراجًا
      ["سِرَاجا وهّاجا : مِصْباحا مُنيرا وقـّـادًا (الشّمس)"] // وَهّاجًا
    ],
    [ // آية 14
      [], // وَأَنزَلنا
      [], // مِنَ
      [], // المُعصِرٰتِ
      ["ماءً ثجّاجا : مُنـْـصَـبّـا بكثرةٍ مع التـّـتابُع"], // ماءً
      ["ماءً ثجّاجا : مُنـْـصَـبّـا بكثرةٍ مع التـّـتابُع"] // ثَجّاجًا
    ],
    [ // آية 15
      [], // لِنُخرِجَ
      [], // بِهِ
      [], // حَبًّا
      [] // وَنَباتًا
    ],
    [ // آية 16
      [], // وَجَنّـٰتٍ
      [] // أَلفافًا
    ],
    [ // آية 17
      [], // إِنَّ
      [], // يَومَ
      [], // الفَصلِ
      [], // كانَ
      [] // ميقـٰتًا
    ],
    [ // آية 18
      [], // يَومَ
      [], // يُنفَخُ
      [], // فِى
      [], // الصّورِ
      ["فتأتون أفواجا : أمَمًـا أو جماعات مُختلفة الأحوال"], // فَتَأتونَ
      ["فتأتون أفواجا : أمَمًـا أو جماعات مُختلفة الأحوال"] // أَفواجًا
    ],
    [ // آية 19
      [], // وَفُتِحَتِ
      [], // السَّماءُ
      [], // فَكانَت
      [] // أَبوٰبًا
    ],
    [ // آية 20
      [], // وَسُيِّرَتِ
      [], // الجِبالُ
      ["فكانت سرابا : فالسّراب الذي لا حَقيقة له"], // فَكانَت
      ["فكانت سرابا : فالسّراب الذي لا حَقيقة له"] // سَرابًا
    ],
    [ // آية 21
      [], // إِنَّ
      [], // جَهَنَّمَ
      ["كانت مِرْصادًا : مَوْضِعَ ترَصّدٍ و ترقّب للكافرين"], // كانَت
      ["كانت مِرْصادًا : مَوْضِعَ ترَصّدٍ و ترقّب للكافرين"] // مِرصادًا
    ],
    [ // آية 22
      [], // لِلطّـٰغينَ
      [] // مَـٔابًا
    ],
    [ // آية 23
      [], // لـٰبِثينَ
      [], // فيها
      [] // أَحقابًا
    ],
    [ // آية 24
      [], // لا
      [], // يَذوقونَ
      [], // فيها
      ["بَرْدًا : نـَوْمًا أو رَوْحًا من حرّ النّـار"], // بَردًا
      [], // وَلا
      [] // شَرابًا
    ],
    [ // آية 25
      [], // إِلّا
      ["حميما : ماءً بالغا نِهاية الحرارة"], // حَميمًا
      [] // وَغَسّاقًا
    ],
    [ // آية 26
      [], // جَزاءً
      [] // وِفاقًا
    ],
    [ // آية 27
      [], // إِنَّهُم
      [], // كانوا
      [], // لا
      [], // يَرجونَ
      [] // حِسابًا
    ],
    [ // آية 28
      [], // وَكَذَّبوا
      [], // بِـٔايـٰتِنا
      ["كِذابا : تكذيبًـا شديدا"] // كِذّابًا
    ],
    [ // آية 29
      [], // وَكُلَّ
      [], // شَىءٍ
      [], // أَحصَينـٰهُ
      [] // كِتـٰبًا
    ],
    [ // آية 30
      [], // فَذوقوا
      [], // فَلَن
      [], // نَزيدَكُم
      [], // إِلّا
      [] // عَذابًا
    ],
    [ // آية 31
      [], // إِنَّ
      [], // لِلمُتَّقينَ
      ["مَفازًا : فوْزًا و ظفَـرًا بكلّ محْبوب"] // مَفازًا
    ],
    [ // آية 32
      [], // حَدائِقَ
      [] // وَأَعنـٰبًا
    ],
    [ // آية 33
      [], // وَكَواعِبَ
      ["أترابًا : مُسْتـَـوياتٍ في السّن"] // أَترابًا
    ],
    [ // آية 34
      [], // وَكَأسًا
      [] // دِهاقًا
    ],
    [ // آية 35
      [], // لا
      [], // يَسمَعونَ
      [], // فيها
      ["لغْوًا : كلاما غير مُعْـتدّ به . أو قبيحًـا"], // لَغوًا
      [], // وَلا
      [] // كِذّٰبًا
    ],
    [ // آية 36
      [], // جَزاءً
      [], // مِن
      [], // رَبِّكَ
      ["عَطاءً حِسابا : إحسانا كافِـيا أو كثيرا"], // عَطاءً
      ["عَطاءً حِسابا : إحسانا كافِـيا أو كثيرا"] // حِسابًا
    ],
    [ // آية 37
      [], // رَبِّ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَما
      [], // بَينَهُمَا
      [], // الرَّحمـٰنِ
      [], // لا
      [], // يَملِكونَ
      [], // مِنهُ
      [] // خِطابًا
    ],
    [ // آية 38
      [], // يَومَ
      [], // يَقومُ
      ["الرّوح : جبريل عليه السلام"], // الرّوحُ
      [], // وَالمَلـٰئِكَةُ
      [], // صَفًّا
      [], // لا
      [], // يَتَكَلَّمونَ
      [], // إِلّا
      [], // مَن
      [], // أَذِنَ
      [], // لَهُ
      [], // الرَّحمـٰنُ
      [], // وَقالَ
      [] // صَوابًا
    ],
    [ // آية 39
      [], // ذٰلِكَ
      [], // اليَومُ
      [], // الحَقُّ
      [], // فَمَن
      [], // شاءَ
      [], // اتَّخَذَ
      [], // إِلىٰ
      [], // رَبِّهِ
      [] // مَـٔابًا
    ],
    [ // آية 40
      [], // إِنّا
      [], // أَنذَرنـٰكُم
      [], // عَذابًا
      [], // قَريبًا
      [], // يَومَ
      [], // يَنظُرُ
      [], // المَرءُ
      [], // ما
      [], // قَدَّمَت
      [], // يَداهُ
      [], // وَيَقولُ
      [], // الكافِرُ
      [], // يـٰلَيتَنى
      [], // كُنتُ
      [] // تُرٰبًا
    ]
  ]
];

export default meanings;