const meanings = [
[ // آية 1
      [], // وَالنّـٰزِعـٰتِ
      ["غرْقا : نـَزعا شديدا مُؤْلما بالغ الغاية"] // غَرقًا
    ],
    [ // آية 2
      [], // وَالنّـٰشِطـٰتِ
      [] // نَشطًا
    ],
    [ // آية 3
      [], // وَالسّـٰبِحـٰتِ
      [] // سَبحًا
    ],
    [ // آية 4
      [], // فَالسّـٰبِقـٰتِ
      [] // سَبقًا
    ],
    [ // آية 5
      [], // فَالمُدَبِّرٰتِ
      [] // أَمرًا
    ],
    [ // آية 6
      ["يوم ترجف الراجفة : لتبعثنّ (جواب القسم) يَوم تضطرب الأجْرَام بالصيحة الهائلة (نفخة الموت)"], // يَومَ
      ["يوم ترجف الراجفة : لتبعثنّ (جواب القسم) يَوم تضطرب الأجْرَام بالصيحة الهائلة (نفخة الموت)"], // تَرجُفُ
      ["يوم ترجف الراجفة : لتبعثنّ (جواب القسم) يَوم تضطرب الأجْرَام بالصيحة الهائلة (نفخة الموت)"] // الرّاجِفَةُ
    ],
    [ // آية 7
      ["تتبعها الرادفة : نفخة البعث التي تردف الأولى"], // تَتبَعُهَا
      ["تتبعها الرادفة : نفخة البعث التي تردف الأولى"] // الرّادِفَةُ
    ],
    [ // آية 8
      [], // قُلوبٌ
      [], // يَومَئِذٍ
      ["واجفة : مُضطربة . أو خائفة وَجلة"] // واجِفَةٌ
    ],
    [ // آية 9
      [], // أَبصـٰرُها
      [] // خـٰشِعَةٌ
    ],
    [ // آية 10
      [], // يَقولونَ
      [], // أَءِنّا
      [], // لَمَردودونَ
      [], // فِى
      [] // الحافِرَةِ
    ],
    [ // آية 11
      [], // أَءِذا
      [], // كُنّا
      [], // عِظـٰمًا
      [] // نَخِرَةً
    ],
    [ // آية 12
      [], // قالوا
      [], // تِلكَ
      [], // إِذًا
      ["كرّة خاسِرة : رَجْعة غابـِـنة"], // كَرَّةٌ
      ["كرّة خاسِرة : رَجْعة غابـِـنة"] // خاسِرَةٌ
    ],
    [ // آية 13
      [], // فَإِنَّما
      [], // هِىَ
      [], // زَجرَةٌ
      [] // وٰحِدَةٌ
    ],
    [ // آية 14
      [], // فَإِذا
      ["همْ بالساهرة : هم أحياءٌ على وجه الأرض"], // هُم
      ["همْ بالساهرة : هم أحياءٌ على وجه الأرض"] // بِالسّاهِرَةِ
    ],
    [ // آية 15
      [], // هَل
      [], // أَتىٰكَ
      [], // حَديثُ
      [] // موسىٰ
    ],
    [ // آية 16
      [], // إِذ
      [], // نادىٰهُ
      [], // رَبُّهُ
      [], // بِالوادِ
      [], // المُقَدَّسِ
      ["طوى : اسم الوادى المقـدّس"] // طُوًى
    ],
    [ // آية 17
      [], // اذهَب
      [], // إِلىٰ
      [], // فِرعَونَ
      [], // إِنَّهُ
      ["طغى : عـتا و تجبّر و كَـفـَر و الطغيان"] // طَغىٰ
    ],
    [ // آية 18
      [], // فَقُل
      [], // هَل
      [], // لَكَ
      [], // إِلىٰ
      [], // أَن
      [] // تَزَكّىٰ
    ],
    [ // آية 19
      [], // وَأَهدِيَكَ
      [], // إِلىٰ
      [], // رَبِّكَ
      [] // فَتَخشىٰ
    ],
    [ // آية 20
      [], // فَأَرىٰهُ
      [], // الـٔايَةَ
      [] // الكُبرىٰ
    ],
    [ // آية 21
      [], // فَكَذَّبَ
      [] // وَعَصىٰ
    ],
    [ // آية 22
      [], // ثُمَّ
      [], // أَدبَرَ
      ["يَسعى : يَــجـِدّ في الإفساد و المعارضة"] // يَسعىٰ
    ],
    [ // آية 23
      ["فحَشر : جَمَعَ السّـحَرَة . أو الجُـنـْـد"], // فَحَشَرَ
      [] // فَنادىٰ
    ],
    [ // آية 24
      [], // فَقالَ
      [], // أَنا۠
      [], // رَبُّكُمُ
      [] // الأَعلىٰ
    ],
    [ // آية 25
      [], // فَأَخَذَهُ
      [], // اللَّهُ
      [], // نَكالَ
      [], // الـٔاخِرَةِ
      [] // وَالأولىٰ
    ],
    [ // آية 26
      [], // إِنَّ
      [], // فى
      [], // ذٰلِكَ
      [], // لَعِبرَةً
      [], // لِمَن
      [] // يَخشىٰ
    ],
    [ // آية 27
      [], // ءَأَنتُم
      [], // أَشَدُّ
      [], // خَلقًا
      [], // أَمِ
      [], // السَّماءُ
      [] // بَنىٰها
    ],
    [ // آية 28
      ["رفع سمكها : جعل ثِـخَـنـَـها مُرْتـَـفِعًـا جهة العلوّ"], // رَفَعَ
      ["رفع سمكها : جعل ثِـخَـنـَـها مُرْتـَـفِعًـا جهة العلوّ"], // سَمكَها
      [] // فَسَوّىٰها
    ],
    [ // آية 29
      [], // وَأَغطَشَ
      [], // لَيلَها
      [], // وَأَخرَجَ
      [] // ضُحىٰها
    ],
    [ // آية 30
      [], // وَالأَرضَ
      [], // بَعدَ
      [], // ذٰلِكَ
      [] // دَحىٰها
    ],
    [ // آية 31
      [], // أَخرَجَ
      [], // مِنها
      [], // ماءَها
      [] // وَمَرعىٰها
    ],
    [ // آية 32
      [], // وَالجِبالَ
      [] // أَرسىٰها
    ],
    [ // آية 33
      [], // مَتـٰعًا
      [], // لَكُم
      [] // وَلِأَنعـٰمِكُم
    ],
    [ // آية 34
      [], // فَإِذا
      [], // جاءَتِ
      ["الطامة الكبرى : الدّاهـية العظمى (القيامة)"], // الطّامَّةُ
      ["الطامة الكبرى : الدّاهـية العظمى (القيامة)"] // الكُبرىٰ
    ],
    [ // آية 35
      [], // يَومَ
      [], // يَتَذَكَّرُ
      [], // الإِنسـٰنُ
      [], // ما
      [] // سَعىٰ
    ],
    [ // آية 36
      [], // وَبُرِّزَتِ
      [], // الجَحيمُ
      [], // لِمَن
      [] // يَرىٰ
    ],
    [ // آية 37
      [], // فَأَمّا
      [], // مَن
      [] // طَغىٰ
    ],
    [ // آية 38
      [], // وَءاثَرَ
      [], // الحَيوٰةَ
      [] // الدُّنيا
    ],
    [ // آية 39
      [], // فَإِنَّ
      [], // الجَحيمَ
      [], // هِىَ
      [] // المَأوىٰ
    ],
    [ // آية 40
      [], // وَأَمّا
      [], // مَن
      [], // خافَ
      [], // مَقامَ
      [], // رَبِّهِ
      [], // وَنَهَى
      [], // النَّفسَ
      [], // عَنِ
      [] // الهَوىٰ
    ],
    [ // آية 41
      [], // فَإِنَّ
      [], // الجَنَّةَ
      [], // هِىَ
      [] // المَأوىٰ
    ],
    [ // آية 42
      [], // يَسـَٔلونَكَ
      [], // عَنِ
      [], // السّاعَةِ
      [], // أَيّانَ
      [] // مُرسىٰها
    ],
    [ // آية 43
      [], // فيمَ
      [], // أَنتَ
      [], // مِن
      [] // ذِكرىٰها
    ],
    [ // آية 44
      [], // إِلىٰ
      [], // رَبِّكَ
      [] // مُنتَهىٰها
    ],
    [ // آية 45
      [], // إِنَّما
      [], // أَنتَ
      [], // مُنذِرُ
      [], // مَن
      [] // يَخشىٰها
    ],
    [ // آية 46
      [], // كَأَنَّهُم
      [], // يَومَ
      [], // يَرَونَها
      [], // لَم
      [], // يَلبَثوا
      [], // إِلّا
      [], // عَشِيَّةً
      [], // أَو
      [] // ضُحىٰها
    ]
];

export default meanings;