const meanings = [
  [ // سورة 8: الأنفال
[ // آية 1
      [], // يَسـَٔلونَكَ
      [], // عَنِ
      ["الأنفال : غنائم بدر"], // الأَنفالِ
      [], // قُلِ
      [], // الأَنفالُ
      [], // لِلَّهِ
      [], // وَالرَّسولِ
      [], // فَاتَّقُوا
      [], // اللَّهَ
      [], // وَأَصلِحوا
      ["ذات بينكم : أحوالكم التي يحصل بها اتّصالكم"], // ذاتَ
      ["ذات بينكم : أحوالكم التي يحصل بها اتّصالكم"], // بَينِكُم
      [], // وَأَطيعُوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // إِن
      [], // كُنتُم
      [] // مُؤمِنينَ
    ],
    [ // آية 2
      [], // إِنَّمَا
      [], // المُؤمِنونَ
      [], // الَّذينَ
      [], // إِذا
      [], // ذُكِرَ
      [], // اللَّهُ
      ["وجلت قلوبهم : فزعت و رقّت استعظاما و هيبة"], // وَجِلَت
      ["وجلت قلوبهم : فزعت و رقّت استعظاما و هيبة"], // قُلوبُهُم
      [], // وَإِذا
      [], // تُلِيَت
      [], // عَلَيهِم
      [], // ءايـٰتُهُ
      [], // زادَتهُم
      [], // إيمـٰنًا
      [], // وَعَلىٰ
      [], // رَبِّهِم
      ["يتوكّلون : يعتمدون و إلى الله يُفوّضون"] // يَتَوَكَّلونَ
    ],
    [ // آية 3
      [], // الَّذينَ
      [], // يُقيمونَ
      [], // الصَّلوٰةَ
      [], // وَمِمّا
      [], // رَزَقنـٰهُم
      [] // يُنفِقونَ
    ],
    [ // آية 4
      [], // أُولـٰئِكَ
      [], // هُمُ
      [], // المُؤمِنونَ
      [], // حَقًّا
      [], // لَهُم
      [], // دَرَجـٰتٌ
      [], // عِندَ
      [], // رَبِّهِم
      [], // وَمَغفِرَةٌ
      [], // وَرِزقٌ
      [] // كَريمٌ
    ],
    [ // آية 5
      [], // كَما
      [], // أَخرَجَكَ
      [], // رَبُّكَ
      [], // مِن
      [], // بَيتِكَ
      [], // بِالحَقِّ
      [], // وَإِنَّ
      [], // فَريقًا
      [], // مِنَ
      [], // المُؤمِنينَ
      [] // لَكـٰرِهونَ
    ],
    [ // آية 6
      [], // يُجـٰدِلونَكَ
      [], // فِى
      [], // الحَقِّ
      [], // بَعدَ
      [], // ما
      [], // تَبَيَّنَ
      [], // كَأَنَّما
      [], // يُساقونَ
      [], // إِلَى
      [], // المَوتِ
      [], // وَهُم
      [] // يَنظُرونَ
    ],
    [ // آية 7
      [], // وَإِذ
      [], // يَعِدُكُمُ
      [], // اللَّهُ
      [], // إِحدَى
      [], // الطّائِفَتَينِ
      [], // أَنَّها
      [], // لَكُم
      [], // وَتَوَدّونَ
      [], // أَنَّ
      [], // غَيرَ
      ["ذات الشّوكة : ذات السّلاح و القوّة . و هي النّفير"], // ذاتِ
      ["ذات الشّوكة : ذات السّلاح و القوّة . و هي النّفير"], // الشَّوكَةِ
      [], // تَكونُ
      [], // لَكُم
      [], // وَيُريدُ
      [], // اللَّهُ
      [], // أَن
      [], // يُحِقَّ
      [], // الحَقَّ
      [], // بِكَلِمـٰتِهِ
      [], // وَيَقطَعَ
      [], // دابِرَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 8
      [], // لِيُحِقَّ
      [], // الحَقَّ
      [], // وَيُبطِلَ
      [], // البـٰطِلَ
      [], // وَلَو
      [], // كَرِهَ
      [] // المُجرِمونَ
    ],
    [ // آية 9
      [], // إِذ
      [], // تَستَغيثونَ
      [], // رَبَّكُم
      [], // فَاستَجابَ
      [], // لَكُم
      [], // أَنّى
      [], // مُمِدُّكُم
      [], // بِأَلفٍ
      [], // مِنَ
      [], // المَلـٰئِكَةِ
      ["مُردفين : مُتبِعا بعضهم بعضا آخر منهم"] // مُردِفينَ
    ],
    [ // آية 10
      [], // وَما
      [], // جَعَلَهُ
      [], // اللَّهُ
      [], // إِلّا
      [], // بُشرىٰ
      [], // وَلِتَطمَئِنَّ
      [], // بِهِ
      [], // قُلوبُكُم
      [], // وَمَا
      [], // النَّصرُ
      [], // إِلّا
      [], // مِن
      [], // عِندِ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 11
      [], // إِذ
      ["يغشّيكم النّعاس : يجعله غاشيا عليكم كالغطاء"], // يُغَشّيكُمُ
      ["يغشّيكم النّعاس : يجعله غاشيا عليكم كالغطاء"], // النُّعاسَ
      ["أمنة منه : أمنا من الله و تقوية لكم"], // أَمَنَةً
      ["أمنة منه : أمنا من الله و تقوية لكم"], // مِنهُ
      [], // وَيُنَزِّلُ
      [], // عَلَيكُم
      [], // مِنَ
      [], // السَّماءِ
      [], // ماءً
      [], // لِيُطَهِّرَكُم
      [], // بِهِ
      [], // وَيُذهِبَ
      [], // عَنكُم
      [], // رِجزَ
      [], // الشَّيطـٰنِ
      [], // وَلِيَربِطَ
      [], // عَلىٰ
      [], // قُلوبِكُم
      [], // وَيُثَبِّتَ
      [], // بِهِ
      [] // الأَقدامَ
    ],
    [ // آية 12
      [], // إِذ
      [], // يوحى
      [], // رَبُّكَ
      [], // إِلَى
      [], // المَلـٰئِكَةِ
      [], // أَنّى
      [], // مَعَكُم
      [], // فَثَبِّتُوا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // سَأُلقى
      [], // فى
      [], // قُلوبِ
      [], // الَّذينَ
      [], // كَفَرُوا
      ["الرّعب : الخوف و الفزع و الإنزعاج"], // الرُّعبَ
      [], // فَاضرِبوا
      [], // فَوقَ
      [], // الأَعناقِ
      [], // وَاضرِبوا
      [], // مِنهُم
      ["كلّ بنان : كلّ الأطراف أو كلّ مفصل"], // كُلَّ
      ["كلّ بنان : كلّ الأطراف أو كلّ مفصل"] // بَنانٍ
    ],
    [ // آية 13
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      ["شاقّوا : خالفوا و عصوْا"], // شاقُّوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَمَن
      [], // يُشاقِقِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 14
      [], // ذٰلِكُم
      [], // فَذوقوهُ
      [], // وَأَنَّ
      [], // لِلكـٰفِرينَ
      [], // عَذابَ
      [] // النّارِ
    ],
    [ // آية 15
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // لَقيتُمُ
      [], // الَّذينَ
      [], // كَفَروا
      ["زحفا : جيشا زاحفا نحوكم لقتالكم"], // زَحفًا
      [], // فَلا
      [], // تُوَلّوهُمُ
      [] // الأَدبارَ
    ],
    [ // آية 16
      [], // وَمَن
      [], // يُوَلِّهِم
      [], // يَومَئِذٍ
      [], // دُبُرَهُ
      [], // إِلّا
      ["مُتحرّفا : مظهرا الفرار خِدعة ثم يكرّ"], // مُتَحَرِّفًا
      [], // لِقِتالٍ
      [], // أَو
      ["مُتحيّزا إلى فئة : منضمّا إليها ليقاتل العدوّ معها"], // مُتَحَيِّزًا
      ["مُتحيّزا إلى فئة : منضمّا إليها ليقاتل العدوّ معها"], // إِلىٰ
      ["مُتحيّزا إلى فئة : منضمّا إليها ليقاتل العدوّ معها"], // فِئَةٍ
      [], // فَقَد
      ["باء بغضب : رجع متلبّسا به مستحقّا له"], // باءَ
      ["باء بغضب : رجع متلبّسا به مستحقّا له"], // بِغَضَبٍ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَمَأوىٰهُ
      [], // جَهَنَّمُ
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 17
      [], // فَلَم
      [], // تَقتُلوهُم
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // قَتَلَهُم
      [], // وَما
      [], // رَمَيتَ
      [], // إِذ
      [], // رَمَيتَ
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // رَمىٰ
      [], // وَلِيُبلِىَ
      [], // المُؤمِنينَ
      [], // مِنهُ
      [], // بَلاءً
      [], // حَسَنًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 18
      [], // ذٰلِكُم
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // موهِنُ
      [], // كَيدِ
      [] // الكـٰفِرينَ
    ],
    [ // آية 19
      [], // إِن
      ["تستفتحوا : تطلبوا النّصر لأهدى الفئتين"], // تَستَفتِحوا
      [], // فَقَد
      [], // جاءَكُمُ
      [], // الفَتحُ
      [], // وَإِن
      [], // تَنتَهوا
      [], // فَهُوَ
      [], // خَيرٌ
      [], // لَكُم
      [], // وَإِن
      [], // تَعودوا
      [], // نَعُد
      [], // وَلَن
      [], // تُغنِىَ
      [], // عَنكُم
      [], // فِئَتُكُم
      [], // شَيـًٔا
      [], // وَلَو
      [], // كَثُرَت
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // مَعَ
      [] // المُؤمِنينَ
    ],
    [ // آية 20
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // أَطيعُوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَلا
      [], // تَوَلَّوا
      [], // عَنهُ
      [], // وَأَنتُم
      [] // تَسمَعونَ
    ],
    [ // آية 21
      [], // وَلا
      [], // تَكونوا
      [], // كَالَّذينَ
      [], // قالوا
      [], // سَمِعنا
      [], // وَهُم
      [], // لا
      [] // يَسمَعونَ
    ],
    [ // آية 22
      [], // إِنَّ
      [], // شَرَّ
      [], // الدَّوابِّ
      [], // عِندَ
      [], // اللَّهِ
      [], // الصُّمُّ
      [], // البُكمُ
      [], // الَّذينَ
      [], // لا
      [] // يَعقِلونَ
    ],
    [ // آية 23
      [], // وَلَو
      [], // عَلِمَ
      [], // اللَّهُ
      [], // فيهِم
      [], // خَيرًا
      [], // لَأَسمَعَهُم
      [], // وَلَو
      [], // أَسمَعَهُم
      [], // لَتَوَلَّوا
      [], // وَهُم
      [] // مُعرِضونَ
    ],
    [ // آية 24
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // استَجيبوا
      [], // لِلَّهِ
      [], // وَلِلرَّسولِ
      [], // إِذا
      [], // دَعاكُم
      [], // لِما
      ["يُحييكم : يورثكم حياةً أبديّة في نعيم سرمديّ"], // يُحييكُم
      [], // وَاعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // يَحولُ
      [], // بَينَ
      [], // المَرءِ
      [], // وَقَلبِهِ
      [], // وَأَنَّهُ
      [], // إِلَيهِ
      [] // تُحشَرونَ
    ],
    [ // آية 25
      [], // وَاتَّقوا
      [], // فِتنَةً
      [], // لا
      [], // تُصيبَنَّ
      [], // الَّذينَ
      [], // ظَلَموا
      [], // مِنكُم
      [], // خاصَّةً
      [], // وَاعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 26
      [], // وَاذكُروا
      [], // إِذ
      [], // أَنتُم
      [], // قَليلٌ
      [], // مُستَضعَفونَ
      [], // فِى
      [], // الأَرضِ
      [], // تَخافونَ
      [], // أَن
      ["يتخطّفكم النّاس : يستلبوكم و يصطلموكم بسرعة"], // يَتَخَطَّفَكُمُ
      ["يتخطّفكم النّاس : يستلبوكم و يصطلموكم بسرعة"], // النّاسُ
      [], // فَـٔاوىٰكُم
      [], // وَأَيَّدَكُم
      [], // بِنَصرِهِ
      [], // وَرَزَقَكُم
      [], // مِنَ
      [], // الطَّيِّبـٰتِ
      [], // لَعَلَّكُم
      [] // تَشكُرونَ
    ],
    [ // آية 27
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَخونُوا
      [], // اللَّهَ
      [], // وَالرَّسولَ
      [], // وَتَخونوا
      [], // أَمـٰنـٰتِكُم
      [], // وَأَنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 28
      [], // وَاعلَموا
      [], // أَنَّما
      [], // أَموٰلُكُم
      [], // وَأَولـٰدُكُم
      ["فتنة : ابتلاء و محنة أو سبب في الإثم و العقاب"], // فِتنَةٌ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // عِندَهُ
      [], // أَجرٌ
      [] // عَظيمٌ
    ],
    [ // آية 29
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِن
      [], // تَتَّقُوا
      [], // اللَّهَ
      [], // يَجعَل
      [], // لَكُم
      ["فرقانا : هداية و نورا أو نجاة . أو مخرجًا"], // فُرقانًا
      [], // وَيُكَفِّر
      [], // عَنكُم
      [], // سَيِّـٔاتِكُم
      [], // وَيَغفِر
      [], // لَكُم
      [], // وَاللَّهُ
      [], // ذُو
      [], // الفَضلِ
      [] // العَظيمِ
    ],
    [ // آية 30
      [], // وَإِذ
      [], // يَمكُرُ
      [], // بِكَ
      [], // الَّذينَ
      [], // كَفَروا
      ["ليُثبتوك : ليحبسوك أو ليُقيّدوك بالوثاق"], // لِيُثبِتوكَ
      [], // أَو
      [], // يَقتُلوكَ
      [], // أَو
      [], // يُخرِجوكَ
      [], // وَيَمكُرونَ
      [], // وَيَمكُرُ
      [], // اللَّهُ
      [], // وَاللَّهُ
      [], // خَيرُ
      [] // المـٰكِرينَ
    ],
    [ // آية 31
      [], // وَإِذا
      [], // تُتلىٰ
      [], // عَلَيهِم
      [], // ءايـٰتُنا
      [], // قالوا
      [], // قَد
      [], // سَمِعنا
      [], // لَو
      [], // نَشاءُ
      [], // لَقُلنا
      [], // مِثلَ
      [], // هـٰذا
      [], // إِن
      [], // هـٰذا
      [], // إِلّا
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 32
      [], // وَإِذ
      [], // قالُوا
      [], // اللَّهُمَّ
      [], // إِن
      [], // كانَ
      [], // هـٰذا
      [], // هُوَ
      [], // الحَقَّ
      [], // مِن
      [], // عِندِكَ
      [], // فَأَمطِر
      [], // عَلَينا
      [], // حِجارَةً
      [], // مِنَ
      [], // السَّماءِ
      [], // أَوِ
      [], // ائتِنا
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 33
      [], // وَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيُعَذِّبَهُم
      [], // وَأَنتَ
      [], // فيهِم
      [], // وَما
      [], // كانَ
      [], // اللَّهُ
      [], // مُعَذِّبَهُم
      [], // وَهُم
      [] // يَستَغفِرونَ
    ],
    [ // آية 34
      [], // وَما
      [], // لَهُم
      [], // أَلّا
      [], // يُعَذِّبَهُمُ
      [], // اللَّهُ
      [], // وَهُم
      [], // يَصُدّونَ
      [], // عَنِ
      [], // المَسجِدِ
      [], // الحَرامِ
      [], // وَما
      [], // كانوا
      [], // أَولِياءَهُ
      [], // إِن
      [], // أَولِياؤُهُ
      [], // إِلَّا
      [], // المُتَّقونَ
      [], // وَلـٰكِنَّ
      [], // أَكثَرَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 35
      [], // وَما
      [], // كانَ
      [], // صَلاتُهُم
      [], // عِندَ
      [], // البَيتِ
      [], // إِلّا
      [], // مُكاءً
      [], // وَتَصدِيَةً
      [], // فَذوقُوا
      [], // العَذابَ
      [], // بِما
      [], // كُنتُم
      [] // تَكفُرونَ
    ],
    [ // آية 36
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // يُنفِقونَ
      [], // أَموٰلَهُم
      [], // لِيَصُدّوا
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَسَيُنفِقونَها
      [], // ثُمَّ
      [], // تَكونُ
      [], // عَلَيهِم
      ["حسرة : ندما و تأسّفا"], // حَسرَةً
      [], // ثُمَّ
      [], // يُغلَبونَ
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // إِلىٰ
      [], // جَهَنَّمَ
      [] // يُحشَرونَ
    ],
    [ // آية 37
      [], // لِيَميزَ
      [], // اللَّهُ
      [], // الخَبيثَ
      [], // مِنَ
      [], // الطَّيِّبِ
      [], // وَيَجعَلَ
      [], // الخَبيثَ
      [], // بَعضَهُ
      [], // عَلىٰ
      [], // بَعضٍ
      ["فيركمه جميعا : فيجمعه ملقى بعضه على بعض"], // فَيَركُمَهُ
      ["فيركمه جميعا : فيجمعه ملقى بعضه على بعض"], // جَميعًا
      [], // فَيَجعَلَهُ
      [], // فى
      [], // جَهَنَّمَ
      [], // أُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 38
      [], // قُل
      [], // لِلَّذينَ
      [], // كَفَروا
      [], // إِن
      [], // يَنتَهوا
      [], // يُغفَر
      [], // لَهُم
      [], // ما
      [], // قَد
      [], // سَلَفَ
      [], // وَإِن
      [], // يَعودوا
      [], // فَقَد
      [], // مَضَت
      [], // سُنَّتُ
      [] // الأَوَّلينَ
    ],
    [ // آية 39
      [], // وَقـٰتِلوهُم
      [], // حَتّىٰ
      [], // لا
      [], // تَكونَ
      [], // فِتنَةٌ
      [], // وَيَكونَ
      [], // الدّينُ
      [], // كُلُّهُ
      [], // لِلَّهِ
      [], // فَإِنِ
      [], // انتَهَوا
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // بِما
      [], // يَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 40
      [], // وَإِن
      [], // تَوَلَّوا
      [], // فَاعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // مَولىٰكُم
      [], // نِعمَ
      [], // المَولىٰ
      [], // وَنِعمَ
      [] // النَّصيرُ
    ],
    [ // آية 41
      [], // وَاعلَموا
      [], // أَنَّما
      [], // غَنِمتُم
      [], // مِن
      [], // شَىءٍ
      [], // فَأَنَّ
      ["لله خُمسه : و الأربعة الأخماس للغانمين"], // لِلَّهِ
      ["لله خُمسه : و الأربعة الأخماس للغانمين"], // خُمُسَهُ
      [], // وَلِلرَّسولِ
      [], // وَلِذِى
      [], // القُربىٰ
      [], // وَاليَتـٰمىٰ
      [], // وَالمَسـٰكينِ
      [], // وَابنِ
      [], // السَّبيلِ
      [], // إِن
      [], // كُنتُم
      [], // ءامَنتُم
      [], // بِاللَّهِ
      [], // وَما
      [], // أَنزَلنا
      [], // عَلىٰ
      [], // عَبدِنا
      ["يوم الفرقان : بين الحقّ و الباطل (يوم بدر)"], // يَومَ
      ["يوم الفرقان : بين الحقّ و الباطل (يوم بدر)"], // الفُرقانِ
      [], // يَومَ
      [], // التَقَى
      [], // الجَمعانِ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 42
      [], // إِذ
      [], // أَنتُم
      ["بالعدوة الدّنيا : بحافّة الوادي و ضفّته الأقرب للمدينة"], // بِالعُدوَةِ
      ["بالعدوة الدّنيا : بحافّة الوادي و ضفّته الأقرب للمدينة"], // الدُّنيا
      [], // وَهُم
      [], // بِالعُدوَةِ
      [], // القُصوىٰ
      [], // وَالرَّكبُ
      [], // أَسفَلَ
      [], // مِنكُم
      [], // وَلَو
      [], // تَواعَدتُم
      [], // لَاختَلَفتُم
      [], // فِى
      [], // الميعـٰدِ
      [], // وَلـٰكِن
      [], // لِيَقضِىَ
      [], // اللَّهُ
      [], // أَمرًا
      [], // كانَ
      [], // مَفعولًا
      [], // لِيَهلِكَ
      [], // مَن
      [], // هَلَكَ
      [], // عَن
      [], // بَيِّنَةٍ
      [], // وَيَحيىٰ
      [], // مَن
      [], // حَىَّ
      [], // عَن
      [], // بَيِّنَةٍ
      [], // وَإِنَّ
      [], // اللَّهَ
      [], // لَسَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 43
      [], // إِذ
      [], // يُريكَهُمُ
      [], // اللَّهُ
      [], // فى
      [], // مَنامِكَ
      [], // قَليلًا
      [], // وَلَو
      [], // أَرىٰكَهُم
      [], // كَثيرًا
      [], // لَفَشِلتُم
      [], // وَلَتَنـٰزَعتُم
      [], // فِى
      [], // الأَمرِ
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // سَلَّمَ
      [], // إِنَّهُ
      [], // عَليمٌ
      [], // بِذاتِ
      [] // الصُّدورِ
    ],
    [ // آية 44
      [], // وَإِذ
      [], // يُريكُموهُم
      [], // إِذِ
      [], // التَقَيتُم
      [], // فى
      [], // أَعيُنِكُم
      [], // قَليلًا
      [], // وَيُقَلِّلُكُم
      [], // فى
      [], // أَعيُنِهِم
      [], // لِيَقضِىَ
      [], // اللَّهُ
      [], // أَمرًا
      [], // كانَ
      [], // مَفعولًا
      [], // وَإِلَى
      [], // اللَّهِ
      [], // تُرجَعُ
      [] // الأُمورُ
    ],
    [ // آية 45
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِذا
      [], // لَقيتُم
      [], // فِئَةً
      [], // فَاثبُتوا
      [], // وَاذكُرُوا
      [], // اللَّهَ
      [], // كَثيرًا
      [], // لَعَلَّكُم
      [] // تُفلِحونَ
    ],
    [ // آية 46
      [], // وَأَطيعُوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // وَلا
      [], // تَنـٰزَعوا
      [], // فَتَفشَلوا
      [], // وَتَذهَبَ
      [], // ريحُكُم
      [], // وَاصبِروا
      [], // إِنَّ
      [], // اللَّهَ
      [], // مَعَ
      [] // الصّـٰبِرينَ
    ],
    [ // آية 47
      [], // وَلا
      [], // تَكونوا
      [], // كَالَّذينَ
      [], // خَرَجوا
      [], // مِن
      [], // دِيـٰرِهِم
      ["بطرًا : طغيانًا أو فخرا و أشرّا"], // بَطَرًا
      [], // وَرِئاءَ
      [], // النّاسِ
      [], // وَيَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // بِما
      [], // يَعمَلونَ
      [] // مُحيطٌ
    ],
    [ // آية 48
      [], // وَإِذ
      [], // زَيَّنَ
      [], // لَهُمُ
      [], // الشَّيطـٰنُ
      [], // أَعمـٰلَهُم
      [], // وَقالَ
      [], // لا
      [], // غالِبَ
      [], // لَكُمُ
      [], // اليَومَ
      [], // مِنَ
      [], // النّاسِ
      [], // وَإِنّى
      [], // جارٌ
      [], // لَكُم
      [], // فَلَمّا
      [], // تَراءَتِ
      [], // الفِئَتانِ
      ["نكص على عقبيه : رجع القهقري و ولّى مُدبرا"], // نَكَصَ
      ["نكص على عقبيه : رجع القهقري و ولّى مُدبرا"], // عَلىٰ
      ["نكص على عقبيه : رجع القهقري و ولّى مُدبرا"], // عَقِبَيهِ
      [], // وَقالَ
      [], // إِنّى
      [], // بَرىءٌ
      [], // مِنكُم
      [], // إِنّى
      [], // أَرىٰ
      [], // ما
      [], // لا
      [], // تَرَونَ
      [], // إِنّى
      [], // أَخافُ
      [], // اللَّهَ
      [], // وَاللَّهُ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 49
      [], // إِذ
      [], // يَقولُ
      [], // المُنـٰفِقونَ
      [], // وَالَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // غَرَّ
      [], // هـٰؤُلاءِ
      [], // دينُهُم
      [], // وَمَن
      [], // يَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 50
      [], // وَلَو
      [], // تَرىٰ
      [], // إِذ
      [], // يَتَوَفَّى
      [], // الَّذينَ
      [], // كَفَرُوا
      [], // المَلـٰئِكَةُ
      [], // يَضرِبونَ
      [], // وُجوهَهُم
      [], // وَأَدبـٰرَهُم
      [], // وَذوقوا
      [], // عَذابَ
      [] // الحَريقِ
    ],
    [ // آية 51
      [], // ذٰلِكَ
      [], // بِما
      [], // قَدَّمَت
      [], // أَيديكُم
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // لَيسَ
      [], // بِظَلّـٰمٍ
      [] // لِلعَبيدِ
    ],
    [ // آية 52
      ["كدأب : كعادة . ."], // كَدَأبِ
      [], // ءالِ
      [], // فِرعَونَ
      [], // وَالَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // كَفَروا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // فَأَخَذَهُمُ
      [], // اللَّهُ
      [], // بِذُنوبِهِم
      [], // إِنَّ
      [], // اللَّهَ
      [], // قَوِىٌّ
      [], // شَديدُ
      [] // العِقابِ
    ],
    [ // آية 53
      [], // ذٰلِكَ
      [], // بِأَنَّ
      [], // اللَّهَ
      [], // لَم
      [], // يَكُ
      [], // مُغَيِّرًا
      [], // نِعمَةً
      [], // أَنعَمَها
      [], // عَلىٰ
      [], // قَومٍ
      [], // حَتّىٰ
      [], // يُغَيِّروا
      [], // ما
      [], // بِأَنفُسِهِم
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 54
      [], // كَدَأبِ
      [], // ءالِ
      [], // فِرعَونَ
      [], // وَالَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // كَذَّبوا
      [], // بِـٔايـٰتِ
      [], // رَبِّهِم
      [], // فَأَهلَكنـٰهُم
      [], // بِذُنوبِهِم
      [], // وَأَغرَقنا
      [], // ءالَ
      [], // فِرعَونَ
      [], // وَكُلٌّ
      [], // كانوا
      [] // ظـٰلِمينَ
    ],
    [ // آية 55
      [], // إِنَّ
      [], // شَرَّ
      [], // الدَّوابِّ
      [], // عِندَ
      [], // اللَّهِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 56
      [], // الَّذينَ
      [], // عـٰهَدتَ
      [], // مِنهُم
      [], // ثُمَّ
      [], // يَنقُضونَ
      [], // عَهدَهُم
      [], // فى
      [], // كُلِّ
      [], // مَرَّةٍ
      [], // وَهُم
      [], // لا
      [] // يَتَّقونَ
    ],
    [ // آية 57
      [], // فَإِمّا
      ["تثقفنّهم : تصادفنّهم و تظفرنّ بهم"], // تَثقَفَنَّهُم
      [], // فِى
      [], // الحَربِ
      ["فشرِّد بهم : ففرّق و بدّد و خوّف بهم"], // فَشَرِّد
      ["فشرِّد بهم : ففرّق و بدّد و خوّف بهم"], // بِهِم
      [], // مَن
      [], // خَلفَهُم
      [], // لَعَلَّهُم
      [] // يَذَّكَّرونَ
    ],
    [ // آية 58
      [], // وَإِمّا
      [], // تَخافَنَّ
      ["من قوم : قد عاهدوك"], // مِن
      ["من قوم : قد عاهدوك"], // قَومٍ
      [], // خِيانَةً
      ["فانبذ إليهم : فاطرح إليهم عهدهم و حاربهم"], // فَانبِذ
      ["فانبذ إليهم : فاطرح إليهم عهدهم و حاربهم"], // إِلَيهِم
      ["على سواء : على استواء في العلم بنبذه"], // عَلىٰ
      ["على سواء : على استواء في العلم بنبذه"], // سَواءٍ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُحِبُّ
      [] // الخائِنينَ
    ],
    [ // آية 59
      [], // وَلا
      [], // يَحسَبَنَّ
      [], // الَّذينَ
      [], // كَفَروا
      ["سبقوا : خلصوا و أفلتوا من العذاب"], // سَبَقوا
      [], // إِنَّهُم
      [], // لا
      [] // يُعجِزونَ
    ],
    [ // آية 60
      [], // وَأَعِدّوا
      [], // لَهُم
      [], // مَا
      [], // استَطَعتُم
      [], // مِن
      ["قوّة : كل ما يُتقوّى به في الحرب"], // قُوَّةٍ
      [], // وَمِن
      ["رباط الخيل : حبسها للجهاد في سبيل الله"], // رِباطِ
      ["رباط الخيل : حبسها للجهاد في سبيل الله"], // الخَيلِ
      [], // تُرهِبونَ
      [], // بِهِ
      [], // عَدُوَّ
      [], // اللَّهِ
      [], // وَعَدُوَّكُم
      [], // وَءاخَرينَ
      [], // مِن
      [], // دونِهِم
      [], // لا
      [], // تَعلَمونَهُمُ
      [], // اللَّهُ
      [], // يَعلَمُهُم
      [], // وَما
      [], // تُنفِقوا
      [], // مِن
      [], // شَىءٍ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // يُوَفَّ
      [], // إِلَيكُم
      [], // وَأَنتُم
      [], // لا
      [] // تُظلَمونَ
    ],
    [ // آية 61
      [], // وَإِن
      [], // جَنَحوا
      [], // لِلسَّلمِ
      [], // فَاجنَح
      [], // لَها
      [], // وَتَوَكَّل
      [], // عَلَى
      [], // اللَّهِ
      [], // إِنَّهُ
      [], // هُوَ
      [], // السَّميعُ
      [] // العَليمُ
    ],
    [ // آية 62
      [], // وَإِن
      [], // يُريدوا
      [], // أَن
      [], // يَخدَعوكَ
      [], // فَإِنَّ
      ["حسبك الله : كافيك في دفع خديعتهم"], // حَسبَكَ
      ["حسبك الله : كافيك في دفع خديعتهم"], // اللَّهُ
      [], // هُوَ
      [], // الَّذى
      [], // أَيَّدَكَ
      [], // بِنَصرِهِ
      [] // وَبِالمُؤمِنينَ
    ],
    [ // آية 63
      [], // وَأَلَّفَ
      [], // بَينَ
      [], // قُلوبِهِم
      [], // لَو
      [], // أَنفَقتَ
      [], // ما
      [], // فِى
      [], // الأَرضِ
      [], // جَميعًا
      [], // ما
      [], // أَلَّفتَ
      [], // بَينَ
      [], // قُلوبِهِم
      [], // وَلـٰكِنَّ
      [], // اللَّهَ
      [], // أَلَّفَ
      [], // بَينَهُم
      [], // إِنَّهُ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 64
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // حَسبُكَ
      [], // اللَّهُ
      [], // وَمَنِ
      [], // اتَّبَعَكَ
      [], // مِنَ
      [] // المُؤمِنينَ
    ],
    [ // آية 65
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      ["حرِّض المؤمنين : بالغ في حثّهم"], // حَرِّضِ
      ["حرِّض المؤمنين : بالغ في حثّهم"], // المُؤمِنينَ
      [], // عَلَى
      [], // القِتالِ
      [], // إِن
      [], // يَكُن
      [], // مِنكُم
      [], // عِشرونَ
      [], // صـٰبِرونَ
      [], // يَغلِبوا
      [], // مِا۟ئَتَينِ
      [], // وَإِن
      [], // يَكُن
      [], // مِنكُم
      [], // مِا۟ئَةٌ
      [], // يَغلِبوا
      [], // أَلفًا
      [], // مِنَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِأَنَّهُم
      [], // قَومٌ
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 66
      [], // الـٔـٰنَ
      [], // خَفَّفَ
      [], // اللَّهُ
      [], // عَنكُم
      [], // وَعَلِمَ
      [], // أَنَّ
      [], // فيكُم
      [], // ضَعفًا
      [], // فَإِن
      [], // يَكُن
      [], // مِنكُم
      [], // مِا۟ئَةٌ
      [], // صابِرَةٌ
      [], // يَغلِبوا
      [], // مِا۟ئَتَينِ
      [], // وَإِن
      [], // يَكُن
      [], // مِنكُم
      [], // أَلفٌ
      [], // يَغلِبوا
      [], // أَلفَينِ
      [], // بِإِذنِ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // مَعَ
      [] // الصّـٰبِرينَ
    ],
    [ // آية 67
      [], // ما
      [], // كانَ
      [], // لِنَبِىٍّ
      [], // أَن
      [], // يَكونَ
      [], // لَهُ
      [], // أَسرىٰ
      [], // حَتّىٰ
      ["يُثخن : يُبالغ في القتل حتى يذل الكفر"], // يُثخِنَ
      [], // فِى
      [], // الأَرضِ
      [], // تُريدونَ
      [], // عَرَضَ
      [], // الدُّنيا
      [], // وَاللَّهُ
      [], // يُريدُ
      [], // الـٔاخِرَةَ
      [], // وَاللَّهُ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 68
      [], // لَولا
      [], // كِتـٰبٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // سَبَقَ
      [], // لَمَسَّكُم
      [], // فيما
      [], // أَخَذتُم
      [], // عَذابٌ
      [] // عَظيمٌ
    ],
    [ // آية 69
      [], // فَكُلوا
      [], // مِمّا
      [], // غَنِمتُم
      [], // حَلـٰلًا
      [], // طَيِّبًا
      [], // وَاتَّقُوا
      [], // اللَّهَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 70
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // قُل
      [], // لِمَن
      [], // فى
      [], // أَيديكُم
      [], // مِنَ
      [], // الأَسرىٰ
      [], // إِن
      [], // يَعلَمِ
      [], // اللَّهُ
      [], // فى
      [], // قُلوبِكُم
      [], // خَيرًا
      [], // يُؤتِكُم
      [], // خَيرًا
      [], // مِمّا
      [], // أُخِذَ
      [], // مِنكُم
      [], // وَيَغفِر
      [], // لَكُم
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 71
      [], // وَإِن
      [], // يُريدوا
      [], // خِيانَتَكَ
      [], // فَقَد
      [], // خانُوا
      [], // اللَّهَ
      [], // مِن
      [], // قَبلُ
      ["فأمكن منهم : فأقدرك عليهم يوم بدر"], // فَأَمكَنَ
      ["فأمكن منهم : فأقدرك عليهم يوم بدر"], // مِنهُم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 72
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَهاجَروا
      [], // وَجـٰهَدوا
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالَّذينَ
      [], // ءاوَوا
      [], // وَنَصَروا
      [], // أُولـٰئِكَ
      [], // بَعضُهُم
      [], // أَولِياءُ
      [], // بَعضٍ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَلَم
      [], // يُهاجِروا
      [], // ما
      [], // لَكُم
      [], // مِن
      [], // وَلـٰيَتِهِم
      [], // مِن
      [], // شَىءٍ
      [], // حَتّىٰ
      [], // يُهاجِروا
      [], // وَإِنِ
      [], // استَنصَروكُم
      [], // فِى
      [], // الدّينِ
      [], // فَعَلَيكُمُ
      [], // النَّصرُ
      [], // إِلّا
      [], // عَلىٰ
      [], // قَومٍ
      [], // بَينَكُم
      [], // وَبَينَهُم
      [], // ميثـٰقٌ
      [], // وَاللَّهُ
      [], // بِما
      [], // تَعمَلونَ
      [] // بَصيرٌ
    ],
    [ // آية 73
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // بَعضُهُم
      [], // أَولِياءُ
      [], // بَعضٍ
      [], // إِلّا
      [], // تَفعَلوهُ
      [], // تَكُن
      [], // فِتنَةٌ
      [], // فِى
      [], // الأَرضِ
      [], // وَفَسادٌ
      [] // كَبيرٌ
    ],
    [ // آية 74
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // وَهاجَروا
      [], // وَجـٰهَدوا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالَّذينَ
      [], // ءاوَوا
      [], // وَنَصَروا
      [], // أُولـٰئِكَ
      [], // هُمُ
      [], // المُؤمِنونَ
      [], // حَقًّا
      [], // لَهُم
      [], // مَغفِرَةٌ
      [], // وَرِزقٌ
      [] // كَريمٌ
    ],
    [ // آية 75
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مِن
      [], // بَعدُ
      [], // وَهاجَروا
      [], // وَجـٰهَدوا
      [], // مَعَكُم
      [], // فَأُولـٰئِكَ
      [], // مِنكُم
      [], // وَأُولُوا
      [], // الأَرحامِ
      [], // بَعضُهُم
      ["أوْلى : بالميراث من الأجانب"], // أَولىٰ
      [], // بِبَعضٍ
      [], // فى
      [], // كِتـٰبِ
      [], // اللَّهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ]
  ]
];

export default meanings;