const meanings = [
  [ // سورة 80: عبس
[ // آية 1
      [], // عَبَسَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 2
      [], // أَن
      [], // جاءَهُ
      [] // الأَعمىٰ
    ],
    [ // آية 3
      [], // وَما
      [], // يُدريكَ
      [], // لَعَلَّهُ
      [] // يَزَّكّىٰ
    ],
    [ // آية 4
      [], // أَو
      [], // يَذَّكَّرُ
      [], // فَتَنفَعَهُ
      [] // الذِّكرىٰ
    ],
    [ // آية 5
      [], // أَمّا
      [], // مَنِ
      [] // استَغنىٰ
    ],
    [ // آية 6
      [], // فَأَنتَ
      [], // لَهُ
      [] // تَصَدّىٰ
    ],
    [ // آية 7
      [], // وَما
      [], // عَلَيكَ
      [], // أَلّا
      [] // يَزَّكّىٰ
    ],
    [ // آية 8
      [], // وَأَمّا
      [], // مَن
      ["جَاءك يَسْعى : وَصَـل إليك مُـسْرعا ليَتـَـعلـّـم"], // جاءَكَ
      ["جَاءك يَسْعى : وَصَـل إليك مُـسْرعا ليَتـَـعلـّـم"] // يَسعىٰ
    ],
    [ // آية 9
      [], // وَهُوَ
      [] // يَخشىٰ
    ],
    [ // آية 10
      [], // فَأَنتَ
      [], // عَنهُ
      [] // تَلَهّىٰ
    ],
    [ // آية 11
      ["كلاّ : حقـّـا أو إرْشادٌ ، بليغٌ لترْك المُـعاوَدَة"], // كَلّا
      [], // إِنَّها
      [] // تَذكِرَةٌ
    ],
    [ // آية 12
      [], // فَمَن
      [], // شاءَ
      [] // ذَكَرَهُ
    ],
    [ // آية 13
      [], // فى
      [], // صُحُفٍ
      [] // مُكَرَّمَةٍ
    ],
    [ // آية 14
      ["مَرْفوعة : رَفيعة الـقـَـدْر و المَنزلة عنده تعالى"], // مَرفوعَةٍ
      [] // مُطَهَّرَةٍ
    ],
    [ // آية 15
      [], // بِأَيدى
      [] // سَفَرَةٍ
    ],
    [ // آية 16
      [], // كِرامٍ
      ["بَرَرة : مُطيعين له تعالى أو صادقين"] // بَرَرَةٍ
    ],
    [ // آية 17
      [], // قُتِلَ
      [], // الإِنسـٰنُ
      [], // ما
      [] // أَكفَرَهُ
    ],
    [ // آية 18
      [], // مِن
      [], // أَىِّ
      [], // شَىءٍ
      [] // خَلَقَهُ
    ],
    [ // آية 19
      [], // مِن
      [], // نُطفَةٍ
      [], // خَلَقَهُ
      [] // فَقَدَّرَهُ
    ],
    [ // آية 20
      [], // ثُمَّ
      ["السّبيل يسّره : سَهّـل له طريقي الهدى و الضّلال"], // السَّبيلَ
      ["السّبيل يسّره : سَهّـل له طريقي الهدى و الضّلال"] // يَسَّرَهُ
    ],
    [ // آية 21
      [], // ثُمَّ
      [], // أَماتَهُ
      [] // فَأَقبَرَهُ
    ],
    [ // آية 22
      [], // ثُمَّ
      [], // إِذا
      [], // شاءَ
      [] // أَنشَرَهُ
    ],
    [ // آية 23
      [], // كَلّا
      [], // لَمّا
      [], // يَقضِ
      [], // ما
      [] // أَمَرَهُ
    ],
    [ // آية 24
      [], // فَليَنظُرِ
      [], // الإِنسـٰنُ
      [], // إِلىٰ
      [] // طَعامِهِ
    ],
    [ // آية 25
      [], // أَنّا
      [], // صَبَبنَا
      [], // الماءَ
      [] // صَبًّا
    ],
    [ // آية 26
      [], // ثُمَّ
      [], // شَقَقنَا
      [], // الأَرضَ
      [] // شَقًّا
    ],
    [ // آية 27
      [], // فَأَنبَتنا
      [], // فيها
      [] // حَبًّا
    ],
    [ // آية 28
      [], // وَعِنَبًا
      [] // وَقَضبًا
    ],
    [ // آية 29
      [], // وَزَيتونًا
      [] // وَنَخلًا
    ],
    [ // آية 30
      [], // وَحَدائِقَ
      [] // غُلبًا
    ],
    [ // آية 31
      [], // وَفـٰكِهَةً
      [] // وَأَبًّا
    ],
    [ // آية 32
      [], // مَتـٰعًا
      [], // لَكُم
      [] // وَلِأَنعـٰمِكُم
    ],
    [ // آية 33
      [], // فَإِذا
      ["جاءت الصاخّة : الصّـيْحَـة تـُـصِمّ الآذان لشِدتِها (النفخة الثانية)"], // جاءَتِ
      ["جاءت الصاخّة : الصّـيْحَـة تـُـصِمّ الآذان لشِدتِها (النفخة الثانية)"] // الصّاخَّةُ
    ],
    [ // آية 34
      [], // يَومَ
      [], // يَفِرُّ
      [], // المَرءُ
      [], // مِن
      [] // أَخيهِ
    ],
    [ // آية 35
      [], // وَأُمِّهِ
      [] // وَأَبيهِ
    ],
    [ // آية 36
      [], // وَصـٰحِبَتِهِ
      [] // وَبَنيهِ
    ],
    [ // آية 37
      [], // لِكُلِّ
      [], // امرِئٍ
      [], // مِنهُم
      [], // يَومَئِذٍ
      [], // شَأنٌ
      [] // يُغنيهِ
    ],
    [ // آية 38
      [], // وُجوهٌ
      [], // يَومَئِذٍ
      [] // مُسفِرَةٌ
    ],
    [ // آية 39
      [], // ضاحِكَةٌ
      [] // مُستَبشِرَةٌ
    ],
    [ // آية 40
      [], // وَوُجوهٌ
      [], // يَومَئِذٍ
      [], // عَلَيها
      [] // غَبَرَةٌ
    ],
    [ // آية 41
      [], // تَرهَقُها
      [] // قَتَرَةٌ
    ],
    [ // آية 42
      [], // أُولـٰئِكَ
      [], // هُمُ
      [], // الكَفَرَةُ
      [] // الفَجَرَةُ
    ]
  ]
];

export default meanings;