const meanings = [
  [ // سورة 81: التكوير
[ // آية 1
      [], // إِذَا
      [], // الشَّمسُ
      [] // كُوِّرَت
    ],
    [ // آية 2
      [], // وَإِذَا
      ["النجوم انكدرت : تـَسَاقـَطتْ و تـَـهاوَت"], // النُّجومُ
      ["النجوم انكدرت : تـَسَاقـَطتْ و تـَـهاوَت"] // انكَدَرَت
    ],
    [ // آية 3
      [], // وَإِذَا
      [], // الجِبالُ
      [] // سُيِّرَت
    ],
    [ // آية 4
      [], // وَإِذَا
      ["العِشار عُطلت : النـّوق الحَوَامل  أهْـمِلـَتْ بلا رَاع"], // العِشارُ
      ["العِشار عُطلت : النـّوق الحَوَامل  أهْـمِلـَتْ بلا رَاع"] // عُطِّلَت
    ],
    [ // آية 5
      [], // وَإِذَا
      ["الوُحوش حُشِرت : جُمِعَـتْ مِنْ كلّ صَوْب"], // الوُحوشُ
      ["الوُحوش حُشِرت : جُمِعَـتْ مِنْ كلّ صَوْب"] // حُشِرَت
    ],
    [ // آية 6
      [], // وَإِذَا
      [], // البِحارُ
      [] // سُجِّرَت
    ],
    [ // آية 7
      [], // وَإِذَا
      [], // النُّفوسُ
      [] // زُوِّجَت
    ],
    [ // آية 8
      [], // وَإِذَا
      [], // المَوءۥدَةُ
      [] // سُئِلَت
    ],
    [ // آية 9
      [], // بِأَىِّ
      [], // ذَنبٍ
      [] // قُتِلَت
    ],
    [ // آية 10
      [], // وَإِذَا
      [], // الصُّحُفُ
      [] // نُشِرَت
    ],
    [ // آية 11
      [], // وَإِذَا
      ["السّماء كُشِطت : قـُـلِعَتْ كما يُـقـْـلع السّـقف"], // السَّماءُ
      ["السّماء كُشِطت : قـُـلِعَتْ كما يُـقـْـلع السّـقف"] // كُشِطَت
    ],
    [ // آية 12
      [], // وَإِذَا
      [], // الجَحيمُ
      [] // سُعِّرَت
    ],
    [ // آية 13
      [], // وَإِذَا
      [], // الجَنَّةُ
      [] // أُزلِفَت
    ],
    [ // آية 14
      [], // عَلِمَت
      [], // نَفسٌ
      [], // ما
      [] // أَحضَرَت
    ],
    [ // آية 15
      ["فلا أقسِم : \"(أقـْسِم)  و\"\"لا\"\" مزيدة ...\""], // فَلا
      ["فلا أقسِم : \"(أقـْسِم)  و\"\"لا\"\" مزيدة ...\""], // أُقسِمُ
      [] // بِالخُنَّسِ
    ],
    [ // آية 16
      [], // الجَوارِ
      [] // الكُنَّسِ
    ],
    [ // آية 17
      [], // وَالَّيلِ
      [], // إِذا
      [] // عَسعَسَ
    ],
    [ // آية 18
      [], // وَالصُّبحِ
      [], // إِذا
      [] // تَنَفَّسَ
    ],
    [ // آية 19
      [], // إِنَّهُ
      [], // لَقَولُ
      [], // رَسولٍ
      [] // كَريمٍ
    ],
    [ // آية 20
      [], // ذى
      [], // قُوَّةٍ
      [], // عِندَ
      [], // ذِى
      [], // العَرشِ
      ["مكين : ذي مكانة رفيعة و شرف"] // مَكينٍ
    ],
    [ // آية 21
      [], // مُطاعٍ
      [], // ثَمَّ
      [] // أَمينٍ
    ],
    [ // آية 22
      [], // وَما
      [], // صاحِبُكُم
      [] // بِمَجنونٍ
    ],
    [ // آية 23
      [], // وَلَقَد
      [], // رَءاهُ
      [], // بِالأُفُقِ
      [] // المُبينِ
    ],
    [ // آية 24
      [], // وَما
      [], // هُوَ
      [], // عَلَى
      ["الغَيْب : الوَحْي و خبَـر السّماء"], // الغَيبِ
      [] // بِضَنينٍ
    ],
    [ // آية 25
      [], // وَما
      [], // هُوَ
      [], // بِقَولِ
      [], // شَيطـٰنٍ
      [] // رَجيمٍ
    ],
    [ // آية 26
      [], // فَأَينَ
      [] // تَذهَبونَ
    ],
    [ // آية 27
      [], // إِن
      [], // هُوَ
      [], // إِلّا
      [], // ذِكرٌ
      [] // لِلعـٰلَمينَ
    ],
    [ // آية 28
      [], // لِمَن
      [], // شاءَ
      [], // مِنكُم
      [], // أَن
      [] // يَستَقيمَ
    ],
    [ // آية 29
      [], // وَما
      [], // تَشاءونَ
      [], // إِلّا
      [], // أَن
      [], // يَشاءَ
      [], // اللَّهُ
      [], // رَبُّ
      [] // العـٰلَمينَ
    ]
  ]
];

export default meanings;