const meanings = [
  [ // سورة 82: الإنفطار
[ // آية 1
      [], // إِذَا
      ["السماء انفطرت : انشقـّـتْ عند قِـيَـام الساعة"], // السَّماءُ
      ["السماء انفطرت : انشقـّـتْ عند قِـيَـام الساعة"] // انفَطَرَت
    ],
    [ // آية 2
      [], // وَإِذَا
      ["الكواكب انتثرت : تساقطتْ مُـتـفـرقة"], // الكَواكِبُ
      ["الكواكب انتثرت : تساقطتْ مُـتـفـرقة"] // انتَثَرَت
    ],
    [ // آية 3
      [], // وَإِذَا
      ["البحار فجّرت : شقـّـقتْ جَوانِبـُـها فصارتْ بَحْرًا واحِدًا"], // البِحارُ
      ["البحار فجّرت : شقـّـقتْ جَوانِبـُـها فصارتْ بَحْرًا واحِدًا"] // فُجِّرَت
    ],
    [ // آية 4
      [], // وَإِذَا
      ["القبور بُعثرت : قـُـلِبَ ترابُها ، و أخْــِرج موتاها"], // القُبورُ
      ["القبور بُعثرت : قـُـلِبَ ترابُها ، و أخْــِرج موتاها"] // بُعثِرَت
    ],
    [ // آية 5
      [], // عَلِمَت
      [], // نَفسٌ
      [], // ما
      [], // قَدَّمَت
      [] // وَأَخَّرَت
    ],
    [ // آية 6
      [], // يـٰأَيُّهَا
      [], // الإِنسـٰنُ
      [], // ما
      [], // غَرَّكَ
      [], // بِرَبِّكَ
      [] // الكَريمِ
    ],
    [ // آية 7
      [], // الَّذى
      [], // خَلَقَكَ
      [], // فَسَوّىٰكَ
      ["فعَدَلك : جَـعَلك معتدلا متناسب الخَـلـْق"] // فَعَدَلَكَ
    ],
    [ // آية 8
      [], // فى
      [], // أَىِّ
      [], // صورَةٍ
      [], // ما
      [], // شاءَ
      [] // رَكَّبَكَ
    ],
    [ // آية 9
      [], // كَلّا
      [], // بَل
      ["تكذبون بالدّين : بالبعث أو الجزاء أو بالإسلام"], // تُكَذِّبونَ
      ["تكذبون بالدّين : بالبعث أو الجزاء أو بالإسلام"] // بِالدّينِ
    ],
    [ // آية 10
      [], // وَإِنَّ
      [], // عَلَيكُم
      [] // لَحـٰفِظينَ
    ],
    [ // آية 11
      [], // كِرامًا
      [] // كـٰتِبينَ
    ],
    [ // آية 12
      [], // يَعلَمونَ
      [], // ما
      [] // تَفعَلونَ
    ],
    [ // آية 13
      [], // إِنَّ
      ["الأبرار : الذين بَرّوا و صدقوا في إيمانهم"], // الأَبرارَ
      [], // لَفى
      [] // نَعيمٍ
    ],
    [ // آية 14
      [], // وَإِنَّ
      [], // الفُجّارَ
      [], // لَفى
      [] // جَحيمٍ
    ],
    [ // آية 15
      [], // يَصلَونَها
      [], // يَومَ
      [] // الدّينِ
    ],
    [ // آية 16
      [], // وَما
      [], // هُم
      [], // عَنها
      [] // بِغائِبينَ
    ],
    [ // آية 17
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [], // يَومُ
      [] // الدّينِ
    ],
    [ // آية 18
      [], // ثُمَّ
      [], // ما
      [], // أَدرىٰكَ
      [], // ما
      [], // يَومُ
      [] // الدّينِ
    ],
    [ // آية 19
      [], // يَومَ
      [], // لا
      [], // تَملِكُ
      [], // نَفسٌ
      [], // لِنَفسٍ
      [], // شَيـًٔا
      [], // وَالأَمرُ
      [], // يَومَئِذٍ
      [] // لِلَّهِ
    ]
  ]
];

export default meanings;