const meanings = [
  [ // سورة 83: المطففين
[ // آية 1
      [], // وَيلٌ
      [] // لِلمُطَفِّفينَ
    ],
    [ // آية 2
      [], // الَّذينَ
      [], // إِذَا
      ["اكتالوا : اشْتروْا بالكيل ، و مثله الوزن"], // اكتالوا
      [], // عَلَى
      [], // النّاسِ
      [] // يَستَوفونَ
    ],
    [ // آية 3
      [], // وَإِذا
      ["كالوهمْ : أعطَوْا غـيرهم بالكيل"], // كالوهُم
      [], // أَو
      ["وَزنوهمْ : أعْطَوْا غـيرهم"], // وَزَنوهُم
      [] // يُخسِرونَ
    ],
    [ // آية 4
      [], // أَلا
      [], // يَظُنُّ
      [], // أُولـٰئِكَ
      [], // أَنَّهُم
      [] // مَبعوثونَ
    ],
    [ // آية 5
      [], // لِيَومٍ
      [] // عَظيمٍ
    ],
    [ // آية 6
      [], // يَومَ
      [], // يَقومُ
      [], // النّاسُ
      [], // لِرَبِّ
      [] // العـٰلَمينَ
    ],
    [ // آية 7
      [], // كَلّا
      [], // إِنَّ
      [], // كِتـٰبَ
      [], // الفُجّارِ
      [], // لَفى
      [] // سِجّينٍ
    ],
    [ // آية 8
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [] // سِجّينٌ
    ],
    [ // آية 9
      [], // كِتـٰبٌ
      [] // مَرقومٌ
    ],
    [ // آية 10
      [], // وَيلٌ
      [], // يَومَئِذٍ
      [] // لِلمُكَذِّبينَ
    ],
    [ // آية 11
      [], // الَّذينَ
      [], // يُكَذِّبونَ
      [], // بِيَومِ
      [] // الدّينِ
    ],
    [ // آية 12
      [], // وَما
      [], // يُكَذِّبُ
      [], // بِهِ
      [], // إِلّا
      [], // كُلُّ
      [], // مُعتَدٍ
      [] // أَثيمٍ
    ],
    [ // آية 13
      [], // إِذا
      [], // تُتلىٰ
      [], // عَلَيهِ
      [], // ءايـٰتُنا
      [], // قالَ
      [], // أَسـٰطيرُ
      [] // الأَوَّلينَ
    ],
    [ // آية 14
      ["كلاّ : رَدْعٌ و زجْرٌ عن قولهم الباطل"], // كَلّا
      [], // بَل
      [], // رانَ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // ما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 15
      [], // كَلّا
      [], // إِنَّهُم
      [], // عَن
      [], // رَبِّهِم
      [], // يَومَئِذٍ
      [] // لَمَحجوبونَ
    ],
    [ // آية 16
      [], // ثُمَّ
      [], // إِنَّهُم
      ["لصالوا الجحيم : لداخِلوها أو لمقاسو حَرّها"], // لَصالُوا
      ["لصالوا الجحيم : لداخِلوها أو لمقاسو حَرّها"] // الجَحيمِ
    ],
    [ // آية 17
      [], // ثُمَّ
      [], // يُقالُ
      [], // هـٰذَا
      [], // الَّذى
      [], // كُنتُم
      [], // بِهِ
      [] // تُكَذِّبونَ
    ],
    [ // آية 18
      [], // كَلّا
      [], // إِنَّ
      [], // كِتـٰبَ
      [], // الأَبرارِ
      [], // لَفى
      [] // عِلِّيّينَ
    ],
    [ // آية 19
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [] // عِلِّيّونَ
    ],
    [ // آية 20
      [], // كِتـٰبٌ
      [] // مَرقومٌ
    ],
    [ // آية 21
      [], // يَشهَدُهُ
      [] // المُقَرَّبونَ
    ],
    [ // آية 22
      [], // إِنَّ
      [], // الأَبرارَ
      [], // لَفى
      [] // نَعيمٍ
    ],
    [ // آية 23
      [], // عَلَى
      ["الأرائك : الأسِرّة في الحجال(جمع حجلة محركة – بيت يزيّن بالقباب و الأسرة و الستور)"], // الأَرائِكِ
      [] // يَنظُرونَ
    ],
    [ // آية 24
      [], // تَعرِفُ
      [], // فى
      [], // وُجوهِهِم
      ["نضْرة النّعيم : بهجته و رونقه و بَهاءَه"], // نَضرَةَ
      ["نضْرة النّعيم : بهجته و رونقه و بَهاءَه"] // النَّعيمِ
    ],
    [ // آية 25
      [], // يُسقَونَ
      [], // مِن
      ["رَحيق : أجْوَد الخَمْر و أصْـفاه"], // رَحيقٍ
      ["مَختوم : إناؤه حتى يَفـكّه الأبرار"] // مَختومٍ
    ],
    [ // آية 26
      [], // خِتـٰمُهُ
      [], // مِسكٌ
      [], // وَفى
      [], // ذٰلِكَ
      [], // فَليَتَنافَسِ
      [] // المُتَنـٰفِسونَ
    ],
    [ // آية 27
      [], // وَمِزاجُهُ
      [], // مِن
      [] // تَسنيمٍ
    ],
    [ // آية 28
      [], // عَينًا
      ["يَشرَب بها : يَشرَب منها"], // يَشرَبُ
      ["يَشرَب بها : يَشرَب منها"], // بِهَا
      [] // المُقَرَّبونَ
    ],
    [ // آية 29
      [], // إِنَّ
      [], // الَّذينَ
      [], // أَجرَموا
      [], // كانوا
      [], // مِنَ
      [], // الَّذينَ
      [], // ءامَنوا
      [] // يَضحَكونَ
    ],
    [ // آية 30
      [], // وَإِذا
      [], // مَرّوا
      [], // بِهِم
      [] // يَتَغامَزونَ
    ],
    [ // آية 31
      [], // وَإِذَا
      [], // انقَلَبوا
      [], // إِلىٰ
      [], // أَهلِهِمُ
      [], // انقَلَبوا
      [] // فَكِهينَ
    ],
    [ // آية 32
      [], // وَإِذا
      [], // رَأَوهُم
      [], // قالوا
      [], // إِنَّ
      [], // هـٰؤُلاءِ
      [] // لَضالّونَ
    ],
    [ // آية 33
      [], // وَما
      [], // أُرسِلوا
      [], // عَلَيهِم
      [] // حـٰفِظينَ
    ],
    [ // آية 34
      [], // فَاليَومَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // مِنَ
      [], // الكُفّارِ
      [] // يَضحَكونَ
    ],
    [ // آية 35
      [], // عَلَى
      [], // الأَرائِكِ
      [] // يَنظُرونَ
    ],
    [ // آية 36
      [], // هَل
      [], // ثُوِّبَ
      [], // الكُفّارُ
      [], // ما
      [], // كانوا
      [] // يَفعَلونَ
    ]
  ]
];

export default meanings;