const meanings = [
  [ // سورة 84: الإنشقاق
[ // آية 1
      [], // إِذَا
      [], // السَّماءُ
      [] // انشَقَّت
    ],
    [ // آية 2
      [], // وَأَذِنَت
      [], // لِرَبِّها
      [] // وَحُقَّت
    ],
    [ // آية 3
      [], // وَإِذَا
      ["الأرْض مُدّتْ : بُـسِطتْ و سُـوّيَتْ  كمَـدّ  الأديم"], // الأَرضُ
      ["الأرْض مُدّتْ : بُـسِطتْ و سُـوّيَتْ  كمَـدّ  الأديم"] // مُدَّت
    ],
    [ // آية 4
      [], // وَأَلقَت
      [], // ما
      [], // فيها
      [] // وَتَخَلَّت
    ],
    [ // آية 5
      [], // وَأَذِنَت
      [], // لِرَبِّها
      [] // وَحُقَّت
    ],
    [ // آية 6
      [], // يـٰأَيُّهَا
      [], // الإِنسـٰنُ
      [], // إِنَّكَ
      [], // كادِحٌ
      [], // إِلىٰ
      [], // رَبِّكَ
      [], // كَدحًا
      [] // فَمُلـٰقيهِ
    ],
    [ // آية 7
      [], // فَأَمّا
      [], // مَن
      [], // أوتِىَ
      [], // كِتـٰبَهُ
      [] // بِيَمينِهِ
    ],
    [ // آية 8
      [], // فَسَوفَ
      [], // يُحاسَبُ
      [], // حِسابًا
      [] // يَسيرًا
    ],
    [ // آية 9
      [], // وَيَنقَلِبُ
      [], // إِلىٰ
      [], // أَهلِهِ
      [] // مَسرورًا
    ],
    [ // آية 10
      [], // وَأَمّا
      [], // مَن
      [], // أوتِىَ
      [], // كِتـٰبَهُ
      [], // وَراءَ
      [] // ظَهرِهِ
    ],
    [ // آية 11
      [], // فَسَوفَ
      [], // يَدعوا
      [] // ثُبورًا
    ],
    [ // آية 12
      [], // وَيَصلىٰ
      [] // سَعيرًا
    ],
    [ // آية 13
      [], // إِنَّهُ
      [], // كانَ
      [], // فى
      [], // أَهلِهِ
      [] // مَسرورًا
    ],
    [ // آية 14
      [], // إِنَّهُ
      [], // ظَنَّ
      [], // أَن
      ["لنْ يَحور : لن يرْجع إلى ربّـه تكْذيبا بالبَعْث"], // لَن
      ["لنْ يَحور : لن يرْجع إلى ربّـه تكْذيبا بالبَعْث"] // يَحورَ
    ],
    [ // آية 15
      [], // بَلىٰ
      [], // إِنَّ
      [], // رَبَّهُ
      [], // كانَ
      [], // بِهِ
      [] // بَصيرًا
    ],
    [ // آية 16
      ["فلا أقسِم : \"أقسِم و \"\"لا\"\" مزيدة \""], // فَلا
      ["فلا أقسِم : \"أقسِم و \"\"لا\"\" مزيدة \""], // أُقسِمُ
      [] // بِالشَّفَقِ
    ],
    [ // آية 17
      [], // وَالَّيلِ
      [], // وَما
      [] // وَسَقَ
    ],
    [ // آية 18
      [], // وَالقَمَرِ
      [], // إِذَا
      [] // اتَّسَقَ
    ],
    [ // آية 19
      [], // لَتَركَبُنَّ
      [], // طَبَقًا
      [], // عَن
      [] // طَبَقٍ
    ],
    [ // آية 20
      [], // فَما
      [], // لَهُم
      [], // لا
      [] // يُؤمِنونَ
    ],
    [ // آية 21
      [], // وَإِذا
      [], // قُرِئَ
      [], // عَلَيهِمُ
      [], // القُرءانُ
      [], // لا
      [] // يَسجُدونَ
    ],
    [ // آية 22
      [], // بَلِ
      [], // الَّذينَ
      [], // كَفَروا
      [] // يُكَذِّبونَ
    ],
    [ // آية 23
      [], // وَاللَّهُ
      [], // أَعلَمُ
      [], // بِما
      [] // يوعونَ
    ],
    [ // آية 24
      [], // فَبَشِّرهُم
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 25
      [], // إِلَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // أَجرٌ
      [], // غَيرُ
      [] // مَمنونٍ
    ]
  ]
];

export default meanings;