const meanings = [
  [ // سورة 85: البروج
[ // آية 1
      [], // وَالسَّماءِ
      ["ذات البروج : ذات المنازلِ المعروفة للكواكب"], // ذاتِ
      ["ذات البروج : ذات المنازلِ المعروفة للكواكب"] // البُروجِ
    ],
    [ // آية 2
      [], // وَاليَومِ
      [] // المَوعودِ
    ],
    [ // آية 3
      [], // وَشاهِدٍ
      [] // وَمَشهودٍ
    ],
    [ // آية 4
      [], // قُتِلَ
      [], // أَصحـٰبُ
      ["الأخدود : \"الشِّقِّ العظيم ؛ كالخَنْدَق\""] // الأُخدودِ
    ],
    [ // آية 5
      [], // النّارِ
      [], // ذاتِ
      [] // الوَقودِ
    ],
    [ // آية 6
      [], // إِذ
      [], // هُم
      [], // عَلَيها
      [] // قُعودٌ
    ],
    [ // آية 7
      [], // وَهُم
      [], // عَلىٰ
      [], // ما
      [], // يَفعَلونَ
      [], // بِالمُؤمِنينَ
      [] // شُهودٌ
    ],
    [ // آية 8
      [], // وَما
      [], // نَقَموا
      [], // مِنهُم
      [], // إِلّا
      [], // أَن
      [], // يُؤمِنوا
      [], // بِاللَّهِ
      [], // العَزيزِ
      [] // الحَميدِ
    ],
    [ // آية 9
      [], // الَّذى
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // شَهيدٌ
    ],
    [ // آية 10
      [], // إِنَّ
      [], // الَّذينَ
      [], // فَتَنُوا
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // ثُمَّ
      [], // لَم
      [], // يَتوبوا
      [], // فَلَهُم
      [], // عَذابُ
      [], // جَهَنَّمَ
      [], // وَلَهُم
      [], // عَذابُ
      [] // الحَريقِ
    ],
    [ // آية 11
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // لَهُم
      [], // جَنّـٰتٌ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // ذٰلِكَ
      [], // الفَوزُ
      [] // الكَبيرُ
    ],
    [ // آية 12
      [], // إِنَّ
      [], // بَطشَ
      [], // رَبِّكَ
      [] // لَشَديدٌ
    ],
    [ // آية 13
      [], // إِنَّهُ
      ["هو يُبدئ : يَخلُقُ ابتِداءً بقدرته"], // هُوَ
      ["هو يُبدئ : يَخلُقُ ابتِداءً بقدرته"], // يُبدِئُ
      [] // وَيُعيدُ
    ],
    [ // آية 14
      [], // وَهُوَ
      [], // الغَفورُ
      ["الوَدود : المُتودِّدُ إلى أوليائِه بالكرامة"] // الوَدودُ
    ],
    [ // آية 15
      [], // ذُو
      [], // العَرشِ
      ["المجيد : العظيمُ الجليلُ المُتعالِى"] // المَجيدُ
    ],
    [ // آية 16
      [], // فَعّالٌ
      [], // لِما
      [] // يُريدُ
    ],
    [ // آية 17
      [], // هَل
      [], // أَتىٰكَ
      [], // حَديثُ
      [] // الجُنودِ
    ],
    [ // آية 18
      [], // فِرعَونَ
      [] // وَثَمودَ
    ],
    [ // آية 19
      [], // بَلِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // فى
      [] // تَكذيبٍ
    ],
    [ // آية 20
      [], // وَاللَّهُ
      [], // مِن
      [], // وَرائِهِم
      [] // مُحيطٌ
    ],
    [ // آية 21
      [], // بَل
      [], // هُوَ
      [], // قُرءانٌ
      [] // مَجيدٌ
    ],
    [ // آية 22
      [], // فى
      [], // لَوحٍ
      [] // مَحفوظٍ
    ]
  ]
];

export default meanings;