const meanings = [
[ // آية 1
      [], // وَالسَّماءِ
      [] // وَالطّارِقِ
    ],
    [ // آية 2
      [], // وَما
      [], // أَدرىٰكَ
      [], // مَا
      [] // الطّارِقُ
    ],
    [ // آية 3
      [], // النَّجمُ
      [] // الثّاقِبُ
    ],
    [ // آية 4
      [], // إِن
      [], // كُلُّ
      [], // نَفسٍ
      [], // لَمّا
      [], // عَلَيها
      [] // حافِظٌ
    ],
    [ // آية 5
      [], // فَليَنظُرِ
      [], // الإِنسـٰنُ
      [], // مِمَّ
      [] // خُلِقَ
    ],
    [ // آية 6
      [], // خُلِقَ
      [], // مِن
      ["ماءٍ : مُمتَزجٍ من مائَي الرجلِ والمرأة"], // ماءٍ
      [] // دافِقٍ
    ],
    [ // آية 7
      [], // يَخرُجُ
      [], // مِن
      [], // بَينِ
      [], // الصُّلبِ
      [] // وَالتَّرائِبِ
    ],
    [ // آية 8
      [], // إِنَّهُ
      [], // عَلىٰ
      ["رَجْعِه : إعادَةِ الإنسانِ بعدَ فنائه"], // رَجعِهِ
      [] // لَقادِرٌ
    ],
    [ // آية 9
      [], // يَومَ
      ["تبْلى السّرائر : تـُكشَفُ مَكنوناتُ القلوب"], // تُبلَى
      ["تبْلى السّرائر : تـُكشَفُ مَكنوناتُ القلوب"] // السَّرائِرُ
    ],
    [ // آية 10
      [], // فَما
      [], // لَهُ
      [], // مِن
      [], // قُوَّةٍ
      [], // وَلا
      [] // ناصِرٍ
    ],
    [ // آية 11
      [], // وَالسَّماءِ
      [], // ذاتِ
      [] // الرَّجعِ
    ],
    [ // آية 12
      [], // وَالأَرضِ
      ["ذات الصّدْع : النباتِ الذى تـَنشَقُّ عنه"], // ذاتِ
      ["ذات الصّدْع : النباتِ الذى تـَنشَقُّ عنه"] // الصَّدعِ
    ],
    [ // آية 13
      [], // إِنَّهُ
      [], // لَقَولٌ
      [] // فَصلٌ
    ],
    [ // آية 14
      [], // وَما
      [], // هُوَ
      [] // بِالهَزلِ
    ],
    [ // آية 15
      [], // إِنَّهُم
      [], // يَكيدونَ
      [] // كَيدًا
    ],
    [ // آية 16
      [], // وَأَكيدُ
      [] // كَيدًا
    ],
    [ // آية 17
      [], // فَمَهِّلِ
      [], // الكـٰفِرينَ
      ["أمْهلهُمْ روَيْدا : إمْهالاً قريبًا ، أو قليلاً حتى يَأتِيَهم العذاب"], // أَمهِلهُم
      ["أمْهلهُمْ روَيْدا : إمْهالاً قريبًا ، أو قليلاً حتى يَأتِيَهم العذاب"] // رُوَيدًا
    ]
];

export default meanings;