const meanings = [
[ // آية 1
      ["سبّح اسم ربّك : نَزِّهُه ومَجِّدهُ تعالى عمَّا لا يَليق به"], // سَبِّحِ
      ["سبّح اسم ربّك : نَزِّهُه ومَجِّدهُ تعالى عمَّا لا يَليق به"], // اسمَ
      ["سبّح اسم ربّك : نَزِّهُه ومَجِّدهُ تعالى عمَّا لا يَليق به"], // رَبِّكَ
      [] // الأَعلَى
    ],
    [ // آية 2
      [], // الَّذى
      ["خَلق : أَوْجَدَ كلَّ شىءٍ بقدرتِه"], // خَلَقَ
      ["فسَوّى : بَينَ خَلْقِه فى الإحْكام والإتقان"] // فَسَوّىٰ
    ],
    [ // آية 3
      [], // وَالَّذى
      [], // قَدَّرَ
      [] // فَهَدىٰ
    ],
    [ // آية 4
      [], // وَالَّذى
      ["أخْرَجَ المرعى : أنـْـبَتَ العُشبَ رَطْبًا غَضًّا"], // أَخرَجَ
      ["أخْرَجَ المرعى : أنـْـبَتَ العُشبَ رَطْبًا غَضًّا"] // المَرعىٰ
    ],
    [ // آية 5
      [], // فَجَعَلَهُ
      [], // غُثاءً
      ["أحْوَى : أسْودَ أو أسْمَرَ بعد الخُضرة"] // أَحوىٰ
    ],
    [ // آية 6
      [], // سَنُقرِئُكَ
      ["فلا تنسى : أبَدًا من قوةِ الحفظِ والإتقان"], // فَلا
      ["فلا تنسى : أبَدًا من قوةِ الحفظِ والإتقان"] // تَنسىٰ
    ],
    [ // آية 7
      [], // إِلّا
      [], // ما
      [], // شاءَ
      [], // اللَّهُ
      [], // إِنَّهُ
      [], // يَعلَمُ
      [], // الجَهرَ
      [], // وَما
      [] // يَخفىٰ
    ],
    [ // آية 8
      [], // وَنُيَسِّرُكَ
      [] // لِليُسرىٰ
    ],
    [ // آية 9
      [], // فَذَكِّر
      [], // إِن
      [], // نَفَعَتِ
      [] // الذِّكرىٰ
    ],
    [ // آية 10
      [], // سَيَذَّكَّرُ
      [], // مَن
      [] // يَخشىٰ
    ],
    [ // آية 11
      [], // وَيَتَجَنَّبُهَا
      [] // الأَشقَى
    ],
    [ // آية 12
      [], // الَّذى
      [], // يَصلَى
      [], // النّارَ
      [] // الكُبرىٰ
    ],
    [ // آية 13
      [], // ثُمَّ
      [], // لا
      [], // يَموتُ
      [], // فيها
      [], // وَلا
      [] // يَحيىٰ
    ],
    [ // آية 14
      [], // قَد
      [], // أَفلَحَ
      [], // مَن
      ["تزَكّى : تَطهِّرَ من الكفر والمعاصى"] // تَزَكّىٰ
    ],
    [ // آية 15
      [], // وَذَكَرَ
      [], // اسمَ
      [], // رَبِّهِ
      [] // فَصَلّىٰ
    ],
    [ // آية 16
      [], // بَل
      [], // تُؤثِرونَ
      [], // الحَيوٰةَ
      [] // الدُّنيا
    ],
    [ // آية 17
      [], // وَالـٔاخِرَةُ
      [], // خَيرٌ
      [] // وَأَبقىٰ
    ],
    [ // آية 18
      [], // إِنَّ
      [], // هـٰذا
      [], // لَفِى
      [], // الصُّحُفِ
      [] // الأولىٰ
    ],
    [ // آية 19
      [], // صُحُفِ
      [], // إِبرٰهيمَ
      [] // وَموسىٰ
    ]
];

export default meanings;