const meanings = [
  [ // سورة 88: الغاشية
[ // آية 1
      [], // هَل
      [], // أَتىٰكَ
      [], // حَديثُ
      [] // الغـٰشِيَةِ
    ],
    [ // آية 2
      [], // وُجوهٌ
      [], // يَومَئِذٍ
      [] // خـٰشِعَةٌ
    ],
    [ // آية 3
      ["عامِلة : تَجُرُّ السلاسلَ والأغلالَ فى النار"], // عامِلَةٌ
      ["ناصبة : تـَعِبَة ٌ ممَّا تـُلاقِيه فيها من العذاب"] // ناصِبَةٌ
    ],
    [ // آية 4
      ["تصلى نارًا حامية : تدخُلُ أو تـُقاسِي نارًا تـَناهَى حَرُّها"], // تَصلىٰ
      ["تصلى نارًا حامية : تدخُلُ أو تـُقاسِي نارًا تـَناهَى حَرُّها"], // نارًا
      ["تصلى نارًا حامية : تدخُلُ أو تـُقاسِي نارًا تـَناهَى حَرُّها"] // حامِيَةً
    ],
    [ // آية 5
      [], // تُسقىٰ
      [], // مِن
      [], // عَينٍ
      [] // ءانِيَةٍ
    ],
    [ // آية 6
      [], // لَيسَ
      [], // لَهُم
      [], // طَعامٌ
      [], // إِلّا
      [], // مِن
      ["ضريع : شيءٍ فى النار ، كالشَّوكِ مُرّّ مُنـْتـِنٍ"] // ضَريعٍ
    ],
    [ // آية 7
      [], // لا
      [], // يُسمِنُ
      [], // وَلا
      [], // يُغنى
      [], // مِن
      [] // جوعٍ
    ],
    [ // آية 8
      [], // وُجوهٌ
      [], // يَومَئِذٍ
      ["ناعمة : ذاتُ بهجةٍ وحُسنٍ ونَضارةٍ"] // ناعِمَةٌ
    ],
    [ // آية 9
      [], // لِسَعيِها
      [] // راضِيَةٌ
    ],
    [ // آية 10
      [], // فى
      [], // جَنَّةٍ
      [] // عالِيَةٍ
    ],
    [ // آية 11
      [], // لا
      [], // تَسمَعُ
      [], // فيها
      [] // لـٰغِيَةً
    ],
    [ // آية 12
      [], // فيها
      [], // عَينٌ
      [] // جارِيَةٌ
    ],
    [ // آية 13
      [], // فيها
      ["سُرُرٌ مرفوعة : مُرتـَفعةُ السَّمكِ أو رفيعة ُ القـَدْرِ"], // سُرُرٌ
      ["سُرُرٌ مرفوعة : مُرتـَفعةُ السَّمكِ أو رفيعة ُ القـَدْرِ"] // مَرفوعَةٌ
    ],
    [ // آية 14
      [], // وَأَكوابٌ
      [] // مَوضوعَةٌ
    ],
    [ // آية 15
      [], // وَنَمارِقُ
      [] // مَصفوفَةٌ
    ],
    [ // آية 16
      [], // وَزَرابِىُّ
      [] // مَبثوثَةٌ
    ],
    [ // آية 17
      [], // أَفَلا
      [], // يَنظُرونَ
      [], // إِلَى
      [], // الإِبِلِ
      [], // كَيفَ
      [] // خُلِقَت
    ],
    [ // آية 18
      [], // وَإِلَى
      [], // السَّماءِ
      [], // كَيفَ
      [] // رُفِعَت
    ],
    [ // آية 19
      [], // وَإِلَى
      [], // الجِبالِ
      [], // كَيفَ
      [] // نُصِبَت
    ],
    [ // آية 20
      [], // وَإِلَى
      [], // الأَرضِ
      [], // كَيفَ
      [] // سُطِحَت
    ],
    [ // آية 21
      [], // فَذَكِّر
      [], // إِنَّما
      [], // أَنتَ
      [] // مُذَكِّرٌ
    ],
    [ // آية 22
      [], // لَستَ
      [], // عَلَيهِم
      [] // بِمُصَيطِرٍ
    ],
    [ // آية 23
      [], // إِلّا
      [], // مَن
      [], // تَوَلّىٰ
      [] // وَكَفَرَ
    ],
    [ // آية 24
      [], // فَيُعَذِّبُهُ
      [], // اللَّهُ
      [], // العَذابَ
      [] // الأَكبَرَ
    ],
    [ // آية 25
      [], // إِنَّ
      [], // إِلَينا
      [] // إِيابَهُم
    ],
    [ // آية 26
      [], // ثُمَّ
      [], // إِنَّ
      [], // عَلَينا
      [] // حِسابَهُم
    ]
  ]
];

export default meanings;