const meanings = [
[ // آية 1
      [] // وَالفَجرِ
    ],
    [ // آية 2
      [], // وَلَيالٍ
      [] // عَشرٍ
    ],
    [ // آية 3
      [], // وَالشَّفعِ
      [] // وَالوَترِ
    ],
    [ // آية 4
      [], // وَالَّيلِ
      [], // إِذا
      [] // يَسرِ
    ],
    [ // آية 5
      [], // هَل
      [], // فى
      [], // ذٰلِكَ
      [], // قَسَمٌ
      [], // لِذى
      [] // حِجرٍ
    ],
    [ // آية 6
      [], // أَلَم
      [], // تَرَ
      [], // كَيفَ
      [], // فَعَلَ
      [], // رَبُّكَ
      [] // بِعادٍ
    ],
    [ // آية 7
      ["إرَم : هو اسمُ جَدِّهم وبه سُمِّـيَت القبيلة"], // إِرَمَ
      ["ذات العِماد : الشدةِ أو الأبْنِية الرَّفيعةِ المُحكَمَة بالعَمَد"], // ذاتِ
      ["ذات العِماد : الشدةِ أو الأبْنِية الرَّفيعةِ المُحكَمَة بالعَمَد"] // العِمادِ
    ],
    [ // آية 8
      [], // الَّتى
      [], // لَم
      [], // يُخلَق
      [], // مِثلُها
      [], // فِى
      [] // البِلـٰدِ
    ],
    [ // آية 9
      [], // وَثَمودَ
      [], // الَّذينَ
      [], // جابُوا
      [], // الصَّخرَ
      [] // بِالوادِ
    ],
    [ // آية 10
      [], // وَفِرعَونَ
      [], // ذِى
      [] // الأَوتادِ
    ],
    [ // آية 11
      [], // الَّذينَ
      [], // طَغَوا
      [], // فِى
      [] // البِلـٰدِ
    ],
    [ // آية 12
      [], // فَأَكثَروا
      [], // فيهَا
      [] // الفَسادَ
    ],
    [ // آية 13
      [], // فَصَبَّ
      [], // عَلَيهِم
      [], // رَبُّكَ
      ["سَوْط عذاب : عذابًا شديدًا مُؤلِمًا دائمًا"], // سَوطَ
      ["سَوْط عذاب : عذابًا شديدًا مُؤلِمًا دائمًا"] // عَذابٍ
    ],
    [ // آية 14
      [], // إِنَّ
      [], // رَبَّكَ
      [] // لَبِالمِرصادِ
    ],
    [ // آية 15
      [], // فَأَمَّا
      [], // الإِنسـٰنُ
      [], // إِذا
      [], // مَا
      [], // ابتَلىٰهُ
      [], // رَبُّهُ
      [], // فَأَكرَمَهُ
      [], // وَنَعَّمَهُ
      [], // فَيَقولُ
      [], // رَبّى
      [] // أَكرَمَنِ
    ],
    [ // آية 16
      [], // وَأَمّا
      [], // إِذا
      [], // مَا
      [], // ابتَلىٰهُ
      ["فقدر عليه رزقه : فَضَـيَّـقـَه عليه ولم يَبسُطْه له"], // فَقَدَرَ
      ["فقدر عليه رزقه : فَضَـيَّـقـَه عليه ولم يَبسُطْه له"], // عَلَيهِ
      ["فقدر عليه رزقه : فَضَـيَّـقـَه عليه ولم يَبسُطْه له"], // رِزقَهُ
      [], // فَيَقولُ
      [], // رَبّى
      [] // أَهـٰنَنِ
    ],
    [ // آية 17
      ["كلاّ : رَدْعٌ للإنسان عمَّا قاله فى الحالَيْن"], // كَلّا
      [], // بَل
      [], // لا
      [], // تُكرِمونَ
      [] // اليَتيمَ
    ],
    [ // آية 18
      [], // وَلا
      [], // تَحـٰضّونَ
      [], // عَلىٰ
      [], // طَعامِ
      [] // المِسكينِ
    ],
    [ // آية 19
      [], // وَتَأكُلونَ
      [], // التُّراثَ
      [], // أَكلًا
      [] // لَمًّا
    ],
    [ // آية 20
      [], // وَتُحِبّونَ
      [], // المالَ
      [], // حُبًّا
      [] // جَمًّا
    ],
    [ // آية 21
      [], // كَلّا
      [], // إِذا
      ["دُكّتِ الأرض : دقَّـتْ وكُـسِرَتْ بالزَّلازل"], // دُكَّتِ
      ["دُكّتِ الأرض : دقَّـتْ وكُـسِرَتْ بالزَّلازل"], // الأَرضُ
      [], // دَكًّا
      [] // دَكًّا
    ],
    [ // آية 22
      [], // وَجاءَ
      [], // رَبُّكَ
      [], // وَالمَلَكُ
      [], // صَفًّا
      [] // صَفًّا
    ],
    [ // آية 23
      [], // وَجِا۟ىءَ
      [], // يَومَئِذٍ
      [], // بِجَهَنَّمَ
      [], // يَومَئِذٍ
      [], // يَتَذَكَّرُ
      [], // الإِنسـٰنُ
      [], // وَأَنّىٰ
      [], // لَهُ
      [] // الذِّكرىٰ
    ],
    [ // آية 24
      [], // يَقولُ
      [], // يـٰلَيتَنى
      [], // قَدَّمتُ
      [] // لِحَياتى
    ],
    [ // آية 25
      [], // فَيَومَئِذٍ
      [], // لا
      [], // يُعَذِّبُ
      [], // عَذابَهُ
      [] // أَحَدٌ
    ],
    [ // آية 26
      [], // وَلا
      [], // يوثِقُ
      [], // وَثاقَهُ
      [] // أَحَدٌ
    ],
    [ // آية 27
      [], // يـٰأَيَّتُهَا
      [], // النَّفسُ
      [] // المُطمَئِنَّةُ
    ],
    [ // آية 28
      [], // ارجِعى
      [], // إِلىٰ
      [], // رَبِّكِ
      [], // راضِيَةً
      [] // مَرضِيَّةً
    ],
    [ // آية 29
      [], // فَادخُلى
      [], // فى
      [] // عِبـٰدى
    ],
    [ // آية 30
      [], // وَادخُلى
      [] // جَنَّتى
    ]
];

export default meanings;