const meanings = [
  [ // سورة 9: التوبة
[ // آية 1
      [], // بَراءَةٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرَسولِهِ
      [], // إِلَى
      [], // الَّذينَ
      [], // عـٰهَدتُم
      [], // مِنَ
      [] // المُشرِكينَ
    ],
    [ // آية 2
      [], // فَسيحوا
      [], // فِى
      [], // الأَرضِ
      ["أربعة أشهر : أوّلها عاشر ذي الحجّة"], // أَربَعَةَ
      ["أربعة أشهر : أوّلها عاشر ذي الحجّة"], // أَشهُرٍ
      [], // وَاعلَموا
      [], // أَنَّكُم
      [], // غَيرُ
      [], // مُعجِزِى
      [], // اللَّهِ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // مُخزِى
      [] // الكـٰفِرينَ
    ],
    [ // آية 3
      [], // وَأَذٰنٌ
      [], // مِنَ
      [], // اللَّهِ
      ["ورسوله : أي بريء أيضا من المشركين"], // وَرَسولِهِ
      [], // إِلَى
      [], // النّاسِ
      ["يوم الحجّ الأكبر : يوم النّحر سنة تسعٍ"], // يَومَ
      ["يوم الحجّ الأكبر : يوم النّحر سنة تسعٍ"], // الحَجِّ
      ["يوم الحجّ الأكبر : يوم النّحر سنة تسعٍ"], // الأَكبَرِ
      [], // أَنَّ
      [], // اللَّهَ
      [], // بَرىءٌ
      [], // مِنَ
      [], // المُشرِكينَ
      [], // وَرَسولُهُ
      [], // فَإِن
      [], // تُبتُم
      [], // فَهُوَ
      [], // خَيرٌ
      [], // لَكُم
      [], // وَإِن
      [], // تَوَلَّيتُم
      [], // فَاعلَموا
      [], // أَنَّكُم
      [], // غَيرُ
      [], // مُعجِزِى
      [], // اللَّهِ
      [], // وَبَشِّرِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 4
      [], // إِلَّا
      [], // الَّذينَ
      [], // عـٰهَدتُم
      [], // مِنَ
      [], // المُشرِكينَ
      [], // ثُمَّ
      ["لم ينقصوكم : لم ينقضوا عهدكم بل وفّوا به"], // لَم
      ["لم ينقصوكم : لم ينقضوا عهدكم بل وفّوا به"], // يَنقُصوكُم
      [], // شَيـًٔا
      [], // وَلَم
      [], // يُظـٰهِروا
      [], // عَلَيكُم
      [], // أَحَدًا
      [], // فَأَتِمّوا
      [], // إِلَيهِم
      [], // عَهدَهُم
      [], // إِلىٰ
      [], // مُدَّتِهِم
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُحِبُّ
      [] // المُتَّقينَ
    ],
    [ // آية 5
      [], // فَإِذَا
      ["انسلخ الأشهر : انقضت أشهر العهد الأربعة"], // انسَلَخَ
      ["انسلخ الأشهر : انقضت أشهر العهد الأربعة"], // الأَشهُرُ
      [], // الحُرُمُ
      [], // فَاقتُلُوا
      [], // المُشرِكينَ
      [], // حَيثُ
      [], // وَجَدتُموهُم
      [], // وَخُذوهُم
      [], // وَاحصُروهُم
      [], // وَاقعُدوا
      [], // لَهُم
      ["كل مرصد : كلّ طريق و ممرّ و مرقب"], // كُلَّ
      ["كل مرصد : كلّ طريق و ممرّ و مرقب"], // مَرصَدٍ
      [], // فَإِن
      [], // تابوا
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // وَءاتَوُا
      [], // الزَّكوٰةَ
      [], // فَخَلّوا
      [], // سَبيلَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 6
      [], // وَإِن
      [], // أَحَدٌ
      [], // مِنَ
      [], // المُشرِكينَ
      ["استجارك : بعد انسلاخ أشهر العهد"], // استَجارَكَ
      [], // فَأَجِرهُ
      [], // حَتّىٰ
      [], // يَسمَعَ
      [], // كَلـٰمَ
      [], // اللَّهِ
      [], // ثُمَّ
      [], // أَبلِغهُ
      [], // مَأمَنَهُ
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // قَومٌ
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 7
      [], // كَيفَ
      [], // يَكونُ
      [], // لِلمُشرِكينَ
      [], // عَهدٌ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَعِندَ
      [], // رَسولِهِ
      [], // إِلَّا
      [], // الَّذينَ
      [], // عـٰهَدتُم
      [], // عِندَ
      [], // المَسجِدِ
      [], // الحَرامِ
      [], // فَمَا
      [], // استَقـٰموا
      [], // لَكُم
      [], // فَاستَقيموا
      [], // لَهُم
      [], // إِنَّ
      [], // اللَّهَ
      [], // يُحِبُّ
      [] // المُتَّقينَ
    ],
    [ // آية 8
      [], // كَيفَ
      [], // وَإِن
      ["يظهروا عليكم : يظفروا بكم"], // يَظهَروا
      ["يظهروا عليكم : يظفروا بكم"], // عَلَيكُم
      [], // لا
      [], // يَرقُبوا
      [], // فيكُم
      ["إلاًّ : رحِما و قرابة . أو حلفا و عهدا"], // إِلًّا
      [], // وَلا
      ["ذمّةً : عهدا . أو أمانا و ضمانا"], // ذِمَّةً
      [], // يُرضونَكُم
      [], // بِأَفوٰهِهِم
      [], // وَتَأبىٰ
      [], // قُلوبُهُم
      [], // وَأَكثَرُهُم
      [] // فـٰسِقونَ
    ],
    [ // آية 9
      [], // اشتَرَوا
      [], // بِـٔايـٰتِ
      [], // اللَّهِ
      [], // ثَمَنًا
      [], // قَليلًا
      [], // فَصَدّوا
      [], // عَن
      [], // سَبيلِهِ
      [], // إِنَّهُم
      [], // ساءَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 10
      [], // لا
      [], // يَرقُبونَ
      [], // فى
      [], // مُؤمِنٍ
      [], // إِلًّا
      [], // وَلا
      [], // ذِمَّةً
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // المُعتَدونَ
    ],
    [ // آية 11
      [], // فَإِن
      [], // تابوا
      [], // وَأَقامُوا
      [], // الصَّلوٰةَ
      [], // وَءاتَوُا
      [], // الزَّكوٰةَ
      [], // فَإِخوٰنُكُم
      [], // فِى
      [], // الدّينِ
      [], // وَنُفَصِّلُ
      [], // الـٔايـٰتِ
      [], // لِقَومٍ
      [] // يَعلَمونَ
    ],
    [ // آية 12
      [], // وَإِن
      [], // نَكَثوا
      [], // أَيمـٰنَهُم
      [], // مِن
      [], // بَعدِ
      [], // عَهدِهِم
      [], // وَطَعَنوا
      [], // فى
      [], // دينِكُم
      [], // فَقـٰتِلوا
      [], // أَئِمَّةَ
      [], // الكُفرِ
      [], // إِنَّهُم
      [], // لا
      [], // أَيمـٰنَ
      [], // لَهُم
      [], // لَعَلَّهُم
      [] // يَنتَهونَ
    ],
    [ // آية 13
      [], // أَلا
      [], // تُقـٰتِلونَ
      [], // قَومًا
      [], // نَكَثوا
      [], // أَيمـٰنَهُم
      [], // وَهَمّوا
      [], // بِإِخراجِ
      [], // الرَّسولِ
      [], // وَهُم
      [], // بَدَءوكُم
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // أَتَخشَونَهُم
      [], // فَاللَّهُ
      [], // أَحَقُّ
      [], // أَن
      [], // تَخشَوهُ
      [], // إِن
      [], // كُنتُم
      [] // مُؤمِنينَ
    ],
    [ // آية 14
      [], // قـٰتِلوهُم
      [], // يُعَذِّبهُمُ
      [], // اللَّهُ
      [], // بِأَيديكُم
      [], // وَيُخزِهِم
      [], // وَيَنصُركُم
      [], // عَلَيهِم
      [], // وَيَشفِ
      [], // صُدورَ
      [], // قَومٍ
      [] // مُؤمِنينَ
    ],
    [ // آية 15
      [], // وَيُذهِب
      ["غيظ قلوبهم : غضبها ووجدها الشّديد"], // غَيظَ
      ["غيظ قلوبهم : غضبها ووجدها الشّديد"], // قُلوبِهِم
      [], // وَيَتوبُ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 16
      [], // أَم
      [], // حَسِبتُم
      [], // أَن
      [], // تُترَكوا
      [], // وَلَمّا
      [], // يَعلَمِ
      [], // اللَّهُ
      [], // الَّذينَ
      [], // جـٰهَدوا
      [], // مِنكُم
      [], // وَلَم
      [], // يَتَّخِذوا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَلا
      [], // رَسولِهِ
      [], // وَلَا
      [], // المُؤمِنينَ
      ["وليجةً : بطانة و أصحاب سرّ و أولياء"], // وَليجَةً
      [], // وَاللَّهُ
      [], // خَبيرٌ
      [], // بِما
      [] // تَعمَلونَ
    ],
    [ // آية 17
      [], // ما
      [], // كانَ
      [], // لِلمُشرِكينَ
      [], // أَن
      [], // يَعمُروا
      [], // مَسـٰجِدَ
      [], // اللَّهِ
      [], // شـٰهِدينَ
      [], // عَلىٰ
      [], // أَنفُسِهِم
      [], // بِالكُفرِ
      [], // أُولـٰئِكَ
      [], // حَبِطَت
      [], // أَعمـٰلُهُم
      [], // وَفِى
      [], // النّارِ
      [], // هُم
      [] // خـٰلِدونَ
    ],
    [ // آية 18
      [], // إِنَّما
      [], // يَعمُرُ
      [], // مَسـٰجِدَ
      [], // اللَّهِ
      [], // مَن
      [], // ءامَنَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَأَقامَ
      [], // الصَّلوٰةَ
      [], // وَءاتَى
      [], // الزَّكوٰةَ
      [], // وَلَم
      [], // يَخشَ
      [], // إِلَّا
      [], // اللَّهَ
      [], // فَعَسىٰ
      [], // أُولـٰئِكَ
      [], // أَن
      [], // يَكونوا
      [], // مِنَ
      [] // المُهتَدينَ
    ],
    [ // آية 19
      [], // أَجَعَلتُم
      [], // سِقايَةَ
      [], // الحاجِّ
      [], // وَعِمارَةَ
      [], // المَسجِدِ
      [], // الحَرامِ
      [], // كَمَن
      [], // ءامَنَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَجـٰهَدَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // لا
      [], // يَستَوۥنَ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 20
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَهاجَروا
      [], // وَجـٰهَدوا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // أَعظَمُ
      [], // دَرَجَةً
      [], // عِندَ
      [], // اللَّهِ
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // الفائِزونَ
    ],
    [ // آية 21
      [], // يُبَشِّرُهُم
      [], // رَبُّهُم
      [], // بِرَحمَةٍ
      [], // مِنهُ
      [], // وَرِضوٰنٍ
      [], // وَجَنّـٰتٍ
      [], // لَهُم
      [], // فيها
      [], // نَعيمٌ
      [] // مُقيمٌ
    ],
    [ // آية 22
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // إِنَّ
      [], // اللَّهَ
      [], // عِندَهُ
      [], // أَجرٌ
      [] // عَظيمٌ
    ],
    [ // آية 23
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // لا
      [], // تَتَّخِذوا
      [], // ءاباءَكُم
      [], // وَإِخوٰنَكُم
      [], // أَولِياءَ
      [], // إِنِ
      ["استحبّوا الكفر : اختاروه و أقاموا عليه"], // استَحَبُّوا
      ["استحبّوا الكفر : اختاروه و أقاموا عليه"], // الكُفرَ
      [], // عَلَى
      [], // الإيمـٰنِ
      [], // وَمَن
      [], // يَتَوَلَّهُم
      [], // مِنكُم
      [], // فَأُولـٰئِكَ
      [], // هُمُ
      [] // الظّـٰلِمونَ
    ],
    [ // آية 24
      [], // قُل
      [], // إِن
      [], // كانَ
      [], // ءاباؤُكُم
      [], // وَأَبناؤُكُم
      [], // وَإِخوٰنُكُم
      [], // وَأَزوٰجُكُم
      [], // وَعَشيرَتُكُم
      [], // وَأَموٰلٌ
      ["اقترفتموها : اكتسبتموها"], // اقتَرَفتُموها
      [], // وَتِجـٰرَةٌ
      [], // تَخشَونَ
      ["كسادها : بوارها بفوات أيّام المواسم"], // كَسادَها
      [], // وَمَسـٰكِنُ
      [], // تَرضَونَها
      [], // أَحَبَّ
      [], // إِلَيكُم
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرَسولِهِ
      [], // وَجِهادٍ
      [], // فى
      [], // سَبيلِهِ
      ["فتربّصوا : فانتظروا"], // فَتَرَبَّصوا
      [], // حَتّىٰ
      [], // يَأتِىَ
      [], // اللَّهُ
      [], // بِأَمرِهِ
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 25
      [], // لَقَد
      [], // نَصَرَكُمُ
      [], // اللَّهُ
      [], // فى
      [], // مَواطِنَ
      [], // كَثيرَةٍ
      [], // وَيَومَ
      [], // حُنَينٍ
      [], // إِذ
      [], // أَعجَبَتكُم
      [], // كَثرَتُكُم
      [], // فَلَم
      [], // تُغنِ
      [], // عَنكُم
      [], // شَيـًٔا
      [], // وَضاقَت
      [], // عَلَيكُمُ
      [], // الأَرضُ
      ["بما رحُبت : مع رُحبها و سَعتها"], // بِما
      ["بما رحُبت : مع رُحبها و سَعتها"], // رَحُبَت
      [], // ثُمَّ
      [], // وَلَّيتُم
      [] // مُدبِرينَ
    ],
    [ // آية 26
      [], // ثُمَّ
      [], // أَنزَلَ
      [], // اللَّهُ
      ["سكينته : طمأنينتهُ و أمنته أو رحمته"], // سَكينَتَهُ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // وَعَلَى
      [], // المُؤمِنينَ
      [], // وَأَنزَلَ
      [], // جُنودًا
      [], // لَم
      [], // تَرَوها
      [], // وَعَذَّبَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // وَذٰلِكَ
      [], // جَزاءُ
      [] // الكـٰفِرينَ
    ],
    [ // آية 27
      [], // ثُمَّ
      [], // يَتوبُ
      [], // اللَّهُ
      [], // مِن
      [], // بَعدِ
      [], // ذٰلِكَ
      [], // عَلىٰ
      [], // مَن
      [], // يَشاءُ
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 28
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّمَا
      ["المشركون نجس : شيء قذر أو خبيث لفساد بواطنهم"], // المُشرِكونَ
      ["المشركون نجس : شيء قذر أو خبيث لفساد بواطنهم"], // نَجَسٌ
      [], // فَلا
      [], // يَقرَبُوا
      [], // المَسجِدَ
      [], // الحَرامَ
      [], // بَعدَ
      [], // عامِهِم
      [], // هـٰذا
      [], // وَإِن
      [], // خِفتُم
      [], // عَيلَةً
      [], // فَسَوفَ
      [], // يُغنيكُمُ
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // إِن
      [], // شاءَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 29
      [], // قـٰتِلُوا
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَلا
      [], // بِاليَومِ
      [], // الـٔاخِرِ
      [], // وَلا
      [], // يُحَرِّمونَ
      [], // ما
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // وَلا
      [], // يَدينونَ
      [], // دينَ
      [], // الحَقِّ
      [], // مِنَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // حَتّىٰ
      ["يُعطوا الجزية : الخراج المقدّر على رؤوسهم"], // يُعطُوا
      ["يُعطوا الجزية : الخراج المقدّر على رؤوسهم"], // الجِزيَةَ
      ["عن يدٍ : عن انقياد أو عن قهر و قوّة"], // عَن
      ["عن يدٍ : عن انقياد أو عن قهر و قوّة"], // يَدٍ
      [], // وَهُم
      [] // صـٰغِرونَ
    ],
    [ // آية 30
      [], // وَقالَتِ
      [], // اليَهودُ
      [], // عُزَيرٌ
      [], // ابنُ
      [], // اللَّهِ
      [], // وَقالَتِ
      [], // النَّصـٰرَى
      [], // المَسيحُ
      [], // ابنُ
      [], // اللَّهِ
      [], // ذٰلِكَ
      [], // قَولُهُم
      [], // بِأَفوٰهِهِم
      [], // يُضـٰهِـٔونَ
      [], // قَولَ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // قَبلُ
      [], // قـٰتَلَهُمُ
      [], // اللَّهُ
      [], // أَنّىٰ
      [] // يُؤفَكونَ
    ],
    [ // آية 31
      [], // اتَّخَذوا
      ["أحبارهم : علماء اليهود"], // أَحبارَهُم
      [], // وَرُهبـٰنَهُم
      ["أربابًا : أطاعوهم كما يُطاع الربّ"], // أَربابًا
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // وَالمَسيحَ
      [], // ابنَ
      [], // مَريَمَ
      [], // وَما
      [], // أُمِروا
      [], // إِلّا
      [], // لِيَعبُدوا
      [], // إِلـٰهًا
      [], // وٰحِدًا
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // سُبحـٰنَهُ
      [], // عَمّا
      [] // يُشرِكونَ
    ],
    [ // آية 32
      [], // يُريدونَ
      [], // أَن
      [], // يُطفِـٔوا
      [], // نورَ
      [], // اللَّهِ
      [], // بِأَفوٰهِهِم
      [], // وَيَأبَى
      [], // اللَّهُ
      [], // إِلّا
      [], // أَن
      [], // يُتِمَّ
      [], // نورَهُ
      [], // وَلَو
      [], // كَرِهَ
      [] // الكـٰفِرونَ
    ],
    [ // آية 33
      [], // هُوَ
      [], // الَّذى
      [], // أَرسَلَ
      [], // رَسولَهُ
      [], // بِالهُدىٰ
      [], // وَدينِ
      [], // الحَقِّ
      ["ليُظهره : ليُعليه"], // لِيُظهِرَهُ
      [], // عَلَى
      [], // الدّينِ
      [], // كُلِّهِ
      [], // وَلَو
      [], // كَرِهَ
      [] // المُشرِكونَ
    ],
    [ // آية 34
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // إِنَّ
      [], // كَثيرًا
      [], // مِنَ
      [], // الأَحبارِ
      [], // وَالرُّهبانِ
      [], // لَيَأكُلونَ
      [], // أَموٰلَ
      [], // النّاسِ
      [], // بِالبـٰطِلِ
      [], // وَيَصُدّونَ
      [], // عَن
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَالَّذينَ
      [], // يَكنِزونَ
      [], // الذَّهَبَ
      [], // وَالفِضَّةَ
      [], // وَلا
      [], // يُنفِقونَها
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَبَشِّرهُم
      [], // بِعَذابٍ
      [] // أَليمٍ
    ],
    [ // آية 35
      [], // يَومَ
      [], // يُحمىٰ
      [], // عَلَيها
      [], // فى
      [], // نارِ
      [], // جَهَنَّمَ
      [], // فَتُكوىٰ
      [], // بِها
      [], // جِباهُهُم
      [], // وَجُنوبُهُم
      [], // وَظُهورُهُم
      [], // هـٰذا
      [], // ما
      [], // كَنَزتُم
      [], // لِأَنفُسِكُم
      [], // فَذوقوا
      [], // ما
      [], // كُنتُم
      [] // تَكنِزونَ
    ],
    [ // آية 36
      [], // إِنَّ
      [], // عِدَّةَ
      [], // الشُّهورِ
      [], // عِندَ
      [], // اللَّهِ
      [], // اثنا
      [], // عَشَرَ
      [], // شَهرًا
      [], // فى
      [], // كِتـٰبِ
      [], // اللَّهِ
      [], // يَومَ
      [], // خَلَقَ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضَ
      [], // مِنها
      ["أربعة حُرُم : رجب و ذو القعدة و ذو الحجة و المحرّم"], // أَربَعَةٌ
      ["أربعة حُرُم : رجب و ذو القعدة و ذو الحجة و المحرّم"], // حُرُمٌ
      [], // ذٰلِكَ
      [], // الدّينُ
      [], // القَيِّمُ
      [], // فَلا
      [], // تَظلِموا
      [], // فيهِنَّ
      [], // أَنفُسَكُم
      [], // وَقـٰتِلُوا
      [], // المُشرِكينَ
      [], // كافَّةً
      [], // كَما
      [], // يُقـٰتِلونَكُم
      [], // كافَّةً
      [], // وَاعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // مَعَ
      [] // المُتَّقينَ
    ],
    [ // آية 37
      [], // إِنَّمَا
      [], // النَّسىءُ
      [], // زِيادَةٌ
      [], // فِى
      [], // الكُفرِ
      [], // يُضَلُّ
      [], // بِهِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // يُحِلّونَهُ
      [], // عامًا
      [], // وَيُحَرِّمونَهُ
      [], // عامًا
      [], // لِيُواطِـٔوا
      [], // عِدَّةَ
      [], // ما
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // فَيُحِلّوا
      [], // ما
      [], // حَرَّمَ
      [], // اللَّهُ
      [], // زُيِّنَ
      [], // لَهُم
      [], // سوءُ
      [], // أَعمـٰلِهِم
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الكـٰفِرينَ
    ],
    [ // آية 38
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // ما
      [], // لَكُم
      [], // إِذا
      [], // قيلَ
      [], // لَكُمُ
      ["انفروا : اخرجوا غزاة ً (لتبوك)"], // انفِروا
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      ["اثاقلتم : تباطأتم و أخلدتم"], // اثّاقَلتُم
      [], // إِلَى
      [], // الأَرضِ
      [], // أَرَضيتُم
      [], // بِالحَيوٰةِ
      [], // الدُّنيا
      [], // مِنَ
      [], // الـٔاخِرَةِ
      [], // فَما
      [], // مَتـٰعُ
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // فِى
      [], // الـٔاخِرَةِ
      [], // إِلّا
      [] // قَليلٌ
    ],
    [ // آية 39
      [], // إِلّا
      [], // تَنفِروا
      [], // يُعَذِّبكُم
      [], // عَذابًا
      [], // أَليمًا
      [], // وَيَستَبدِل
      [], // قَومًا
      [], // غَيرَكُم
      [], // وَلا
      [], // تَضُرّوهُ
      [], // شَيـًٔا
      [], // وَاللَّهُ
      [], // عَلىٰ
      [], // كُلِّ
      [], // شَىءٍ
      [] // قَديرٌ
    ],
    [ // آية 40
      [], // إِلّا
      [], // تَنصُروهُ
      [], // فَقَد
      [], // نَصَرَهُ
      [], // اللَّهُ
      [], // إِذ
      [], // أَخرَجَهُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // ثانِىَ
      [], // اثنَينِ
      [], // إِذ
      [], // هُما
      [], // فِى
      [], // الغارِ
      [], // إِذ
      [], // يَقولُ
      [], // لِصـٰحِبِهِ
      [], // لا
      [], // تَحزَن
      [], // إِنَّ
      [], // اللَّهَ
      [], // مَعَنا
      [], // فَأَنزَلَ
      [], // اللَّهُ
      [], // سَكينَتَهُ
      [], // عَلَيهِ
      [], // وَأَيَّدَهُ
      [], // بِجُنودٍ
      [], // لَم
      [], // تَرَوها
      [], // وَجَعَلَ
      [], // كَلِمَةَ
      [], // الَّذينَ
      [], // كَفَرُوا
      [], // السُّفلىٰ
      [], // وَكَلِمَةُ
      [], // اللَّهِ
      [], // هِىَ
      [], // العُليا
      [], // وَاللَّهُ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 41
      [], // انفِروا
      [], // خِفافًا
      [], // وَثِقالًا
      [], // وَجـٰهِدوا
      [], // بِأَموٰلِكُم
      [], // وَأَنفُسِكُم
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // ذٰلِكُم
      [], // خَيرٌ
      [], // لَكُم
      [], // إِن
      [], // كُنتُم
      [] // تَعلَمونَ
    ],
    [ // آية 42
      [], // لَو
      [], // كانَ
      ["عرضا قريبا : مغنما سهل المأخذ"], // عَرَضًا
      ["عرضا قريبا : مغنما سهل المأخذ"], // قَريبًا
      [], // وَسَفَرًا
      [], // قاصِدًا
      [], // لَاتَّبَعوكَ
      [], // وَلـٰكِن
      [], // بَعُدَت
      [], // عَلَيهِمُ
      ["الشُّقّة : المسافة التي تقطع بمشقّة"], // الشُّقَّةُ
      [], // وَسَيَحلِفونَ
      [], // بِاللَّهِ
      [], // لَوِ
      [], // استَطَعنا
      [], // لَخَرَجنا
      [], // مَعَكُم
      [], // يُهلِكونَ
      [], // أَنفُسَهُم
      [], // وَاللَّهُ
      [], // يَعلَمُ
      [], // إِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 43
      [], // عَفَا
      [], // اللَّهُ
      [], // عَنكَ
      [], // لِمَ
      [], // أَذِنتَ
      [], // لَهُم
      [], // حَتّىٰ
      [], // يَتَبَيَّنَ
      [], // لَكَ
      [], // الَّذينَ
      [], // صَدَقوا
      [], // وَتَعلَمَ
      [] // الكـٰذِبينَ
    ],
    [ // آية 44
      [], // لا
      [], // يَستَـٔذِنُكَ
      [], // الَّذينَ
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // أَن
      [], // يُجـٰهِدوا
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // بِالمُتَّقينَ
    ],
    [ // آية 45
      [], // إِنَّما
      [], // يَستَـٔذِنُكَ
      [], // الَّذينَ
      [], // لا
      [], // يُؤمِنونَ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَارتابَت
      [], // قُلوبُهُم
      [], // فَهُم
      [], // فى
      [], // رَيبِهِم
      [] // يَتَرَدَّدونَ
    ],
    [ // آية 46
      [], // وَلَو
      [], // أَرادُوا
      [], // الخُروجَ
      [], // لَأَعَدّوا
      [], // لَهُ
      [], // عُدَّةً
      [], // وَلـٰكِن
      [], // كَرِهَ
      [], // اللَّهُ
      ["انبعاثهم : نهوضهم  للخروج معكم"], // انبِعاثَهُم
      ["فثبّطهم : فحبسهمو عوّقهم عن الخروج معكم"], // فَثَبَّطَهُم
      [], // وَقيلَ
      [], // اقعُدوا
      [], // مَعَ
      [] // القـٰعِدينَ
    ],
    [ // آية 47
      [], // لَو
      [], // خَرَجوا
      [], // فيكُم
      [], // ما
      [], // زادوكُم
      [], // إِلّا
      ["خبالا : شرّا و فسادا ، أو عجزا و جُبنا"], // خَبالًا
      [], // وَلَأَوضَعوا
      [], // خِلـٰلَكُم
      ["يبغونكم الفتنة : يطلبون لكم ما تفتنون به"], // يَبغونَكُمُ
      ["يبغونكم الفتنة : يطلبون لكم ما تفتنون به"], // الفِتنَةَ
      [], // وَفيكُم
      [], // سَمّـٰعونَ
      [], // لَهُم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // بِالظّـٰلِمينَ
    ],
    [ // آية 48
      [], // لَقَدِ
      [], // ابتَغَوُا
      [], // الفِتنَةَ
      [], // مِن
      [], // قَبلُ
      [], // وَقَلَّبوا
      [], // لَكَ
      [], // الأُمورَ
      [], // حَتّىٰ
      [], // جاءَ
      [], // الحَقُّ
      [], // وَظَهَرَ
      [], // أَمرُ
      [], // اللَّهِ
      [], // وَهُم
      [] // كـٰرِهونَ
    ],
    [ // آية 49
      [], // وَمِنهُم
      [], // مَن
      [], // يَقولُ
      [], // ائذَن
      [], // لى
      [], // وَلا
      [], // تَفتِنّى
      [], // أَلا
      [], // فِى
      [], // الفِتنَةِ
      [], // سَقَطوا
      [], // وَإِنَّ
      [], // جَهَنَّمَ
      [], // لَمُحيطَةٌ
      [] // بِالكـٰفِرينَ
    ],
    [ // آية 50
      [], // إِن
      [], // تُصِبكَ
      [], // حَسَنَةٌ
      [], // تَسُؤهُم
      [], // وَإِن
      [], // تُصِبكَ
      [], // مُصيبَةٌ
      [], // يَقولوا
      [], // قَد
      [], // أَخَذنا
      [], // أَمرَنا
      [], // مِن
      [], // قَبلُ
      [], // وَيَتَوَلَّوا
      [], // وَهُم
      [] // فَرِحونَ
    ],
    [ // آية 51
      [], // قُل
      [], // لَن
      [], // يُصيبَنا
      [], // إِلّا
      [], // ما
      [], // كَتَبَ
      [], // اللَّهُ
      [], // لَنا
      [], // هُوَ
      [], // مَولىٰنا
      [], // وَعَلَى
      [], // اللَّهِ
      [], // فَليَتَوَكَّلِ
      [] // المُؤمِنونَ
    ],
    [ // آية 52
      [], // قُل
      ["هل تربّصون بنا : ما تنتظرون بنا"], // هَل
      ["هل تربّصون بنا : ما تنتظرون بنا"], // تَرَبَّصونَ
      ["هل تربّصون بنا : ما تنتظرون بنا"], // بِنا
      [], // إِلّا
      [], // إِحدَى
      ["الحُسنيين : النّصرة و الشّهادة"], // الحُسنَيَينِ
      [], // وَنَحنُ
      [], // نَتَرَبَّصُ
      [], // بِكُم
      [], // أَن
      [], // يُصيبَكُمُ
      [], // اللَّهُ
      [], // بِعَذابٍ
      [], // مِن
      [], // عِندِهِ
      [], // أَو
      [], // بِأَيدينا
      [], // فَتَرَبَّصوا
      [], // إِنّا
      [], // مَعَكُم
      [] // مُتَرَبِّصونَ
    ],
    [ // آية 53
      [], // قُل
      [], // أَنفِقوا
      [], // طَوعًا
      [], // أَو
      [], // كَرهًا
      [], // لَن
      [], // يُتَقَبَّلَ
      [], // مِنكُم
      [], // إِنَّكُم
      [], // كُنتُم
      [], // قَومًا
      [] // فـٰسِقينَ
    ],
    [ // آية 54
      [], // وَما
      [], // مَنَعَهُم
      [], // أَن
      [], // تُقبَلَ
      [], // مِنهُم
      [], // نَفَقـٰتُهُم
      [], // إِلّا
      [], // أَنَّهُم
      [], // كَفَروا
      [], // بِاللَّهِ
      [], // وَبِرَسولِهِ
      [], // وَلا
      [], // يَأتونَ
      [], // الصَّلوٰةَ
      [], // إِلّا
      [], // وَهُم
      [], // كُسالىٰ
      [], // وَلا
      [], // يُنفِقونَ
      [], // إِلّا
      [], // وَهُم
      [] // كـٰرِهونَ
    ],
    [ // آية 55
      [], // فَلا
      [], // تُعجِبكَ
      [], // أَموٰلُهُم
      [], // وَلا
      [], // أَولـٰدُهُم
      [], // إِنَّما
      [], // يُريدُ
      [], // اللَّهُ
      [], // لِيُعَذِّبَهُم
      [], // بِها
      [], // فِى
      [], // الحَيوٰةِ
      [], // الدُّنيا
      [], // وَتَزهَقَ
      [], // أَنفُسُهُم
      [], // وَهُم
      [] // كـٰفِرونَ
    ],
    [ // آية 56
      [], // وَيَحلِفونَ
      [], // بِاللَّهِ
      [], // إِنَّهُم
      [], // لَمِنكُم
      [], // وَما
      [], // هُم
      [], // مِنكُم
      [], // وَلـٰكِنَّهُم
      ["قوم يفرقون : يخافون منكم فينافقون تقيّة"], // قَومٌ
      ["قوم يفرقون : يخافون منكم فينافقون تقيّة"] // يَفرَقونَ
    ],
    [ // آية 57
      [], // لَو
      [], // يَجِدونَ
      [], // مَلجَـًٔا
      [], // أَو
      [], // مَغـٰرٰتٍ
      [], // أَو
      ["مُدّخلا : سربا في الأرض ينجحرون فيه"], // مُدَّخَلًا
      [], // لَوَلَّوا
      [], // إِلَيهِ
      [], // وَهُم
      ["يجمحون : يسرعون في الدّخول فيه"] // يَجمَحونَ
    ],
    [ // آية 58
      [], // وَمِنهُم
      [], // مَن
      ["يلمزك : يعيبك و يطعن عليك"], // يَلمِزُكَ
      [], // فِى
      [], // الصَّدَقـٰتِ
      [], // فَإِن
      [], // أُعطوا
      [], // مِنها
      [], // رَضوا
      [], // وَإِن
      [], // لَم
      [], // يُعطَوا
      [], // مِنها
      [], // إِذا
      [], // هُم
      [] // يَسخَطونَ
    ],
    [ // آية 59
      [], // وَلَو
      [], // أَنَّهُم
      [], // رَضوا
      [], // ما
      [], // ءاتىٰهُمُ
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // وَقالوا
      ["حسبنا الله : كافينا فضل الله و قسمته"], // حَسبُنَا
      ["حسبنا الله : كافينا فضل الله و قسمته"], // اللَّهُ
      [], // سَيُؤتينَا
      [], // اللَّهُ
      [], // مِن
      [], // فَضلِهِ
      [], // وَرَسولُهُ
      [], // إِنّا
      [], // إِلَى
      [], // اللَّهِ
      [] // رٰغِبونَ
    ],
    [ // آية 60
      [], // إِنَّمَا
      [], // الصَّدَقـٰتُ
      [], // لِلفُقَراءِ
      [], // وَالمَسـٰكينِ
      [], // وَالعـٰمِلينَ
      [], // عَلَيها
      [], // وَالمُؤَلَّفَةِ
      [], // قُلوبُهُم
      [], // وَفِى
      [], // الرِّقابِ
      [], // وَالغـٰرِمينَ
      [], // وَفى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَابنِ
      [], // السَّبيلِ
      [], // فَريضَةً
      [], // مِنَ
      [], // اللَّهِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 61
      [], // وَمِنهُمُ
      [], // الَّذينَ
      [], // يُؤذونَ
      [], // النَّبِىَّ
      [], // وَيَقولونَ
      ["هو أذُن : يسمع كل ما يُقال له و يصدّقه"], // هُوَ
      ["هو أذُن : يسمع كل ما يُقال له و يصدّقه"], // أُذُنٌ
      [], // قُل
      ["أذن خير لكم : يسمع الخير و لا يسمع الشرّ"], // أُذُنُ
      ["أذن خير لكم : يسمع الخير و لا يسمع الشرّ"], // خَيرٍ
      ["أذن خير لكم : يسمع الخير و لا يسمع الشرّ"], // لَكُم
      [], // يُؤمِنُ
      [], // بِاللَّهِ
      [], // وَيُؤمِنُ
      [], // لِلمُؤمِنينَ
      [], // وَرَحمَةٌ
      [], // لِلَّذينَ
      [], // ءامَنوا
      [], // مِنكُم
      [], // وَالَّذينَ
      [], // يُؤذونَ
      [], // رَسولَ
      [], // اللَّهِ
      [], // لَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 62
      [], // يَحلِفونَ
      [], // بِاللَّهِ
      [], // لَكُم
      [], // لِيُرضوكُم
      [], // وَاللَّهُ
      [], // وَرَسولُهُ
      [], // أَحَقُّ
      [], // أَن
      [], // يُرضوهُ
      [], // إِن
      [], // كانوا
      [] // مُؤمِنينَ
    ],
    [ // آية 63
      [], // أَلَم
      [], // يَعلَموا
      [], // أَنَّهُ
      [], // مَن
      [], // يُحادِدِ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // فَأَنَّ
      [], // لَهُ
      [], // نارَ
      [], // جَهَنَّمَ
      [], // خـٰلِدًا
      [], // فيها
      [], // ذٰلِكَ
      [], // الخِزىُ
      [] // العَظيمُ
    ],
    [ // آية 64
      [], // يَحذَرُ
      [], // المُنـٰفِقونَ
      [], // أَن
      [], // تُنَزَّلَ
      [], // عَلَيهِم
      [], // سورَةٌ
      [], // تُنَبِّئُهُم
      [], // بِما
      [], // فى
      [], // قُلوبِهِم
      [], // قُلِ
      [], // استَهزِءوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // مُخرِجٌ
      [], // ما
      [] // تَحذَرونَ
    ],
    [ // آية 65
      [], // وَلَئِن
      [], // سَأَلتَهُم
      [], // لَيَقولُنَّ
      [], // إِنَّما
      [], // كُنّا
      [], // نَخوضُ
      [], // وَنَلعَبُ
      [], // قُل
      [], // أَبِاللَّهِ
      [], // وَءايـٰتِهِ
      [], // وَرَسولِهِ
      [], // كُنتُم
      [] // تَستَهزِءونَ
    ],
    [ // آية 66
      [], // لا
      [], // تَعتَذِروا
      [], // قَد
      [], // كَفَرتُم
      [], // بَعدَ
      [], // إيمـٰنِكُم
      [], // إِن
      [], // نَعفُ
      [], // عَن
      [], // طائِفَةٍ
      [], // مِنكُم
      [], // نُعَذِّب
      [], // طائِفَةً
      [], // بِأَنَّهُم
      [], // كانوا
      [] // مُجرِمينَ
    ],
    [ // آية 67
      [], // المُنـٰفِقونَ
      [], // وَالمُنـٰفِقـٰتُ
      [], // بَعضُهُم
      [], // مِن
      [], // بَعضٍ
      [], // يَأمُرونَ
      [], // بِالمُنكَرِ
      [], // وَيَنهَونَ
      [], // عَنِ
      [], // المَعروفِ
      [], // وَيَقبِضونَ
      [], // أَيدِيَهُم
      [], // نَسُوا
      [], // اللَّهَ
      ["فنسيهم : فتركهم من توفيقه و هدايته"], // فَنَسِيَهُم
      [], // إِنَّ
      [], // المُنـٰفِقينَ
      [], // هُمُ
      [] // الفـٰسِقونَ
    ],
    [ // آية 68
      [], // وَعَدَ
      [], // اللَّهُ
      [], // المُنـٰفِقينَ
      [], // وَالمُنـٰفِقـٰتِ
      [], // وَالكُفّارَ
      [], // نارَ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // هِىَ
      [], // حَسبُهُم
      [], // وَلَعَنَهُمُ
      [], // اللَّهُ
      [], // وَلَهُم
      [], // عَذابٌ
      [] // مُقيمٌ
    ],
    [ // آية 69
      [], // كَالَّذينَ
      [], // مِن
      [], // قَبلِكُم
      [], // كانوا
      [], // أَشَدَّ
      [], // مِنكُم
      [], // قُوَّةً
      [], // وَأَكثَرَ
      [], // أَموٰلًا
      [], // وَأَولـٰدًا
      [], // فَاستَمتَعوا
      [], // بِخَلـٰقِهِم
      [], // فَاستَمتَعتُم
      [], // بِخَلـٰقِكُم
      [], // كَمَا
      [], // استَمتَعَ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِكُم
      [], // بِخَلـٰقِهِم
      [], // وَخُضتُم
      [], // كَالَّذى
      [], // خاضوا
      [], // أُولـٰئِكَ
      [], // حَبِطَت
      [], // أَعمـٰلُهُم
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // الخـٰسِرونَ
    ],
    [ // آية 70
      [], // أَلَم
      [], // يَأتِهِم
      [], // نَبَأُ
      [], // الَّذينَ
      [], // مِن
      [], // قَبلِهِم
      [], // قَومِ
      [], // نوحٍ
      [], // وَعادٍ
      [], // وَثَمودَ
      [], // وَقَومِ
      [], // إِبرٰهيمَ
      [], // وَأَصحـٰبِ
      [], // مَديَنَ
      [], // وَالمُؤتَفِكـٰتِ
      [], // أَتَتهُم
      [], // رُسُلُهُم
      [], // بِالبَيِّنـٰتِ
      [], // فَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيَظلِمَهُم
      [], // وَلـٰكِن
      [], // كانوا
      [], // أَنفُسَهُم
      [] // يَظلِمونَ
    ],
    [ // آية 71
      [], // وَالمُؤمِنونَ
      [], // وَالمُؤمِنـٰتُ
      [], // بَعضُهُم
      [], // أَولِياءُ
      [], // بَعضٍ
      [], // يَأمُرونَ
      [], // بِالمَعروفِ
      [], // وَيَنهَونَ
      [], // عَنِ
      [], // المُنكَرِ
      [], // وَيُقيمونَ
      [], // الصَّلوٰةَ
      [], // وَيُؤتونَ
      [], // الزَّكوٰةَ
      [], // وَيُطيعونَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // أُولـٰئِكَ
      [], // سَيَرحَمُهُمُ
      [], // اللَّهُ
      [], // إِنَّ
      [], // اللَّهَ
      [], // عَزيزٌ
      [] // حَكيمٌ
    ],
    [ // آية 72
      [], // وَعَدَ
      [], // اللَّهُ
      [], // المُؤمِنينَ
      [], // وَالمُؤمِنـٰتِ
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // وَمَسـٰكِنَ
      [], // طَيِّبَةً
      [], // فى
      [], // جَنّـٰتِ
      [], // عَدنٍ
      [], // وَرِضوٰنٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // أَكبَرُ
      [], // ذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 73
      [], // يـٰأَيُّهَا
      [], // النَّبِىُّ
      [], // جـٰهِدِ
      [], // الكُفّارَ
      [], // وَالمُنـٰفِقينَ
      [], // وَاغلُظ
      [], // عَلَيهِم
      [], // وَمَأوىٰهُم
      [], // جَهَنَّمُ
      [], // وَبِئسَ
      [] // المَصيرُ
    ],
    [ // آية 74
      [], // يَحلِفونَ
      [], // بِاللَّهِ
      [], // ما
      [], // قالوا
      [], // وَلَقَد
      [], // قالوا
      [], // كَلِمَةَ
      [], // الكُفرِ
      [], // وَكَفَروا
      [], // بَعدَ
      [], // إِسلـٰمِهِم
      [], // وَهَمّوا
      [], // بِما
      [], // لَم
      [], // يَنالوا
      [], // وَما
      [], // نَقَموا
      [], // إِلّا
      [], // أَن
      [], // أَغنىٰهُمُ
      [], // اللَّهُ
      [], // وَرَسولُهُ
      [], // مِن
      [], // فَضلِهِ
      [], // فَإِن
      [], // يَتوبوا
      [], // يَكُ
      [], // خَيرًا
      [], // لَهُم
      [], // وَإِن
      [], // يَتَوَلَّوا
      [], // يُعَذِّبهُمُ
      [], // اللَّهُ
      [], // عَذابًا
      [], // أَليمًا
      [], // فِى
      [], // الدُّنيا
      [], // وَالـٔاخِرَةِ
      [], // وَما
      [], // لَهُم
      [], // فِى
      [], // الأَرضِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [] // نَصيرٍ
    ],
    [ // آية 75
      [], // وَمِنهُم
      [], // مَن
      [], // عـٰهَدَ
      [], // اللَّهَ
      [], // لَئِن
      [], // ءاتىٰنا
      [], // مِن
      [], // فَضلِهِ
      [], // لَنَصَّدَّقَنَّ
      [], // وَلَنَكونَنَّ
      [], // مِنَ
      [] // الصّـٰلِحينَ
    ],
    [ // آية 76
      [], // فَلَمّا
      [], // ءاتىٰهُم
      [], // مِن
      [], // فَضلِهِ
      [], // بَخِلوا
      [], // بِهِ
      [], // وَتَوَلَّوا
      [], // وَهُم
      [] // مُعرِضونَ
    ],
    [ // آية 77
      [], // فَأَعقَبَهُم
      [], // نِفاقًا
      [], // فى
      [], // قُلوبِهِم
      [], // إِلىٰ
      [], // يَومِ
      [], // يَلقَونَهُ
      [], // بِما
      [], // أَخلَفُوا
      [], // اللَّهَ
      [], // ما
      [], // وَعَدوهُ
      [], // وَبِما
      [], // كانوا
      [] // يَكذِبونَ
    ],
    [ // آية 78
      [], // أَلَم
      [], // يَعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      ["يعلم سرّهم : ما أسرّوا في قلوبهم من النّفاق"], // يَعلَمُ
      ["يعلم سرّهم : ما أسرّوا في قلوبهم من النّفاق"], // سِرَّهُم
      [], // وَنَجوىٰهُم
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // عَلّـٰمُ
      [] // الغُيوبِ
    ],
    [ // آية 79
      ["الذين يلمزون : يعيبون (هم المنافقون)"], // الَّذينَ
      ["الذين يلمزون : يعيبون (هم المنافقون)"], // يَلمِزونَ
      [], // المُطَّوِّعينَ
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // فِى
      [], // الصَّدَقـٰتِ
      [], // وَالَّذينَ
      [], // لا
      [], // يَجِدونَ
      [], // إِلّا
      ["جُهدهم : طاقتهم و وسعهم (الفقراء)"], // جُهدَهُم
      [], // فَيَسخَرونَ
      [], // مِنهُم
      ["سخر الله منهم : أهانهم و أذلّهم جزاءً وفاقا"], // سَخِرَ
      ["سخر الله منهم : أهانهم و أذلّهم جزاءً وفاقا"], // اللَّهُ
      ["سخر الله منهم : أهانهم و أذلّهم جزاءً وفاقا"], // مِنهُم
      [], // وَلَهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 80
      [], // استَغفِر
      [], // لَهُم
      [], // أَو
      [], // لا
      [], // تَستَغفِر
      [], // لَهُم
      [], // إِن
      [], // تَستَغفِر
      [], // لَهُم
      [], // سَبعينَ
      [], // مَرَّةً
      [], // فَلَن
      [], // يَغفِرَ
      [], // اللَّهُ
      [], // لَهُم
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // كَفَروا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الفـٰسِقينَ
    ],
    [ // آية 81
      [], // فَرِحَ
      [], // المُخَلَّفونَ
      [], // بِمَقعَدِهِم
      [], // خِلـٰفَ
      [], // رَسولِ
      [], // اللَّهِ
      [], // وَكَرِهوا
      [], // أَن
      [], // يُجـٰهِدوا
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَقالوا
      [], // لا
      [], // تَنفِروا
      [], // فِى
      [], // الحَرِّ
      [], // قُل
      [], // نارُ
      [], // جَهَنَّمَ
      [], // أَشَدُّ
      [], // حَرًّا
      [], // لَو
      [], // كانوا
      [] // يَفقَهونَ
    ],
    [ // آية 82
      [], // فَليَضحَكوا
      [], // قَليلًا
      [], // وَليَبكوا
      [], // كَثيرًا
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 83
      [], // فَإِن
      [], // رَجَعَكَ
      [], // اللَّهُ
      [], // إِلىٰ
      [], // طائِفَةٍ
      [], // مِنهُم
      [], // فَاستَـٔذَنوكَ
      [], // لِلخُروجِ
      [], // فَقُل
      [], // لَن
      [], // تَخرُجوا
      [], // مَعِىَ
      [], // أَبَدًا
      [], // وَلَن
      [], // تُقـٰتِلوا
      [], // مَعِىَ
      [], // عَدُوًّا
      [], // إِنَّكُم
      [], // رَضيتُم
      [], // بِالقُعودِ
      [], // أَوَّلَ
      [], // مَرَّةٍ
      [], // فَاقعُدوا
      [], // مَعَ
      [] // الخـٰلِفينَ
    ],
    [ // آية 84
      [], // وَلا
      [], // تُصَلِّ
      [], // عَلىٰ
      [], // أَحَدٍ
      [], // مِنهُم
      [], // ماتَ
      [], // أَبَدًا
      [], // وَلا
      [], // تَقُم
      [], // عَلىٰ
      [], // قَبرِهِ
      [], // إِنَّهُم
      [], // كَفَروا
      [], // بِاللَّهِ
      [], // وَرَسولِهِ
      [], // وَماتوا
      [], // وَهُم
      [] // فـٰسِقونَ
    ],
    [ // آية 85
      [], // وَلا
      [], // تُعجِبكَ
      [], // أَموٰلُهُم
      [], // وَأَولـٰدُهُم
      [], // إِنَّما
      [], // يُريدُ
      [], // اللَّهُ
      [], // أَن
      [], // يُعَذِّبَهُم
      [], // بِها
      [], // فِى
      [], // الدُّنيا
      [], // وَتَزهَقَ
      [], // أَنفُسُهُم
      [], // وَهُم
      [] // كـٰفِرونَ
    ],
    [ // آية 86
      [], // وَإِذا
      [], // أُنزِلَت
      [], // سورَةٌ
      [], // أَن
      [], // ءامِنوا
      [], // بِاللَّهِ
      [], // وَجـٰهِدوا
      [], // مَعَ
      [], // رَسولِهِ
      [], // استَـٔذَنَكَ
      ["أولوا الطّول منهم : أصحاب الغنى و السّعة من المنافقين"], // أُولُوا
      ["أولوا الطّول منهم : أصحاب الغنى و السّعة من المنافقين"], // الطَّولِ
      ["أولوا الطّول منهم : أصحاب الغنى و السّعة من المنافقين"], // مِنهُم
      [], // وَقالوا
      [], // ذَرنا
      [], // نَكُن
      [], // مَعَ
      [] // القـٰعِدينَ
    ],
    [ // آية 87
      [], // رَضوا
      [], // بِأَن
      [], // يَكونوا
      [], // مَعَ
      ["الخوالف : النّساء المتخلّفات عن الجهاد"], // الخَوالِفِ
      [], // وَطُبِعَ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // فَهُم
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 88
      [], // لـٰكِنِ
      [], // الرَّسولُ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // مَعَهُ
      [], // جـٰهَدوا
      [], // بِأَموٰلِهِم
      [], // وَأَنفُسِهِم
      [], // وَأُولـٰئِكَ
      [], // لَهُمُ
      [], // الخَيرٰتُ
      [], // وَأُولـٰئِكَ
      [], // هُمُ
      [] // المُفلِحونَ
    ],
    [ // آية 89
      [], // أَعَدَّ
      [], // اللَّهُ
      [], // لَهُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // ذٰلِكَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 90
      [], // وَجاءَ
      ["المعذّرون : المعتذرون بالأعذار الكاذبة"], // المُعَذِّرونَ
      [], // مِنَ
      [], // الأَعرابِ
      [], // لِيُؤذَنَ
      [], // لَهُم
      [], // وَقَعَدَ
      [], // الَّذينَ
      [], // كَذَبُوا
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // سَيُصيبُ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِنهُم
      [], // عَذابٌ
      [] // أَليمٌ
    ],
    [ // آية 91
      [], // لَيسَ
      [], // عَلَى
      [], // الضُّعَفاءِ
      [], // وَلا
      [], // عَلَى
      [], // المَرضىٰ
      [], // وَلا
      [], // عَلَى
      [], // الَّذينَ
      [], // لا
      [], // يَجِدونَ
      [], // ما
      [], // يُنفِقونَ
      ["حرج : إثم أو ذنب في التّخلف عن الجهاد"], // حَرَجٌ
      [], // إِذا
      [], // نَصَحوا
      [], // لِلَّهِ
      [], // وَرَسولِهِ
      [], // ما
      [], // عَلَى
      [], // المُحسِنينَ
      [], // مِن
      [], // سَبيلٍ
      [], // وَاللَّهُ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 92
      [], // وَلا
      [], // عَلَى
      [], // الَّذينَ
      [], // إِذا
      [], // ما
      [], // أَتَوكَ
      [], // لِتَحمِلَهُم
      [], // قُلتَ
      [], // لا
      [], // أَجِدُ
      [], // ما
      [], // أَحمِلُكُم
      [], // عَلَيهِ
      [], // تَوَلَّوا
      [], // وَأَعيُنُهُم
      ["تفيض من الدّمع : تمتلئ به فتصُبّه"], // تَفيضُ
      ["تفيض من الدّمع : تمتلئ به فتصُبّه"], // مِنَ
      ["تفيض من الدّمع : تمتلئ به فتصُبّه"], // الدَّمعِ
      [], // حَزَنًا
      [], // أَلّا
      [], // يَجِدوا
      [], // ما
      [] // يُنفِقونَ
    ],
    [ // آية 93
      [], // إِنَّمَا
      [], // السَّبيلُ
      [], // عَلَى
      [], // الَّذينَ
      [], // يَستَـٔذِنونَكَ
      [], // وَهُم
      [], // أَغنِياءُ
      [], // رَضوا
      [], // بِأَن
      [], // يَكونوا
      [], // مَعَ
      [], // الخَوالِفِ
      [], // وَطَبَعَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // قُلوبِهِم
      [], // فَهُم
      [], // لا
      [] // يَعلَمونَ
    ],
    [ // آية 94
      [], // يَعتَذِرونَ
      [], // إِلَيكُم
      [], // إِذا
      [], // رَجَعتُم
      [], // إِلَيهِم
      [], // قُل
      [], // لا
      [], // تَعتَذِروا
      [], // لَن
      [], // نُؤمِنَ
      [], // لَكُم
      [], // قَد
      [], // نَبَّأَنَا
      [], // اللَّهُ
      [], // مِن
      [], // أَخبارِكُم
      [], // وَسَيَرَى
      [], // اللَّهُ
      [], // عَمَلَكُم
      [], // وَرَسولُهُ
      [], // ثُمَّ
      [], // تُرَدّونَ
      [], // إِلىٰ
      [], // عـٰلِمِ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // فَيُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 95
      [], // سَيَحلِفونَ
      [], // بِاللَّهِ
      [], // لَكُم
      [], // إِذَا
      [], // انقَلَبتُم
      [], // إِلَيهِم
      [], // لِتُعرِضوا
      [], // عَنهُم
      [], // فَأَعرِضوا
      [], // عَنهُم
      [], // إِنَّهُم
      [], // رِجسٌ
      [], // وَمَأوىٰهُم
      [], // جَهَنَّمُ
      [], // جَزاءً
      [], // بِما
      [], // كانوا
      [] // يَكسِبونَ
    ],
    [ // آية 96
      [], // يَحلِفونَ
      [], // لَكُم
      [], // لِتَرضَوا
      [], // عَنهُم
      [], // فَإِن
      [], // تَرضَوا
      [], // عَنهُم
      [], // فَإِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يَرضىٰ
      [], // عَنِ
      [], // القَومِ
      [] // الفـٰسِقينَ
    ],
    [ // آية 97
      [], // الأَعرابُ
      [], // أَشَدُّ
      [], // كُفرًا
      [], // وَنِفاقًا
      [], // وَأَجدَرُ
      [], // أَلّا
      [], // يَعلَموا
      [], // حُدودَ
      [], // ما
      [], // أَنزَلَ
      [], // اللَّهُ
      [], // عَلىٰ
      [], // رَسولِهِ
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 98
      [], // وَمِنَ
      [], // الأَعرابِ
      [], // مَن
      [], // يَتَّخِذُ
      [], // ما
      [], // يُنفِقُ
      ["مغرما : غرامة و خسرانا"], // مَغرَمًا
      [], // وَيَتَرَبَّصُ
      [], // بِكُمُ
      [], // الدَّوائِرَ
      [], // عَلَيهِم
      [], // دائِرَةُ
      [], // السَّوءِ
      [], // وَاللَّهُ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 99
      [], // وَمِنَ
      [], // الأَعرابِ
      [], // مَن
      [], // يُؤمِنُ
      [], // بِاللَّهِ
      [], // وَاليَومِ
      [], // الـٔاخِرِ
      [], // وَيَتَّخِذُ
      [], // ما
      [], // يُنفِقُ
      [], // قُرُبـٰتٍ
      [], // عِندَ
      [], // اللَّهِ
      [], // وَصَلَوٰتِ
      [], // الرَّسولِ
      [], // أَلا
      [], // إِنَّها
      [], // قُربَةٌ
      [], // لَهُم
      [], // سَيُدخِلُهُمُ
      [], // اللَّهُ
      [], // فى
      [], // رَحمَتِهِ
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 100
      [], // وَالسّـٰبِقونَ
      [], // الأَوَّلونَ
      [], // مِنَ
      [], // المُهـٰجِرينَ
      [], // وَالأَنصارِ
      [], // وَالَّذينَ
      [], // اتَّبَعوهُم
      [], // بِإِحسـٰنٍ
      [], // رَضِىَ
      [], // اللَّهُ
      [], // عَنهُم
      [], // وَرَضوا
      [], // عَنهُ
      [], // وَأَعَدَّ
      [], // لَهُم
      [], // جَنّـٰتٍ
      [], // تَجرى
      [], // تَحتَهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // ذٰلِكَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 101
      [], // وَمِمَّن
      [], // حَولَكُم
      [], // مِنَ
      [], // الأَعرابِ
      [], // مُنـٰفِقونَ
      [], // وَمِن
      [], // أَهلِ
      [], // المَدينَةِ
      ["مردوا على النّفاق : مرنواعليه و دَربوا به"], // مَرَدوا
      ["مردوا على النّفاق : مرنواعليه و دَربوا به"], // عَلَى
      ["مردوا على النّفاق : مرنواعليه و دَربوا به"], // النِّفاقِ
      [], // لا
      [], // تَعلَمُهُم
      [], // نَحنُ
      [], // نَعلَمُهُم
      [], // سَنُعَذِّبُهُم
      [], // مَرَّتَينِ
      [], // ثُمَّ
      [], // يُرَدّونَ
      [], // إِلىٰ
      [], // عَذابٍ
      [] // عَظيمٍ
    ],
    [ // آية 102
      [], // وَءاخَرونَ
      [], // اعتَرَفوا
      [], // بِذُنوبِهِم
      [], // خَلَطوا
      [], // عَمَلًا
      [], // صـٰلِحًا
      [], // وَءاخَرَ
      [], // سَيِّئًا
      [], // عَسَى
      [], // اللَّهُ
      [], // أَن
      [], // يَتوبَ
      [], // عَلَيهِم
      [], // إِنَّ
      [], // اللَّهَ
      [], // غَفورٌ
      [] // رَحيمٌ
    ],
    [ // آية 103
      [], // خُذ
      [], // مِن
      [], // أَموٰلِهِم
      [], // صَدَقَةً
      [], // تُطَهِّرُهُم
      [], // وَتُزَكّيهِم
      [], // بِها
      [], // وَصَلِّ
      [], // عَلَيهِم
      [], // إِنَّ
      [], // صَلوٰتَكَ
      ["سكن لهم : طُمأنينةٌ . أو رحمة لهم"], // سَكَنٌ
      ["سكن لهم : طُمأنينةٌ . أو رحمة لهم"], // لَهُم
      [], // وَاللَّهُ
      [], // سَميعٌ
      [] // عَليمٌ
    ],
    [ // آية 104
      [], // أَلَم
      [], // يَعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // يَقبَلُ
      [], // التَّوبَةَ
      [], // عَن
      [], // عِبادِهِ
      [], // وَيَأخُذُ
      [], // الصَّدَقـٰتِ
      [], // وَأَنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // التَّوّابُ
      [] // الرَّحيمُ
    ],
    [ // آية 105
      [], // وَقُلِ
      [], // اعمَلوا
      [], // فَسَيَرَى
      [], // اللَّهُ
      [], // عَمَلَكُم
      [], // وَرَسولُهُ
      [], // وَالمُؤمِنونَ
      [], // وَسَتُرَدّونَ
      [], // إِلىٰ
      [], // عـٰلِمِ
      [], // الغَيبِ
      [], // وَالشَّهـٰدَةِ
      [], // فَيُنَبِّئُكُم
      [], // بِما
      [], // كُنتُم
      [] // تَعمَلونَ
    ],
    [ // آية 106
      [], // وَءاخَرونَ
      ["مُرجون : مؤخّرون لا يُقطع لهم بتوبة"], // مُرجَونَ
      [], // لِأَمرِ
      [], // اللَّهِ
      [], // إِمّا
      [], // يُعَذِّبُهُم
      [], // وَإِمّا
      [], // يَتوبُ
      [], // عَلَيهِم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 107
      [], // وَالَّذينَ
      [], // اتَّخَذوا
      ["مسجدا ضرارا : مُضارّة لأهل مسجد قباء"], // مَسجِدًا
      ["مسجدا ضرارا : مُضارّة لأهل مسجد قباء"], // ضِرارًا
      [], // وَكُفرًا
      [], // وَتَفريقًا
      [], // بَينَ
      [], // المُؤمِنينَ
      [], // وَإِرصادًا
      [], // لِمَن
      [], // حارَبَ
      [], // اللَّهَ
      [], // وَرَسولَهُ
      [], // مِن
      [], // قَبلُ
      [], // وَلَيَحلِفُنَّ
      [], // إِن
      [], // أَرَدنا
      [], // إِلَّا
      [], // الحُسنىٰ
      [], // وَاللَّهُ
      [], // يَشهَدُ
      [], // إِنَّهُم
      [] // لَكـٰذِبونَ
    ],
    [ // آية 108
      [], // لا
      [], // تَقُم
      [], // فيهِ
      [], // أَبَدًا
      ["لَمسجد : هو مسجد قُباء أو المسجد النّبوي"], // لَمَسجِدٌ
      [], // أُسِّسَ
      [], // عَلَى
      [], // التَّقوىٰ
      [], // مِن
      [], // أَوَّلِ
      [], // يَومٍ
      [], // أَحَقُّ
      [], // أَن
      [], // تَقومَ
      [], // فيهِ
      [], // فيهِ
      [], // رِجالٌ
      [], // يُحِبّونَ
      [], // أَن
      [], // يَتَطَهَّروا
      [], // وَاللَّهُ
      [], // يُحِبُّ
      [] // المُطَّهِّرينَ
    ],
    [ // آية 109
      [], // أَفَمَن
      [], // أَسَّسَ
      [], // بُنيـٰنَهُ
      [], // عَلىٰ
      [], // تَقوىٰ
      [], // مِنَ
      [], // اللَّهِ
      [], // وَرِضوٰنٍ
      [], // خَيرٌ
      [], // أَم
      [], // مَن
      [], // أَسَّسَ
      [], // بُنيـٰنَهُ
      ["على شفا جرف : على حرف بئر لم تُبن بالحجارة"], // عَلىٰ
      ["على شفا جرف : على حرف بئر لم تُبن بالحجارة"], // شَفا
      ["على شفا جرف : على حرف بئر لم تُبن بالحجارة"], // جُرُفٍ
      ["هارٍ : هائر متصدّع أو متهدّم"], // هارٍ
      ["فانهار به : فسقط البنيان بالباني"], // فَانهارَ
      ["فانهار به : فسقط البنيان بالباني"], // بِهِ
      [], // فى
      [], // نارِ
      [], // جَهَنَّمَ
      [], // وَاللَّهُ
      [], // لا
      [], // يَهدِى
      [], // القَومَ
      [] // الظّـٰلِمينَ
    ],
    [ // آية 110
      [], // لا
      [], // يَزالُ
      [], // بُنيـٰنُهُمُ
      [], // الَّذى
      [], // بَنَوا
      [], // ريبَةً
      [], // فى
      [], // قُلوبِهِم
      [], // إِلّا
      [], // أَن
      ["تقطّع قلوبهم : تتقطّع و تتفرّق أجزاء بالموت"], // تَقَطَّعَ
      ["تقطّع قلوبهم : تتقطّع و تتفرّق أجزاء بالموت"], // قُلوبُهُم
      [], // وَاللَّهُ
      [], // عَليمٌ
      [] // حَكيمٌ
    ],
    [ // آية 111
      [], // إِنَّ
      [], // اللَّهَ
      [], // اشتَرىٰ
      [], // مِنَ
      [], // المُؤمِنينَ
      [], // أَنفُسَهُم
      [], // وَأَموٰلَهُم
      [], // بِأَنَّ
      [], // لَهُمُ
      [], // الجَنَّةَ
      [], // يُقـٰتِلونَ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // فَيَقتُلونَ
      [], // وَيُقتَلونَ
      [], // وَعدًا
      [], // عَلَيهِ
      [], // حَقًّا
      [], // فِى
      [], // التَّورىٰةِ
      [], // وَالإِنجيلِ
      [], // وَالقُرءانِ
      [], // وَمَن
      [], // أَوفىٰ
      [], // بِعَهدِهِ
      [], // مِنَ
      [], // اللَّهِ
      [], // فَاستَبشِروا
      [], // بِبَيعِكُمُ
      [], // الَّذى
      [], // بايَعتُم
      [], // بِهِ
      [], // وَذٰلِكَ
      [], // هُوَ
      [], // الفَوزُ
      [] // العَظيمُ
    ],
    [ // آية 112
      [], // التّـٰئِبونَ
      [], // العـٰبِدونَ
      [], // الحـٰمِدونَ
      [], // السّـٰئِحونَ
      [], // الرّٰكِعونَ
      [], // السّـٰجِدونَ
      [], // الـٔامِرونَ
      [], // بِالمَعروفِ
      [], // وَالنّاهونَ
      [], // عَنِ
      [], // المُنكَرِ
      [], // وَالحـٰفِظونَ
      ["لحدود الله : لأوامره و نواهيه"], // لِحُدودِ
      ["لحدود الله : لأوامره و نواهيه"], // اللَّهِ
      [], // وَبَشِّرِ
      [] // المُؤمِنينَ
    ],
    [ // آية 113
      [], // ما
      [], // كانَ
      [], // لِلنَّبِىِّ
      [], // وَالَّذينَ
      [], // ءامَنوا
      [], // أَن
      [], // يَستَغفِروا
      [], // لِلمُشرِكينَ
      [], // وَلَو
      [], // كانوا
      [], // أُولى
      [], // قُربىٰ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // تَبَيَّنَ
      [], // لَهُم
      [], // أَنَّهُم
      [], // أَصحـٰبُ
      [] // الجَحيمِ
    ],
    [ // آية 114
      [], // وَما
      [], // كانَ
      [], // استِغفارُ
      [], // إِبرٰهيمَ
      [], // لِأَبيهِ
      [], // إِلّا
      [], // عَن
      [], // مَوعِدَةٍ
      [], // وَعَدَها
      [], // إِيّاهُ
      [], // فَلَمّا
      [], // تَبَيَّنَ
      [], // لَهُ
      [], // أَنَّهُ
      [], // عَدُوٌّ
      [], // لِلَّهِ
      [], // تَبَرَّأَ
      [], // مِنهُ
      [], // إِنَّ
      [], // إِبرٰهيمَ
      [], // لَأَوّٰهٌ
      [] // حَليمٌ
    ],
    [ // آية 115
      [], // وَما
      [], // كانَ
      [], // اللَّهُ
      [], // لِيُضِلَّ
      [], // قَومًا
      [], // بَعدَ
      [], // إِذ
      [], // هَدىٰهُم
      [], // حَتّىٰ
      [], // يُبَيِّنَ
      [], // لَهُم
      [], // ما
      [], // يَتَّقونَ
      [], // إِنَّ
      [], // اللَّهَ
      [], // بِكُلِّ
      [], // شَىءٍ
      [] // عَليمٌ
    ],
    [ // آية 116
      [], // إِنَّ
      [], // اللَّهَ
      [], // لَهُ
      [], // مُلكُ
      [], // السَّمـٰوٰتِ
      [], // وَالأَرضِ
      [], // يُحيۦ
      [], // وَيُميتُ
      [], // وَما
      [], // لَكُم
      [], // مِن
      [], // دونِ
      [], // اللَّهِ
      [], // مِن
      [], // وَلِىٍّ
      [], // وَلا
      [] // نَصيرٍ
    ],
    [ // آية 117
      [], // لَقَد
      [], // تابَ
      [], // اللَّهُ
      [], // عَلَى
      [], // النَّبِىِّ
      [], // وَالمُهـٰجِرينَ
      [], // وَالأَنصارِ
      [], // الَّذينَ
      [], // اتَّبَعوهُ
      [], // فى
      ["ساعة العسرة : وقت الشّدة و الضّيق في تبوك"], // ساعَةِ
      ["ساعة العسرة : وقت الشّدة و الضّيق في تبوك"], // العُسرَةِ
      [], // مِن
      [], // بَعدِ
      [], // ما
      [], // كادَ
      ["يزيغ : يميل إلى التّخلّف عن الجهاد"], // يَزيغُ
      [], // قُلوبُ
      [], // فَريقٍ
      [], // مِنهُم
      [], // ثُمَّ
      [], // تابَ
      [], // عَلَيهِم
      [], // إِنَّهُ
      [], // بِهِم
      [], // رَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 118
      [], // وَعَلَى
      [], // الثَّلـٰثَةِ
      [], // الَّذينَ
      [], // خُلِّفوا
      [], // حَتّىٰ
      [], // إِذا
      [], // ضاقَت
      [], // عَلَيهِمُ
      [], // الأَرضُ
      ["بما رحُبت : مع رُحبها و سعتها"], // بِما
      ["بما رحُبت : مع رُحبها و سعتها"], // رَحُبَت
      [], // وَضاقَت
      [], // عَلَيهِم
      [], // أَنفُسُهُم
      [], // وَظَنّوا
      [], // أَن
      [], // لا
      [], // مَلجَأَ
      [], // مِنَ
      [], // اللَّهِ
      [], // إِلّا
      [], // إِلَيهِ
      [], // ثُمَّ
      [], // تابَ
      [], // عَلَيهِم
      ["ليتوبوا : ليُداوموا على التّوبة في المستقبل"], // لِيَتوبوا
      [], // إِنَّ
      [], // اللَّهَ
      [], // هُوَ
      [], // التَّوّابُ
      [] // الرَّحيمُ
    ],
    [ // آية 119
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنُوا
      [], // اتَّقُوا
      [], // اللَّهَ
      [], // وَكونوا
      [], // مَعَ
      [] // الصّـٰدِقينَ
    ],
    [ // آية 120
      [], // ما
      [], // كانَ
      [], // لِأَهلِ
      [], // المَدينَةِ
      [], // وَمَن
      [], // حَولَهُم
      [], // مِنَ
      [], // الأَعرابِ
      [], // أَن
      [], // يَتَخَلَّفوا
      [], // عَن
      [], // رَسولِ
      [], // اللَّهِ
      [], // وَلا
      [], // يَرغَبوا
      [], // بِأَنفُسِهِم
      [], // عَن
      [], // نَفسِهِ
      [], // ذٰلِكَ
      [], // بِأَنَّهُم
      [], // لا
      [], // يُصيبُهُم
      [], // ظَمَأٌ
      [], // وَلا
      [], // نَصَبٌ
      [], // وَلا
      ["مخمصةٌ : مجاعة ما"], // مَخمَصَةٌ
      [], // فى
      [], // سَبيلِ
      [], // اللَّهِ
      [], // وَلا
      [], // يَطَـٔونَ
      [], // مَوطِئًا
      ["يغيظ الكفّار : يغضبهم و يغمّهم"], // يَغيظُ
      ["يغيظ الكفّار : يغضبهم و يغمّهم"], // الكُفّارَ
      [], // وَلا
      [], // يَنالونَ
      [], // مِن
      [], // عَدُوٍّ
      ["نيلا : شيئا من قتل أو أسر أو غنيمة"], // نَيلًا
      [], // إِلّا
      [], // كُتِبَ
      [], // لَهُم
      [], // بِهِ
      [], // عَمَلٌ
      [], // صـٰلِحٌ
      [], // إِنَّ
      [], // اللَّهَ
      [], // لا
      [], // يُضيعُ
      [], // أَجرَ
      [] // المُحسِنينَ
    ],
    [ // آية 121
      [], // وَلا
      [], // يُنفِقونَ
      [], // نَفَقَةً
      [], // صَغيرَةً
      [], // وَلا
      [], // كَبيرَةً
      [], // وَلا
      [], // يَقطَعونَ
      [], // وادِيًا
      [], // إِلّا
      [], // كُتِبَ
      [], // لَهُم
      [], // لِيَجزِيَهُمُ
      [], // اللَّهُ
      [], // أَحسَنَ
      [], // ما
      [], // كانوا
      [] // يَعمَلونَ
    ],
    [ // آية 122
      [], // وَما
      [], // كانَ
      [], // المُؤمِنونَ
      ["لينفروا كافّة : ليخرجوا إلى الجهاد جميعا"], // لِيَنفِروا
      ["لينفروا كافّة : ليخرجوا إلى الجهاد جميعا"], // كافَّةً
      [], // فَلَولا
      [], // نَفَرَ
      [], // مِن
      [], // كُلِّ
      [], // فِرقَةٍ
      [], // مِنهُم
      [], // طائِفَةٌ
      [], // لِيَتَفَقَّهوا
      [], // فِى
      [], // الدّينِ
      [], // وَلِيُنذِروا
      [], // قَومَهُم
      [], // إِذا
      [], // رَجَعوا
      [], // إِلَيهِم
      [], // لَعَلَّهُم
      [] // يَحذَرونَ
    ],
    [ // آية 123
      [], // يـٰأَيُّهَا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // قـٰتِلُوا
      [], // الَّذينَ
      [], // يَلونَكُم
      [], // مِنَ
      [], // الكُفّارِ
      [], // وَليَجِدوا
      [], // فيكُم
      ["غلظةً : شدّة و شجاعة ، و حمية ، و صبرا"], // غِلظَةً
      [], // وَاعلَموا
      [], // أَنَّ
      [], // اللَّهَ
      [], // مَعَ
      [] // المُتَّقينَ
    ],
    [ // آية 124
      [], // وَإِذا
      [], // ما
      [], // أُنزِلَت
      [], // سورَةٌ
      [], // فَمِنهُم
      [], // مَن
      [], // يَقولُ
      [], // أَيُّكُم
      [], // زادَتهُ
      [], // هـٰذِهِ
      [], // إيمـٰنًا
      [], // فَأَمَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // فَزادَتهُم
      [], // إيمـٰنًا
      [], // وَهُم
      [] // يَستَبشِرونَ
    ],
    [ // آية 125
      [], // وَأَمَّا
      [], // الَّذينَ
      [], // فى
      [], // قُلوبِهِم
      [], // مَرَضٌ
      [], // فَزادَتهُم
      ["رجسا : نفاقا و كفرا"], // رِجسًا
      [], // إِلىٰ
      [], // رِجسِهِم
      [], // وَماتوا
      [], // وَهُم
      [] // كـٰفِرونَ
    ],
    [ // آية 126
      [], // أَوَلا
      [], // يَرَونَ
      [], // أَنَّهُم
      ["يُفتنون : يُمتحنون بالشّدائد و البلايا"], // يُفتَنونَ
      [], // فى
      [], // كُلِّ
      [], // عامٍ
      [], // مَرَّةً
      [], // أَو
      [], // مَرَّتَينِ
      [], // ثُمَّ
      [], // لا
      [], // يَتوبونَ
      [], // وَلا
      [], // هُم
      [] // يَذَّكَّرونَ
    ],
    [ // آية 127
      [], // وَإِذا
      [], // ما
      [], // أُنزِلَت
      [], // سورَةٌ
      [], // نَظَرَ
      [], // بَعضُهُم
      [], // إِلىٰ
      [], // بَعضٍ
      [], // هَل
      [], // يَرىٰكُم
      [], // مِن
      [], // أَحَدٍ
      [], // ثُمَّ
      [], // انصَرَفوا
      [], // صَرَفَ
      [], // اللَّهُ
      [], // قُلوبَهُم
      [], // بِأَنَّهُم
      [], // قَومٌ
      [], // لا
      [] // يَفقَهونَ
    ],
    [ // آية 128
      [], // لَقَد
      [], // جاءَكُم
      [], // رَسولٌ
      [], // مِن
      [], // أَنفُسِكُم
      ["عزيز عليه : صعب و شاقّ عليه"], // عَزيزٌ
      ["عزيز عليه : صعب و شاقّ عليه"], // عَلَيهِ
      [], // ما
      [], // عَنِتُّم
      [], // حَريصٌ
      [], // عَلَيكُم
      [], // بِالمُؤمِنينَ
      [], // رَءوفٌ
      [] // رَحيمٌ
    ],
    [ // آية 129
      [], // فَإِن
      [], // تَوَلَّوا
      [], // فَقُل
      [], // حَسبِىَ
      [], // اللَّهُ
      [], // لا
      [], // إِلـٰهَ
      [], // إِلّا
      [], // هُوَ
      [], // عَلَيهِ
      [], // تَوَكَّلتُ
      [], // وَهُوَ
      [], // رَبُّ
      [], // العَرشِ
      [] // العَظيمِ
    ]
  ]
];

export default meanings;