const meanings = [
  [ // سورة 90: البلد
[ // آية 1
      [], // لا
      [], // أُقسِمُ
      [], // بِهـٰذَا
      [] // البَلَدِ
    ],
    [ // آية 2
      [], // وَأَنتَ
      [], // حِلٌّ
      [], // بِهـٰذَا
      [] // البَلَدِ
    ],
    [ // آية 3
      [], // وَوالِدٍ
      [], // وَما
      [] // وَلَدَ
    ],
    [ // آية 4
      [], // لَقَد
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // فى
      ["كبد : نـَـصَـب و مشقـّة و مُكابَدة للشّدائد"] // كَبَدٍ
    ],
    [ // آية 5
      [], // أَيَحسَبُ
      [], // أَن
      [], // لَن
      [], // يَقدِرَ
      [], // عَلَيهِ
      [] // أَحَدٌ
    ],
    [ // آية 6
      [], // يَقولُ
      [], // أَهلَكتُ
      [], // مالًا
      [] // لُبَدًا
    ],
    [ // آية 7
      [], // أَيَحسَبُ
      [], // أَن
      [], // لَم
      [], // يَرَهُ
      [] // أَحَدٌ
    ],
    [ // آية 8
      [], // أَلَم
      [], // نَجعَل
      [], // لَهُ
      [] // عَينَينِ
    ],
    [ // آية 9
      [], // وَلِسانًا
      [] // وَشَفَتَينِ
    ],
    [ // آية 10
      [], // وَهَدَينـٰهُ
      [] // النَّجدَينِ
    ],
    [ // آية 11
      [], // فَلَا
      [], // اقتَحَمَ
      [] // العَقَبَةَ
    ],
    [ // آية 12
      [], // وَما
      [], // أَدرىٰكَ
      [], // مَا
      [] // العَقَبَةُ
    ],
    [ // آية 13
      [], // فَكُّ
      [] // رَقَبَةٍ
    ],
    [ // آية 14
      [], // أَو
      [], // إِطعـٰمٌ
      [], // فى
      [], // يَومٍ
      [], // ذى
      [] // مَسغَبَةٍ
    ],
    [ // آية 15
      ["يتيما ذا مقربة : قرَابَة في الـنّـسَب"], // يَتيمًا
      ["يتيما ذا مقربة : قرَابَة في الـنّـسَب"], // ذا
      ["يتيما ذا مقربة : قرَابَة في الـنّـسَب"] // مَقرَبَةٍ
    ],
    [ // آية 16
      [], // أَو
      ["مسكينا ذا متربَة : فاقة شديدة لـَـصِـقَ منها بالتراب"], // مِسكينًا
      ["مسكينا ذا متربَة : فاقة شديدة لـَـصِـقَ منها بالتراب"], // ذا
      ["مسكينا ذا متربَة : فاقة شديدة لـَـصِـقَ منها بالتراب"] // مَترَبَةٍ
    ],
    [ // آية 17
      [], // ثُمَّ
      [], // كانَ
      [], // مِنَ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَتَواصَوا
      [], // بِالصَّبرِ
      [], // وَتَواصَوا
      [] // بِالمَرحَمَةِ
    ],
    [ // آية 18
      [], // أُولـٰئِكَ
      [], // أَصحـٰبُ
      [] // المَيمَنَةِ
    ],
    [ // آية 19
      [], // وَالَّذينَ
      [], // كَفَروا
      [], // بِـٔايـٰتِنا
      [], // هُم
      [], // أَصحـٰبُ
      [] // المَشـَٔمَةِ
    ],
    [ // آية 20
      [], // عَلَيهِم
      ["نارٌ مؤصَدة : مُـطبَقة ٌ مُـغْـلقة أبْوابها"], // نارٌ
      ["نارٌ مؤصَدة : مُـطبَقة ٌ مُـغْـلقة أبْوابها"] // مُؤصَدَةٌ
    ]
  ]
];

export default meanings;