const meanings = [
[ // آية 1
      [], // وَالشَّمسِ
      [] // وَضُحىٰها
    ],
    [ // آية 2
      [], // وَالقَمَرِ
      [], // إِذا
      [] // تَلىٰها
    ],
    [ // آية 3
      [], // وَالنَّهارِ
      [], // إِذا
      [] // جَلّىٰها
    ],
    [ // آية 4
      [], // وَالَّيلِ
      [], // إِذا
      [] // يَغشىٰها
    ],
    [ // آية 5
      [], // وَالسَّماءِ
      [], // وَما
      [] // بَنىٰها
    ],
    [ // آية 6
      [], // وَالأَرضِ
      [], // وَما
      [] // طَحىٰها
    ],
    [ // آية 7
      [], // وَنَفسٍ
      [], // وَما
      [] // سَوّىٰها
    ],
    [ // آية 8
      [], // فَأَلهَمَها
      [], // فُجورَها
      [] // وَتَقوىٰها
    ],
    [ // آية 9
      [], // قَد
      [], // أَفلَحَ
      [], // مَن
      [] // زَكّىٰها
    ],
    [ // آية 10
      [], // وَقَد
      [], // خابَ
      [], // مَن
      [] // دَسّىٰها
    ],
    [ // آية 11
      [], // كَذَّبَت
      [], // ثَمودُ
      [] // بِطَغوىٰها
    ],
    [ // آية 12
      [], // إِذِ
      [], // انبَعَثَ
      [] // أَشقىٰها
    ],
    [ // آية 13
      [], // فَقالَ
      [], // لَهُم
      [], // رَسولُ
      [], // اللَّهِ
      [], // ناقَةَ
      [], // اللَّهِ
      [] // وَسُقيـٰها
    ],
    [ // آية 14
      [], // فَكَذَّبوهُ
      [], // فَعَقَروها
      ["فدمدم عليهم : أهْـلـكهمْ و أطبَق العذاب عليهم"], // فَدَمدَمَ
      ["فدمدم عليهم : أهْـلـكهمْ و أطبَق العذاب عليهم"], // عَلَيهِم
      [], // رَبُّهُم
      [], // بِذَنبِهِم
      [] // فَسَوّىٰها
    ],
    [ // آية 15
      [], // وَلا
      [], // يَخافُ
      [] // عُقبـٰها
    ]
];

export default meanings;