const meanings = [
[ // آية 1
      [], // وَالَّيلِ
      [], // إِذا
      [] // يَغشىٰ
    ],
    [ // آية 2
      [], // وَالنَّهارِ
      [], // إِذا
      [] // تَجَلّىٰ
    ],
    [ // آية 3
      [], // وَما
      [], // خَلَقَ
      [], // الذَّكَرَ
      [] // وَالأُنثىٰ
    ],
    [ // آية 4
      [], // إِنَّ
      [], // سَعيَكُم
      [] // لَشَتّىٰ
    ],
    [ // آية 5
      [], // فَأَمّا
      [], // مَن
      [], // أَعطىٰ
      [] // وَاتَّقىٰ
    ],
    [ // آية 6
      [], // وَصَدَّقَ
      [] // بِالحُسنىٰ
    ],
    [ // آية 7
      [], // فَسَنُيَسِّرُهُ
      ["لليُسرى : للخَصـلة المؤَدّية إلى اليُسْر و الرّاحَة"] // لِليُسرىٰ
    ],
    [ // آية 8
      [], // وَأَمّا
      [], // مَن
      [], // بَخِلَ
      [] // وَاستَغنىٰ
    ],
    [ // آية 9
      [], // وَكَذَّبَ
      [] // بِالحُسنىٰ
    ],
    [ // آية 10
      [], // فَسَنُيَسِّرُهُ
      ["للعُسْرى : للخصلة المؤدية إلى العُسْر و الشدّة"] // لِلعُسرىٰ
    ],
    [ // آية 11
      [], // وَما
      [], // يُغنى
      [], // عَنهُ
      [], // مالُهُ
      [], // إِذا
      ["ترَدّى : هَـلـَـكَ . أوْ سَـقـَـط في النـّـار"] // تَرَدّىٰ
    ],
    [ // آية 12
      ["إنّ علينا للهدى : الدّلالة على الحقّ أو بيان طريقه"], // إِنَّ
      ["إنّ علينا للهدى : الدّلالة على الحقّ أو بيان طريقه"], // عَلَينا
      ["إنّ علينا للهدى : الدّلالة على الحقّ أو بيان طريقه"] // لَلهُدىٰ
    ],
    [ // آية 13
      [], // وَإِنَّ
      [], // لَنا
      [], // لَلـٔاخِرَةَ
      [] // وَالأولىٰ
    ],
    [ // آية 14
      [], // فَأَنذَرتُكُم
      [], // نارًا
      [] // تَلَظّىٰ
    ],
    [ // آية 15
      [], // لا
      [], // يَصلىٰها
      [], // إِلَّا
      [] // الأَشقَى
    ],
    [ // آية 16
      [], // الَّذى
      [], // كَذَّبَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 17
      [], // وَسَيُجَنَّبُهَا
      [] // الأَتقَى
    ],
    [ // آية 18
      [], // الَّذى
      [], // يُؤتى
      [], // مالَهُ
      ["يتزكّى : يتـطهّر به منَ الذنوب"] // يَتَزَكّىٰ
    ],
    [ // آية 19
      [], // وَما
      [], // لِأَحَدٍ
      [], // عِندَهُ
      [], // مِن
      [], // نِعمَةٍ
      [] // تُجزىٰ
    ],
    [ // آية 20
      [], // إِلَّا
      [], // ابتِغاءَ
      [], // وَجهِ
      [], // رَبِّهِ
      [] // الأَعلىٰ
    ],
    [ // آية 21
      [], // وَلَسَوفَ
      [] // يَرضىٰ
    ]
];

export default meanings;