const meanings = [
[ // آية 1
      [] // وَالضُّحىٰ
    ],
    [ // آية 2
      [], // وَالَّيلِ
      [], // إِذا
      ["سجى : سَكنَ أو اشتدّ ظلامه"] // سَجىٰ
    ],
    [ // آية 3
      [], // ما
      [], // وَدَّعَكَ
      [], // رَبُّكَ
      [], // وَما
      [] // قَلىٰ
    ],
    [ // آية 4
      [], // وَلَلـٔاخِرَةُ
      [], // خَيرٌ
      [], // لَكَ
      [], // مِنَ
      [] // الأولىٰ
    ],
    [ // آية 5
      [], // وَلَسَوفَ
      [], // يُعطيكَ
      [], // رَبُّكَ
      [] // فَتَرضىٰ
    ],
    [ // آية 6
      [], // أَلَم
      [], // يَجِدكَ
      [], // يَتيمًا
      [] // فَـٔاوىٰ
    ],
    [ // آية 7
      [], // وَوَجَدَكَ
      ["ضالاّ : غافِلاً عنْ أحكام الشّرائع"], // ضالًّا
      ["فهَدَى : فهَـدَاك إلى مناهجها بما أوحى إليك"] // فَهَدىٰ
    ],
    [ // آية 8
      [], // وَوَجَدَكَ
      ["عائلا : فقيرا عَديما"], // عائِلًا
      [] // فَأَغنىٰ
    ],
    [ // آية 9
      [], // فَأَمَّا
      [], // اليَتيمَ
      [], // فَلا
      [] // تَقهَر
    ],
    [ // آية 10
      [], // وَأَمَّا
      [], // السّائِلَ
      [], // فَلا
      [] // تَنهَر
    ],
    [ // آية 11
      [], // وَأَمّا
      [], // بِنِعمَةِ
      [], // رَبِّكَ
      [] // فَحَدِّث
    ]
];

export default meanings;