const meanings = [
  [ // سورة 94: الشرح
[ // آية 1
      ["ألم نشرحْ : ألم نـُـفـسِـحْ بالحكمة و النبوّة – قد أفـْـسَحْـنا"], // أَلَم
      ["ألم نشرحْ : ألم نـُـفـسِـحْ بالحكمة و النبوّة – قد أفـْـسَحْـنا"], // نَشرَح
      [], // لَكَ
      [] // صَدرَكَ
    ],
    [ // آية 2
      [], // وَوَضَعنا
      [], // عَنكَ
      ["ِوزرك : \"حِمْـلك \"\"أعباءَ النبوّة و الرّسالة\"\"\""] // وِزرَكَ
    ],
    [ // آية 3
      [], // الَّذى
      [], // أَنقَضَ
      [] // ظَهرَكَ
    ],
    [ // آية 4
      [], // وَرَفَعنا
      [], // لَكَ
      [] // ذِكرَكَ
    ],
    [ // آية 5
      [], // فَإِنَّ
      [], // مَعَ
      [], // العُسرِ
      [] // يُسرًا
    ],
    [ // آية 6
      [], // إِنَّ
      [], // مَعَ
      [], // العُسرِ
      [] // يُسرًا
    ],
    [ // آية 7
      ["فإذا فرغت : مِـنْ عِـبَـادة أدّيتها"], // فَإِذا
      ["فإذا فرغت : مِـنْ عِـبَـادة أدّيتها"], // فَرَغتَ
      ["فانصبْ : فاجْتهِدْ و أتـْـبعْها بعِبادة أخرى"] // فَانصَب
    ],
    [ // آية 8
      [], // وَإِلىٰ
      [], // رَبِّكَ
      ["فارْغَبْ : فاجْعَـلْ رَغْـبَـتـَك في جَميع شؤونك"] // فَارغَب
    ]
  ]
];

export default meanings;