const meanings = [
[ // آية 1
      [], // وَالتّينِ
      [] // وَالزَّيتونِ
    ],
    [ // آية 2
      [], // وَطورِ
      [] // سينينَ
    ],
    [ // آية 3
      [], // وَهـٰذَا
      ["البلد الأمين : مكة المكرّمة"], // البَلَدِ
      ["البلد الأمين : مكة المكرّمة"] // الأَمينِ
    ],
    [ // آية 4
      [], // لَقَد
      [], // خَلَقنَا
      [], // الإِنسـٰنَ
      [], // فى
      ["أحْسَنِ تقويم : أكْمَلِ تَعدِيلٍ وأحسنِ صُورَةٍ"], // أَحسَنِ
      ["أحْسَنِ تقويم : أكْمَلِ تَعدِيلٍ وأحسنِ صُورَةٍ"] // تَقويمٍ
    ],
    [ // آية 5
      [], // ثُمَّ
      [], // رَدَدنـٰهُ
      [], // أَسفَلَ
      [] // سـٰفِلينَ
    ],
    [ // آية 6
      [], // إِلَّا
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // فَلَهُم
      [], // أَجرٌ
      ["غير ممنون : غيرُ مَقطُوعٍ عنهم"], // غَيرُ
      ["غير ممنون : غيرُ مَقطُوعٍ عنهم"] // مَمنونٍ
    ],
    [ // آية 7
      [], // فَما
      [], // يُكَذِّبُكَ
      [], // بَعدُ
      ["بالدّين : بالجزاءِ بعد البعث والحساب"] // بِالدّينِ
    ],
    [ // آية 8
      [], // أَلَيسَ
      [], // اللَّهُ
      [], // بِأَحكَمِ
      [] // الحـٰكِمينَ
    ]
];

export default meanings;