const meanings = [
  [ // سورة 96: العلق
[ // آية 1
      [], // اقرَأ
      [], // بِاسمِ
      [], // رَبِّكَ
      [], // الَّذى
      [] // خَلَقَ
    ],
    [ // آية 2
      [], // خَلَقَ
      [], // الإِنسـٰنَ
      [], // مِن
      ["عَلق : دَمٍ جامِدٍ استحالَ إليه المَنِىُّ"] // عَلَقٍ
    ],
    [ // آية 3
      [], // اقرَأ
      [], // وَرَبُّكَ
      [] // الأَكرَمُ
    ],
    [ // آية 4
      [], // الَّذى
      [], // عَلَّمَ
      [] // بِالقَلَمِ
    ],
    [ // آية 5
      [], // عَلَّمَ
      [], // الإِنسـٰنَ
      [], // ما
      [], // لَم
      [] // يَعلَم
    ],
    [ // آية 6
      ["كلاّ : حقـّـًـا"], // كَلّا
      [], // إِنَّ
      [], // الإِنسـٰنَ
      ["ليَطغَى : لَيُجَاوزُ الحدَّ فى العِصيان"] // لَيَطغىٰ
    ],
    [ // آية 7
      [], // أَن
      [], // رَءاهُ
      [] // استَغنىٰ
    ],
    [ // آية 8
      [], // إِنَّ
      [], // إِلىٰ
      [], // رَبِّكَ
      ["الرّجْعى : الرُّجُوعَ فى الآخرة للجزاء"] // الرُّجعىٰ
    ],
    [ // آية 9
      [], // أَرَءَيتَ
      [], // الَّذى
      [] // يَنهىٰ
    ],
    [ // آية 10
      [], // عَبدًا
      [], // إِذا
      [] // صَلّىٰ
    ],
    [ // آية 11
      [], // أَرَءَيتَ
      [], // إِن
      [], // كانَ
      [], // عَلَى
      [] // الهُدىٰ
    ],
    [ // آية 12
      [], // أَو
      [], // أَمَرَ
      [] // بِالتَّقوىٰ
    ],
    [ // آية 13
      [], // أَرَءَيتَ
      [], // إِن
      [], // كَذَّبَ
      [] // وَتَوَلّىٰ
    ],
    [ // آية 14
      [], // أَلَم
      [], // يَعلَم
      [], // بِأَنَّ
      [], // اللَّهَ
      [] // يَرىٰ
    ],
    [ // آية 15
      [], // كَلّا
      [], // لَئِن
      [], // لَم
      [], // يَنتَهِ
      [], // لَنَسفَعًا
      [] // بِالنّاصِيَةِ
    ],
    [ // آية 16
      [], // ناصِيَةٍ
      [], // كـٰذِبَةٍ
      [] // خاطِئَةٍ
    ],
    [ // آية 17
      ["فليَدْع نادِيَه : أهلَ مَجلِسِه من قَومِه وعَشِيَرتِه"], // فَليَدعُ
      ["فليَدْع نادِيَه : أهلَ مَجلِسِه من قَومِه وعَشِيَرتِه"] // نادِيَهُ
    ],
    [ // آية 18
      ["سَندْع الزبانية : ملائكةَ العذابِ لِجَرِّه إلى النار"], // سَنَدعُ
      ["سَندْع الزبانية : ملائكةَ العذابِ لِجَرِّه إلى النار"] // الزَّبانِيَةَ
    ],
    [ // آية 19
      [], // كَلّا
      [], // لا
      [], // تُطِعهُ
      [], // وَاسجُد
      [] // وَاقتَرِب
    ]
  ]
];

export default meanings;