const meanings = [
  [ // سورة 97: القدر
[ // آية 1
      [], // إِنّا
      [], // أَنزَلنـٰهُ
      [], // فى
      ["ليلة القدْر : لَيلَةِ الشَّرفِ والعَظَمَة"], // لَيلَةِ
      ["ليلة القدْر : لَيلَةِ الشَّرفِ والعَظَمَة"] // القَدرِ
    ],
    [ // آية 2
      [], // وَما
      [], // أَدرىٰكَ
      [], // ما
      [], // لَيلَةُ
      [] // القَدرِ
    ],
    [ // آية 3
      [], // لَيلَةُ
      [], // القَدرِ
      [], // خَيرٌ
      [], // مِن
      [], // أَلفِ
      [] // شَهرٍ
    ],
    [ // آية 4
      [], // تَنَزَّلُ
      [], // المَلـٰئِكَةُ
      [], // وَالرّوحُ
      [], // فيها
      [], // بِإِذنِ
      [], // رَبِّهِم
      ["منْ كل أمر : بكلّ أمر من الخير و البركة"], // مِن
      ["منْ كل أمر : بكلّ أمر من الخير و البركة"], // كُلِّ
      ["منْ كل أمر : بكلّ أمر من الخير و البركة"] // أَمرٍ
    ],
    [ // آية 5
      [], // سَلـٰمٌ
      [], // هِىَ
      [], // حَتّىٰ
      [], // مَطلَعِ
      [] // الفَجرِ
    ]
  ]
];

export default meanings;