const meanings = [
[ // آية 1
      [], // لَم
      [], // يَكُنِ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // وَالمُشرِكينَ
      [], // مُنفَكّينَ
      [], // حَتّىٰ
      [], // تَأتِيَهُمُ
      [] // البَيِّنَةُ
    ],
    [ // آية 2
      [], // رَسولٌ
      [], // مِنَ
      [], // اللَّهِ
      [], // يَتلوا
      [], // صُحُفًا
      ["مطهّرة : مُنزّهة عن الباطل و الشّبهات"] // مُطَهَّرَةً
    ],
    [ // آية 3
      ["فيها كتب : آيات و أحكام  مكتوبة"], // فيها
      ["فيها كتب : آيات و أحكام  مكتوبة"], // كُتُبٌ
      ["قيّمة : مُسْـتقـيمة حَقة عادلة مُحْكَمَة"] // قَيِّمَةٌ
    ],
    [ // آية 4
      [], // وَما
      [], // تَفَرَّقَ
      [], // الَّذينَ
      [], // أوتُوا
      [], // الكِتـٰبَ
      [], // إِلّا
      [], // مِن
      [], // بَعدِ
      [], // ما
      ["جاءتهم البينة : بالهُدى و كان الحقّ أو لا يتفـرقـوا"], // جاءَتهُمُ
      ["جاءتهم البينة : بالهُدى و كان الحقّ أو لا يتفـرقـوا"] // البَيِّنَةُ
    ],
    [ // آية 5
      [], // وَما
      [], // أُمِروا
      [], // إِلّا
      [], // لِيَعبُدُوا
      [], // اللَّهَ
      [], // مُخلِصينَ
      [], // لَهُ
      ["الدين : العِبادة"], // الدّينَ
      ["حُنفاء : مائلين عن الباطل إلى الإسلام"], // حُنَفاءَ
      [], // وَيُقيمُوا
      [], // الصَّلوٰةَ
      [], // وَيُؤتُوا
      [], // الزَّكوٰةَ
      [], // وَذٰلِكَ
      [], // دينُ
      [] // القَيِّمَةِ
    ],
    [ // آية 6
      [], // إِنَّ
      [], // الَّذينَ
      [], // كَفَروا
      [], // مِن
      [], // أَهلِ
      [], // الكِتـٰبِ
      [], // وَالمُشرِكينَ
      [], // فى
      [], // نارِ
      [], // جَهَنَّمَ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أُولـٰئِكَ
      [], // هُم
      [], // شَرُّ
      ["البَريّة : الخلائق أو البَشَر"] // البَرِيَّةِ
    ],
    [ // آية 7
      [], // إِنَّ
      [], // الَّذينَ
      [], // ءامَنوا
      [], // وَعَمِلُوا
      [], // الصّـٰلِحـٰتِ
      [], // أُولـٰئِكَ
      [], // هُم
      [], // خَيرُ
      [] // البَرِيَّةِ
    ],
    [ // آية 8
      [], // جَزاؤُهُم
      [], // عِندَ
      [], // رَبِّهِم
      [], // جَنّـٰتُ
      [], // عَدنٍ
      [], // تَجرى
      [], // مِن
      [], // تَحتِهَا
      [], // الأَنهـٰرُ
      [], // خـٰلِدينَ
      [], // فيها
      [], // أَبَدًا
      [], // رَضِىَ
      [], // اللَّهُ
      [], // عَنهُم
      [], // وَرَضوا
      [], // عَنهُ
      [], // ذٰلِكَ
      [], // لِمَن
      [], // خَشِىَ
      [] // رَبَّهُ
    ]
];

export default meanings;