const meanings = [
  [ // سورة 99: الزلزلة
[ // آية 1
      [], // إِذا
      ["زلزلت الأرض : حـُرّكت تحْريكا عَـنيفا مُتكرّرا عند النفخة الأولى"], // زُلزِلَتِ
      ["زلزلت الأرض : حـُرّكت تحْريكا عَـنيفا مُتكرّرا عند النفخة الأولى"], // الأَرضُ
      [] // زِلزالَها
    ],
    [ // آية 2
      [], // وَأَخرَجَتِ
      [], // الأَرضُ
      ["أثقالها : كُنـوزها و مَوْتاها في النّـفخة الثانية"] // أَثقالَها
    ],
    [ // آية 3
      [], // وَقالَ
      [], // الإِنسـٰنُ
      [], // ما
      [] // لَها
    ],
    [ // آية 4
      [], // يَومَئِذٍ
      [], // تُحَدِّثُ
      [] // أَخبارَها
    ],
    [ // آية 5
      [], // بِأَنَّ
      [], // رَبَّكَ
      ["أوْحى لها : جَعَل في حالِها دِلالة على ذلك"], // أَوحىٰ
      ["أوْحى لها : جَعَل في حالِها دِلالة على ذلك"] // لَها
    ],
    [ // آية 6
      [], // يَومَئِذٍ
      ["يصدر الناس : يَخْـرجونَ منْ قُـبُورهمْ إلى المَحْـشَر"], // يَصدُرُ
      ["يصدر الناس : يَخْـرجونَ منْ قُـبُورهمْ إلى المَحْـشَر"], // النّاسُ
      ["أشتاتا : مُـتـفرّقين على حَسَب أحْـوالِهمْ"], // أَشتاتًا
      [], // لِيُرَوا
      [] // أَعمـٰلَهُم
    ],
    [ // آية 7
      [], // فَمَن
      [], // يَعمَل
      ["مِثقال ذرّة : وَزْنَ أصْـغر نملةٍ أو هَـباءَةٍ"], // مِثقالَ
      ["مِثقال ذرّة : وَزْنَ أصْـغر نملةٍ أو هَـباءَةٍ"], // ذَرَّةٍ
      [], // خَيرًا
      [] // يَرَهُ
    ],
    [ // آية 8
      [], // وَمَن
      [], // يَعمَل
      [], // مِثقالَ
      [], // ذَرَّةٍ
      [], // شَرًّا
      [] // يَرَهُ
    ]
  ]
];

export default meanings;